{"rss":{"@version":"2.0","@xmlns:discourse":"http://www.discourse.org/","@xmlns:atom":"http://www.w3.org/2005/Atom","@xmlns:dc":"http://purl.org/dc/elements/1.1/","channel":{"title":"Gitcoin Governance - Latest topics","link":"https://gov.gitcoin.co/latest","description":"Latest topics","lastBuildDate":"Thu, 04 Jul 2024 09:00:01 +0000","atom:link":{"@href":"https://gov.gitcoin.co/latest.rss","@rel":"self","@type":"application/rss+xml"},"item":[{"title":"[PROPOSAL] Remove Ratification Requirement for Gitcoin Grants Round Results","dc:creator":"MathildaDV","category":"🌱 Gitcoin Grants","description":"<p>This proposal seeks to eliminate the need for a formal snapshot vote to ratify the results after each Gitcoin Grants round. By removing this governance step, we can streamline the process and distribute matching funds more quickly to grant recipients.</p>\n<p>The ratification vote has served an important role in maintaining transparency and community approval for past funding rounds. However, as the Gitcoin Grants program continues to mature and refine its processes, this extra governance step has become redundant and unnecessarily delays payouts. We will still publish results but won’t have to formally request the funds from the Matching Pool in order to do so.</p>\n<p>The Gitcoin team has shown a strong commitment to transparency and fairness in fund distribution. Our upgraded methodologies and tools, such as the cluster-matching quadratic funding mechanism (COCM) and Passport’s model-based detection system, have significantly enhanced our ability to allocate funds objectively and resist sybil attacks.</p>\n<p><strong>By removing ratification, we can realize the following benefits:</strong></p>\n<ul>\n<li>Faster payouts to grant recipients after each round concludes</li>\n<li>Reduced overhead and operational strain on the Gitcoin team</li>\n<li>Implicit trust in Gitcoin’s processes and methodologies</li>\n</ul>\n<p>We will continue to publicly disclose all relevant data, methodologies and funding calculations for each round. The community retains the ability to scrutinize results and provide feedback through regular channels.</p>\n<p><strong>To recap:</strong></p>\n<ul>\n<li>No more snapshot votes will be held to ratify grant round results</li>\n<li>Gitcoin will transparently communicate funding methodologies before each round as outlined in the <a href=\"https://gov.gitcoin.co/t/gg19-matching-funds-proposal-for-discussion/16945\">GG19 post</a></li>\n<li>Comprehensive results and allocation data <a href=\"https://gov.gitcoin.co/t/passed-gg20-program-round-matching-results/18816\">will still be shared after each round</a></li>\n<li>The community can raise any concerns through normal feedback channels (this forum, Discord)</li>\n</ul>\n<p>This change takes effect immediately and will be applied to upcoming GG21.</p>\n            <p><small>2 posts - 2 participants</small></p>\n            <p><a href=\"https://gov.gitcoin.co/t/proposal-remove-ratification-requirement-for-gitcoin-grants-round-results/19068\">Read full topic</a></p>","link":"https://gov.gitcoin.co/t/proposal-remove-ratification-requirement-for-gitcoin-grants-round-results/19068","pubDate":"Thu, 04 Jul 2024 09:00:01 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"gov.gitcoin.co-topic-19068"},"source":{"@url":"https://gov.gitcoin.co/t/proposal-remove-ratification-requirement-for-gitcoin-grants-round-results/19068.rss","#text":"[PROPOSAL] Remove Ratification Requirement for Gitcoin Grants Round Results"}},{"title":"Citizens Retro Update","dc:creator":"MathildaDV","category":"📝 Citizen Grants","description":"<h1><a name=\"citizens-retro-update-1\" class=\"anchor\" href=\"https://gov.gitcoin.co#citizens-retro-update-1\"></a>Citizens Retro Update</h1>\n<p>This is to provide an update to the Citizens Grants Program, specifically Citizens Retro <span class=\"hashtag-raw\">#4</span>. As outlined in <a href=\"https://gov.gitcoin.co/t/gitcoin-citizens-retro-4-update/19004\">this post</a>, some changes are underway to the Retro round. <strong>Citizen Grants as a whole is currently undergoing review, with a potential major redesign.</strong></p>\n<p>Given our strategic shifts to make the Gitcoin 2.0 vision a reality, we are currently redesigning the program from first-principles (with the help of the Grants Program Canvas!) so that we can ensure it further aligns to our goals and creates more clarity for community members on where their contributions will create the most impact in the Gitcoin Ecosystem. The current working group consists of myself (<a class=\"mention\" href=\"https://gov.gitcoin.co/u/mathildadv\">@MathildaDV</a>) <a class=\"mention\" href=\"https://gov.gitcoin.co/u/owocki\">@owocki</a>, <a class=\"mention\" href=\"https://gov.gitcoin.co/u/deltajuliet\">@deltajuliet</a>, <a class=\"mention\" href=\"https://gov.gitcoin.co/u/viriya\">@Viriya</a>, <a class=\"mention\" href=\"https://gov.gitcoin.co/u/coachjonathan\">@CoachJonathan</a>, consulting <a class=\"mention\" href=\"https://gov.gitcoin.co/u/sejalrekhan\">@sejalrekhan</a>.</p>\n<p>Other notes worth mentioning:</p>\n<ul>\n<li>Moving forward, I’ll be taking the lead on the Citizens Retro. We feel that an important next step in the evolution of this program is to appoint a high-context contributor to drive and hold the vision for the program for the time being.</li>\n<li><strong>We are still hiring!</strong> I will share a job description for a full-time grants coordinator position via <a href=\"https://x.com/mathildawrites\">my Twitter very soon</a> (so if you’re interested in getting involved, please keep an eye out!). All candidates that have applied to the Citizens Retro will still be considered for this new position.</li>\n<li>I would like to extend my gratitude and admiration to <a class=\"mention\" href=\"https://gov.gitcoin.co/u/krrisis\">@krrisis</a>, who has taken the lead on getting the Retro round to where it is today. It has been wonderful to see it grow into what it is, and I deeply appreciate Kris’ hard work.</li>\n</ul>\n<p>Continue to keep an eye out for exciting updates ahead! More details to follow.</p>\n<p>Should you have any questions or concerns regarding these updates, please leave your comments below. Otherwise, stay tuned for more updates in the coming weeks.</p>\n            <p><small>2 posts - 2 participants</small></p>\n            <p><a href=\"https://gov.gitcoin.co/t/citizens-retro-update/19067\">Read full topic</a></p>","link":"https://gov.gitcoin.co/t/citizens-retro-update/19067","pubDate":"Wed, 03 Jul 2024 20:53:56 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"gov.gitcoin.co-topic-19067"},"source":{"@url":"https://gov.gitcoin.co/t/citizens-retro-update/19067.rss","#text":"Citizens Retro Update"}},{"title":"SimpleGrants (status and contribution needs)","dc:creator":"gusaus","category":"🧙 🧙‍♀️ Ideas and Open Discussion","description":"<p>Around the same time last year, I was talking with <a class=\"mention\" href=\"https://gov.gitcoin.co/u/owocki\">@owocki</a> about leveraging <a href=\"https://www.simplegrants.xyz/\" rel=\"noopener nofollow ugc\">Simple Grants</a> for <a href=\"https://opencollective.com/fundoss\" rel=\"noopener nofollow ugc\">FundOSS</a> (the pilot was a partnership between Gitcoin and <a href=\"https://www.oscollective.org/\" rel=\"noopener nofollow ugc\">Open Source Collective</a>) and specific rounds for global projects/communities like WordPress and Drupal.</p>\n<p>While we were unable to move forward at the time (mainly due to the lead dev becoming unavailable and not having capacity to fill the void), I recently noticed that not only was there some active development, but <a href=\"https://github.com/gitcoinco/simplegrants.xyz\" class=\"inline-onebox\" rel=\"noopener nofollow ugc\">GitHub - gitcoinco/simplegrants.xyz: Web2 Quadratic Funding platform</a> was now part of <a href=\"https://github.com/gitcoinco\" class=\"inline-onebox\" rel=\"noopener nofollow ugc\">Gitcoin · GitHub</a>.</p>\n<p>That said, I haven’t talked with Kevin (nor seen discussions in this forum) about status, needs, and if/how Simple Grants fits in with current strategy.</p>\n<p>Playing around with <a href=\"https://demo.simplegrants.xyz/\" rel=\"noopener nofollow ugc\">https://demo.simplegrants.xyz/</a> it seems like it’s close to being something partners could leverage.</p>\n<p>Would love to know more about status and if/how contributors and partners could potentially help.</p>\n            <p><small>4 posts - 2 participants</small></p>\n            <p><a href=\"https://gov.gitcoin.co/t/simplegrants-status-and-contribution-needs/19048\">Read full topic</a></p>","link":"https://gov.gitcoin.co/t/simplegrants-status-and-contribution-needs/19048","pubDate":"Thu, 27 Jun 2024 20:29:27 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"gov.gitcoin.co-topic-19048"},"source":{"@url":"https://gov.gitcoin.co/t/simplegrants-status-and-contribution-needs/19048.rss","#text":"SimpleGrants (status and contribution needs)"}},{"title":"Pre-proposal: Fund Muqa to build on Gitcoin stack","dc:creator":"tomislavmamic","category":"📝 Citizen Grants","description":"<h1><a name=\"pre-proposal-fund-muqa-to-build-on-gitcoin-stack-1\" class=\"anchor\" href=\"https://gov.gitcoin.co#pre-proposal-fund-muqa-to-build-on-gitcoin-stack-1\"></a>Pre-proposal: Fund Muqa to build on Gitcoin stack</h1>\n<p>Hello Gitcoin,</p>\n<p>I am kindly asking you to review this pre-proposal, join the discussion and provide your sentiment for this temp check. Thank you to <span class=\"mention\">@RohitMalekar</span> and <span class=\"mention\">@CoachJ</span> for helping with this proposal.</p>\n<h2><a name=\"background-2\" class=\"anchor\" href=\"https://gov.gitcoin.co#background-2\"></a>Background</h2>\n<p>Last summer, thanks to the Funding the Commons support and Gitcoin’s funding, I started <a href=\"https://explorer-v1.gitcoin.co/#/round/42161/0x5aa255d5cae9b6ce0f2d9aee209cb02349b83731/65\" rel=\"noopener nofollow ugc\">working on a project</a> which would get my home town, City of Split, to try out QF for one of their grant programs.</p>\n<p>Since then, I have done a lot on advancing the idea. From multiple meetings with various city officials, collecting the data on city’s grants programs, analysing it, presenting at <a href=\"https://innovation.eurasia.undp.org/urban-transformation/\" rel=\"noopener nofollow ugc\">UNDP</a> conference for cities, researching the needed tech stacks and potential integrations, to narrowing down the how and where we would use QF.</p>\n<p>Also, I applied for EF Next Billion with this project in mind. Not only the <a href=\"https://blog.ethereum.org/2024/06/24/next-billion-cohort4\" rel=\"noopener nofollow ugc\">project was selected</a> as one of the very few, but it got additional funding for the purpose of building the app.</p>\n<h2><a name=\"what-are-we-building-3\" class=\"anchor\" href=\"https://gov.gitcoin.co#what-are-we-building-3\"></a>What are we building?</h2>\n<p>Ethereum has a number of protocols and apps that are both mature enough and solve a need a city has. We are building an open-source app customised for cities, which will serve as an interface to the Ethereum ecosystem of apps and protocols. Premier example of these, and the first one we want to offer access to is Gitcoin.</p>\n<p>One of the most important things cities do, is allocating money for public goods. Whether they need direct grants, QF, retro funding or something else, they could and should use Allo protocol. We intend on running our grant programs on Allo protocol.</p>\n<p>Gitcoin has built Grants Stack for the purpose of providing an easy and powerful interface for using Allo protocol. While using Allo protocol is a non-brainer for us, for Grants Stack we have some obstacles to use it as-is. It comes with its own set of features which are not directly usable by cities in their interaction with non-web3-native citizens, while some features which are needed are missing. We want to use as much of Grants stack as possible, but we have yet to look deeper and decide how to do it.</p>\n<p>Here are some of the things we’ll probably need to do differently:</p>\n<ul>\n<li>we need to offer users an in-app non-custodial wallet with no need to manage private keys (we plan to use Cometh Connect for this)</li>\n<li>we need to offer simple in-app onramp solution which works well with local banks, cards, currencies and KYC requirements.</li>\n<li>we need to abstract away the cryptocurrency used, so that users who top up euros, see euro balance (which means we need to use euro stablecoin)</li>\n<li>we need to make it in local language with local legal documents</li>\n<li>we need to be able to support different types of grants than what is currently supported by Gitcoin. (Eg. citizens propose projects, but the city gets the money and executes)</li>\n<li>we need to use city-specific tools and available data for sybil resistance, and possibly for KYC</li>\n<li>we need to only show the rounds which a citizen can participate in</li>\n<li>we might need to integrate a forum for discussions on the rounds</li>\n<li>we might need to integrate an option for donors to vote on disbursement of funds after the execution</li>\n<li>we might need to allow for documents submission</li>\n<li>we might need to add additional types of fields in the submission forms</li>\n</ul>\n<h2><a name=\"where-are-we-now-4\" class=\"anchor\" href=\"https://gov.gitcoin.co#where-are-we-now-4\"></a>Where are we now?</h2>\n<p>To advance [or help implement] this project I was recently selected as part of the Ethereum Foundation’s Next Billion Fellowship Program.  With their advisory and financial support we will build a minimum viable app for the purpose of running one specific QF grant round in Split, Croatia. Unfortunately, this funding is limited and besides building the app for pilot, doesn’t cover much more.</p>\n<p>Also, there are multiple grant programs with multiple grant rounds which we could run through the app as well. We could just run the pilot, or we could build such an MVP, which would be usable by any city or other institution to run local grant programs on Ethereum and Allo. We have already started talks with UNDP about this possibility. They work directly with more than 100 cities and national governments, and thourgh their network, we could reach more users quickly.</p>\n<h2><a name=\"what-do-we-expect-from-the-pilot-5\" class=\"anchor\" href=\"https://gov.gitcoin.co#what-do-we-expect-from-the-pilot-5\"></a>What do we expect from the pilot?</h2>\n<p>The pilot will run in Split in September 2024. with a goal of at least 30 proposals and 1500 citizens donating (1% of population).</p>\n<p>These citizens will be onboarded on Ethereum and Gitcoin.</p>\n<h2><a name=\"what-do-we-expect-to-achieve-with-additional-funding-6\" class=\"anchor\" href=\"https://gov.gitcoin.co#what-do-we-expect-to-achieve-with-additional-funding-6\"></a>What do we expect to achieve with additional funding?</h2>\n<h3><a name=\"june-2024-november-2024-7\" class=\"anchor\" href=\"https://gov.gitcoin.co#june-2024-november-2024-7\"></a>June 2024 - November 2024</h3>\n<p>We will create an app and run a successful pilot in the city of Split during the fellowship (). We will do the necessary legal work, local marketing campaign, establish key partnerships, provide support for grant program managers, grantees and citizens, create a report and build a website to showcase the outcome.</p>\n<h3><a name=\"december-2024-may-2025-8\" class=\"anchor\" href=\"https://gov.gitcoin.co#december-2024-may-2025-8\"></a>December 2024 - May 2025</h3>\n<p>We will run multiple rounds of different types during the 6 months following the pilot.<br>\nTypes of rounds:</p>\n<ol>\n<li>Municipal grant program</li>\n<li>Participatory budgeting</li>\n<li>Journalism funding on the national level<br>\nWe will onboard the first cohort of cities after the pilot. We will make necessary adjustments to the app.</li>\n</ol>\n<h2><a name=\"what-do-we-ask-9\" class=\"anchor\" href=\"https://gov.gitcoin.co#what-do-we-ask-9\"></a>What do we ask?</h2>\n<h3><a name=\"supplement-the-funding-for-current-development-milestone-10\" class=\"anchor\" href=\"https://gov.gitcoin.co#supplement-the-funding-for-current-development-milestone-10\"></a>Supplement the funding for current development milestone</h3>\n<p>We ask for funding to start working right away on incorporating Allo and Grants stack and preparing to run multiple rounds after the pilot on this infrastructure.</p>\n<h3><a name=\"extend-the-development-runway-to-build-more-than-prototype-11\" class=\"anchor\" href=\"https://gov.gitcoin.co#extend-the-development-runway-to-build-more-than-prototype-11\"></a>Extend the development runway to build more than prototype</h3>\n<p>We ask for funding to extend our development runway from 3 to 9 months, where for each quarter (or more frequent if needed) we would set objective and relevant milestones.</p>\n<h3><a name=\"costs-of-operations-marketing-bizdev-and-legal-12\" class=\"anchor\" href=\"https://gov.gitcoin.co#costs-of-operations-marketing-bizdev-and-legal-12\"></a>Costs of operations, marketing, bizdev and legal</h3>\n<p>We ask for funding to run local campaigns for rounds, for business development activities and for other costs there might be such as legal costs.</p>\n<h1><a name=\"conclusion-13\" class=\"anchor\" href=\"https://gov.gitcoin.co#conclusion-13\"></a>Conclusion</h1>\n<p>Please provide your opinions and thoughts. Do you think this project should be funded by Gitcoin. If not, why not and can we change something to make it better fitting. If yes, please express your support.</p>\n            <p><small>4 posts - 3 participants</small></p>\n            <p><a href=\"https://gov.gitcoin.co/t/pre-proposal-fund-muqa-to-build-on-gitcoin-stack/19047\">Read full topic</a></p>","link":"https://gov.gitcoin.co/t/pre-proposal-fund-muqa-to-build-on-gitcoin-stack/19047","pubDate":"Thu, 27 Jun 2024 14:11:50 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"gov.gitcoin.co-topic-19047"},"source":{"@url":"https://gov.gitcoin.co/t/pre-proposal-fund-muqa-to-build-on-gitcoin-stack/19047.rss","#text":"Pre-proposal: Fund Muqa to build on Gitcoin stack"}},{"title":"GG20 Reflections, Insights, and Future Plans","dc:creator":"MathildaDV","category":"🌱 Gitcoin Grants","description":"<p>I’m excited to share an in-depth reflections and learnings post on GG20. Thank you to my co-author, <a class=\"mention\" href=\"https://gov.gitcoin.co/u/umarkhaneth\">@umarkhaneth</a>, and for the key inputs from <a class=\"mention\" href=\"https://gov.gitcoin.co/u/sejalrekhan\">@sejalrekhan</a> and <a class=\"mention\" href=\"https://gov.gitcoin.co/u/sov\">@Sov</a>. As we continue to move forward and iterate on the grants program, it’s important to take stock on learnings and community feedback to inform the decision we make ahead of the remainder of this year and as we look into 2025.</p>\n<p>Below I am sharing a summary of the post, with the link to the detailed Mirror post for those who want to take some time for a deep dive.</p>\n<h4><a name=\"tldr-1\" class=\"anchor\" href=\"https://gov.gitcoin.co#tldr-1\"></a>TL;DR:</h4>\n<ul>\n<li>Duration of GG20: <strong>April 23 - May 7, 2024</strong></li>\n<li>Key Learnings: Governance, Grantee Experience, Donor Experience, Operations</li>\n<li>Future Plans: Continuous improvement and innovation</li>\n</ul>\n<p><strong>Summary:</strong> Gitcoin Grants, a community-driven funding initiative, has facilitated over 3,500 projects with $60M distributed since 2019. GG20, running from April 23 to May 7, 2024, saw a $1.6M matching pool, the election of a Community Council, a protocol upgrade, and an improved sybil resistance strategy.</p>\n<h4><a name=\"key-learnings-2\" class=\"anchor\" href=\"https://gov.gitcoin.co#key-learnings-2\"></a>Key Learnings:</h4>\n<ul>\n<li><strong>Governance:</strong> The new Community Round governance process required proposals reviewed and voted on by a newly elected Community Council. The top five rounds received an extra $25K each in matching funds. Moving forward, Gitcoin plans to include more rounds in the marketing efforts, above and beyond of the top 5 chosen for extra matching funds.</li>\n<li><strong>Grantee Experience:</strong> Improvements in communication and platform navigation led to an 81% satisfaction rate among grantees (which met our key success metric). Positive feedback highlighted the need for better marketing resources, a more user-friendly grantee portal, and clearer guidance on creating strong grant proposals. Future plans include enhancing resources, such as Canva kits, and providing streamlined application processes for returning grantees.</li>\n<li><strong>Donor Experience:</strong> Despite a decrease in the number of donors, each donor contributed more, leading to a $27K increase in crowdfunding. Focus on retaining first-time donors and simplifying the donation process is essential. Strategies include potentially collecting donor emails for updates and making the donation process more user-friendly, especially for new donors. Running all rounds on Arbitrum and partnering with ThankARB enhanced the donor experience.</li>\n<li><strong>Operations:</strong> The introduction of decentralized review processes with “Team Tiger” and the use of the AI-based tool “Checker” improved transparency and efficiency. Clearer instructions and better support for grantees were identified as areas for further improvement. Future plans include refining the review process, enhancing support during the application phase, and expediting payout timelines by improving the QF/COCM calculator app and pre-approving matching results.</li>\n</ul>\n<h4><a name=\"moving-forward-3\" class=\"anchor\" href=\"https://gov.gitcoin.co#moving-forward-3\"></a>Moving Forward:</h4>\n<ul>\n<li><strong>Marketing</strong>: Expand marketing efforts to include more community rounds, providing broader exposure and support to teams beyond the top five. This approach aims to ensure a more inclusive and impactful experience for all participants.</li>\n<li><strong>Grantee Support:</strong> Enhance resources to guide grantees in successfully marketing their grants. Improve the grantee portal to be more user-friendly and easier to navigate. Provide clearer resources on creating strong grant proposals and consider rolling applications for returning grantees to streamline the process. Finding ways to build a stronger builder community centered around mentorship, growth and education.</li>\n<li><strong>Donor Retention:</strong> Implement strategies to retain donors by collecting their emails for updates and exploring ways to allow grantees to email their donors. Make the donation process more user-friendly and continue promoting the popular collections feature to make the experience more social and engaging.</li>\n<li><strong>Operations:</strong> Continue refining the review process and expediting payout timelines. Improve support for grantees during the application phase and enhance project impact reporting. Maintain a fair and transparent process by not making team member wallet addresses public and focusing on the core mission of supporting open-source software and digital public goods.</li>\n</ul>\n<p>Gitcoin is committed to evolving its grants program to be more resilient, inclusive, and impactful. The insights from GG20 will guide future strategies, ensuring continuous improvement and innovation as we move forward to GG21 and GG22. As we move into a multi-mechanism future, further experimentation and expansion will be enabled as we continue to evolve.</p>\n<p><a href=\"https://gitcoin.mirror.xyz/GyT9ZE_PuopPVwSlgRIF-o7cm_ZTCqcXBKXMCNkc1Sk\">Read the detailed post here</a></p>\n            <p><small>3 posts - 2 participants</small></p>\n            <p><a href=\"https://gov.gitcoin.co/t/gg20-reflections-insights-and-future-plans/19045\">Read full topic</a></p>","link":"https://gov.gitcoin.co/t/gg20-reflections-insights-and-future-plans/19045","pubDate":"Wed, 26 Jun 2024 11:04:45 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"gov.gitcoin.co-topic-19045"},"source":{"@url":"https://gov.gitcoin.co/t/gg20-reflections-insights-and-future-plans/19045.rss","#text":"GG20 Reflections, Insights, and Future Plans"}},{"title":"Onchain Capital Allocation Handbook","dc:creator":"owocki","category":"🧙 🧙‍♀️ Ideas and Open Discussion","description":"<p>At ETHcc this year I will be launching a new book entitled the <strong>Onchain Capital Allocation Handbook</strong>.</p>\n<p></p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://gov.gitcoin.co/uploads/db4391/original/2X/a/a2b9e77f77954f1bb62613dc78220d614aeef863.jpeg\" data-download-href=\"https://gov.gitcoin.co/uploads/db4391/a2b9e77f77954f1bb62613dc78220d614aeef863\" title=\"GQ3Ki7kWMAAmmUD\"><img src=\"https://gov.gitcoin.co/uploads/db4391/optimized/2X/a/a2b9e77f77954f1bb62613dc78220d614aeef863_2_338x499.jpeg\" alt=\"GQ3Ki7kWMAAmmUD\" data-base62-sha1=\"ndxEc7u8sxgMm5BUm5wBFCxyUv1\" width=\"338\" height=\"499\" srcset=\"https://gov.gitcoin.co/uploads/db4391/optimized/2X/a/a2b9e77f77954f1bb62613dc78220d614aeef863_2_338x499.jpeg, https://gov.gitcoin.co/uploads/db4391/optimized/2X/a/a2b9e77f77954f1bb62613dc78220d614aeef863_2_507x748.jpeg 1.5x, https://gov.gitcoin.co/uploads/db4391/optimized/2X/a/a2b9e77f77954f1bb62613dc78220d614aeef863_2_676x998.jpeg 2x\" data-dominant-color=\"ADA9A1\"></a></div><p></p>\n<p>Please <a href=\"https://twitter.com/owocki\">DM me on twitter</a> if you would like an invite.   I will update this thread with purchase/download links when those are live (launch day is 7/11).</p>\n<p>More info about the book follows:</p>\n<blockquote>\n<p>Title: Onchain Capital Allocation Handbook: A Practical Journey from Present Mechanisms to Future Possibilities<br>\nDesc:</p>\n<p>Capital allocation is a simple concept: it’s the act of deciding how to distribute funding or resources. If you’ve ever paid bills, taxes, or repaid friends for a meal, you’ve allocated capital.</p>\n<p>Capital allocation can become a full time job: governments and grant-making organi- zations spend vast amounts of time and money figuring out the process, logistics, and decision-making involved in allocating capital. At scale, capital allocation inevitably be- comes mired in gatekeeping, rivalrous decision making, and lack of transparency and accountability.</p>\n<p>Crypto with its programmable smart contracts, present incredible advantages towards allocating capital in an efficient, effective, and transparent manner.</p>\n<p>The internet revolutionized how information was distributed in society. If crypto succeeds in revolutionizing how society distributes scarce resources, it follows that it will upend, and improve, how we do capital allocation.</p>\n<p>What if we could solve coordination failures with capital allocation? What if we could create better, more sovereign, collective action? How might we bring centuries old capital allocation strategies onchain? Can we invent new onchain capital allocation strategies that were not possible before Ethereum?</p>\n<p>The next horizon is hard to see alone, but by exploring it together, we can grasp it.</p>\n<p>This book is a celebration of the design space, and your no-hype resource to understand- ing the emergent pluralistic ecology of capital allocation developing in the web3 space. I’ve enjoyed putting together this handbook of the latest and greatest in what’s possible. It is my great pleasure to have a front row seat to this movement as a member of Gitcoin. My hope for this book is that I can pay it forward to you.</p>\n</blockquote>\n            <p><small>2 posts - 2 participants</small></p>\n            <p><a href=\"https://gov.gitcoin.co/t/onchain-capital-allocation-handbook/19041\">Read full topic</a></p>","link":"https://gov.gitcoin.co/t/onchain-capital-allocation-handbook/19041","pubDate":"Tue, 25 Jun 2024 19:58:35 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"gov.gitcoin.co-topic-19041"},"source":{"@url":"https://gov.gitcoin.co/t/onchain-capital-allocation-handbook/19041.rss","#text":"Onchain Capital Allocation Handbook"}},{"title":"The Grants Program Canvas + Playbook: An open source tool for easy grant-making","dc:creator":"Viriya","category":"🧙 🧙‍♀️ Ideas and Open Discussion","description":"<p>Yesterday we launched the Grants Program Canvas and Playbook! This is a set of open-source (creative commons) resources designed to empower growth leaders to create and manage high-impact grants programs within the web3 space.</p>\n<p>The project was birthed out of a question that we kept getting asked: “How do I launch a grants program? Where do I even start?”</p>\n<p>So we went to work building a simple design tool that breaks down each step into manageable pieces that makes it easy for the most novice of grants operators to launch a program.</p>\n<h3><a name=\"streamlined-grantmaking-with-the-grants-program-canvas-1\" class=\"anchor\" href=\"https://gov.gitcoin.co#streamlined-grantmaking-with-the-grants-program-canvas-1\"></a>Streamlined Grantmaking with the Grants Program Canvas</h3>\n<p>Our launch is mainly focused on introducing and driving adoption for the Grants Program Canvas — which is a tool that visualizes the different elements of a grants program in phases (Define, Design, Execute and Learn), each with specific quadrants leading users through a complete process for program design.</p>\n<p>Taking inspo from the <a href=\"https://www.strategyzer.com/library/the-business-model-canvas\" rel=\"noopener nofollow ugc\">business model canvas</a>, we believe that this framework could become a standard for more comprehensive and streamlined grantmaking that has been a major gap for web3 ecosystems.</p>\n<p>The exciting part about this tool is that it can be used for both grants program creation AND evaluation and elevation of existing programs.</p>\n<p>We are already using this too internally to evaluate the Citizens Retro and are incorporating the tool in our grants services offerings as well.</p>\n<p>You can <a href=\"https://grantscanvas.gitcoin.co/\" rel=\"noopener nofollow ugc\">download the canvas here</a> and upload it into any whiteboard tool to get started with it.</p>\n<p></p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://gov.gitcoin.co/uploads/db4391/original/2X/d/d91ec6f93e86fe8685dbf1f9b2a2d33be7559921.png\" data-download-href=\"https://gov.gitcoin.co/uploads/db4391/d91ec6f93e86fe8685dbf1f9b2a2d33be7559921\" title=\"Screenshot_2024-06-25_at_15.16.11\"><img src=\"https://gov.gitcoin.co/uploads/db4391/optimized/2X/d/d91ec6f93e86fe8685dbf1f9b2a2d33be7559921_2_618x500.png\" alt=\"Screenshot_2024-06-25_at_15.16.11\" data-base62-sha1=\"uYJya7Qd99dWhnxydRviyEm971L\" width=\"618\" height=\"500\" srcset=\"https://gov.gitcoin.co/uploads/db4391/optimized/2X/d/d91ec6f93e86fe8685dbf1f9b2a2d33be7559921_2_618x500.png, https://gov.gitcoin.co/uploads/db4391/optimized/2X/d/d91ec6f93e86fe8685dbf1f9b2a2d33be7559921_2_927x750.png 1.5x, https://gov.gitcoin.co/uploads/db4391/original/2X/d/d91ec6f93e86fe8685dbf1f9b2a2d33be7559921.png 2x\" data-dominant-color=\"BECAD4\"></a></div><p></p>\n<h2><a name=\"dive-deeper-with-the-grants-program-design-playbook-2\" class=\"anchor\" href=\"https://gov.gitcoin.co#dive-deeper-with-the-grants-program-design-playbook-2\"></a>Dive Deeper with the Grants Program Design Playbook</h2>\n<p>The comprehensive 100+ page guide dives deeper into each quadrant of the Canvas, offering invaluable tools insights. It features helpful worksheets, templates, useful examples and case studies that pull from the biggest grants programs in web3.</p>\n<p>The playbook really does support a deeper understanding on how to…</p>\n<ul>\n<li>Maximize Impact: the methodology emphasizes the creation of clear objectives and strong impact measurement, guaranteeing a program delivers meaningful results.</li>\n<li>Simplify Planning: our step-by-step approach ensures a comprehensive plan without the overwhelming complexity.</li>\n<li>Stay Growth-Focused: the structured process allows for continuous learning and adaptation, ensuring a given program evolves alongside its community’s needs.</li>\n</ul>\n<p>At the moment it’s also free so you should probably just <a href=\"https://grantscanvas.gitcoin.co/\" rel=\"noopener nofollow ugc\">download the playbook</a>.</p>\n<h2><a name=\"enabling-any-community-to-fund-what-matters-3\" class=\"anchor\" href=\"https://gov.gitcoin.co#enabling-any-community-to-fund-what-matters-3\"></a>Enabling any community to fund what matters</h2>\n<p>We’re bullish on grants.</p>\n<p>As an org, working to turn the hype around grants into purposeful and impactful grant-making in the web3.</p>\n<p>We’re excited to see how the canvas will move the needle towards this objective. And I’m personally excited to see how Gitcoin itself will use this tool to support its grants ecosystem! (GG community rounds, Citizen Grants, rounds running on Grants Stack).</p>\n<p>I think this is just the beginning, in lockstep with the open-source ethos of Gitcoin, the canvas is a creative commons tool that can be remixed, repurposed and reused by anyone in our community and beyond. We hope that those in our orbit really embrace the power of this tool and continue to prove that grants = growth.</p>\n<p><a href=\"https://grantscanvas.gitcoin.co/\" rel=\"noopener nofollow ugc\">Download the canvas and playbook here!</a></p>\n<p><strong>We’ll be at EthCC diving into different aspects of the canvas on July 8! <a href=\"https://lu.ma/hyxifa1t\" rel=\"noopener nofollow ugc\">Get your tickets here</a>.</strong></p>\n            <p><small>2 posts - 2 participants</small></p>\n            <p><a href=\"https://gov.gitcoin.co/t/the-grants-program-canvas-playbook-an-open-source-tool-for-easy-grant-making/19040\">Read full topic</a></p>","link":"https://gov.gitcoin.co/t/the-grants-program-canvas-playbook-an-open-source-tool-for-easy-grant-making/19040","pubDate":"Tue, 25 Jun 2024 14:37:58 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"gov.gitcoin.co-topic-19040"},"source":{"@url":"https://gov.gitcoin.co/t/the-grants-program-canvas-playbook-an-open-source-tool-for-easy-grant-making/19040.rss","#text":"The Grants Program Canvas + Playbook: An open source tool for easy grant-making"}},{"title":"Gitcoin as a delegate in L2s- starting with ZK","dc:creator":"ZER8","category":"🧙 🧙‍♀️ Ideas and Open Discussion","description":"<p>Hey everyone, just wanted to share an idea…I think it would be amazing if we could have a “Gitcoin” delegate in L2s such as Arbitrum, ZKsync, etc.</p>\n<p><em>Reasoning:</em><br>\nRecently, I’ve been noticing multiple organizations in web3 joining major L2s as delegates and I think this would be a great strategic move for Gitcoin to start getting more involved in L2 governance.</p>\n<p>My assumption is that because multiple Gitcoin donors were one of the categories that got a booster in the recent ZK airdrop they might want to delegate to Gitcoin if it steps up as a delegate. <strong>As the one of the core promotors of public goods I think it’s Gitcoins duty to do so.</strong> Oh, and we could maybe join an alliance with other PG ecosystems to really make public goods matter everywhere!</p>\n<p><em>Advantages:</em> We would be able to empower their public goods ecosystems with Gitcoins vast networks and experience. They could help Gitcoin expand it’s protocols.</p>\n<p>PS. this could be a bad idea, extremely open to feedback <img src=\"https://gov.gitcoin.co/images/emoji/twitter/smiley.png?v=12\" title=\":smiley:\" class=\"emoji\" alt=\":smiley:\" loading=\"lazy\" width=\"20\" height=\"20\"></p>\n            <p><small>2 posts - 2 participants</small></p>\n            <p><a href=\"https://gov.gitcoin.co/t/gitcoin-as-a-delegate-in-l2s-starting-with-zk/19033\">Read full topic</a></p>","link":"https://gov.gitcoin.co/t/gitcoin-as-a-delegate-in-l2s-starting-with-zk/19033","pubDate":"Sat, 22 Jun 2024 21:49:58 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"gov.gitcoin.co-topic-19033"},"source":{"@url":"https://gov.gitcoin.co/t/gitcoin-as-a-delegate-in-l2s-starting-with-zk/19033.rss","#text":"Gitcoin as a delegate in L2s- starting with ZK"}},{"title":"Grants Lab - Contributor Token Grant Program","dc:creator":"owocki","category":"🧙 🧙‍♀️ Ideas and Open Discussion","description":"<h1><a name=\"overview-1\" class=\"anchor\" href=\"https://gov.gitcoin.co#overview-1\"></a>Overview</h1>\n<p>With the introduction of Gitcoin 2.0, we have renewed focus as an organization and have set ambitious goals! We are driving towards $50M in GMV this year and a north star of $1B in GMV through Allo over the next several years.</p>\n<p>To hit these goals, we need best-in-class contributor talent that is motivated and aligned with our mission and ambition.</p>\n<p>Token grants are a key tool we have to create those alignments. After all – the idea that we can program our values into money to ensure alignment is central to <a href=\"https://www.gitcoin.co/whitepaper/read\">our vision for capital allocation</a>.</p>\n<h1><a name=\"structure-2\" class=\"anchor\" href=\"https://gov.gitcoin.co#structure-2\"></a>Structure</h1>\n<p>I propose that every contributor to Grants Lab is eligible for a 4-year token grant. These grants will be subject to linear vesting schedules and a 1-year cliff. Contributors who have been at Gitcoin for over a year and have not previously received a token grant will be eligible for an accelerated 6-month cliff, instead of 1 year.</p>\n<p>This proposal covers all current contributors to Grants Labs as well as an option pool for future contributors. In total, 3M GTC is requested. This represents 3% of the supply of GTC and is aligned with (or below) industry standards for team allocations. Though team allocations are typically only done at launch, Gitcoin has evolved substantially since the token launch in 2021. Most of the team that was present in 2021 are no longer active contributors, and the vast majority (80%) of current contributors do not have any token grants.</p>\n<h1><a name=\"potential-risks-3\" class=\"anchor\" href=\"https://gov.gitcoin.co#potential-risks-3\"></a>Potential Risks</h1>\n<ul>\n<li>Operational overhead\n<ul>\n<li>This will be part of the Grants Lab budgeting process and we will use available tools on the market (Liquifi or Hedgey or Gnosis Safe) to minimize overhead.</li>\n</ul>\n</li>\n<li>How can we avoid negative impacts to the organization?\n<ul>\n<li>Tokens, once earned (including vesting), are wholly owned by the contributor and they have the freedom to do whatever they want with them. This autonomy and ownership are core to the culture we want to build.</li>\n<li>Additionally, unlocks will occur over a long period of time (4 years) to minimize potential disruption.</li>\n</ul>\n</li>\n<li>Why now / how is this fiscally responsible?\n<ul>\n<li>As mentioned above, we’re at a critical juncture in Gitcoin’s ambition. Token grants are a tool we are deploying to ensure the success of our organization through creating a talented and aligned contributor base. (In fact, we believe it’s irresponsible to have a bunch of contributors who are NOT aligned with the long term org!)</li>\n</ul>\n</li>\n<li>COI?\n<ul>\n<li>The proposer of this plan (Owocki) will not be a beneficiary of it. Owocki will not be requesting token grants through this program.</li>\n</ul>\n</li>\n<li>What about individuals who have current token grants?\n<ul>\n<li>These will be negotiated on an individual basis and may be transitioned to the new structure if the individual consents. This is not a large risk given that there are a small number (3) of current contributors with active token grants.</li>\n</ul>\n</li>\n</ul>\n<h1><a name=\"feedback-welcome-4\" class=\"anchor\" href=\"https://gov.gitcoin.co#feedback-welcome-4\"></a>Feedback welcome.</h1>\n<p>I welcome feedback from stewards + community members about this plan.</p>\n            <p><small>2 posts - 2 participants</small></p>\n            <p><a href=\"https://gov.gitcoin.co/t/grants-lab-contributor-token-grant-program/19032\">Read full topic</a></p>","link":"https://gov.gitcoin.co/t/grants-lab-contributor-token-grant-program/19032","pubDate":"Sat, 22 Jun 2024 03:20:11 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"gov.gitcoin.co-topic-19032"},"source":{"@url":"https://gov.gitcoin.co/t/grants-lab-contributor-token-grant-program/19032.rss","#text":"Grants Lab - Contributor Token Grant Program"}},{"title":"GG20 Decentralized Science Reflection Report","dc:creator":"manuelolariu","category":"🌱 Gitcoin Grants","description":"<h1><a name=\"english-version-1\" class=\"anchor\" href=\"https://gov.gitcoin.co#english-version-1\"></a>English Version</h1>\n<h1><a name=\"gitcoin-gg20-desci-round-reflection-report-2\" class=\"anchor\" href=\"https://gov.gitcoin.co#gitcoin-gg20-desci-round-reflection-report-2\"></a>Gitcoin GG20 DeSci Round: Reflection Report</h1>\n<h2><a name=\"introduction-3\" class=\"anchor\" href=\"https://gov.gitcoin.co#introduction-3\"></a>Introduction</h2>\n<p>The Gitcoin <a href=\"https://explorer.gitcoin.co/#/round/42161/39\">GG20 DeSci Round</a> marked a significant milestone in the journey of decentralized science. As we conclude this round, it is essential to reflect on our achievements, challenges, and learnings to enhance future rounds. This report synthesizes feedback from various DeSci operators and stewards, providing a comprehensive overview of the GG20 DeSci Round’s performance.</p>\n<h2><a name=\"results-of-gg20-4\" class=\"anchor\" href=\"https://gov.gitcoin.co#results-of-gg20-4\"></a>Results of GG20</h2>\n<p>The GG20 DeSci Round saw a diverse array of projects applying for funding. Despite some logistical challenges, the round successfully highlighted the potential of decentralized science. Several grantees received the necessary funding to grow their projects. The community engagement was robust, with a notable increase in grantee participation on X compared to previous rounds.</p>\n<h2><a name=\"round-metrics-5\" class=\"anchor\" href=\"https://gov.gitcoin.co#round-metrics-5\"></a>Round Metrics</h2>\n<ul>\n<li>Number of Applications: 34</li>\n<li>Funded Projects: 29</li>\n<li>Total Funds Distributed: $25,000</li>\n<li>Donor Participation: 292 individuals</li>\n<li>Community Growth: 20% increase in social media followers</li>\n</ul>\n<h2><a name=\"social-metrics-6\" class=\"anchor\" href=\"https://gov.gitcoin.co#social-metrics-6\"></a>Social Metrics</h2>\n<ul>\n<li>Weekly DeSci Cornerstone Attendance: 69% total grantee participation rate</li>\n<li>Impressions: 46.1K</li>\n<li>Total Engagement rate: 3.9%</li>\n<li>Link clicks: 233</li>\n<li>Retweets: 227</li>\n<li>Likes: 514</li>\n<li>Replies: 64</li>\n</ul>\n<h2><a name=\"challenges-7\" class=\"anchor\" href=\"https://gov.gitcoin.co#challenges-7\"></a>Challenges</h2>\n<h3><a name=\"multi-language-support-8\" class=\"anchor\" href=\"https://gov.gitcoin.co#multi-language-support-8\"></a>Multi-language Support</h3>\n<p>There were difficulties in managing multi-language applications and the need for better support structures. Suggested solutions included multi-language onboarding documents and grantee portals in Chinese and Spanish.</p>\n<h3><a name=\"grantee-onboarding-and-relations-9\" class=\"anchor\" href=\"https://gov.gitcoin.co#grantee-onboarding-and-relations-9\"></a>Grantee Onboarding and Relations</h3>\n<p>Challenges in grantee relations and onboarding were noted, with a consensus on the need for clearer roles and responsibilities, as well as structured marketing efforts, including templates for grantees.</p>\n<h3><a name=\"steward-onboarding-10\" class=\"anchor\" href=\"https://gov.gitcoin.co#steward-onboarding-10\"></a>Steward Onboarding</h3>\n<p>There was a need for more time for steward onboarding, suggesting a preparation period of 1-2 months before the round starts. Creating a steward template to streamline the onboarding process was also recommended.</p>\n<h3><a name=\"community-engagement-11\" class=\"anchor\" href=\"https://gov.gitcoin.co#community-engagement-11\"></a>Community Engagement</h3>\n<p>The importance of more robust community engagement was stressed. This includes earlier and more frequent communications, engaging specific communities like the Asian community, and organizing weekly calls for better coordination.</p>\n<h3><a name=\"application-deadlines-12\" class=\"anchor\" href=\"https://gov.gitcoin.co#application-deadlines-12\"></a>Application Deadlines</h3>\n<p>It was suggested to have a strict deadline, potentially midway through the round, to ensure meaningful applications. The idea of rolling applications was also discussed but remained undecided.</p>\n<h2><a name=\"learnings-13\" class=\"anchor\" href=\"https://gov.gitcoin.co#learnings-13\"></a>Learnings</h2>\n<h3><a name=\"importance-of-structured-onboarding-14\" class=\"anchor\" href=\"https://gov.gitcoin.co#importance-of-structured-onboarding-14\"></a>Importance of Structured Onboarding</h3>\n<p>The feedback highlighted the necessity of structured onboarding for both grantees and stewards. Providing clear guidelines and templates can significantly enhance the efficiency of the process.</p>\n<h3><a name=\"multi-language-support-is-crucial-15\" class=\"anchor\" href=\"https://gov.gitcoin.co#multi-language-support-is-crucial-15\"></a>Multi-language Support is Crucial</h3>\n<p>Supporting applications in multiple languages is vital for inclusivity. Creating multi-language onboarding documents and having dedicated support for different language speakers can improve participation and understanding.</p>\n<h3><a name=\"early-and-continuous-community-engagement-16\" class=\"anchor\" href=\"https://gov.gitcoin.co#early-and-continuous-community-engagement-16\"></a>Early and Continuous Community Engagement</h3>\n<p>Engaging the community early and maintaining regular communication is essential. Weekly calls, active social media engagement, and clear, consistent updates can help keep all stakeholders informed and involved.</p>\n<h3><a name=\"clear-application-processes-17\" class=\"anchor\" href=\"https://gov.gitcoin.co#clear-application-processes-17\"></a>Clear Application Processes</h3>\n<p>Establishing clear and strict application deadlines ensures that applications are well-prepared and submitted on time. This helps in better planning and evaluation.</p>\n<h2><a name=\"impact-18\" class=\"anchor\" href=\"https://gov.gitcoin.co#impact-18\"></a>Impact</h2>\n<p>The GG20 DeSci Round had a significant impact on the decentralized science community:</p>\n<ul>\n<li>Funding Distribution: Successfully funded 29 projects, providing them with the resources needed to innovate and explore.</li>\n<li>Community Building: Increased community engagement and participation, fostering a more inclusive and collaborative environment.</li>\n<li>Awareness and Advocacy: Raised awareness about the importance of decentralized science and its potential to drive scientific innovation.</li>\n<li>Impact Measurements: The GG20 DeSci Operators have initiated the implementation of Hypercerts and KarmaGap to enhance impact measurements, ensuring accountability and transparency for funded projects across rounds.</li>\n</ul>\n<h2><a name=\"implementations-19\" class=\"anchor\" href=\"https://gov.gitcoin.co#implementations-19\"></a>Implementations</h2>\n<h3><a name=\"multi-language-onboarding-20\" class=\"anchor\" href=\"https://gov.gitcoin.co#multi-language-onboarding-20\"></a>Multi-language Onboarding</h3>\n<p>Implementing multi-language onboarding documents and grantee portals in Chinese, Spanish, and other languages will be prioritized for future rounds.</p>\n<h3><a name=\"structured-onboarding-and-templates-21\" class=\"anchor\" href=\"https://gov.gitcoin.co#structured-onboarding-and-templates-21\"></a>Structured Onboarding and Templates</h3>\n<p>Developing comprehensive onboarding templates for stewards and grantees will be essential. This includes creating marketing templates and structured guidelines for better project presentation and promotion.</p>\n<h3><a name=\"enhanced-community-engagement-22\" class=\"anchor\" href=\"https://gov.gitcoin.co#enhanced-community-engagement-22\"></a>Enhanced Community Engagement</h3>\n<p>We will enhance our community engagement strategies, including more frequent communications, targeted community outreach, and regular updates to keep all participants informed and involved.</p>\n<h3><a name=\"clear-application-timelines-23\" class=\"anchor\" href=\"https://gov.gitcoin.co#clear-application-timelines-23\"></a>Clear Application Timelines</h3>\n<p>Future rounds will feature strict application deadlines and possibly rolling application periods to ensure better planning and evaluation.</p>\n<h2><a name=\"conclusion-24\" class=\"anchor\" href=\"https://gov.gitcoin.co#conclusion-24\"></a>Conclusion</h2>\n<p>The GG20 DeSci Round has been a learning experience filled with both challenges and triumphs. By addressing the feedback provided by our community, sponsors, operators, and stewards, we are committed to making future rounds more efficient, inclusive, and impactful. Together, we continue to push the boundaries of decentralized science on Gitcoin and pave the way for a more innovative and collaborative future.</p>\n<p>Huge shoutout to our operators and stewards <a class=\"mention\" href=\"https://gov.gitcoin.co/u/swiftevo\">@Swiftevo</a> <a class=\"mention\" href=\"https://gov.gitcoin.co/u/goretifreitas\">@GoretiFreitas</a> <a class=\"mention\" href=\"https://gov.gitcoin.co/u/tomislavmamic\">@tomislavmamic</a> <a class=\"mention\" href=\"https://gov.gitcoin.co/u/robioreefeco\">@robioreefeco</a> <a class=\"mention\" href=\"https://gov.gitcoin.co/u/jag\">@Jag</a> Twone, Eva and Lana!</p>\n<p>Thank you to all our participants, donors, and supporters for making the GG20 DeSci Round a success. We look forward to your continued engagement in future rounds.</p>\n<p>~ The DeSci Operations Team</p>\n<h1><a name=\"chinese-version-25\" class=\"anchor\" href=\"https://gov.gitcoin.co#chinese-version-25\"></a>Chinese Version</h1>\n<h1><a name=\"gitcoin-gg20-desci-26\" class=\"anchor\" href=\"https://gov.gitcoin.co#gitcoin-gg20-desci-26\"></a>Gitcoin GG20 DeSci 輪次：回顧報告</h1>\n<h2><a name=\"h-27\" class=\"anchor\" href=\"https://gov.gitcoin.co#h-27\"></a>簡介</h2>\n<p>Gitcoin GG20 DeSci 輪次標誌著去中心化科學進程中的一個重要里程碑。在此輪次結束之際，回顧我們的成就、挑戰和經驗顯得尤為重要，以令未來的 DeSci 輪次變得更好。本報告綜合了來自不同 DeSci 工作組成員和負責把關申請項目的評審組反饋，為 GG20 DeSci 輪次作出了全面的回顧。</p>\n<h2><a name=\"gg20-desci-28\" class=\"anchor\" href=\"https://gov.gitcoin.co#gg20-desci-28\"></a>GG20 DeSci 輪次的結果</h2>\n<p>GG20 DeSci 輪次吸引了各種不同類型的項目申請資助。儘管這次我們存在一些行政上的挑戰，本輪次成功展示了去中心化科學的潛力。多個受資助者獲得了必要的資金來發展他們的項目。社區高度參與，與之前的輪次相比，受資助者在 Twitter（X）平台上的參與度顯著增加。</p>\n<h3><a name=\"h-29\" class=\"anchor\" href=\"https://gov.gitcoin.co#h-29\"></a>輪次指標</h3>\n<p>申請數量：34</p>\n<p>資助項目：29</p>\n<p>分發總資金：$25,000</p>\n<p>捐贈者人數：292 人</p>\n<p>社區增長：社交媒體關注者增加 20%</p>\n<p>每週 DeSci Cornerstone 出席率：總受資助者參與率 69%</p>\n<h3><a name=\"h-30\" class=\"anchor\" href=\"https://gov.gitcoin.co#h-30\"></a>社交指標</h3>\n<p>每週 DeSci Cornerstone 出席率：總受資助者參與率 69%</p>\n<p>展示次數：46.1K</p>\n<p>總互動率：3.9%</p>\n<p>連結點擊：233</p>\n<p>轉發：227</p>\n<p>點讚：514</p>\n<p>回覆：64</p>\n<h2><a name=\"h-31\" class=\"anchor\" href=\"https://gov.gitcoin.co#h-31\"></a>挑戰</h2>\n<h3><a name=\"h-32\" class=\"anchor\" href=\"https://gov.gitcoin.co#h-32\"></a>多語言支持</h3>\n<p>在管理多語言申請專案方面存在困難，未來我們需要有更好的支援工具。建議的解決方案包括給與中文及西班牙語的申請者提供多語言的申請指南。</p>\n<h3><a name=\"h-33\" class=\"anchor\" href=\"https://gov.gitcoin.co#h-33\"></a>受資助者參與及互動</h3>\n<p>在受資助者參與本輪次和互動上存在挑戰，工作組一致認為需要明確的角色和職責，以及系統化的宣傳工作，包括為受資助者提供推廣模板。</p>\n<h3><a name=\"h-34\" class=\"anchor\" href=\"https://gov.gitcoin.co#h-34\"></a>評審組的參與</h3>\n<p>評審人員需要更多時間參與整個工作流程，建議在輪次開始前的 1 - 2 個月邀請評審組加入，他們在正式工作前有足夠的準備時間。同時建議創建評審人員工作模板以簡化加入 DeSci Round 時的流程。</p>\n<h3><a name=\"h-35\" class=\"anchor\" href=\"https://gov.gitcoin.co#h-35\"></a>社區參與</h3>\n<p>更強大的社區參與對於 DeSci 輪次是必不可少的。這包括更早和更頻繁與社區的溝通，吸引特定社區如亞洲社區，以及組織每週線上會議以更好地與社區協調及溝通。</p>\n<h3><a name=\"h-36\" class=\"anchor\" href=\"https://gov.gitcoin.co#h-36\"></a>申請截止日期</h3>\n<p>建議設定嚴格的截止日期，例如申請截止日期定在輪次開始接受資助的中段，以確保受資助者有足夠的時間參與輪次。我們也討論了滾動申請的想法，即容許專案在輪次捐款結束前都可以提交項目申請，但工作組對此仍需要有更多的討論。</p>\n<h2><a name=\"h-37\" class=\"anchor\" href=\"https://gov.gitcoin.co#h-37\"></a>經驗總結</h2>\n<h3><a name=\"h-38\" class=\"anchor\" href=\"https://gov.gitcoin.co#h-38\"></a>系統化入門指南的重要性</h3>\n<p>這次 DeSci Round 工作組及評審人員的反饋強調了為受資助者和評審人員提供系統化入門指南的必要性。提供明確的指導方針和模板可以顯著提高工作流程的效率。</p>\n<h3><a name=\"h-39\" class=\"anchor\" href=\"https://gov.gitcoin.co#h-39\"></a>多語言支持至關重要</h3>\n<p>多樣性在科學中的重要地位顯而易見。DeSci Round 也希望透過支持多種語言的申請，提高輪次的包容性。創建多種語言的入門指南，並為不同語言的申請者提供專門支持，可以提高整個社區的理解和參與度。</p>\n<h3><a name=\"h-40\" class=\"anchor\" href=\"https://gov.gitcoin.co#h-40\"></a>早期和持續的社區參與</h3>\n<p>早期與社區互動並保持定期溝通是不可忽視的。每週線上會議、積極的社交媒體互動和清晰一致的更新可以幫助所有相關者保持消息的流通和有效提高社區的參與。</p>\n<h3><a name=\"h-41\" class=\"anchor\" href=\"https://gov.gitcoin.co#h-41\"></a>清晰的申請流程</h3>\n<p>建立清晰且嚴格的申請流程。明確的截止日期確保申請者有充分準備並按時提交申請。這有助於 DeSci Round 工作組有更好的活動規劃和評估。</p>\n<h2><a name=\"h-42\" class=\"anchor\" href=\"https://gov.gitcoin.co#h-42\"></a>影響</h2>\n<p>GG20 DeSci 輪次對去中心化科學社區產生了重大影響：</p>\n<p>資金分配：成功資助了 29 個項目，為他們提供了創新和探索所需的資源。</p>\n<p>社區建設：增加了社區參與度，營造了更具包容性和協作的環境。</p>\n<p>意識提升和倡導：提高了去中心化科學的認識，展示了其推動科學創新的潛力。</p>\n<p>影響測量：GG20 DeSci 工作組將使用 Hypercerts 和 KarmaGap，以記錄影響力的測量和評估，確保跨輪次資助項目的問責制和透明度。</p>\n<h2><a name=\"h-43\" class=\"anchor\" href=\"https://gov.gitcoin.co#h-43\"></a>實施</h2>\n<h3><a name=\"h-44\" class=\"anchor\" href=\"https://gov.gitcoin.co#h-44\"></a>多語言入門指南</h3>\n<p>未來的輪次應該為申請者優先實施中文、西班牙語和其他語言的多語言入門指南。</p>\n<h3><a name=\"h-45\" class=\"anchor\" href=\"https://gov.gitcoin.co#h-45\"></a>系統化指南和模板</h3>\n<p>開發全面的評審人員和受資助者入門指南和模板是很重要的一步。這包括創建行銷模板和系統化指導手冊，以令受資助者更好地展示和推廣項目。</p>\n<h3><a name=\"h-46\" class=\"anchor\" href=\"https://gov.gitcoin.co#h-46\"></a>加強社區參與</h3>\n<p>我們將加強社區參與策略，包括更頻繁的溝通、針對性的社區推廣和定期更新，以保持所有參與者的信息透明和參與度。</p>\n<h3><a name=\"h-47\" class=\"anchor\" href=\"https://gov.gitcoin.co#h-47\"></a>清晰的申請時間表</h3>\n<p>未來的輪次將設定嚴格的申請截止日期，並可能採用滾動申請制度，以確保更好的規劃和評估。</p>\n<h2><a name=\"h-48\" class=\"anchor\" href=\"https://gov.gitcoin.co#h-48\"></a>結論</h2>\n<p>GG20 DeSci 輪次是一次充滿挑戰和學習的經歷。通過工作組和評審人員提供的反饋，我們致力於令未來的輪次更加高效、包容和有影響力。我們將共同推動去中心化科學的邊界，為更具創新性和協作性的未來鋪平道路。感謝所有參與者、捐贈者和支持者使 GG20 DeSci 輪次取得成功。我們期待您在未來輪次中的持續參與 DeSci。</p>\n<p>DeSci 營運團隊</p>\n<h1><a name=\"spanish-version-49\" class=\"anchor\" href=\"https://gov.gitcoin.co#spanish-version-49\"></a>Spanish Version</h1>\n<h1><a name=\"gitcoin-gg20-ronda-desci-informe-de-reflexin-50\" class=\"anchor\" href=\"https://gov.gitcoin.co#gitcoin-gg20-ronda-desci-informe-de-reflexin-50\"></a>Gitcoin GG20 Ronda DeSci: Informe de Reflexión</h1>\n<h2><a name=\"introduccin-51\" class=\"anchor\" href=\"https://gov.gitcoin.co#introduccin-51\"></a>Introducción</h2>\n<p>La Ronda DeSci GG20 de Gitcoin marcó un hito significativo en el viaje de la ciencia descentralizada. Al concluir esta ronda, es esencial reflexionar sobre nuestros logros, desafíos y aprendizajes para mejorar las rondas futuras. Este informe sintetiza los comentarios de varios operadores y administradores de DeSci, proporcionando una visión integral del desempeño de la Ronda DeSci GG20.</p>\n<h2><a name=\"resultados-de-gg20-52\" class=\"anchor\" href=\"https://gov.gitcoin.co#resultados-de-gg20-52\"></a>Resultados de GG20</h2>\n<p>La Ronda DeSci GG20 vio una diversa gama de proyectos solicitando financiación. A pesar de algunos desafíos logísticos, la ronda destacó con éxito el potencial de la ciencia descentralizada. Varios beneficiarios recibieron la financiación necesaria para hacer crecer sus proyectos. La participación de la comunidad fue robusta, con un notable aumento en la participación de los beneficiarios en X en comparación con rondas anteriores.</p>\n<h2><a name=\"mtricas-de-la-ronda-53\" class=\"anchor\" href=\"https://gov.gitcoin.co#mtricas-de-la-ronda-53\"></a>Métricas de la Ronda</h2>\n<ul>\n<li>Número de Solicitudes: 34</li>\n<li>Proyectos Financiados: 29</li>\n<li>Fondos Totales Distribuidos: $25,000</li>\n<li>Participación de Donantes: 292 individuos</li>\n<li>Crecimiento de la Comunidad: Aumento del 20% en seguidores en redes sociales</li>\n<li>Asistencia Semanal a Cornerstone DeSci: 69% de tasa de participación total de los beneficiarios</li>\n</ul>\n<h2><a name=\"mtricas-sociales-54\" class=\"anchor\" href=\"https://gov.gitcoin.co#mtricas-sociales-54\"></a>Métricas Sociales</h2>\n<ul>\n<li>Asistencia Semanal a Cornerstone DeSci: 69% de tasa de participación total de los beneficiarios</li>\n<li>Impresiones: 46.1K</li>\n<li>Tasa Total de Compromiso: 3.9%</li>\n<li>Clics en Enlaces: 233</li>\n<li>Retweets: 227</li>\n<li>Likes: 514</li>\n<li>Respuestas: 64</li>\n</ul>\n<h2><a name=\"desafos-55\" class=\"anchor\" href=\"https://gov.gitcoin.co#desafos-55\"></a>Desafíos</h2>\n<h3><a name=\"soporte-multilinge-56\" class=\"anchor\" href=\"https://gov.gitcoin.co#soporte-multilinge-56\"></a>Soporte Multilingüe</h3>\n<p>Hubo dificultades en la gestión de aplicaciones multilingües y la necesidad de mejores estructuras de soporte. Las soluciones sugeridas incluyeron documentos de incorporación multilingües y portales para beneficiarios en chino y español.</p>\n<h3><a name=\"incorporacin-y-relaciones-con-los-beneficiarios-57\" class=\"anchor\" href=\"https://gov.gitcoin.co#incorporacin-y-relaciones-con-los-beneficiarios-57\"></a>Incorporación y Relaciones con los Beneficiarios</h3>\n<p>Se señalaron desafíos en las relaciones y la incorporación de los beneficiarios, con un consenso sobre la necesidad de roles y responsabilidades más claros, así como esfuerzos de marketing estructurados, incluyendo plantillas para los beneficiarios.</p>\n<h3><a name=\"incorporacin-de-administradores-58\" class=\"anchor\" href=\"https://gov.gitcoin.co#incorporacin-de-administradores-58\"></a>Incorporación de Administradores</h3>\n<p>Se destacó la necesidad de más tiempo para la incorporación de administradores, sugiriendo un período de preparación de 1-2 meses antes de que comience la ronda. También se recomendó crear una plantilla para administradores para agilizar el proceso de incorporación.</p>\n<h3><a name=\"compromiso-de-la-comunidad-59\" class=\"anchor\" href=\"https://gov.gitcoin.co#compromiso-de-la-comunidad-59\"></a>Compromiso de la Comunidad</h3>\n<p>Se subrayó la importancia de un compromiso comunitario más robusto. Esto incluye comunicaciones más tempranas y frecuentes, involucrar a comunidades específicas como la comunidad asiática, y organizar llamadas semanales para una mejor coordinación.</p>\n<h3><a name=\"plazos-de-aplicacin-60\" class=\"anchor\" href=\"https://gov.gitcoin.co#plazos-de-aplicacin-60\"></a>Plazos de Aplicación</h3>\n<p>Se sugirió tener un plazo estricto, potencialmente a mitad de la ronda, para asegurar aplicaciones significativas. También se discutió la idea de aplicaciones continuas, pero no se tomó una decisión.</p>\n<h2><a name=\"aprendizajes-61\" class=\"anchor\" href=\"https://gov.gitcoin.co#aprendizajes-61\"></a>Aprendizajes</h2>\n<h3><a name=\"importancia-de-una-incorporacin-estructurada-62\" class=\"anchor\" href=\"https://gov.gitcoin.co#importancia-de-una-incorporacin-estructurada-62\"></a>Importancia de una Incorporación Estructurada</h3>\n<p>Los comentarios destacaron la necesidad de una incorporación estructurada tanto para los beneficiarios como para los administradores. Proporcionar directrices y plantillas claras puede mejorar significativamente la eficiencia del proceso.</p>\n<h3><a name=\"el-soporte-multilinge-es-crucial-63\" class=\"anchor\" href=\"https://gov.gitcoin.co#el-soporte-multilinge-es-crucial-63\"></a>El Soporte Multilingüe es Crucial</h3>\n<p>Apoyar aplicaciones en múltiples idiomas es vital para la inclusividad. Crear documentos de incorporación multilingües y tener soporte dedicado para hablantes de diferentes idiomas puede mejorar la participación y la comprensión.</p>\n<h3><a name=\"compromiso-comunitario-temprano-y-continuo-64\" class=\"anchor\" href=\"https://gov.gitcoin.co#compromiso-comunitario-temprano-y-continuo-64\"></a>Compromiso Comunitario Temprano y Continuo</h3>\n<p>Involucrar a la comunidad temprano y mantener una comunicación regular es esencial. Llamadas semanales, un compromiso activo en redes sociales y actualizaciones claras y consistentes pueden ayudar a mantener a todos los interesados informados y comprometidos.</p>\n<h3><a name=\"procesos-de-aplicacin-claros-65\" class=\"anchor\" href=\"https://gov.gitcoin.co#procesos-de-aplicacin-claros-65\"></a>Procesos de Aplicación Claros</h3>\n<p>Establecer plazos de aplicación claros y estrictos asegura que las aplicaciones estén bien preparadas y se presenten a tiempo. Esto ayuda a una mejor planificación y evaluación.</p>\n<h2><a name=\"impacto-66\" class=\"anchor\" href=\"https://gov.gitcoin.co#impacto-66\"></a>Impacto</h2>\n<p>La Ronda DeSci GG20 tuvo un impacto significativo en la comunidad de ciencia descentralizada:</p>\n<ul>\n<li>Distribución de Fondos: Financiamos con éxito 29 proyectos, proporcionando los recursos necesarios para innovar y explorar.</li>\n<li>Construcción de Comunidad: Aumentó el compromiso y la participación de la comunidad, fomentando un entorno más inclusivo y colaborativo.</li>\n<li>Conciencia y Defensa: Aumentó la conciencia sobre la importancia de la ciencia descentralizada y su potencial para impulsar la innovación científica.</li>\n<li>Mediciones de Impacto: Los operadores de DeSci GG20 han iniciado la implementación de Hypercerts y KarmaGap para mejorar las mediciones de impacto, asegurando responsabilidad y transparencia para los proyectos financiados en todas las rondas.</li>\n</ul>\n<h2><a name=\"implementaciones-67\" class=\"anchor\" href=\"https://gov.gitcoin.co#implementaciones-67\"></a>Implementaciones</h2>\n<h3><a name=\"incorporacin-multilinge-68\" class=\"anchor\" href=\"https://gov.gitcoin.co#incorporacin-multilinge-68\"></a>Incorporación Multilingüe</h3>\n<p>Se priorizará la implementación de documentos de incorporación multilingües y portales para beneficiarios en chino, español y otros idiomas para futuras rondas.</p>\n<h3><a name=\"incorporacin-estructurada-y-plantillas-69\" class=\"anchor\" href=\"https://gov.gitcoin.co#incorporacin-estructurada-y-plantillas-69\"></a>Incorporación Estructurada y Plantillas</h3>\n<p>Desarrollar plantillas de incorporación comprensivas para administradores y beneficiarios será esencial. Esto incluye la creación de plantillas de marketing y directrices estructuradas para una mejor presentación y promoción de proyectos.</p>\n<h3><a name=\"compromiso-comunitario-mejorado-70\" class=\"anchor\" href=\"https://gov.gitcoin.co#compromiso-comunitario-mejorado-70\"></a>Compromiso Comunitario Mejorado</h3>\n<p>Mejoraremos nuestras estrategias de compromiso comunitario, incluyendo comunicaciones más frecuentes, alcance comunitario dirigido y actualizaciones regulares para mantener a todos los participantes informados y comprometidos.</p>\n<h3><a name=\"lneas-de-tiempo-de-aplicacin-claras-71\" class=\"anchor\" href=\"https://gov.gitcoin.co#lneas-de-tiempo-de-aplicacin-claras-71\"></a>Líneas de Tiempo de Aplicación Claras</h3>\n<p>Las futuras rondas contarán con plazos de aplicación estrictos y posiblemente períodos de aplicaciones continuas para asegurar una mejor planificación y evaluación.</p>\n<h2><a name=\"conclusin-72\" class=\"anchor\" href=\"https://gov.gitcoin.co#conclusin-72\"></a>Conclusión</h2>\n<p>La Ronda DeSci GG20 ha sido una experiencia de aprendizaje llena de desafíos y triunfos. Al abordar los comentarios proporcionados por nuestros operadores y administradores, nos comprometemos a hacer que las futuras rondas sean más eficientes, inclusivas y de mayor impacto. Juntos, continuamos empujando los límites de la ciencia descentralizada y pavimentando el camino para un futuro más innovador y colaborativo.</p>\n<p>Gracias a todos nuestros participantes, donantes y seguidores por hacer que la Ronda DeSci GG20 sea un éxito. Esperamos su continuo compromiso en futuras rondas.</p>\n<p>Equipo de Operaciones DeSci</p>\n            <p><small>5 posts - 4 participants</small></p>\n            <p><a href=\"https://gov.gitcoin.co/t/gg20-decentralized-science-reflection-report/19025\">Read full topic</a></p>","link":"https://gov.gitcoin.co/t/gg20-decentralized-science-reflection-report/19025","pubDate":"Fri, 21 Jun 2024 12:58:48 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"gov.gitcoin.co-topic-19025"},"source":{"@url":"https://gov.gitcoin.co/t/gg20-decentralized-science-reflection-report/19025.rss","#text":"GG20 Decentralized Science Reflection Report"}},{"title":"Gitcoin 2.1 - where we've been, where should we go?","dc:creator":"owocki","category":"🧙 🧙‍♀️ Ideas and Open Discussion","description":"<p>Sometimes I write in order to clarify my thinking.  Below is a memo I wrote a couple weeks ago about Gitcoin 2.1.  These are my raw opinions circa 2 weeks ago, about where Gitcoin’s been and where we’re going.   I am sharing for transparency, but beware it may contain errors and this post is not financial, strategic, or any other type of advice.</p>\n<h1><a name=\"gitcoin-21-1\" class=\"anchor\" href=\"https://gov.gitcoin.co#gitcoin-21-1\"></a>Gitcoin 2.1</h1>\n<p><em>The future is not something we enter. The future is something we create. ~ Leonard Sweeter</em></p>\n<h2><a name=\"where-weve-been-2\" class=\"anchor\" href=\"https://gov.gitcoin.co#where-weve-been-2\"></a>Where we’ve been</h2>\n<p>Gitcoin DAO spent $25m and 3 years (2021-2024) inventing a product that was too little too late.</p>\n<ul>\n<li>Grants Stack QF was perfect for 2021 (notable aside: we generated a few spin outs/spin downs: PGN, public works, ODC, dCompass, Passport, etc)</li>\n</ul>\n<p>The market has moved on</p>\n<ol>\n<li>From single player (Gitcoin only) to many competitors (some are now bigger than us).</li>\n<li>From QF only to a pluralistic ecosystem of capital allocation mechanisms.</li>\n<li>From 2010s era tech (L1s, on-chain POAPs, transparency by default) to 2020 era tech (zk, MACI, L2s)</li>\n</ol>\n<p>Gitcoin must evolve to catch up (but not just catch up, we will skate to where the puck is going).</p>\n<h2><a name=\"where-were-going-3\" class=\"anchor\" href=\"https://gov.gitcoin.co#where-were-going-3\"></a>Where we’re going</h2>\n<p><em>(We should do an essay contest with the prompt “What is Gitcoin 2.1” and have other leaders write their own thoughtful takes. Here is my answer to this prompt:)</em></p>\n<p>Our Goal is $50GMV, and then financial sustainability.</p>\n<p>The good news is that we have everything we need to do it.</p>\n<p>We are betting the brand on</p>\n<ol>\n<li>Grants = Growth (immediate business line)</li>\n<li><a href=\"https://gov.gitcoin.co/t/the-case-capital-allocation-strategy-exchange/18271\">CASE</a> (back of house, long term strategic investment)</li>\n</ol>\n<p>Why betting the brand on this?</p>\n<ol>\n<li>I have high conviction in both initiatives.</li>\n<li>Gitcoin has enough $$$ left to pull it off (for now, but that overton window will close soon).</li>\n<li>The default is death.</li>\n</ol>\n<h2><a name=\"what-got-us-here-wont-get-us-there-4\" class=\"anchor\" href=\"https://gov.gitcoin.co#what-got-us-here-wont-get-us-there-4\"></a>What got us here won’t get us there.</h2>\n<h3><a name=\"h-0-those-who-remain-will-need-to-opt-in-to-being-a-live-player-or-gtfo-5\" class=\"anchor\" href=\"https://gov.gitcoin.co#h-0-those-who-remain-will-need-to-opt-in-to-being-a-live-player-or-gtfo-5\"></a>0. Those who remain will need to opt in to being a live player or GTFO</h3>\n<p>For those who want to be full time still, This will be hard. Everyone needs to be a live player. Everyone needs to be pulling their weight. We will win by committing to doing it, together. By supporting each other.</p>\n<p>We have <a href=\"https://x.com/owocki/status/1803868411942047882\">burnt the boats</a>. There is no going back to Gitcoin 1.0 or to 2.0. Please leave if you are not 100% onboard. If that’s you, come talk to me. We will make it easy. Please do me the justice of freeing up your seat for someone who wants to be here.</p>\n<p>Anyone who remains after 1 week, we get hardcore. We commit. We believe we can do it.</p>\n<h3><a name=\"h-1-we-believe-we-can-do-it-so-we-can-do-it-6\" class=\"anchor\" href=\"https://gov.gitcoin.co#h-1-we-believe-we-can-do-it-so-we-can-do-it-6\"></a>1. We believe we can do it, so we can do it.</h3>\n<p>We can do it if we believe we can do it.</p>\n<p>If we don’t believe we can do it we won’t do it. We commit to the outcome and we work backwards to make it work. This mindset creates folllow through and it is key.</p>\n<h3><a name=\"h-2-we-are-the-source-of-a-new-regenerative-web3-7\" class=\"anchor\" href=\"https://gov.gitcoin.co#h-2-we-are-the-source-of-a-new-regenerative-web3-7\"></a>2. We are the SOURCE of a new regenerative web3</h3>\n<p>We are <a href=\"https://workwithsource.com/what-is-source/introduction/\">source</a>.  We are the highest-lindy public goods funding project in Ethereum and an early innovator in a existentially important space! We sit atop a groundswell of legitimacy. Lets act like it.</p>\n<h3><a name=\"h-3-its-just-an-optimization-problem-tune-spent-to-gmv-output-8\" class=\"anchor\" href=\"https://gov.gitcoin.co#h-3-its-just-an-optimization-problem-tune-spent-to-gmv-output-8\"></a>3. It’s just an optimization problem (tune $$$ spent to GMV output)</h3>\n<p>Literally the most important metric to scale rn: $$$ spent to GMV output. If we spent $25m on traditional QF ($3.5m GMV in 2024), then how might we learn from newer initiatives that costed closer to $200k to build, like EasyRetroPGF ($1.95m GMV in 2024)?</p>\n<p>What if we can make bets in multiple areas?  We already are.  Check out all of these things that were built on Allo.</p>\n<p></p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://gov.gitcoin.co/uploads/db4391/original/2X/3/385d8a15b786008af1a1bd5b9a4d8c01377f079b.png\" data-download-href=\"https://gov.gitcoin.co/uploads/db4391/385d8a15b786008af1a1bd5b9a4d8c01377f079b\" title=\"Screenshot 2024-06-20 at 11.59.45 PM\"><img src=\"https://gov.gitcoin.co/uploads/db4391/optimized/2X/3/385d8a15b786008af1a1bd5b9a4d8c01377f079b_2_690x375.png\" alt=\"Screenshot 2024-06-20 at 11.59.45 PM\" data-base62-sha1=\"82D91zWvZlYIeM6fDWOF0sMid87\" width=\"690\" height=\"375\" srcset=\"https://gov.gitcoin.co/uploads/db4391/optimized/2X/3/385d8a15b786008af1a1bd5b9a4d8c01377f079b_2_690x375.png, https://gov.gitcoin.co/uploads/db4391/optimized/2X/3/385d8a15b786008af1a1bd5b9a4d8c01377f079b_2_1035x562.png 1.5x, https://gov.gitcoin.co/uploads/db4391/optimized/2X/3/385d8a15b786008af1a1bd5b9a4d8c01377f079b_2_1380x750.png 2x\" data-dominant-color=\"EFEFEF\"></a></div><p></p>\n<h2><a name=\"how-do-we-do-it-9\" class=\"anchor\" href=\"https://gov.gitcoin.co#how-do-we-do-it-9\"></a>How do we do it?</h2>\n<h3><a name=\"object-level-investments-from-shallowest-to-deepest-10\" class=\"anchor\" href=\"https://gov.gitcoin.co#object-level-investments-from-shallowest-to-deepest-10\"></a>Object level investments (from shallowest to deepest)</h3>\n<h3><a name=\"h-1-grants-growth-powered-by-case-11\" class=\"anchor\" href=\"https://gov.gitcoin.co#h-1-grants-growth-powered-by-case-11\"></a>1. Grants = Growth, powered by CASE</h3>\n<p>We show off the fruits of <a href=\"https://gov.gitcoin.co/t/the-case-capital-allocation-strategy-exchange/18271\">CASE</a> in sales/BD convos. Sometimes this means we build new stuff for customers.</p>\n<h3><a name=\"h-2-case-rd-12\" class=\"anchor\" href=\"https://gov.gitcoin.co#h-2-case-rd-12\"></a>2. CASE R&amp;D</h3>\n<p>In CASE R&amp;D, we focus on Grants mechanisms.</p>\n<ol>\n<li>Key investment: Reduce TTV for new mechanisms to explore design space 10000x faster.</li>\n<li>2nd Key investment: Embrace Capital Allocation Strategies built elsewhere (more on that later).</li>\n<li>Mechanisms</li>\n<li>QF<br>\n1. Via GS<br>\n2. VIa QF new build</li>\n<li>RetroPGF<br>\n1. OP Round 3 style<br>\n2. OP Round 4-5 style</li>\n<li>Experimental Mechanisms<br>\n1. Private QF<br>\n2. Conviction Voting<br>\n3. Guilds<br>\n4. Streaming QF<br>\n5. Cookie Jar<br>\n6. MolochDAOs</li>\n<li>Supporting Software</li>\n<li>Sidecar Apps that add utility for all mechanisms (like checker)</li>\n<li>GTC Utility<br>\n1.  Our goal is not just GMV but Allo GMV and eventually GTC utility.</li>\n</ol>\n<h3><a name=\"h-3-gg21-powered-by-case-13\" class=\"anchor\" href=\"https://gov.gitcoin.co#h-3-gg21-powered-by-case-13\"></a>3. GG21+ powered by CASE</h3>\n<p>We use CASE to reinvent Grant Program/Citizens Programs to match our product offerings.</p>\n<ol>\n<li>QF</li>\n<li>RetroPGF</li>\n<li>Grant ships</li>\n<li>1 or 2 experimental mechanisms</li>\n</ol>\n<p>During this, we must:</p>\n<ol>\n<li>Become experts on the mechanisms by demoing the mechanisms.</li>\n<li>Do a Rotational Volunteering Program so that engineers and other back of house ppl have to do customer service + have empathy forour users. Everyone who is full time at Grants Lab must serve in some volunteer or support capacity in the round. This will create empathy for our users and for each other.</li>\n<li>Merge Citizens Grants Rounds into GG rounds</li>\n<li>These should have the same operational playbook just be focused on Gitcoin internally instead of outwards.</li>\n</ol>\n<h3><a name=\"h-4-cccc-powered-by-case-14\" class=\"anchor\" href=\"https://gov.gitcoin.co#h-4-cccc-powered-by-case-14\"></a>4. CCCC, powered by CASE</h3>\n<p>Launch a new container for DAO/Citizens work entitled the citizens &amp; core coordination container (CCCC)</p>\n<ol>\n<li>Core =\n<ol>\n<li>Owns education on the common knowledge citizens must all have (Whitepaper, Rainbowpaper, CASE book, grants canvas book, current events / initiatives)</li>\n<li>Owns internal comms</li>\n<li>Owns website</li>\n<li>Owns brand</li>\n</ol>\n</li>\n<li>Citizens = the people in the outer orbit of the DAO.</li>\n<li>Coordination - ways that they can help Gitcoin\n<ol>\n<li>Mechanisms, built on Allo.\n<ol>\n<li>Direct Grants</li>\n<li>Retroactive Grants</li>\n<li>RFPs from GL</li>\n<li>Write Software / Build Mechanisms on Allo</li>\n</ol>\n</li>\n</ol>\n</li>\n<li>Education &amp; Training Programs<br>\n1. Teach people to see the world in terms of capital allocation.<br>\n2. Teach them to use our software.<br>\n3. 10m GTC all in commitment from treasury.\n<ul>\n<li>Its a lot but if we dont dogfood our own mechanisms we will never win. And we need to level access to outsiders.</li>\n</ul>\n</li>\n<li>Container</li>\n</ol>\n<h3><a name=\"h-5-metagovernance-loop-progressive-governance-refactor-15\" class=\"anchor\" href=\"https://gov.gitcoin.co#h-5-metagovernance-loop-progressive-governance-refactor-15\"></a>5. Metagovernance loop: Progressive governance refactor</h3>\n<p>Workstreams. Fucking. Blow. They don’t work. They’re capital inefficient. They turn into fiefdoms.</p>\n<p>Why are we still using workstreams (or a variant of them) 36 months after the dao was created?</p>\n<p>Why are we using workstreams when we should be using our own mechanisms?  Or the latest DAO tooling?  If we  believe in networks over hierarchies, lets start using our products to nurture the neworks around Gitcoin!</p>\n<p>We need to go through this loop</p>\n<ol>\n<li>Start to think in mechanisms</li>\n<li>Start to act in mechanisms</li>\n<li>Build them on Allo</li>\n<li>Use them here</li>\n<li>Repeat until moon</li>\n</ol>\n<p>S22 needs to be the LAST time we dont use allo (or something on the road to being on Allo) to distribute $$$ to the DAO.</p>\n<p>How do we govern what mechanisms we use? I recommend we use</p>\n<ol>\n<li><a href=\"https://grantships.fun/\">Grants Ships</a> - decentralized container for choosing mechanisms.</li>\n<li><a href=\"https://forum.arbitrum.foundation/t/questbook-dda-program-update-thread/23672\">Dedicated Domain Allocation</a> == Kevin and Meg and other top stewards are domain experts now, but eventually we open up more pools of funds.</li>\n</ol>\n<h2><a name=\"in-closing-16\" class=\"anchor\" href=\"https://gov.gitcoin.co#in-closing-16\"></a>In Closing</h2>\n<p>Gitcoin then iterates every 6 months until big success or until failure. Whatever we are in Dec 2024, that is Gitcoin 2.2. The amount of pain we all go through in 6 months is directly driven by the results of what we do now until then (and some luck).</p>\n<p>In November, Owocki to give Gitcoin 2.1 talk at Devcon this year about new product offerings. We are fucking Gitcoin. We were leaders and will be again. This is how you can leverage us yourself.</p>\n            <p><small>1 post - 1 participant</small></p>\n            <p><a href=\"https://gov.gitcoin.co/t/gitcoin-2-1-where-weve-been-where-should-we-go/19022\">Read full topic</a></p>","link":"https://gov.gitcoin.co/t/gitcoin-2-1-where-weve-been-where-should-we-go/19022","pubDate":"Fri, 21 Jun 2024 03:25:48 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"gov.gitcoin.co-topic-19022"},"source":{"@url":"https://gov.gitcoin.co/t/gitcoin-2-1-where-weve-been-where-should-we-go/19022.rss","#text":"Gitcoin 2.1 - where we've been, where should we go?"}},{"title":"Gitcoin 2.1 - Org Updates June 2024","dc:creator":"deltajuliet","category":"🧙 🧙‍♀️ Ideas and Open Discussion","description":"<p>Hey everyone,</p>\n<p>I hope this message finds you well. We have some exciting updates to share regarding the evolution of our organization as we transition into Gitcoin 2.1 and what that means right now, and for the future we’re creating.The following message has been shared with our core DAO contributors and I wanted to extend context to the broader community on some of the recent developments we’re making to our org. I welcome any comments, notes and feedback and always happy to talk through these things live - my calendar is <a href=\"https://calendar.google.com/calendar/appointments/schedules/AcZssZ3MvOFfCEJ-ERoy4_l7C-iXRXB8OOCCau2Ri1aTr3idf0h0Yu_03QPAe_CCIbWx_Kj6ouAaGasg\">here</a>.</p>\n<p>Our mission to foster a community-driven platform that advances public goods remains at the heart of our efforts. This mission requires improved execution and sharper focus to navigate the fluctuations of the market—through bull runs, bear markets, and beyond.</p>\n<p>To align our strategic goals with the evolving demands of our industry, we are making some significant changes:</p>\n<ul>\n<li>Dissolving the Ecosystem Collective: We will concentrate our efforts where they count the most.</li>\n<li>Focusing solely on our Grants Program and Product: Levelling up our leadership in grant-making technology.</li>\n</ul>\n<p>The primary goals of these decisions are to:</p>\n<ul>\n<li>Focus our energy on the initiatives that will keep us at the forefront of the Grants and Grant tech ecosystem, increase GMV, and position ourselves as thought leaders.</li>\n<li>Work towards financial sustainability and extend our operational runway beyond current projections.</li>\n</ul>\n<p>The competitive landscape has evolved, with multiple new players entering the market. To remain at the forefront, we must adapt and innovate rapidly. This means developing highly configurable, custom solutions that cater to the specific needs of our community and partners. We are dedicating more energy to these key areas and focusing our resources on onboarding every web3 grants program into Gitcoin.</p>\n<p>In line with our proactive approach, we are hyperfocused on making adjustments that concentrate us on the greatest impact and alignment for our mission. As Passport spins out and we streamline the Grants Lab and Ecosystem Collective teams, we aim continue to strengthen  and position ourselves for future success. We intend to move more work into the community, leveraging their expertise and enthusiasm to deliver updates across Gitcoin more efficiently.</p>\n<p>We understand that these changes come with their challenges and will impact some of our valued contributors. We are committed to providing financial support and assistance to those affected during this transition, helping them find new roles within the industry or beyond.</p>\n<p>We want to assure all community members, stewards, and token holders that these changes have been taken very seriously and carefully considered. Our intention is to make Gitcoin as operationally efficient as possible while continuously bolstering our efforts to grow adoption for our suite of products, and knowledge base, further ensuring their longevity.</p>\n<p>I want to thank and show my genuine gratitude for the work that the Ecosystem Collective team has poured into the heart and soul of Gitcoin, and I’m optimistic that we’ll have further opportunities to work together again in the future. I’m excited for our next chapter - focusing on our <a href=\"https://gov.gitcoin.co/t/grants-labs-product-strategy-review-june-2024/19011\">hyper-focused Grants Lab strategy</a>, and I look forward to sharing some of the amazing partnerships we have in the pipeline with you all.</p>\n            <p><small>2 posts - 2 participants</small></p>\n            <p><a href=\"https://gov.gitcoin.co/t/gitcoin-2-1-org-updates-june-2024/19019\">Read full topic</a></p>","link":"https://gov.gitcoin.co/t/gitcoin-2-1-org-updates-june-2024/19019","pubDate":"Thu, 20 Jun 2024 23:23:37 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"gov.gitcoin.co-topic-19019"},"source":{"@url":"https://gov.gitcoin.co/t/gitcoin-2-1-org-updates-june-2024/19019.rss","#text":"Gitcoin 2.1 - Org Updates June 2024"}},{"title":"GG21 Community Round Proposal Template","dc:creator":"MathildaDV","category":"🌱 Gitcoin Grants","description":"<h1><a name=\"gg21-community-round-proposal-template-1\" class=\"anchor\" href=\"https://gov.gitcoin.co#gg21-community-round-proposal-template-1\"></a>GG21 Community Round Proposal Template</h1>\n<p>For those who would like to apply to be a community round in GG21, below is the proposal template to work off of and a breakdown of the process. <strong>PLEASE NOTE:</strong> There is NO minimum matching required to apply! The top 10 will be accepted into the round, and the top 5 of those will receive extra matching funds from Gitcoin.</p>\n<ul>\n<li><strong>GG21:</strong> August 7 - 21\n<ul>\n<li><em>Ecosystem ‘Spotlight’ Rounds</em>\n<ul>\n<li>Ecosystem Rounds will now have the opportunity to share the stage alongside the community rounds.</li>\n</ul>\n</li>\n<li><em>10 Community Rounds</em></li>\n<li><em>$125k allocated towards matching for top 5 Community Rounds</em></li>\n</ul>\n</li>\n</ul>\n<h4><a name=\"tldr-of-the-process-2\" class=\"anchor\" href=\"https://gov.gitcoin.co#tldr-of-the-process-2\"></a>TL;DR of the process:</h4>\n<p>To be eligible to run a community round in GG21, each community needs to upload their proposal to our gov forum (with the outlined template below).<br>\nAfter the deadline for proposals, the <a href=\"https://gov.gitcoin.co/t/gg20-community-council/17749\">Community Council </a>will review and vote on which rounds to accept into the round, and how to allocate matching funds to the top 5.</p>\n<h2><a name=\"community-round-governance-gg21-3\" class=\"anchor\" href=\"https://gov.gitcoin.co#community-round-governance-gg21-3\"></a>Community Round Governance - GG21</h2>\n<p>Here’s a breakdown of GG21’s governance process and a rundown of how the Council will be involved on the process we will follow to select community rounds:</p>\n<p><strong>Week 1</strong>: Gitcoin team posts eligibility criteria &amp; agreements to gov forum [June 18th]</p>\n<p><strong>Week 1-3:</strong> Community Round partners complete and post their proposal to the gov forum under the category [Gitcoin Grants].</p>\n<ul>\n<li>Community Round partners to create a proposal that they post on the gov forum.</li>\n</ul>\n<p><strong>Week 3:</strong> Deadline for proposals [July 14th]</p>\n<ul>\n<li>A full list of Community Rounds are available for the GG21 Community Council to review.</li>\n</ul>\n<p><strong>Week 3 - 4:</strong> Review &amp; voting period [July 15 - July 18]</p>\n<ul>\n<li>The proposals are reviewed by the GG20 Community Council and go to a vote</li>\n<li>The decision of the vote is published on the gov forum.</li>\n</ul>\n<p><strong>Week 4 - 6</strong>: Results and onboarding period [July 19 - 26]</p>\n<ul>\n<li>The Community Rounds are onboarded into the upcoming round.</li>\n</ul>\n<p><strong>PLEASE NOTE:</strong> To officially be part of GG21, each community needs to go through this new governance process. The top 10 rounds will be included in marketing efforts and be “official” GG21 rounds, and the top 5 will receive extra matching from Gitcoin.</p>\n<h2><a name=\"when-drafting-a-proposal-please-include-the-following-information-4\" class=\"anchor\" href=\"https://gov.gitcoin.co#when-drafting-a-proposal-please-include-the-following-information-4\"></a>When drafting a proposal, please include the following information:</h2>\n<p>The proposal will <strong>be posted on the Gitcoin gov forum as a new post under the category: [Gitcoin Grants]</strong>. Please note: <a href=\"https://gov.gitcoin.co/t/gg21-community-round-eligibility-criteria/19003\">Review the GG21 Eligibility Criteria</a> and agreements while creating your proposal.</p>\n<p>Deadline to submit for GG21: <strong>July 14th at 11:59pm UTC</strong></p>\n<p>GG21 donations (round kick off) will go live on August 7th.</p>\n<p><strong>Proposal Template:</strong></p>\n<h3><a name=\"name-or-topictheme-of-proposed-round-5\" class=\"anchor\" href=\"https://gov.gitcoin.co#name-or-topictheme-of-proposed-round-5\"></a>Name (or Topic/Theme) of Proposed Round:</h3>\n<p>[Proposed Round Name]</p>\n<h3><a name=\"social-handle-of-your-organization-6\" class=\"anchor\" href=\"https://gov.gitcoin.co#social-handle-of-your-organization-6\"></a>Social Handle of Your Organization:</h3>\n<p>@[Social Handle]</p>\n<h3><a name=\"eligibility-criteria-7\" class=\"anchor\" href=\"https://gov.gitcoin.co#eligibility-criteria-7\"></a>Eligibility Criteria:</h3>\n<p>What is the eligibility criteria for your round? Projects must primarily focus on [specific focus]. Additional criteria include [detailed eligibility criteria]. All rounds must comply with Gitcoin’s core rules.</p>\n<p>For example: to be in the Climate Solutions Round, your project must primarily focus on climate action. <a href=\"https://gitcoin.notion.site/GG19-Eligibility-50843c8b3ab44ad297731a00efa6e389?pvs=4\">see this example of eligibility criteria for the last grant rounds 1</a>.</p>\n<p>Reminder: All rounds must comply with Gitcoin’s core rules, which include no fraudulent activity, quid pro quo, hate speech, or other activities out of alignment with Gitcoin’s essential intents. Please include all additional eligibility criteria specific to this proposed grants round.</p>\n<h3><a name=\"round-history-8\" class=\"anchor\" href=\"https://gov.gitcoin.co#round-history-8\"></a>Round History:</h3>\n<p>Clearly identify the round history.</p>\n<ul>\n<li>This round has been run [number of times] during Gitcoin Grants rounds. If running a new version of an old round, specify details. If unsure, indicate lack of historical context.</li>\n</ul>\n<h3><a name=\"team-running-this-round-9\" class=\"anchor\" href=\"https://gov.gitcoin.co#team-running-this-round-9\"></a>Team Running This Round:</h3>\n<p>Clearly identify the round operator with relevant experience, and provide detailed bios and social handle links for at least two additional team members, emphasizing their relevant experience.</p>\n<ul>\n<li>Round Operator: [Name], [Relevant Experience], [Bio], [Social Handle]</li>\n<li>Team Member 1: [Name], [Relevant Experience], [Bio], [Social Handle]</li>\n<li>Team Member 2: [Name], [Relevant Experience], [Bio], [Social Handle]</li>\n<li>Additional team members if applicable.</li>\n</ul>\n<h3><a name=\"alignment-with-gitcoins-missionhttpsgovgitcoincotupdate-gitcoins-adopted-mission-and-vision-statements15039-and-essential-intentshttpsgovgitcoincotupdate-gitcoin-s-ratified-essential-intents-2023-2024-and-a-recap-of-our-successes16818-10\" class=\"anchor\" href=\"https://gov.gitcoin.co#alignment-with-gitcoins-missionhttpsgovgitcoincotupdate-gitcoins-adopted-mission-and-vision-statements15039-and-essential-intentshttpsgovgitcoincotupdate-gitcoin-s-ratified-essential-intents-2023-2024-and-a-recap-of-our-successes16818-10\"></a>Alignment with Gitcoin’s <a href=\"https://gov.gitcoin.co/t/update-gitcoins-adopted-mission-and-vision-statements/15039\">Mission</a> and <a href=\"https://gov.gitcoin.co/t/update-gitcoin-s-ratified-essential-intents-2023-2024-and-a-recap-of-our-successes/16818\">Essential Intents</a>:</h3>\n<p>Clearly articulate how the proposed round aligns with Gitcoin’s mission and essential intents.</p>\n<ul>\n<li>This round aligns with Gitcoin’s mission and essential intents by [ insert explanation].</li>\n</ul>\n<h3><a name=\"anticipated-size-of-the-matching-pool-11\" class=\"anchor\" href=\"https://gov.gitcoin.co#anticipated-size-of-the-matching-pool-11\"></a>Anticipated Size of the Matching Pool:</h3>\n<p>Clearly state the anticipated size of the matching pool, Include the funding address. And outline a clear plan for future fundraising if not already in place.</p>\n<ul>\n<li>The matching pool is anticipated to be [amount], fundraised through [partners/connections/combination].</li>\n<li>Funding address: [Address].</li>\n<li>We have a clear plan in place for future fundraising, including [details of the plan].</li>\n</ul>\n<h3><a name=\"advisors-for-this-round-12\" class=\"anchor\" href=\"https://gov.gitcoin.co#advisors-for-this-round-12\"></a>Advisors for This Round:</h3>\n<p>Clearly identify any advisors and their relevant experience. Indicate if any have run a round for Gitcoin or participated in running a round in the past. List any advisors and their relevant experience.</p>\n<h3><a name=\"funding-mechanism-13\" class=\"anchor\" href=\"https://gov.gitcoin.co#funding-mechanism-13\"></a>Funding Mechanism:</h3>\n<p>We are using [funding mechanism] because [reason why it is the best option for your round].</p>\n<h3><a name=\"community-size-and-engagement-14\" class=\"anchor\" href=\"https://gov.gitcoin.co#community-size-and-engagement-14\"></a>Community Size and Engagement:</h3>\n<p>Estimate the size of the community approximately, provide tangible metrics indicating the strength of the community (e.g., donations, past round participation), describe the type of projects intended to be funded, estimate the number of eligible grantees, and detail the plan for assessing grantee impact over successive rounds.</p>\n<ul>\n<li>Our community consists of approximately [number] members. Tangible metrics indicating the strength of our community include [donations/past round participation].</li>\n</ul>\n<h3><a name=\"type-of-projects-to-fund-15\" class=\"anchor\" href=\"https://gov.gitcoin.co#type-of-projects-to-fund-15\"></a>Type of Projects to Fund:</h3>\n<ul>\n<li>We aim to fund projects that [description of the type of projects].</li>\n</ul>\n<h3><a name=\"estimated-number-of-eligible-grantees-16\" class=\"anchor\" href=\"https://gov.gitcoin.co#estimated-number-of-eligible-grantees-16\"></a>Estimated Number of Eligible Grantees:</h3>\n<ul>\n<li>We believe that [number] grantees will be eligible to apply for this round.</li>\n</ul>\n<h3><a name=\"impact-assessment-plan-17\" class=\"anchor\" href=\"https://gov.gitcoin.co#impact-assessment-plan-17\"></a>Impact Assessment Plan:</h3>\n<p>Describe how you intend to assess grantee impact through methods such as Hypercerts, GAP, Deresy, etc., and provide details of the plan, including how you will measure and evaluate the success and impact of the grantees over successive rounds.</p>\n<ul>\n<li>We intend to assess grantee impact through [methods such as Hypercerts, GAP, Deresy, etc.]. Our detailed plan includes [details of the plan].</li>\n</ul>\n<h3><a name=\"additional-considerations-18\" class=\"anchor\" href=\"https://gov.gitcoin.co#additional-considerations-18\"></a>Additional Considerations:</h3>\n<p>Community members should consider [any additional relevant information].</p>\n<h3><a name=\"potential-conflicts-of-interest-19\" class=\"anchor\" href=\"https://gov.gitcoin.co#potential-conflicts-of-interest-19\"></a>Potential Conflicts of Interest:</h3>\n<p>[Disclose any potential conflicts of interest].</p>\n<p>This would include if any round operations team members are part of any projects participating to receive/get a grant</p>\n            <p><small>6 posts - 5 participants</small></p>\n            <p><a href=\"https://gov.gitcoin.co/t/gg21-community-round-proposal-template/19015\">Read full topic</a></p>","link":"https://gov.gitcoin.co/t/gg21-community-round-proposal-template/19015","pubDate":"Thu, 20 Jun 2024 12:29:22 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"gov.gitcoin.co-topic-19015"},"source":{"@url":"https://gov.gitcoin.co/t/gg21-community-round-proposal-template/19015.rss","#text":"GG21 Community Round Proposal Template"}},{"title":"Grants Labs Product Strategy Review June 2024","dc:creator":"meglister","category":"🧙 🧙‍♀️ Ideas and Open Discussion","description":"<h3><a name=\"meeting-notes-grants-lab-case-and-product-strategy-1\" class=\"anchor\" href=\"https://gov.gitcoin.co#meeting-notes-grants-lab-case-and-product-strategy-1\"></a>Meeting Notes: Grants Lab CASE and Product Strategy</h3>\n<p><strong>Date:</strong> June 19 2024</p>\n<p><strong>Link to slides:</strong> <a href=\"https://docs.google.com/presentation/d/1NzUzmOkpNvpCA1vF0NrZOkXnzf3ND0hWuNb5Kx_SzoY/edit?usp=sharing\" class=\"inline-onebox\">Share_Product Strategy_061924 - Google Slides</a></p>\n<p><strong>Attendees:</strong></p>\n<ul>\n<li>Core contributors to Gitcoin</li>\n<li>Meg and <a class=\"mention\" href=\"https://gov.gitcoin.co/u/owocki\">@owocki</a> presenting</li>\n</ul>\n<p><strong>Agenda:</strong></p>\n<ol>\n<li>Review 2024 Product Strategy Introduction to CASE and its integration with the product strategy.</li>\n<li>Introduction to CASE and its integration with the product strategy.</li>\n<li>Breakout sessions for in-depth discussions.</li>\n</ol>\n<p><strong>Key Points Discussed:</strong></p>\n<ol>\n<li>\n<p><strong>Introduction and Objectives:</strong></p>\n<ul>\n<li>The meeting aimed to address the integration of CASE (Capital Allocation Strategy Exchange) into the overall product strategy, especially as Q3 approaches.</li>\n<li>Emphasis on maintaining a casual yet productive conversation with active participation from all attendees.</li>\n</ul>\n</li>\n<li>\n<p><strong>Overview of Gitcoin 2.0 and Product Strategy:</strong></p>\n<ul>\n<li>Reflection on the nascent success of Gitcoin 2.0 launched earlier in the year.</li>\n<li>Acknowledgement of the need for adjustments and improvements while maintaining core goals, such as distributing $50 million through Allo and focusing on grants = growth.</li>\n</ul>\n</li>\n<li>\n<p><strong>Key Focus Areas:</strong></p>\n<ul>\n<li><strong>Customer-Driven Innovation:</strong> Leveraging Gitcoin’s expertise in grants programs to offer customized and consultative solutions to partners.</li>\n<li><strong>Improving Grants Administration:</strong> Addressing challenges faced by grant administrators with better tooling solutions.</li>\n<li><strong>Embracing Multi-Mechanism Future:</strong> Incorporating diverse capital allocation mechanisms into the Gitcoin ecosystem to enhance product offerings.</li>\n</ul>\n</li>\n<li>\n<p><strong>Strategic Projects and Initiatives:</strong></p>\n<ul>\n<li>Examples of successful custom builds were shared.</li>\n<li>The importance of making these processes repeatable and reliable to handle multiple large deals efficiently.</li>\n</ul>\n</li>\n<li>\n<p><strong>CASE (Capital Allocation Strategy Exchange):</strong></p>\n<ul>\n<li>CASE aims to incorporate mechanisms developed by others into the Gitcoin product suite, enhancing the ecosystem’s capabilities.</li>\n<li>Development of the Allo starter kit to facilitate quick and efficient integration of new mechanisms.</li>\n<li>Publication of the “Capital Allocation Strategy Handbook” detailing over 30 potential mechanisms for future on-chain coordination.</li>\n</ul>\n</li>\n<li>\n<p><strong>Product Strategy and Future Outlook:</strong></p>\n<ul>\n<li>Projected financial goals and distribution of GMV (Gross Merchandise Value) across various mechanisms.</li>\n<li>Discussion on the anticipated pluralistic ecology of tools contributing to GMV, with no single dominant mechanism.</li>\n</ul>\n</li>\n</ol>\n<p><strong>Action Items:</strong></p>\n<ul>\n<li>Conduct breakout sessions to gather feedback and discuss the strategy in detail.</li>\n<li>Continue refining the Allo starter kit and integrate new mechanisms as part of CASE.</li>\n<li>Focus on improving customer-driven innovation and grants administration processes.</li>\n<li>Monitor and adjust the product strategy based on ongoing feedback and performance metrics.</li>\n</ul>\n<p><strong>Conclusion:</strong><br>\nThe meeting reinforced the importance of CASE in the product strategy, emphasizing customer-driven innovation and efficient grants administration. The team remains committed to achieving the set financial goals while continuously improving and adapting the product offerings.</p>\n<hr>\n<p>These notes are taken from a meeting transcript summarized by ChatGPT.</p>\n            <p><small>1 post - 1 participant</small></p>\n            <p><a href=\"https://gov.gitcoin.co/t/grants-labs-product-strategy-review-june-2024/19011\">Read full topic</a></p>","link":"https://gov.gitcoin.co/t/grants-labs-product-strategy-review-june-2024/19011","pubDate":"Wed, 19 Jun 2024 23:04:57 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"gov.gitcoin.co-topic-19011"},"source":{"@url":"https://gov.gitcoin.co/t/grants-labs-product-strategy-review-june-2024/19011.rss","#text":"Grants Labs Product Strategy Review June 2024"}},{"title":"Gitcoin Citizens Retro #4 Update","dc:creator":"krrisis","category":"📝 Citizen Grants","description":"<p>Hey Gitcoin Community!</p>\n<p>We will soon officially announce Gitcoin Citizens Retro Round <span class=\"hashtag-raw\">#4</span>, but in the meantime, we already want to share what we know and would love to get your feedback on some points.</p>\n<p>First of all, <strong>a huge thank you</strong> to all supporters of the previous 3 rounds: Citizens for their passion and contributions, donors for giving back, and everyone at Gitcoin for the continuous dialogue and funding this initiative. We learned so much over the past 3 rounds (see <a href=\"https://www.gitcoin.co/blog/citizens-round-a-case-study-retroactive-qf\">here</a>, <a href=\"https://gov.gitcoin.co/t/overall-learnings-from-gcp-004-and-gitcoin-citizens-round-2-results/17201\">here</a> and this recent <a href=\"https://miro.com/app/board/uXjVK8Zo6Ok=/?share_link_id=825112287835\">internal retro</a>), incrementally improving this initiative’s success and impact, with Round <span class=\"hashtag-raw\">#3</span> being the <a href=\"https://x.com/GitcoinCitizens/status/1780596740728430821\">most successful one to date</a>. We will continue to apply these learnings in what’s next.</p>\n<p>Now, let’s dive in.</p>\n<h2><a name=\"what-we-know-so-far-1\" class=\"anchor\" href=\"https://gov.gitcoin.co#what-we-know-so-far-1\"></a>What we know so far:</h2>\n<h3><a name=\"timing-2\" class=\"anchor\" href=\"https://gov.gitcoin.co#timing-2\"></a>Timing</h3>\n<p>Deviating from what was announced <a href=\"https://gov.gitcoin.co/t/gitcoin-grants-proposed-updates/17649\">previously</a>,  <strong>we are now planning to run Citizens Retro <span class=\"hashtag-raw\">#4</span> <a href=\"https://gov.gitcoin.co/t/gitcoin-grants-2024-strategy-outline/18991\">after GG21</a>,</strong> which will allow us to reward Citizens for work done over the two preceding rounds, increase the available funding, and focus on some internal reorganization (more on this below), which will ideally lead to more impact, both for Gitcoin and for all Citizens.</p>\n<p>We are planning to run <strong>Citizens Retro <span class=\"hashtag-raw\">#4</span> from September 24 to October 8, with applications opening up on August 27</strong>. This timing will be confirmed once we have secured the full budget.</p>\n<h3><a name=\"budget-3\" class=\"anchor\" href=\"https://gov.gitcoin.co#budget-3\"></a>Budget</h3>\n<p>We have funding available for one more round through the current GCP. However, we plan to request an additional budget to bring <strong>the total sum of matching funding to 100K GTC</strong> ($125.000 at time of writing). We are announcing this well in advance, to invite Citizens to start working today towards earning their fair share of this budget tomorrow.</p>\n<p>This is the largest amount we’ve allocated to Citizens to date, effectively doubling the matching. Our previous rounds had matching funds of 20K, 22K and 50K GTC respectively, not counting donations. Additionally, <strong>we hope to secure extra funding</strong> through external support, as we did in the past with the help of <a class=\"mention\" href=\"https://gov.gitcoin.co/u/owocki\">@owocki</a> (respectively 4.20 eth + 10K GTC in the last two rounds) and Arbitrum (who doubled our matching for Retro <span class=\"hashtag-raw\">#3</span>).</p>\n<p><strong>If you want to get to work right now, you can and should</strong>: <a href=\"https://gitcoin.notion.site/Discord-Access-Guide-for-Citizens-5a91a307428b43c6966a5466438ff9fd\">join our Discord</a>,<a href=\"https://lu.ma/calendar/cal-yYcYQVROlvvWseF\"> attend Citizen office hours</a>, <a href=\"https://gitcoin.notion.site/Gitcoin-Idea-Board-3d839ea2b299495d9e4a6268cf1e0f9e\">dive into our idea board, propose your own ideas</a>, <a href=\"https://x.com/GitcoinCitizens\">and follow us on X for inspiration</a>.</p>\n<h2><a name=\"what-we-would-love-feedback-on-4\" class=\"anchor\" href=\"https://gov.gitcoin.co#what-we-would-love-feedback-on-4\"></a>What we would love feedback on:</h2>\n<h3><a name=\"engage-builder-citizens-5\" class=\"anchor\" href=\"https://gov.gitcoin.co#engage-builder-citizens-5\"></a>Engage Builder Citizens</h3>\n<p>With the <a href=\"https://gov.gitcoin.co/t/update-gitcoin-s-ratified-essential-intents-2023-2024-and-a-recap-of-our-successes/16818\">updated essential intents</a>, the focus of the Gitcoin team is more than ever on increasing <a href=\"https://gov.gitcoin.co/t/2024-gmv-strategy-overview-grants-lab/18805\">Allo’s GMV</a>. Citizens contribute to our ‘Gross Merchandise Value’ in so many ways, as explained <a href=\"https://gov.gitcoin.co/t/gitcoin-citizens-rounds-value-generation-opportunities/18727\">here</a>. However, technical submissions have been mostly limited to (epic!) dashboards, and we want to take this a step further.</p>\n<p><strong>For our next round we would love to see more technical applications: not just submissions for standalone work, but deep integrations with Allo Protocol and Grants Stack</strong>, which we can provide support for. We would love to know: how do you think we can ensure deep integrations with Grants Lab and how can we better encourage Citizens to submit more technical work?</p>\n<p>Check out <a href=\"https://gitcoin.notion.site/Gitcoin-Idea-Board-3d839ea2b299495d9e4a6268cf1e0f9e\">some ideas already popping up</a>, and feel free to submit yours! Want to chat more? <a href=\"https://gitcoin.notion.site/Discord-Access-Guide-for-Citizens-5a91a307428b43c6966a5466438ff9fd\">Join our Discord</a> and talk to the team, or <a href=\"https://lu.ma/calendar/cal-yYcYQVROlvvWseF\">sign up for Citizen office hours</a>.</p>\n<h3><a name=\"retropgf-6\" class=\"anchor\" href=\"https://gov.gitcoin.co#retropgf-6\"></a>Retropgf</h3>\n<p>The Citizens rounds have been a place for experimentation in both format and execution <a href=\"https://gov.gitcoin.co/t/gcp-004-passed-gitcoin-citizens-round/13462\">since day 1</a>, and we plan to uphold this exciting tradition. After an entirely retroactive round, one mixed, and another retroactive one, each on a different network, <strong>we are now planning to run our next round as <a href=\"https://www.gitcoin.co/grants-stack/rpgf\">a fully retroactive funding round, with badgeholders (RetroPGF).</a></strong> We have a lot of in-house experience with <a class=\"mention\" href=\"https://gov.gitcoin.co/u/owocki\">@owocki</a>’s team, who built one of the two frontends for <a href=\"https://round3.optimism.io/projects?after=undefined&amp;display=grid&amp;sort=mostAwarded&amp;search=&amp;seed=1718378572712&amp;categories=\">Optimism RPGF Round 3</a>, and Gitcoin is now also offering this <a href=\"https://www.gitcoin.co/grants-stack/rpgf\">as a service</a>.</p>\n<p>Next to our enthusiasm about <strong>dogfooding all things Gitcoin</strong>, we also have noticed how it is very often the same limited group of warm-hearted people donating to these public greats. We want to address <strong>potential donor fatigue,</strong> and see how only working with voting could influence the results of our next round. Next to this, it will allow us to work with <strong>categories of submitted work</strong>, which will make it easier to evaluate submissions, and potentially allocate funds in a different way.</p>\n<p>Switching to RPGF will be our biggest experiment yet, and we have a lot of things to figure out by then. <strong>We feel very inspired, and would like to use this opportunity to ask for your input on organizing this round.</strong></p>\n<p>Some of the questions that have come up for us:</p>\n<ul>\n<li>Who should be the <strong>badgeholders</strong>, the voters for our round? Should it be all GG grantees? All donors? Should it only be participants of previous Citizens rounds?</li>\n<li>Should <strong>GTC holders</strong> be voters for this round, and if so, how do we set this up? Do we use simple voting, quadratic voting, conviction voting, …? Should we mix grantees and GTC holders? Or try something else?</li>\n<li>Do we keep our successful <strong><a href=\"https://gov.gitcoin.co/t/signal-boosting-for-gitcoin-citizens-retro-3/18518\">signal boosting experiment</a></strong> in the mix, and how do we make this work with badgeholders? Do they have double or quadratic voting power, versus badgeholders just having one vote?</li>\n</ul>\n<p>We have so many questions (and a few potential answers) but first of all: we want to hear your thoughts. Let us know in the comments!</p>\n<h3><a name=\"one-more-thing-7\" class=\"anchor\" href=\"https://gov.gitcoin.co#one-more-thing-7\"></a>One more thing</h3>\n<p>Lastly, <strong>I’ve decided to step down as the main round operator for the Gitcoin Citizens Retro rounds, so we are looking for someone new</strong>. It has been a true honor and a tremendous, heart-warming, inspiring pleasure to interact with our community of passionate Citizens on a daily basis. Over the  3 past rounds I continued working with the core team, building on strong foundations, after two years of running DAO Ops before this. For me, it is time to explore new horizons (<a href=\"https://gov.gitcoin.co\">dms open</a>), and for Citizens, this is an opportunity to step up! <strong>If you are interested in this role, or know someone qualified, please <a href=\"https://docs.google.com/document/u/0/d/1U6MzjkPC6Z6tfxYU6cEyoT2AATvDUwAG0-FkC8PS04g/edit\">dive in and reach out!</a></strong></p>\n<p>I’d like to specifically thank <a class=\"mention\" href=\"https://gov.gitcoin.co/u/umarkhaneth\">@umarkhaneth</a>, the instigator of the Citizens rounds, my rock and partner in crime, it truly was an honor, ser. A huge thanks also to <a class=\"mention\" href=\"https://gov.gitcoin.co/u/shawn16400\">@shawn16400</a>, with whom we ran Round <span class=\"hashtag-raw\">#1</span>, <a class=\"mention\" href=\"https://gov.gitcoin.co/u/carlosjmelgar\">@carlosjmelgar</a> for stepping up for Round <span class=\"hashtag-raw\">#2</span>, and <a class=\"mention\" href=\"https://gov.gitcoin.co/u/jon-spark-eco\">@jon-spark-eco</a> and <a class=\"mention\" href=\"https://gov.gitcoin.co/u/rohit\">@rohit</a> for their strong support and advice on Round <span class=\"hashtag-raw\">#3</span>. Through all of this, <a class=\"mention\" href=\"https://gov.gitcoin.co/u/mathildadv\">@MathildaDV</a> has always been there with her continuous insights and comms support through all the rounds, and will continue to be. Thank you Citizens, for your heart, your feedback, the gifs and giggles, and your relentless passion.</p>\n<p>We look forward to your thoughts on the round design in the comments or your role application <a href=\"https://docs.google.com/document/u/0/d/1U6MzjkPC6Z6tfxYU6cEyoT2AATvDUwAG0-FkC8PS04g/edit\">here</a>.</p>\n<p>And as always: <strong>we can’t wait to see what you’ll do next</strong>. <img src=\"https://gov.gitcoin.co/images/emoji/twitter/green_heart.png?v=12\" title=\":green_heart:\" class=\"emoji\" alt=\":green_heart:\" loading=\"lazy\" width=\"20\" height=\"20\"></p>\n            <p><small>6 posts - 5 participants</small></p>\n            <p><a href=\"https://gov.gitcoin.co/t/gitcoin-citizens-retro-4-update/19004\">Read full topic</a></p>","link":"https://gov.gitcoin.co/t/gitcoin-citizens-retro-4-update/19004","pubDate":"Tue, 18 Jun 2024 15:00:06 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"gov.gitcoin.co-topic-19004"},"source":{"@url":"https://gov.gitcoin.co/t/gitcoin-citizens-retro-4-update/19004.rss","#text":"Gitcoin Citizens Retro #4 Update"}},{"title":"GG21 Community Round Eligibility Criteria","dc:creator":"MathildaDV","category":"🌱 Gitcoin Grants","description":"<h1><a name=\"gitcoin-grants-21-community-round-eligibility-criteria-1\" class=\"anchor\" href=\"https://gov.gitcoin.co#gitcoin-grants-21-community-round-eligibility-criteria-1\"></a>Gitcoin Grants 21 Community Round Eligibility Criteria</h1>\n<p>The first iteration of the updated Gitcoin Grants Community Round process was rolled out in GG20. ICYMI, <a href=\"https://gov.gitcoin.co/t/gg20-community-round-governance-a-retrospective/18766\">read the retrospective</a>.</p>\n<p>The below eligibility criteria has been set by the elected <a href=\"https://gov.gitcoin.co/t/passed-extending-the-term-of-gg-community-council/18776\">GG Community Council</a> in partnership with Gitcoin. Applications for GG21 Community Rounds are open <strong>June 19-July 14th</strong>. The Community Council will vote on the proposals, select the top 10, and allocate matching funds to the top 5 rounds. The proposal template and fleshed out timeline will be posted a day after this post is live. If you would like to apply to GG21, please use that post as your foundation for applying.</p>\n<ul>\n<li><strong>GG21:</strong> August 7 - 21\n<ul>\n<li><em>Ecosystem ‘Spotlight’ Rounds</em>\n<ul>\n<li>Ecosystem Rounds will now have the opportunity to share the stage alongside the community rounds.</li>\n</ul>\n</li>\n<li><em>10 Community Rounds</em></li>\n<li><em>$125k allocated towards matching for top 5 Community Rounds</em></li>\n</ul>\n</li>\n</ul>\n<p><strong>UPDATE</strong>: The top 10 rounds will be accepted into the round (included in marketing efforts), and the top 5 of those will receive extra matching funds from Gitcoin.</p>\n<p><strong>NOTE:</strong> If you would like to experiment with another funding mechanism during GG21 outside of Quadratic Funding or with QF itself, you may include this in your proposal for the Gitcoin team to first review in the proposal phase. This could include: Direct Grants, Conviction Voting, MACI QF, <a href=\"https://medium.com/token-engineering-commons/expertise-and-quadratic-funding-bd4f0c5c3e23\">Tunable QF</a>. For Grants Stack resources and more information, please visit the <a href=\"https://www.notion.so/gitcoin/Grants-Stack-Resources-ad7e4685d4154aecb4a488852a6102cf?pvs=4\">Grants Stack Resource Hub</a>. <strong>All proposed mechanisms must run on top of Allo Protocol.</strong> <em>Note that the GG21 Ecosystem Rounds will be Quadratic Funding.</em></p>\n<h2><a name=\"eligibility-criteria-for-community-rounds-2\" class=\"anchor\" href=\"https://gov.gitcoin.co#eligibility-criteria-for-community-rounds-2\"></a>Eligibility Criteria for Community Rounds</h2>\n<h4><a name=\"tldr-how-to-get-a-community-round-approved-3\" class=\"anchor\" href=\"https://gov.gitcoin.co#tldr-how-to-get-a-community-round-approved-3\"></a>TLDR: How to get a Community Round Approved</h4>\n<ol>\n<li>Identify the Round Operator and at least two other partner team members who will be reviewers and/or be involved in managing the round.</li>\n<li>Every round must raise their own matching pool (no minimum)</li>\n<li>The round should align with <a href=\"https://gov.gitcoin.co/t/update-gitcoins-adopted-mission-and-vision-statements/15039\">Gitcoin’s Mission and Essential Intents </a></li>\n<li>All rounds must comply with <a href=\"https://support.gitcoin.co/gitcoin-knowledge-base/about-gitcoin/code-of-conduct\">Gitcoin’s core rules,</a> which include no fraudulent activity, <a href=\"https://support.gitcoin.co/gitcoin-knowledge-base/gitcoin-grants/general-questions/what-is-our-quid-pro-quo-policy\">no quid pro quo</a>, hate speech, or other activities out of alignment with Gitcoin’s essential intents.</li>\n<li>Rounds run on Arbitrum or OP for a seamless donor experience, and is our preferred method for our OSS Program. Arbitrum will be strongly encouraged. <em>If you’d like to run on another chain, please specify the reasoning behind it and our team will review.</em></li>\n<li>Show proof of funds in a multisig (similar to how anyone can view the funds in Gitcoin’s multisig)</li>\n</ol>\n<ul>\n<li>We highly recommend that proof of matching funds and any further plans for funds raised by communities be provided by the time applications are in review. This will help council members review applications more easily.</li>\n</ul>\n<h4><a name=\"before-the-round-4\" class=\"anchor\" href=\"https://gov.gitcoin.co#before-the-round-4\"></a>Before the Round</h4>\n<p>The time leading up to the round requires an intentional blitz and dedicated owners who can drive the responsibilities below forward.</p>\n<p>For smaller first-time rounds, all these may fall on the Round Operator if the Round Operator is operating in a near full-time capacity. On top of using Gitcoin’s AI <a href=\"https://gov.gitcoin.co/t/introducing-checker/17292\">Checker</a> tool for application reviews, we recommend building out a small team to assist the Round Operator as well as a small group of stakeholders from the community to be an Advisory Team of committed people to help generate ideas, gather feedback and provide support throughout the round.</p>\n<h4><a name=\"round-eligibility-document-5\" class=\"anchor\" href=\"https://gov.gitcoin.co#round-eligibility-document-5\"></a>Round Eligibility Document</h4>\n<p>A Round Owner should create an eligibility criteria doc for what projects qualify for acceptance.</p>\n<p>While this can evolve if needed, the first version should be created before going out and fundraising and recruiting grantees so that it is clear to parties <a href=\"https://roundoperations.gitcoin.co/round-operations/eligibility-and-review/eligibility-process\">what is eligible &amp; what isn’t for the round.</a></p>\n<p>The first-order mission-critical areas include:</p>\n<ul>\n<li>Allocating or otherwise raising funds for the matching pool</li>\n<li>Grantee recruitment &amp; onboarding - (Runbooks will be made available with guidance for this process on the new Gitcoin Grants Stack tools)</li>\n</ul>\n<p>Other Considerations</p>\n<ul>\n<li>When selecting a round owner, it is recommended (if possible) to have someone on the team that has previously run a Gitcoin round or participated in one in the past, or has experience in grants management/operations.</li>\n</ul>\n<h4><a name=\"during-the-round-6\" class=\"anchor\" href=\"https://gov.gitcoin.co#during-the-round-6\"></a>During the Round</h4>\n<p>Responsibilities include:</p>\n<ul>\n<li>Marketing the Round</li>\n<li>Undergoing KYC if receiving matching funds from Gitcoin.</li>\n<li>Supporting Grantees and Donors in partnership with the Gitcoin Core Team.</li>\n</ul>\n<h4><a name=\"after-the-round-7\" class=\"anchor\" href=\"https://gov.gitcoin.co#after-the-round-7\"></a>After the Round</h4>\n<p>Responsibilities include:</p>\n<ul>\n<li>Overseeing the payouts and KYC process (if required for your round) to ensure smooth facilitation and address questions or issues.\n<ul>\n<li>Conducting a retrospective of the round to assess what worked and what can be improved and sharing feedback as appropriate with Gitcoin.</li>\n</ul>\n</li>\n<li>Matching funds must be released within 4 weeks of the round ending, barring any unforeseen delays. If not, will not be eligible for further matching or participation in GG rounds.\n<ul>\n<li>All payouts to be conducted via Grants Stack, and not manually. This is non-negotiable.</li>\n<li>If using alternative mechanisms, those must run on top of Allo.</li>\n</ul>\n</li>\n<li>Ongoing support and communications with Grantees are often required as the round concludes.</li>\n</ul>\n<p><strong>REMINDER</strong>: This is the minimum for a viable round. <a href=\"https://roundoperations.gitcoin.co/round-operations\">The runbook provided to Round Operators</a> includes much more information about how to run the best possible round.</p>\n<h2><a name=\"community-round-partner-offerings-gg21-8\" class=\"anchor\" href=\"https://gov.gitcoin.co#community-round-partner-offerings-gg21-8\"></a>Community Round Partner Offerings - GG21</h2>\n<h4><a name=\"gitcoins-agreements-9\" class=\"anchor\" href=\"https://gov.gitcoin.co#gitcoins-agreements-9\"></a>Gitcoin’s Agreements:</h4>\n<ul>\n<li><strong>Gitcoin Marketing Support:</strong> Includes the following:\n<ul>\n<li>Round highlighted on our grants website</li>\n<li>Round highlighted in our announcement post</li>\n<li>All open shill spaces are open to the spotlight round &amp; community rounds</li>\n<li>Partner logos on the main funder banner grants website &amp; shared in all Gitcoin Grants Round emails</li>\n<li>Each community round will have access to Gitcoin’s marketing assets to use for their own round marketing and grantee communications.</li>\n<li>Gitcoin will amplify GG21-related posts.</li>\n<li>Each partner will receive a marketing best practices handbook and any resources needed to run their round successfully.</li>\n</ul>\n</li>\n<li><strong>Responsive Grant Ops Support:</strong> Our dedicated Grant Ops team is available for general questions and support.\n<ul>\n<li>A dedicated support group with selected round operators will be set up</li>\n</ul>\n</li>\n</ul>\n<h4><a name=\"partners-agreements-10\" class=\"anchor\" href=\"https://gov.gitcoin.co#partners-agreements-10\"></a>Partner’s Agreements:</h4>\n<p>These are non-negotiable.</p>\n<ul>\n<li>Publish a fleshed-out proposal on the gov forum\n<ul>\n<li>The elected GG Community Council votes on the proposals, selects the top 10, and allocates matching funds to the top 5 rounds</li>\n</ul>\n</li>\n<li>Meet all eligibility criteria for running a Community Round</li>\n<li>Round donation and application periods to align with GG21 dates set by Gitcoin</li>\n<li>Be responsible for outlining your round’s eligibility criteria</li>\n<li>Owning marketing and grantee &amp; donor support of your round</li>\n<li>A post-round retrospective report released within 30 days after closure of GG</li>\n<li>Complete security training with Gitcoin’s security consultant</li>\n<li>All payouts to be conducted via Allo, and not manually.</li>\n<li>All GG rounds to use Passport’s Model Based Detection in conjunction with COCM for sybil resistance</li>\n<li>Round Operators agree to use Gitcoin’s “Checker” tool and provide clear feedback to all applicants with a short rationale on their approval/rejection.</li>\n</ul>\n<h2><a name=\"resources-11\" class=\"anchor\" href=\"https://gov.gitcoin.co#resources-11\"></a>Resources</h2>\n<ul>\n<li><a href=\"https://gov.gitcoin.co/t/opencivics-consortium-round-02-insights-learnings/18879\">Example of a strong Community Round retrospective</a></li>\n<li><a href=\"https://gov.gitcoin.co/t/token-engineering-qf-grants-round-spring-2024-gg20-round-retro/18978\">Another example of a strong Community Round retrospective</a></li>\n<li><a href=\"https://docs.google.com/document/d/1eAF-AjljTXaUS3hQOKxom7nNLrp6916cK4NtIaQV8co/edit?usp=sharing\">Retrospective template</a></li>\n</ul>\n            <p><small>3 posts - 2 participants</small></p>\n            <p><a href=\"https://gov.gitcoin.co/t/gg21-community-round-eligibility-criteria/19003\">Read full topic</a></p>","link":"https://gov.gitcoin.co/t/gg21-community-round-eligibility-criteria/19003","pubDate":"Tue, 18 Jun 2024 12:14:55 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"gov.gitcoin.co-topic-19003"},"source":{"@url":"https://gov.gitcoin.co/t/gg21-community-round-eligibility-criteria/19003.rss","#text":"GG21 Community Round Eligibility Criteria"}},{"title":"Grants Lab Monthly Meeting - June 2024","dc:creator":"meglister","category":"🧙 🧙‍♀️ Ideas and Open Discussion","description":"<p>At the start of each month, the Grants Lab team has an hour-long meeting that primarily focuses on strategy and progress against our goals. This month, we focused on our financial position as well as how we’re pacing against our Q2 goals. I’m linking the presentation here, as well as including an AI-assisted summary of the notes for anyone interested!</p>\n<p>Link: <a href=\"https://docs.google.com/presentation/d/1KY6mCdjPCoKtCKwtiC5rUPmBYxSDWUFW3EBc_CwE7qo/edit?usp=sharing\" class=\"inline-onebox\">Grants Lab Monthly_June24_GovForum - Google Slides</a></p>\n<h4><a name=\"key-updates-1\" class=\"anchor\" href=\"https://gov.gitcoin.co#key-updates-1\"></a>Key Updates</h4>\n<ol>\n<li><strong>Hiring Update</strong></li>\n</ol>\n<ul>\n<li>No new hires are currently planned. We have filled some key leadership roles within Grants Lab and aspire to be a lean, agile team.</li>\n<li>Recent key hires include Jehana leading marketing, Henry on Dev Rel, Dan leading Sales, Huss as Sr FS Eng, and a new head of product who starts on July 1st.</li>\n</ul>\n<ol start=\"2\">\n<li><strong>Educational Initiatives</strong></li>\n</ol>\n<ul>\n<li>Sejal and Lau NaMu reviewed learnings from the Easy RPGF pilot program, which ran over the previous 3 months and resulted in $2M in GMV.</li>\n<li>We are learning that there are many similar needs and tooling opportunities across funding mechanisms.</li>\n<li>Additionally, Sejal and team are leading an educational session on EZ RPGF, aiming for 100% participation from team members.</li>\n</ul>\n<ol start=\"3\">\n<li><strong>Sales and Financial Pipeline</strong></li>\n</ol>\n<ul>\n<li>Daniel Schuman provided a detailed update on the sales pipeline:\n<ul>\n<li>A total of $17.83 million in weighted GMV, with $13.689 million related to Grants Lab.</li>\n<li>Ongoing discussions with potential clients + significant opportunities on the horizon.</li>\n</ul>\n</li>\n<li>Financial health remains strong, with the treasury benefiting from upward GTC price movement and diversification into USDC.</li>\n</ul>\n<ol start=\"4\">\n<li><strong>Challenges and Opportunities</strong></li>\n</ol>\n<ul>\n<li>Recognized challenges include ensuring cohesion between Grants Lab and other teams, and updating outdated apps.</li>\n<li>Emphasized that we’re solving operational problems rather than existential ones, with a focus on leveraging market opportunities in grants.</li>\n</ul>\n<ol start=\"5\">\n<li><strong>Future Goals</strong></li>\n</ol>\n<ul>\n<li>Upcoming budget cycle will not request additional funds due to a healthy treasury.</li>\n<li>Continued focus on pipeline development and client acquisition.</li>\n</ul>\n<ol start=\"6\">\n<li><strong>Meeting Conclusion</strong></li>\n</ol>\n<ul>\n<li>Financial review and further pipeline updates were shared, emphasizing the positive trends and future opportunities.</li>\n</ul>\n            <p><small>1 post - 1 participant</small></p>\n            <p><a href=\"https://gov.gitcoin.co/t/grants-lab-monthly-meeting-june-2024/18998\">Read full topic</a></p>","link":"https://gov.gitcoin.co/t/grants-lab-monthly-meeting-june-2024/18998","pubDate":"Sun, 16 Jun 2024 22:21:42 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"gov.gitcoin.co-topic-18998"},"source":{"@url":"https://gov.gitcoin.co/t/grants-lab-monthly-meeting-june-2024/18998.rss","#text":"Grants Lab Monthly Meeting - June 2024"}},{"title":"Gitcoin Grants 2024 Strategy Outline","dc:creator":"MathildaDV","category":"🌱 Gitcoin Grants","description":"<h1><a name=\"gg-2024-strategy-outline-1\" class=\"anchor\" href=\"https://gov.gitcoin.co#gg-2024-strategy-outline-1\"></a>GG 2024 Strategy Outline</h1>\n<p>Gitcoin Grants is a community-driven quarterly funding initiative that aims to propel high-impact digital public goods projects forward by allocating capital in the Ethereum community. <strong><em>Grants = Growth.</em></strong></p>\n<p>As we embark on the journey of Gitcoin Grants for the remainder of 2024, we’re excited to share our comprehensive strategy designed to support impactful projects, and strengthen our community. This year’s approach builds upon the valuable insights gained from previous rounds, ensuring that we continue to evolve and improve and serve the community’s best interests.</p>\n<p>Our strategy for Gitcoin Grants across the remainder of 2024 centers on three core pillars:</p>\n<ul>\n<li>Inclusivity: Broaden participation by reaching diverse communities and supporting various projects across different sectors</li>\n<li>Transparency: Clear communication and open processes to maintain trust and engagement</li>\n<li>Sustainability: Ensuring long-term growth and impact through strategic funding and resource allocation</li>\n</ul>\n<p>Thank you to <a class=\"mention\" href=\"https://gov.gitcoin.co/u/sov\">@sov</a>, <a class=\"mention\" href=\"https://gov.gitcoin.co/u/umarkhaneth\">@umarkhaneth</a> and <a class=\"mention\" href=\"https://gov.gitcoin.co/u/sejalrekhan\">@sejalrekhan</a> for your thought partnership in baking out this strategy for 2024 and beyond.</p>\n<h2><a name=\"overall-strategy-2\" class=\"anchor\" href=\"https://gov.gitcoin.co#overall-strategy-2\"></a><strong>Overall Strategy</strong></h2>\n<h3><a name=\"oss-program-3\" class=\"anchor\" href=\"https://gov.gitcoin.co#oss-program-3\"></a>OSS Program</h3>\n<p>Since its inception, Gitcoin Grants has been committed to furthering the ethos of OSS/Digital Public Goods while fostering project growth and sustainability through novel funding mechanisms. GG supports both early-stage and more mature builders across the wider Ethereum ecosystem and  is run by Gitcoin core contributors. <strong><em>These rounds run twice annually.</em></strong></p>\n<p>With Gitcoin Grants 20, we refocused on our core mission of supporting open-source software and digital public goods and started on a journey to redefine how we continually fund and sustain the digital infrastructure that underpins our modern world.</p>\n<p><em>You have our commitment that we will work tirelessly to continue to create a more resilient, inclusive, and thriving future.</em></p>\n<h3><a name=\"community-rounds-4\" class=\"anchor\" href=\"https://gov.gitcoin.co#community-rounds-4\"></a>Community Rounds</h3>\n<p>GG20 was the first iteration of a new Community Round structure: we created a dedicated pool of funds (up to $125K quarterly) available to support “matching on matching” pools and highlighting them alongside the Program rounds. Communities with any amount raised for matching and meeting the round criteria could apply for up to $25K in funding from Gitcoin to go toward their matching pool. The Community Council (a Gitcoin DAO-elected external council) reviews applications and votes on which communities to fund and accept into the round. Read the<a href=\"https://www.google.com/url?q=https://gov.gitcoin.co/t/gg20-community-round-governance-a-retrospective/18766&amp;sa=D&amp;source=docs&amp;ust=1718383498824988&amp;usg=AOvVaw2ne5ZmxUXj80j1evwgJyN-\"> GG20 Community Round Retrospective</a> for learnings and new ways forward.<br>\nICYMI, the external Community Council’s term was extended until the end of this year, continuing their engagement with us, which allows us to iterate and improve the governance structures around the Community Rounds as we continue to move forward.</p>\n<p>The Community Council governs the Community Rounds that are accepted into a GG round, distributing decision-making to the edges and away from a centralized mechanism within Gitcoin.</p>\n<p>We will offer an updated support for Community Rounds, ensuring that we still uphold the standards that are important to Gitcoin, yet remaining inclusive to those wishing to participate in GG rounds. <em>We will accept 8-10 Community Rounds (this depends on the type of round we’re running and the resources we have available) in each GG round moving forward, with the top 5 of those still receiving extra matching funds from Gitcoin.</em></p>\n<p>The eligibility criteria for GG21 Community Rounds will be posted to the forum <strong>June 17.</strong></p>\n<h2><a name=\"key-dates-for-2024-5\" class=\"anchor\" href=\"https://gov.gitcoin.co#key-dates-for-2024-5\"></a><strong>Key Dates for 2024</strong></h2>\n<p>To help you plan and participate effectively, here are the important dates for the rest of the year. Note that due to time constraints, we will only run three GG rounds in 2024:</p>\n<ul>\n<li><strong>GG20:</strong> April 23 - May 7th [COMPLETED]\n<ul>\n<li><em>OSS Program (4 rounds) $1M Matching Pool</em></li>\n<li><em>5+ Community Rounds</em></li>\n</ul>\n</li>\n<li><strong>GG21:</strong> August 7 - 21\n<ul>\n<li><em>Ecosystem ‘Spotlight’ Rounds</em>\n<ul>\n<li>Ecosystem Rounds will now have the opportunity to share the stage alongside the community rounds.</li>\n</ul>\n</li>\n<li><em>10 Community Rounds</em></li>\n<li><em>$125k allocated towards matching for top 5 Community Rounds</em></li>\n</ul>\n</li>\n<li><strong>GG22:</strong> End of October (exact dates announced in the coming weeks)\n<ul>\n<li><em>OSS Program (4 rounds) $1M Matching Pool</em></li>\n<li><em>8 Community Rounds</em>\n<ul>\n<li><em>During OSS rounds, our internal resources will likely be more constrained and due to this, we will only be able to support 8. (Subject to change).</em></li>\n</ul>\n</li>\n<li><em>$125k allocated towards matching for top 5 Community Rounds</em></li>\n</ul>\n</li>\n</ul>\n<p><strong>One key difference</strong> to note is that our OSS Program will only run again in GG22, sticking to the twice annual  cadence that was first <a href=\"https://gov.gitcoin.co/t/gitcoin-grants-proposed-updates/17649\">announced and outlined in this post</a>. Because the Gitcoin Grants matching pool are funds that were entrusted to us by the community (separate from our treasury), it’s important that we run a program that is sustainable for the long term, which will create a runway for our builders well into the future beyond the next few years. To fund what matters to us, we realize we have to take steps to ensure financial sustainability, but still serve our community and builders in a foundational way.  Additionally, as Gitcoin grows its presence and product stack to the wider Web3 Ecosystem we want to allow these groups to be able to run during GG.</p>\n<h2><a name=\"learnings-from-past-rounds-6\" class=\"anchor\" href=\"https://gov.gitcoin.co#learnings-from-past-rounds-6\"></a><strong>Learnings from Past Rounds</strong></h2>\n<p>Reflecting on past rounds, we’ve gleaned several critical learnings that have shaped our 2024 strategy:</p>\n<ol>\n<li><strong>Enhanced Matching Algorithms:</strong> We’ve improved our Quadratic Funding algorithms to better match contributions with projects, ensuring a more equitable distribution of funds. This has been done through the use of <a href=\"https://www.google.com/url?q=https://gov.gitcoin.co/t/nerd-post-updates-to-cluster-mapping-matching/18705&amp;sa=D&amp;source=docs&amp;ust=1718383498828793&amp;usg=AOvVaw3zm5wpN0R4XtOjQ6nZhIGs\">COCM</a> and Passport’s Model Based Detection: a <a href=\"https://gov.gitcoin.co/t/our-sybil-resistance-strategy-for-gg20/18524\">two-pronged sybil resistance strategy</a> that we rolled out in GG20, which proved to be incredibly successful.</li>\n<li><strong>Community Feedback:</strong> Incorporating feedback from participants has been invaluable. We’ve streamlined the application process and introduced more robust support systems to assist grantees. GG20 saw an 80% grantee satisfaction rate, the highest we’ve seen in at least the past year. <em>This was measured through a GG20 grantee survey conducted, where we received more than 70 detailed responses.</em></li>\n<li><strong>Operations:</strong> We saw the need for improving our operations for an enhanced user experience, and in GG20 we introduced Checker and ‘Team Tiger’ which helped expedite grantee applications reviews.<br>\nBy integrating these learnings, we aim to create a more effective and rewarding experience for everyone involved.</li>\n</ol>\n<h2><a name=\"new-updates-7\" class=\"anchor\" href=\"https://gov.gitcoin.co#new-updates-7\"></a><strong>New Updates</strong></h2>\n<p>We plan to release dates of GG rounds further in advance than we have historically. This will allow Community Rounds and grantees to prepare for the rounds ahead of time adequately, and will enable us to better plan internally. Within the following weeks, we will release a 12-18 month roadmap for GG that will flow over into rough dates for next year. From 2025 onwards, we will return to <strong>4 rounds per year.</strong></p>\n<p>Builder engagement in between GG rounds is top of mind for the Gitcoin team, and we are proactively working on how to set up stronger 1) support systems 2) education funnels 3) active community spaces 4) builder care that fosters innovation and collaboration not only during a GG round but also during the periods outside of the rounds. <strong>No one knows what developers need more than developers.</strong></p>\n<p>We are exploring ways to introduce new funding mechanisms into the grants program. This could include ways to adapt our QF mechanism even more, such as introducing MACI, <a href=\"https://gov.gitcoin.co/t/signal-boosting-for-gitcoin-citizens-retro-3/18518\">continuing signal boosting</a>, <a href=\"https://easyretropgf.xyz/\">easyRPGF</a>, and more. <em>More about how this might unfold is coming soon.</em></p>\n<p>Stay tuned for more updates and get ready to contribute to the future of open-source innovation with Gitcoin Grants 2024!</p>\n            <p><small>5 posts - 5 participants</small></p>\n            <p><a href=\"https://gov.gitcoin.co/t/gitcoin-grants-2024-strategy-outline/18991\">Read full topic</a></p>","link":"https://gov.gitcoin.co/t/gitcoin-grants-2024-strategy-outline/18991","pubDate":"Fri, 14 Jun 2024 16:26:47 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"gov.gitcoin.co-topic-18991"},"source":{"@url":"https://gov.gitcoin.co/t/gitcoin-grants-2024-strategy-outline/18991.rss","#text":"Gitcoin Grants 2024 Strategy Outline"}},{"title":"DAO Financial Report - May 2024","dc:creator":"Sor03","category":"🧙 🧙‍♀️ Ideas and Open Discussion","description":"<p><strong>Summary</strong></p>\n<p>In the past month, operational expenses amounted to $633,758, marking a decrease of $109,585 compared to the previous month. This decrease underscores our steadfast dedication to financial prudence.</p>\n<p>As of May 2024, the current value of the DAO treasury is $67,109,851, reflecting an upsurge from the previous period. This increase is chiefly due to the rise in the price of the GTC token, which has surged by 39.56% since the last report.</p>\n<p>This report provides a thorough examination of our financial performance throughout May 2024, highlighting essential metrics and budgetary analysis.</p>\n<h2><a name=\"overviewhttpsdunecomumarkhanethgitcoin-treasury-1\" class=\"anchor\" href=\"https://gov.gitcoin.co#overviewhttpsdunecomumarkhanethgitcoin-treasury-1\"></a><a href=\"https://dune.com/umarkhaneth/gitcoin-treasury\" rel=\"noopener nofollow ugc\">Overview</a></h2>\n<ul>\n<li><strong>Last Month’s Treasury Holdings</strong>: $49,251,125</li>\n<li><strong>Current Month Treasury Holdings</strong>: $67,109,851</li>\n<li><strong>Variance</strong> ($17,858,726, 36.26%): Mainly influenced by the fluctuating price of the token, which saw an upturn last month, and compounded by the effect of our monthly operating expenses across all workstreams, amounting to $633,758.</li>\n</ul>\n<h2><a name=\"runway-2\" class=\"anchor\" href=\"https://gov.gitcoin.co#runway-2\"></a>Runway</h2>\n<p>The surge in the value of our treasury’s GTC holdings, largely influenced by GTC’s performance, has affected our Runway. At present, our Runway is projected to be 96 months (8 years), considering an estimated expenditure of $700,000 across the Business Units and the Ecosystem Collective.</p>\n<p>The total GTC held within the DAO stands at $57,295,244, with each token averaging a value of $1.77.</p>\n<p>Currently, our reliance on GTC is at 85.38%, underscoring the substantial impact of this token’s performance on our treasury. To mitigate associated risks and ensure financial resilience amid market fluctuations, it is crucial to diligently monitor and explore strategies for diversifying our treasury holdings.</p>\n<p>Last Month’s Expenditure: Our spending for the prior month amounted to $633,758, showcasing a praiseworthy decrease of 14.74% (equivalent to $109,585) from our expenditure of $743,343 the month before. This disciplined adherence to the budget highlights our unwavering dedication to efficient resource allocation.</p>\n<p>May*</p>\n<p></p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://gov.gitcoin.co/uploads/db4391/original/2X/8/8b72f6758b9a1401c598425a7ef44be08abdbb1e.png\" data-download-href=\"https://gov.gitcoin.co/uploads/db4391/8b72f6758b9a1401c598425a7ef44be08abdbb1e\" title=\"Chart\"><img src=\"https://gov.gitcoin.co/uploads/db4391/optimized/2X/8/8b72f6758b9a1401c598425a7ef44be08abdbb1e_2_288x244.png\" alt=\"\" title=\"Chart\" data-base62-sha1=\"jTCFQlr5o78p6Ymol5L6Lj0I9oG\" width=\"288\" height=\"244\" role=\"presentation\" srcset=\"https://gov.gitcoin.co/uploads/db4391/optimized/2X/8/8b72f6758b9a1401c598425a7ef44be08abdbb1e_2_288x244.png, https://gov.gitcoin.co/uploads/db4391/optimized/2X/8/8b72f6758b9a1401c598425a7ef44be08abdbb1e_2_432x366.png 1.5x, https://gov.gitcoin.co/uploads/db4391/optimized/2X/8/8b72f6758b9a1401c598425a7ef44be08abdbb1e_2_576x488.png 2x\" data-dominant-color=\"F3C2B8\"></a></div><p></p>\n<ul>\n<li>Figures ran on June 4 2024</li>\n</ul>\n<p>April*</p>\n<p></p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://gov.gitcoin.co/uploads/db4391/original/2X/6/65f64b7a3a97250f714c50c5f9ff9fb38f699be4.png\" data-download-href=\"https://gov.gitcoin.co/uploads/db4391/65f64b7a3a97250f714c50c5f9ff9fb38f699be4\" title=\"Chart\"><img src=\"https://gov.gitcoin.co/uploads/db4391/optimized/2X/6/65f64b7a3a97250f714c50c5f9ff9fb38f699be4_2_288x244.png\" alt=\"\" title=\"Chart\" data-base62-sha1=\"exZUlhHCH4zQ4FTyklEhDfW3VWc\" width=\"288\" height=\"244\" role=\"presentation\" srcset=\"https://gov.gitcoin.co/uploads/db4391/optimized/2X/6/65f64b7a3a97250f714c50c5f9ff9fb38f699be4_2_288x244.png, https://gov.gitcoin.co/uploads/db4391/optimized/2X/6/65f64b7a3a97250f714c50c5f9ff9fb38f699be4_2_432x366.png 1.5x, https://gov.gitcoin.co/uploads/db4391/optimized/2X/6/65f64b7a3a97250f714c50c5f9ff9fb38f699be4_2_576x488.png 2x\" data-dominant-color=\"F1C3BA\"></a></div><p></p>\n<ul>\n<li>Figures ran on May 6 2024</li>\n</ul>\n<h3><a name=\"token-spend-in-may-3\" class=\"anchor\" href=\"https://gov.gitcoin.co#token-spend-in-may-3\"></a>Token spend in May</h3>\n<p>During May, our total expenditure in USD reached $633,758. This breakdown comprises $568,220 in USDC, 29,382 GTC valued at $37,772 and $27,766 in USDC on Rain.</p>\n<h2><a name=\"key-financial-insights-may-4\" class=\"anchor\" href=\"https://gov.gitcoin.co#key-financial-insights-may-4\"></a>Key Financial Insights May</h2>\n<h3><a name=\"total-contributor-costs-5\" class=\"anchor\" href=\"https://gov.gitcoin.co#total-contributor-costs-5\"></a>Total Contributor Costs</h3>\n<ul>\n<li>The total expenses associated with contributors, encompassing both full-time team members and part-time support (including headcount and external consultants), stand at $551,135. This marks a decrease of $81,953, representing a reduction of 12.94% from last month.</li>\n</ul>\n<h3><a name=\"other-notable-operating-expenses-6\" class=\"anchor\" href=\"https://gov.gitcoin.co#other-notable-operating-expenses-6\"></a>Other Notable Operating Expenses</h3>\n<ul>\n<li>Software &amp; Subscriptions: $64,865. The primary driver behind this expense was the annual payment for Hubspot ($34,008).</li>\n<li>Travel, Lodging, and Meals: $186. However, it is noteworthy that the workstreams received reimbursement from the CSDO for the Lisbon Off-site, entitled to $49,917, reflecting the team’s expenditure, exclusive of the amount provided by the Foundation.</li>\n<li>General and Administrative: $17,571, encompassing certain payments related to marketing expenses.</li>\n</ul>\n<p>This breakdown underscores our commitment to prudent and efficient spending, resulting in significant savings across various expense categories.</p>\n<h2><a name=\"summary-7\" class=\"anchor\" href=\"https://gov.gitcoin.co#summary-7\"></a>Summary</h2>\n<p></p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://gov.gitcoin.co/uploads/db4391/original/2X/3/36c1329b5e6569b746960f9e25f6f41fe5a8d5c4.png\" data-download-href=\"https://gov.gitcoin.co/uploads/db4391/36c1329b5e6569b746960f9e25f6f41fe5a8d5c4\" title=\"Chart\"><img src=\"https://gov.gitcoin.co/uploads/db4391/optimized/2X/3/36c1329b5e6569b746960f9e25f6f41fe5a8d5c4_2_549x339.png\" alt=\"\" title=\"Chart\" data-base62-sha1=\"7OnHRKAvxSP4f15RxccKtFGhcTa\" width=\"549\" height=\"339\" role=\"presentation\" srcset=\"https://gov.gitcoin.co/uploads/db4391/optimized/2X/3/36c1329b5e6569b746960f9e25f6f41fe5a8d5c4_2_549x339.png, https://gov.gitcoin.co/uploads/db4391/optimized/2X/3/36c1329b5e6569b746960f9e25f6f41fe5a8d5c4_2_823x508.png 1.5x, https://gov.gitcoin.co/uploads/db4391/optimized/2X/3/36c1329b5e6569b746960f9e25f6f41fe5a8d5c4_2_1098x678.png 2x\" data-dominant-color=\"CFCBE6\"></a></div><p></p>\n<ul>\n<li>May’s budget does not include any allocation for Grant Lab, as it does not have a budget for this month.</li>\n</ul>\n<h2><a name=\"monthly-breakdown-8\" class=\"anchor\" href=\"https://gov.gitcoin.co#monthly-breakdown-8\"></a>Monthly Breakdown</h2>\n<h3><a name=\"may-9\" class=\"anchor\" href=\"https://gov.gitcoin.co#may-9\"></a>May</h3>\n<div class=\"md-table\">\n<table>\n<thead>\n<tr>\n<th></th>\n<th>Actuals</th>\n<th>Actuals</th>\n<th>Variance</th>\n<th>% Difference</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>Headcount</td>\n<td>$513,779</td>\n<td>$564,744</td>\n<td>-$50,965</td>\n<td>-9.02%</td>\n</tr>\n<tr>\n<td>Other Consultants</td>\n<td>$37,356</td>\n<td>$68,344</td>\n<td>-$30,988</td>\n<td>-45.34%</td>\n</tr>\n<tr>\n<td>Software &amp; Subscriptions</td>\n<td>$64,865</td>\n<td>$26,464</td>\n<td>$38,402</td>\n<td>145.11%</td>\n</tr>\n<tr>\n<td>Travel, Lodging and Meals</td>\n<td>$186</td>\n<td>$11,124</td>\n<td>-$10,938</td>\n<td>-98.32%</td>\n</tr>\n<tr>\n<td>General and Administrative</td>\n<td>$162</td>\n<td>$1,330</td>\n<td>-$1,167</td>\n<td>-87.78%</td>\n</tr>\n<tr>\n<td>Miscellaneous</td>\n<td>$17,409</td>\n<td>$71,337</td>\n<td>-$53,929</td>\n<td>-75.60%</td>\n</tr>\n</tbody>\n</table>\n</div><ul>\n<li>Subscription increases represent the annual fee for Hubspot.</li>\n</ul>\n<p><strong>Breakdown by business unit / workstream:</strong></p>\n<p>The <strong>Ecosystem Collective</strong> demonstrated exceptional financial efficiency by operating substantially below budget, with expenses totaling only $190,743, well below the allocated budget of $260,013. Despite significant expenditures throughout the month, the Ecosystem Collective effectively managed to conclude May with considerable breathing space within budget constraints.</p>\n<p></p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://gov.gitcoin.co/uploads/db4391/original/2X/e/e7f5f0cc770f69c12805c14c781295675cd0eeba.png\" data-download-href=\"https://gov.gitcoin.co/uploads/db4391/e7f5f0cc770f69c12805c14c781295675cd0eeba\" title=\"Chart\"><img src=\"https://gov.gitcoin.co/uploads/db4391/optimized/2X/e/e7f5f0cc770f69c12805c14c781295675cd0eeba_2_336x208.png\" alt=\"\" title=\"Chart\" data-base62-sha1=\"x61dHBELA5wO9AH1ZmGKoyILmCC\" width=\"336\" height=\"208\" role=\"presentation\" srcset=\"https://gov.gitcoin.co/uploads/db4391/optimized/2X/e/e7f5f0cc770f69c12805c14c781295675cd0eeba_2_336x208.png, https://gov.gitcoin.co/uploads/db4391/optimized/2X/e/e7f5f0cc770f69c12805c14c781295675cd0eeba_2_504x312.png 1.5x, https://gov.gitcoin.co/uploads/db4391/optimized/2X/e/e7f5f0cc770f69c12805c14c781295675cd0eeba_2_672x416.png 2x\" data-dominant-color=\"DDDDED\"></a></div><p></p>\n<ul>\n<li>January and February represent MMM workstream performance.</li>\n</ul>\n<p>In the <strong>Grants Lab</strong> business unit, expenses amounted to $235,473. May’s financial overview demonstrates a notable decrease in total expenditure compared to the previous month, despite the lack of a formal budget.</p>\n<p></p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://gov.gitcoin.co/uploads/db4391/original/2X/b/be48f2e3e68725115653e4435c2559a2fefb61cd.png\" data-download-href=\"https://gov.gitcoin.co/uploads/db4391/be48f2e3e68725115653e4435c2559a2fefb61cd\" title=\"Chart\"><img src=\"https://gov.gitcoin.co/uploads/db4391/optimized/2X/b/be48f2e3e68725115653e4435c2559a2fefb61cd_2_336x208.png\" alt=\"\" title=\"Chart\" data-base62-sha1=\"r9l0I09v7SPvDSvqiGnfZzs356Z\" width=\"336\" height=\"208\" role=\"presentation\" srcset=\"https://gov.gitcoin.co/uploads/db4391/optimized/2X/b/be48f2e3e68725115653e4435c2559a2fefb61cd_2_336x208.png, https://gov.gitcoin.co/uploads/db4391/optimized/2X/b/be48f2e3e68725115653e4435c2559a2fefb61cd_2_504x312.png 1.5x, https://gov.gitcoin.co/uploads/db4391/optimized/2X/b/be48f2e3e68725115653e4435c2559a2fefb61cd_2_672x416.png 2x\" data-dominant-color=\"D4D6EC\"></a></div><p></p>\n<ul>\n<li>January represents Grants Stack workstream performance.There is no budget for May.</li>\n</ul>\n<p>Within the <strong>Passport</strong> business unit, $207,542 was expended out of the allocated budget of $233,482, leaving $25,940 unutilized. Despite initial expectations of increased infrastructure costs, the Passport BU effectively managed May, comfortably finishing the month below budget.</p>\n<p></p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://gov.gitcoin.co/uploads/db4391/original/2X/0/03410ebf163991390b5c4d75c134b4318e5aacb4.png\" data-download-href=\"https://gov.gitcoin.co/uploads/db4391/03410ebf163991390b5c4d75c134b4318e5aacb4\" title=\"Chart\"><img src=\"https://gov.gitcoin.co/uploads/db4391/optimized/2X/0/03410ebf163991390b5c4d75c134b4318e5aacb4_2_336x208.png\" alt=\"\" title=\"Chart\" data-base62-sha1=\"sMOHaRPRYjBthkErbKcLMEUkg4\" width=\"336\" height=\"208\" role=\"presentation\" srcset=\"https://gov.gitcoin.co/uploads/db4391/optimized/2X/0/03410ebf163991390b5c4d75c134b4318e5aacb4_2_336x208.png, https://gov.gitcoin.co/uploads/db4391/optimized/2X/0/03410ebf163991390b5c4d75c134b4318e5aacb4_2_504x312.png 1.5x, https://gov.gitcoin.co/uploads/db4391/optimized/2X/0/03410ebf163991390b5c4d75c134b4318e5aacb4_2_672x416.png 2x\" data-dominant-color=\"CDD0E9\"></a></div><p></p>\n            <p><small>1 post - 1 participant</small></p>\n            <p><a href=\"https://gov.gitcoin.co/t/dao-financial-report-may-2024/18987\">Read full topic</a></p>","link":"https://gov.gitcoin.co/t/dao-financial-report-may-2024/18987","pubDate":"Thu, 13 Jun 2024 18:22:52 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"gov.gitcoin.co-topic-18987"},"source":{"@url":"https://gov.gitcoin.co/t/dao-financial-report-may-2024/18987.rss","#text":"DAO Financial Report - May 2024"}},{"title":"Token Engineering QF Grants Round: Spring 2024 GG20 Round Retro","dc:creator":"iviangita","category":"🌱 Gitcoin Grants","description":"<h2><a name=\"round-details-and-process-of-setting-it-up-1\" class=\"anchor\" href=\"https://gov.gitcoin.co#round-details-and-process-of-setting-it-up-1\"></a>Round Details and Process of Setting it up</h2>\n<p>The Token Engineering QF Grants Round: Spring 2024 round was specifically tied to fostering innovation and supporting projects within the field of token engineering. The setup involved careful planning, including defining criteria, selecting and onboarding token engineers as advisors, and implementing a robust application and review system to ensure transparency and fairness. Key partners and stakeholders were engaged early in the process to align goals and expectations.</p>\n<h2><a name=\"grant-round-objectives-2\" class=\"anchor\" href=\"https://gov.gitcoin.co#grant-round-objectives-2\"></a>Grant Round Objectives</h2>\n<p>The primary objectives of this grant round were to:</p>\n<ul>\n<li>Support and accelerate public good projects that align with token engineering principles</li>\n<li>Encourage new ideas and solutions that will advance the token engineering field</li>\n<li>Build a stronger community by fostering connections between token engineering innovators and the broader public goods ecosystem.</li>\n</ul>\n<p>The grant round was specifically designed to engage and support projects and individuals advancing the field of token engineering, an area encompassing economics, system design with crypto, and the design and analysis of cryptoeconomic systems. The round targeted academics, researchers, educators, and developers focused on:</p>\n<ul>\n<li>Token engineering research</li>\n<li>Events, seminars, and papers educating the community about token engineering</li>\n<li>Software development for token engineering tools</li>\n<li>Building or enhancing social infrastructure related to token engineering.</li>\n</ul>\n<h2><a name=\"implementation-3\" class=\"anchor\" href=\"https://gov.gitcoin.co#implementation-3\"></a>Implementation</h2>\n<h3><a name=\"setup-and-management-4\" class=\"anchor\" href=\"https://gov.gitcoin.co#setup-and-management-4\"></a>Setup and Management</h3>\n<p>This being our 4th grant round, the setup process was streamlined based on previous experiences. We maintained the matching cap at 15% to allow up to 5-6 bigger projects to receive a substantial matching amount, optimizing the distribution of funds to drive meaningful impact. The eligibility criteria were improved with a list of project types perfectly aligned with the identified needs within the token engineering community, as informed by a TEC-sponsored <a href=\"https://osf.io/preprints/socarxiv/xw48b/\" rel=\"noopener nofollow ugc\">Token Engineering Stakeholder Study</a>.</p>\n<p>We also implemented a new communication strategy that involved promptly notifying applicants of their acceptance or rejection, followed by a structured appeal process. This approach ensured clear and timely communication throughout the grant round, maintaining transparency and managing expectations effectively.</p>\n<h3><a name=\"challenges-and-solutions-5\" class=\"anchor\" href=\"https://gov.gitcoin.co#challenges-and-solutions-5\"></a>Challenges and Solutions</h3>\n<p>One ongoing challenge has been defining project qualifications clearly—distinguishing between projects that genuinely advance token engineering as a discipline versus those that merely apply token engineering elements, such as launching a token or incorporating a token economy. To address this, we focused on enhancing the review process by involving advisors who are experts in token engineering. The involvement of 9 seasoned advisors enriched the evaluation process. Their insights were crucial in accurately assessing the true impact and relevance of each project to the field of token engineering. Additionally, we recognized the need to provide clearer feedback on application rejections, helping applicants understand exactly why they did not meet the criteria and how they might improve for future submissions.</p>\n<p>During this grant round, managing the simultaneous processes of late applications, appeals, and the donation period also proved challenging. The need to address late submissions and appeals while simultaneously driving the donation campaign stretched our resources. To streamline future rounds, we hope to establish a more definitive schedule that separates the closing of applications from the start of the donation period. This will allow dedicated attention to appeals and ensure all applications are considered without compromising our donation campaign efforts. Assigning specific team roles for managing appeals and rejections will further prevent operational overlap, maintaining our focus on effective campaigning and meticulous evaluation.</p>\n<h3><a name=\"unique-features-or-approaches-6\" class=\"anchor\" href=\"https://gov.gitcoin.co#unique-features-or-approaches-6\"></a>Unique Features or Approaches</h3>\n<p>Continuing from a previous round, we employed the <a href=\"https://medium.com/token-engineering-commons/expertise-and-quadratic-funding-bd4f0c5c3e23\" rel=\"noopener nofollow ugc\">Tunable Quadratic Funding (TQF)</a> Matching Boost, a strategic enhancement to the Quadratic Funding allocation process that leverages token engineering expertise. TQF works by analyzing token-based signals of token engineering expertise in the wallets of donors participating in our Token Engineering Grants Round. When such signals are detected, we apply a ‘boost’ to the donations, thereby increasing the funding received by projects that attract support from well-regarded members of the token engineering community. This approach not only incentivizes quality contributions but also ensures that funding is aligned with genuine expertise in the field.</p>\n<h2><a name=\"outcomes-and-statistics-7\" class=\"anchor\" href=\"https://gov.gitcoin.co#outcomes-and-statistics-7\"></a>Outcomes and Statistics</h2>\n<h3><a name=\"funding-and-contributions-8\" class=\"anchor\" href=\"https://gov.gitcoin.co#funding-and-contributions-8\"></a>Funding and Contributions</h3>\n<ul>\n<li>Total funding: $9,365</li>\n<li>Number of contributions: 1,619</li>\n<li>Average contribution: $16.90</li>\n<li>Unique donors: 554</li>\n<li>Participating projects: 32</li>\n<li>Average grant size: $TEC 2,975.88</li>\n</ul>\n<h3><a name=\"participant-feedback-9\" class=\"anchor\" href=\"https://gov.gitcoin.co#participant-feedback-9\"></a>Participant Feedback</h3>\n<p>Every round, we gather open and honest feedback from our grantees using an anonymous feedback form. Below are some sample responses from the feedback received:</p>\n<p><em>“It was great and apreciate the trust in grantees, having some accountability methods to ensure the well use of the funds would make me more accountable and thats always a good thing. We are using the funds to keep runing operations and we are constantly delivering milestones but its always nice to keep a layer of accountability.”</em></p>\n<p><em>“Team did a fantastic job promoting and holding spaces, and having follow ups. I deeply appreciate the platform to share my ideas. Keep up the great work there.”</em></p>\n<p><em>“Of course I could have stood to earned more toward my mission, but I was really happy with the direct donation as well as the size of the match I received.”</em></p>\n<h3><a name=\"impact-assessment-10\" class=\"anchor\" href=\"https://gov.gitcoin.co#impact-assessment-10\"></a>Impact Assessment</h3>\n<p><em><strong>Overall Payouts</strong></em></p>\n<div class=\"md-table\">\n<table>\n<thead>\n<tr>\n<th></th>\n<th>Grant Name</th>\n<th>Total Funding ($TEC)</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>1</td>\n<td>Commons Stack</td>\n<td>10,229.50</td>\n</tr>\n<tr>\n<td>2</td>\n<td>The cadCAD Foundation</td>\n<td>7,634.60</td>\n</tr>\n<tr>\n<td>3</td>\n<td>Trusted Seed: A value-driven community advancing Regen Economies</td>\n<td>7,391.80</td>\n</tr>\n<tr>\n<td>4</td>\n<td>Bonding Curve Research Group (BCRG)</td>\n<td>7,201.90</td>\n</tr>\n<tr>\n<td>5</td>\n<td>Super DCA: Innovating Decentralized Finance with Time-Weighted Average Market Making</td>\n<td>6,697.20</td>\n</tr>\n<tr>\n<td>6</td>\n<td>Crypto Commons Association</td>\n<td>5,951.50</td>\n</tr>\n<tr>\n<td>7</td>\n<td>Kairos Research</td>\n<td>5,085.50</td>\n</tr>\n<tr>\n<td>8</td>\n<td>Streaming Quadratic Funding</td>\n<td>4,319.60</td>\n</tr>\n<tr>\n<td>9</td>\n<td>Network of Trust</td>\n<td>3,120.80</td>\n</tr>\n<tr>\n<td>10</td>\n<td>Gobying</td>\n<td>3,069.20</td>\n</tr>\n<tr>\n<td>11</td>\n<td>DeFinomics Labs</td>\n<td>3,006.20</td>\n</tr>\n<tr>\n<td>12</td>\n<td>Lived experience-based Weighted Voting Mechanism Design</td>\n<td>3,003.00</td>\n</tr>\n<tr>\n<td>13</td>\n<td>Token Engineering Dialogues</td>\n<td>2,787.50</td>\n</tr>\n<tr>\n<td>14</td>\n<td>Metrics Garden Labs</td>\n<td>2,744.10</td>\n</tr>\n<tr>\n<td>15</td>\n<td>Change Code</td>\n<td>2,575.80</td>\n</tr>\n<tr>\n<td>16</td>\n<td>$REGEN Tokenomics DAO</td>\n<td>2,550.10</td>\n</tr>\n<tr>\n<td>17</td>\n<td>Breadchain Cooperative</td>\n<td>2,237.40</td>\n</tr>\n<tr>\n<td>18</td>\n<td>Pairwise: Simplifying Choices, Amplifying Voices</td>\n<td>2,070.50</td>\n</tr>\n<tr>\n<td>19</td>\n<td>CATTS, Composite Attestations</td>\n<td>1,846.50</td>\n</tr>\n<tr>\n<td>20</td>\n<td>1Hive Gardens</td>\n<td>1,839.20</td>\n</tr>\n<tr>\n<td>21</td>\n<td>EVMcrispr</td>\n<td>1,647.50</td>\n</tr>\n<tr>\n<td>22</td>\n<td>Moos Modular Money Framework</td>\n<td>1,353.60</td>\n</tr>\n<tr>\n<td>23</td>\n<td>Armitage</td>\n<td>1,133.30</td>\n</tr>\n<tr>\n<td>24</td>\n<td>Turtleshell</td>\n<td>984.1</td>\n</tr>\n<tr>\n<td>25</td>\n<td>Casually Looped</td>\n<td>892.5</td>\n</tr>\n<tr>\n<td>26</td>\n<td>ProtocolGuardï¼šAI-Driven Exploring Potential Malicious Strategies in PAMMs &amp; SAMMs</td>\n<td>889.8</td>\n</tr>\n<tr>\n<td>27</td>\n<td>Index Wallets</td>\n<td>804.9</td>\n</tr>\n<tr>\n<td>28</td>\n<td>$EARTH - OSS</td>\n<td>598.6</td>\n</tr>\n<tr>\n<td>29</td>\n<td>Tokenization for Inflation-Alleviation</td>\n<td>560</td>\n</tr>\n<tr>\n<td>30</td>\n<td>SymVal</td>\n<td>440.8</td>\n</tr>\n<tr>\n<td>31</td>\n<td>NERD DAO: Decentralized Science and Web3 Innovation</td>\n<td>348.2</td>\n</tr>\n<tr>\n<td>32</td>\n<td>HonorCode</td>\n<td>212.9</td>\n</tr>\n</tbody>\n</table>\n</div><h1><a name=\"h-11\" class=\"anchor\" href=\"https://gov.gitcoin.co#h-11\"></a></h1>\n<p><em><strong>TEGR3 vs TEGR4 - Project &amp; Funding Growth</strong></em></p>\n<div class=\"md-table\">\n<table>\n<thead>\n<tr>\n<th></th>\n<th>TEGR3</th>\n<th>TEGR4</th>\n<th>Difference</th>\n<th>% Change</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>Total Projects</td>\n<td>20</td>\n<td>32</td>\n<td>12</td>\n<td>60%</td>\n</tr>\n<tr>\n<td>Recurring Projects</td>\n<td>8</td>\n<td>9</td>\n<td>1</td>\n<td>12.50%</td>\n</tr>\n<tr>\n<td>New Projects</td>\n<td>11</td>\n<td>23</td>\n<td>12</td>\n<td>109.09%</td>\n</tr>\n<tr>\n<td>Unique Donors</td>\n<td>530</td>\n<td>554</td>\n<td>24</td>\n<td>4.53%</td>\n</tr>\n<tr>\n<td>Total Crowdfunded</td>\n<td>$5,108.14</td>\n<td>$9,363.07</td>\n<td>$4,254.93</td>\n<td>83.30%</td>\n</tr>\n<tr>\n<td>Total Contributions</td>\n<td>1,672</td>\n<td>1,579</td>\n<td>-93</td>\n<td>-5.56%</td>\n</tr>\n<tr>\n<td>Average Contribution</td>\n<td>$9.63</td>\n<td>$16.9</td>\n<td>$7.27</td>\n<td>75.49%</td>\n</tr>\n</tbody>\n</table>\n</div><ol>\n<li><strong>Total Projects:</strong> The total number of projects increased significantly by 60%, indicating a broader reach and more opportunities for funding in TEGR4 compared to TEGR3.</li>\n<li><strong>Recurring Projects:</strong> There was a moderate increase of 12.5% in recurring projects, suggesting that most of the projects in TEGR4 were new initiatives.</li>\n<li><strong>New Projects:</strong> The number of new projects more than doubled, highlighting a substantial influx of fresh ideas and proposals.</li>\n<li><strong>Unique Donors:</strong> The unique donor count saw a slight rise of 4.53%, indicating a stable and slightly growing donor base.</li>\n<li><strong>Total Crowdfunded</strong>: There was a significant increase (83.3%) in the total amount crowdfunded. Showing a higher level of financial support and engagement from the community in TEGR3.</li>\n<li><strong>Average Contribution:</strong> The average contribution amount rose sharply by 75.5%, supporting the observation that individual contributions became significantly larger in TEGR4.</li>\n</ol>\n<p>The comparison between TEGR3 and TEGR4 shows a clear positive trend in terms of project submissions, new projects, and total funds raised. Despite a slight decrease in the number of contributions, the substantial increase in the average contribution and total crowdfunded amount reflects enhanced donor generosity and engagement. This overall growth suggests successful outreach and possibly improved strategies in attracting larger contributions per donor.</p>\n<h1><a name=\"h-12\" class=\"anchor\" href=\"https://gov.gitcoin.co#h-12\"></a></h1>\n<p><em><strong>All TEGR - Impact Tool Adoption by Category</strong></em></p>\n<div class=\"md-table\">\n<table>\n<thead>\n<tr>\n<th></th>\n<th>Total Projects</th>\n<th>OSO</th>\n<th>% OSO</th>\n<th>Karma</th>\n<th>% Karma</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>Tooling</td>\n<td>21</td>\n<td>11</td>\n<td>52.4%</td>\n<td>15</td>\n<td>71.4%</td>\n</tr>\n<tr>\n<td>Research</td>\n<td>23</td>\n<td>8</td>\n<td>34.8%</td>\n<td>17</td>\n<td>73.9%</td>\n</tr>\n<tr>\n<td>Social Infrastructure</td>\n<td>2</td>\n<td>0</td>\n<td>0%</td>\n<td>2</td>\n<td>100%</td>\n</tr>\n<tr>\n<td>Education</td>\n<td>8</td>\n<td>5</td>\n<td>62.5%</td>\n<td>4</td>\n<td>50%</td>\n</tr>\n<tr>\n<td>Other</td>\n<td>4</td>\n<td>1</td>\n<td>25%</td>\n<td>0</td>\n<td>0%</td>\n</tr>\n<tr>\n<td>Total</td>\n<td>58</td>\n<td>25</td>\n<td>43.1%</td>\n<td>39</td>\n<td>67.2%</td>\n</tr>\n</tbody>\n</table>\n</div><p><strong>a. Overall Adoption Rate</strong></p>\n<ol>\n<li>43.1% of all projects are on OSO</li>\n<li>67.2% of all projects are on Karma (most have not created milestones)</li>\n</ol>\n<p><strong>b. Category-Specific Adoption</strong></p>\n<ol>\n<li>Tooling and Research projects have a relatively high adoption rate for both tools, with Karma being more popular. Though every grantee from TEGR4 has a Karma account, perhaps account generation is automatic in Gitcoin rounds now</li>\n<li>Social Infrastructure projects have a 100% adoption rate for Karma but none for OSO</li>\n<li>Education projects show a higher preference for OSO compared to Karma</li>\n<li>Other projects have low adoptions rate for both tools</li>\n</ol>\n<h2><a name=\"lessons-learned-and-improvements-13\" class=\"anchor\" href=\"https://gov.gitcoin.co#lessons-learned-and-improvements-13\"></a>Lessons Learned and Improvements</h2>\n<h3><a name=\"key-learnings-14\" class=\"anchor\" href=\"https://gov.gitcoin.co#key-learnings-14\"></a>Key Learnings</h3>\n<p>This grant round has been a journey of discovery and improvement. We were honored to be selected as one of Gitcoin’s sponsored community rounds, which significantly amplified our reach. The support from Gitcoin not only helped us attract a wider array of projects but also expanded our circle of grantees beyond the familiar faces from previous rounds. These new ideas and perspectives have been refreshing for our community.</p>\n<p>One critical insight from this round was the absolute necessity of crystal-clear criteria. We realized that to truly achieve our objectives, we must sharpen our ability to distinguish between projects that are simply using token engineering and those that are pushing the boundaries of the field. This clarity is crucial for steering our efforts towards projects that promise genuine advancement in token engineering.</p>\n<p>Another major takeaway involved the importance of supporting impactful initiatives. The round reaffirmed our commitment to not just funding projects but also measuring their long-term impact. This means developing robust metrics to assess both the potential and the realized impact of projects, ensuring that our investments continue to bear fruit long after the funding has been disbursed.</p>\n<h3><a name=\"areas-for-improvement-15\" class=\"anchor\" href=\"https://gov.gitcoin.co#areas-for-improvement-15\"></a>Areas for Improvement</h3>\n<p>We discovered that many of our grantees were not maximizing opportunities to promote their projects. In future rounds, we need to provide more support for grantee marketing and engagement. Whether through resources, training, or incentives, we must empower our grantees to champion their projects effectively, to better boost their visibility and impact.</p>\n<p>Additionally, in future grant rounds, we plan to introduce detailed metrics and evaluation tools specifically designed to assess the direct impact of our funding on the supported projects. This initiative will allow us to track how our contributions aid in advancing each project’s goals and development within the field of token engineering. By refining our evaluation framework, we aim to ensure that our funding not only supports worthy projects but also maximizes their potential for success and growth.</p>\n<p>One logistical improvement from this round we would suggest is having earlier clarification of grant round dates. Knowing these dates in advance would significantly enhance our planning and coordination. This advance notice is crucial for ensuring that all aspects of the grant round—from application deadlines to project evaluation and donation campaigns—are better organized and clearly communicated.</p>\n<p>As we reflect on these lessons, we are inspired to refine our processes and approaches for future rounds. Each grant round is an opportunity to learn, adapt, and enhance the transformative potential of our funding. The insights gained from this round will undoubtedly influence our strategies moving forward, making each successive round more impactful than the last.</p>\n<h2><a name=\"closing-thoughts-16\" class=\"anchor\" href=\"https://gov.gitcoin.co#closing-thoughts-16\"></a>Closing Thoughts</h2>\n<p>Reflecting on this grant round, several key learnings stand out as crucial for our growth and future planning. The importance of setting clearer criteria and an evaluation matrix cannot be overstated—it is essential for guiding both applicants and reviewers, ensuring that projects align with the true spirit of token engineering. This round has reinforced the necessity of planning ahead and meticulous time management, especially when aligning with Gitcoin’s timeline and balancing multiple processes such as appeals, late applications, and active donation campaigns.</p>\n<p>Constant and clear communication has been an essential component in running our round. Maintaining open channels with grantees, our community, and partners like Gitcoin has helped keep the process transparent and inclusive, fostering a trusting and engaged community environment.</p>\n<p>Looking ahead, we are excited to continue refining these processes. Each round brings new opportunities to enhance our approach, deepen our impact, and expand our community’s engagement with token engineering. We encourage everyone—projects/grantees, donors, and partners—to share their feedback on this round. Your insights are invaluable as they help us improve and innovate for future rounds.</p>\n            <p><small>1 post - 1 participant</small></p>\n            <p><a href=\"https://gov.gitcoin.co/t/token-engineering-qf-grants-round-spring-2024-gg20-round-retro/18978\">Read full topic</a></p>","link":"https://gov.gitcoin.co/t/token-engineering-qf-grants-round-spring-2024-gg20-round-retro/18978","pubDate":"Tue, 11 Jun 2024 15:53:09 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"gov.gitcoin.co-topic-18978"},"source":{"@url":"https://gov.gitcoin.co/t/token-engineering-qf-grants-round-spring-2024-gg20-round-retro/18978.rss","#text":"Token Engineering QF Grants Round: Spring 2024 GG20 Round Retro"}},{"title":"[Discussion] Allo Fee Switch Proposal","dc:creator":"James","category":"🤖 DAO Governance and Vision","description":"<h1><a name=\"allo-fee-switch-proposal-1\" class=\"anchor\" href=\"https://gov.gitcoin.co#allo-fee-switch-proposal-1\"></a>Allo Fee Switch Proposal</h1>\n<h2><a name=\"abstract-background-2\" class=\"anchor\" href=\"https://gov.gitcoin.co#abstract-background-2\"></a>Abstract &amp; Background</h2>\n<p>Fire Eyes DAO has been working towards creating a roadmap for <a href=\"https://gov.gitcoin.co/t/gtc-value-accrual-intro/18380\">GTC Value Accrual</a>  as well as driving more clear sustainability and value to the GitcoinDAO.</p>\n<p>As mentioned in the <a href=\"https://gov.gitcoin.co/t/gtc-value-accrual-intro/18380\">GTC Value Accrual Intro</a> forum post, introducing a fee switch to the Allo Protocol is a straightforward decision that can allow us to begin this journey.</p>\n<p><strong>This forum post aims to ignite initial discussion on an Allo fee switch, not be a ‘ready to vote’ proposal.</strong></p>\n<h2><a name=\"motivation-3\" class=\"anchor\" href=\"https://gov.gitcoin.co#motivation-3\"></a>Motivation</h2>\n<p>Allo protocol v2 (and its predecessors) have had $60m+ in combined volume. The introduction of a fee to Allo would create a new revenue stream which would be passed back into the DAO treasury.</p>\n<p>Uniswaps previous discussion on the activation of their fee switch provides some guidance around the process involved in making this change, and valuable insight into the wider community response to such a change.</p>\n<p>Although Gitcoin is a different protocol to Uniswap, the foundation of these decisions should follow the same logical course. <strong>Protocols cannot sustain being public goods indefinitely and leaning into value accrual as a protocol is important.</strong></p>\n<h2><a name=\"specification-4\" class=\"anchor\" href=\"https://gov.gitcoin.co#specification-4\"></a>Specification</h2>\n<p>This initial pre-proposal discussion centres around two decisions that need to be made before we move forward:</p>\n<ul>\n<li>Firstly (1.) if the fee is added to Gitcoin’s deployment of Allo protocol <strong>or</strong> (2.) to all deployments of Allo protocol.</li>\n<li>Secondly if this fee was to be added, what percentage of volume the fee would take.</li>\n</ul>\n<p><strong>Firstly:</strong></p>\n<ol>\n<li>\n<p>The fee switch could added to the Allo Protocol but only be enacted via the official Gitcoin deployment, not at the overall contract level.</p>\n<ul>\n<li>This allows others to fork the contracts and deploy their own instance without the fee if they wish to.</li>\n</ul>\n</li>\n<li>\n<p>The fee switch could be implemented at the contract level, meaning that all deployments would include the switch unless it was removed from the contract itself.</p>\n<ul>\n<li>This more strongly encourages anyone using the allo contracts to contribute to the funding of public goods via GitcoinDAO.</li>\n</ul>\n</li>\n</ol>\n<p><strong>Secondly:</strong> The fee level is an open question - we invite community feedback and discussion but envision the fee sitting at one of the following levels:</p>\n<ul>\n<li>0.5%</li>\n<li>1%</li>\n<li>3%</li>\n</ul>\n<p>For context, looking at these fee levels retroactively gives us an idea of how impactful a fee could be over time:</p>\n<h4><a name=\"gg20-5\" class=\"anchor\" href=\"https://gov.gitcoin.co#gg20-5\"></a>GG20:</h4>\n<ul>\n<li>0.5% of total GG20 donations = $3165</li>\n<li>1% of total GG20 donations = $6330</li>\n<li>3% of total GG20 donations = $18,990</li>\n</ul>\n<h4><a name=\"all-time-6\" class=\"anchor\" href=\"https://gov.gitcoin.co#all-time-6\"></a>All time:</h4>\n<ul>\n<li>0.5% of total Grants distributions to date = ~$300k</li>\n<li>1% of total Grants distributions to date = ~$600k</li>\n<li>3% of total Grants distributions to date = ~$1.8m</li>\n</ul>\n<p>These numbers show value flows that could be directed towards sustainability.</p>\n<p><strong>It is important to note that the proceeds of this fee will be deposited back into the Gitcoin DAO treasury,</strong> to be directed into funding both the development of Gitcoin infrastructure, and the commons more broadly. As such, it makes sense for the fee to be higher than average and that most users would be accepting of this given that the fee exists purely to sustain the provision of Allo and related public goods.</p>\n<p><em>FireEyes would recommend that the switch be implemented at the Allo contract level with a fee of 1%. This is because it provides a clear value proposition to GitcoinDAO’s sustainability whilst remaining reasonably unobtrusive to users donating via the Allo protocol. It is obviously still possible to remove or reduce this fee switch, but this would need to be an explicit decision to exclude by anyone deploying.</em></p>\n<h2><a name=\"drawbacks-risks-7\" class=\"anchor\" href=\"https://gov.gitcoin.co#drawbacks-risks-7\"></a>Drawbacks / Risks</h2>\n<p>There are reasonable discussion points that this type of fee switch could damage Gitcoin’s public goods reputation, here’s how we feel that we could mitigate this if deemed necessary by the community:</p>\n<ul>\n<li>Start with the checkout process having an optional donation/fee to Gitcoin DAO.</li>\n<li>Only enact the fee switch on the official Gitcoin frontend, and let others deploy their own frontends without fee switches.</li>\n</ul>\n<p>Allo has established itself as a credible tool for capital allocation, projects with large sums of capital have two incentives to use Allo with a fee switch.</p>\n<ul>\n<li>It has pre-existing infrastructure which is easy to use, making the fee worthwhile.</li>\n<li>Using Allo (with a fee) also means that you are also contributing to public goods inherently by contributing to the sustainability of public goods infrastructure.</li>\n</ul>\n<h2><a name=\"conclusion-8\" class=\"anchor\" href=\"https://gov.gitcoin.co#conclusion-8\"></a>Conclusion</h2>\n<p>We hope to foster community discussion around both the introduction of this mechanism and its finer details, as well as more broadly around sustainability for the GitcoinDAO and it’s infrastructure.</p>\n<p>We realise this is a controversial topic to introduce to a public goods focused community like Gitcoin however starting this conversation is an important step towards ensuring that we can continue sustainably building public goods infrastructure for years to come!</p>\n<p>Please share your thoughts and feedback in this forum post <img src=\"https://gov.gitcoin.co/images/emoji/twitter/robot.png?v=12\" title=\":robot:\" class=\"emoji\" alt=\":robot:\" loading=\"lazy\" width=\"20\" height=\"20\"></p>\n            <p><small>6 posts - 6 participants</small></p>\n            <p><a href=\"https://gov.gitcoin.co/t/discussion-allo-fee-switch-proposal/18974\">Read full topic</a></p>","link":"https://gov.gitcoin.co/t/discussion-allo-fee-switch-proposal/18974","pubDate":"Mon, 10 Jun 2024 22:27:17 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"gov.gitcoin.co-topic-18974"},"source":{"@url":"https://gov.gitcoin.co/t/discussion-allo-fee-switch-proposal/18974.rss","#text":"[Discussion] Allo Fee Switch Proposal"}},{"title":"Dark Matter, coin voting, bribes, transferable stake, etc","dc:creator":"skilesare","category":"🧙 🧙‍♀️ Ideas and Open Discussion","description":"<p>Hey all…I’ve started a bit of discussion over on the DFINITY forums(i know, i know) about some issues we’re running into. It is a bit of a diatribe, but I figured if there might be any collective wisdom out there to help guide what is going on with our community, I’d love to hear it:</p>\n<aside class=\"onebox discoursetopic\" data-onebox-src=\"https://forum.dfinity.org/t/dark-matter-or-do-you-know-where-your-icp-bags-value-is-going/31685\">\n  <header class=\"source\">\n      <img src=\"https://gov.gitcoin.co/uploads/db4391/original/2X/5/548566686f4d22f6dcfd4f9386574ee94d1c0660.png\" class=\"site-icon\" data-dominant-color=\"90748E\" width=\"32\" height=\"32\">\n\n      <a href=\"https://forum.dfinity.org/t/dark-matter-or-do-you-know-where-your-icp-bags-value-is-going/31685\" target=\"_blank\" rel=\"noopener nofollow ugc\" title=\"12:55PM - 09 June 2024\">Internet Computer Developer Forum – 9 Jun 24</a>\n  </header>\n\n  <article class=\"onebox-body\">\n    <div class=\"aspect-image\" style=\"--aspect-ratio:690/383;\"><img src=\"https://gov.gitcoin.co/uploads/db4391/optimized/2X/7/7c2b50a1a1093ac730e5adede35bdded451657c1_2_690x383.jpeg\" class=\"thumbnail\" data-dominant-color=\"1B1B1B\" width=\"690\" height=\"383\"></div>\n\n<div class=\"title-wrapper\">\n  <h3><a href=\"https://forum.dfinity.org/t/dark-matter-or-do-you-know-where-your-icp-bags-value-is-going/31685\" target=\"_blank\" rel=\"noopener nofollow ugc\">\"Dark Matter\" or \"Do you know where your ICP Bag's value is going?\"</a></h3>\n  <div class=\"topic-category\">\n      <span class=\"badge-wrapper bullet\">\n        <span class=\"badge-category-bg\" style=\"background-color: #29ABE2;\"></span>\n        <span class=\"badge-category clear-badge\">\n          <span class=\"category-name\">General</span>\n        </span>\n      </span>\n    <div class=\"topic-header-extra\">\n      <div class=\"list-tags\">\n        <div class=\"discourse-tags\">\n          <svg class=\"fa d-icon d-icon-tag svg-icon svg-string\"><use href=\"#tag\"></use></svg>\n            <span class=\"discourse-tag simple\">Discussing</span>\n        </div>\n      </div>\n    </div>\n  </div>\n</div>\n\n  <p>Value is about to exit your ICP Bag and no one seems to notice    h/t to @klac x.com for the media.  TLDR: Neuron Markets, Liquid Staking, and Quadratic Passion reduce the value of YOUR BAG. But can they be used to fund public goods that benefit...</p>\n\n  <p>\n    <span class=\"label1\">Reading time: 11 mins 🕑</span>\n      <span class=\"label2\">Likes: 14 ❤</span>\n  </p>\n\n  </article>\n\n  <div class=\"onebox-metadata\">\n    \n    \n  </div>\n\n  <div style=\"clear: both\"></div>\n</aside>\n\n<p>TLDR: Our smart contracts are getting the ability to hold “voting neurons” and that lets people DeFi them and potentially sell DAO votes.  I explore how it could be used for funding public goods.  I make up something called Quadratic Passion.</p>\n            <p><small>1 post - 1 participant</small></p>\n            <p><a href=\"https://gov.gitcoin.co/t/dark-matter-coin-voting-bribes-transferable-stake-etc/18972\">Read full topic</a></p>","link":"https://gov.gitcoin.co/t/dark-matter-coin-voting-bribes-transferable-stake-etc/18972","pubDate":"Mon, 10 Jun 2024 13:28:37 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"gov.gitcoin.co-topic-18972"},"source":{"@url":"https://gov.gitcoin.co/t/dark-matter-coin-voting-bribes-transferable-stake-etc/18972.rss","#text":"Dark Matter, coin voting, bribes, transferable stake, etc"}},{"title":"[PASSED] S23 - Gitcoin Passport Business Unit Budget Proposal","dc:creator":"kyle","category":"📜 Proposals","description":"<p>Hey Gitcoin Community - we are excited to present our FINAL six month budget to the DAO. It has been a goal of mine and others on the team to graduate Passport from Gitcoin as Gitcoin has been focused on Grants and growing GMV for a while now. At the same time, the Passport team has been focused on identity and the emerging world of onchain reputation, with some support for Gitcoin, but largely prioritizing the broader Ethereum ecosystem. Creating separation from the two entities ensures Passport’s actions across the space are no longer associated with the Gitcoin brand, and while Gitcoin continues to focus on capital allocation, there will no longer be questions on why we have an identity solution in the portfolio.</p>\n<p>This budget request seeks funding to enable the spin out of Passport and fund the business for its initial six months. Here is what we are thinking. Passport has generated revenue on OP and Linea (by enabling onchain attestations of one’s unique humanity, and OP RPGF3). Together with this funding, and a six month budget, we would like to formally request a vote to spin out of Gitcoin DAO. In return for bootstrapping the business unit, we will ensure Gitcoin has equity ownership in the new entity, a token allocation if/when we launch a token and a board seat in the new entity. The details on how a DAO may participate are a little murky (ie, have equity, and a board seat) and so we will be working with the Gitcoin Foundation to formalize the ownership and board seat appointment.</p>\n<p>Passport currently drives the majority utility use case for GTC and we plan to keep GTC utility in the product for the foreseeable future. We do not have details on if/when Passport has its own token, but we want to ensure as Gitcoin will likely be a large token holder in Passport, there will be token use cases that extend utility for other ERC-20 (like GTC).</p>\n<p>We are aiming to have this spinout complete in July, and would expect the Passport team to start to use its own properties (ie, Passport.xyz for the website and app, its own discord server, its own email, etc.) on July 1. While Passport will be an independent entity, there will still be lots of areas of collaboration as those running grants programs often need Sybil protection (and those doing airdrops often want to seed a Grants program after TGE).</p>\n<p>As for the progress the team has been making, updates below outline both progress and the roadmap we have ahead.</p>\n<h2><a name=\"tldr-on-the-next-6mos-1\" class=\"anchor\" href=\"https://gov.gitcoin.co#tldr-on-the-next-6mos-1\"></a>TL;DR on the next 6mos</h2>\n<p>Gitcoin Passport aims to be the go-to solution for web3 identity and reputation management. We are continuing to focus on ways to build a reputational substrate that can be leveraged permissionlessly onchain:</p>\n<ol>\n<li><strong>Adoption</strong> - Continue to expand the number of real humans with a passport</li>\n<li><strong>Growth</strong> - Grow the number of onchain attestations</li>\n<li><strong>Sustainability</strong> - Ensure continued runway extension</li>\n</ol>\n<h2><a name=\"outline-2\" class=\"anchor\" href=\"https://gov.gitcoin.co#outline-2\"></a>Outline</h2>\n<p>Passport is the premier web3 native offering that enables ecosystems to protect, understand and organically grow what matters most – their communities. We see Passport at the confluence of a best in class identity solution, backed by the most relevant and comprehensive data analysis toolset that also offers communities the ability to ascribe reputation.</p>\n<p>Objectives for Seasons 23: This table lists the milestones and deliverables we plan to tackle. While they are in a loose priority order, their final sequencing is still under evaluation.</p>\n<table>\n  <tbody><tr>\n   <td><strong>Initiative/Project\t\t</strong>\n   </td>\n   <td><strong>Outcome</strong>\n   </td>\n   <td><strong>Milestone/ deliverable</strong>\n   </td>\n  </tr>\n  <tr>\n   <td><strong>Adoption</strong>\n   </td>\n   <td>Expand real human user base\n<p>\nGrow Model based detection (MBD)\n   </p></td>\n   <td>Increase Passport count 450k to 1.85M Passports from a baseline of 1.4M \n<p>\nScore &gt; 1,000,000 addresses\n   </p></td>\n  </tr>\n  <tr>\n   <td><strong>Growth</strong>\n   </td>\n   <td>Increase onchain data available for other dApps and novel use cases\n   </td>\n   <td>Increase attestation count from 100k to 500k (across all networks)\n   </td>\n  </tr>\n  <tr>\n   <td><strong>Sustainability</strong>\n   </td>\n   <td>Increase revenue\n<p>\nIncrease GTC staked\n   </p></td>\n   <td>Grow revenue from an average of 2.5 Eth a week to 4 Eth a week.\n<p>\nIncrease staked GTC from 1.75M to 2.25M \n   </p></td>\n  </tr>\n</tbody></table>\n<h2><a name=\"milestone-update-season-22-3\" class=\"anchor\" href=\"https://gov.gitcoin.co#milestone-update-season-22-3\"></a>Milestone Update: Season 22</h2>\n<p>In Season 22, our top line growth picked up quite a bit adding 255k new Passport users or 22% net new growth in May, compared to 279k new Passports or 35% total growth in the previous 3 months of S21. We now have a total of 1.4M unique all time passports. We also continued to drive strongly against our targets in GTC staking, hitting over 1.75M GTC staked.</p>\n<p>With a focus on onchain attestations, we have launched two new networks where Passport holders can attest to their unique humanity. This means, we now support attestations on Arbitrum, Optimism, Linea, and zkSync. Onchain attestations have started to unlock novel use cases where smartcontract interactions can now directly confirm a wallet’s humanity score, enabling truly permissionless and decentralized humanity confirmation.</p>\n<p>We have also done a lot of work to revamp the GTC staking experience to make the process more intuitive and informative. This has brought the creation of privacy policy details and user terms as the GTC staked can be slashed when users are acting in bad faith.</p>\n<p>And finally, our new Model Based Detection endpoint, and L2 coverage has continued to expand. We now can review wallets using our models across ARB, OP, zkSync, Polygon, Eth Mainnet, and NFT communities. This capability is incredibly helpful when engaging with other communities (new L2s) to help them understand who is likely a sybil actor and who is likely human on their network.</p>\n<h3><a name=\"milestone-report-for-past-season-4\" class=\"anchor\" href=\"https://gov.gitcoin.co#milestone-report-for-past-season-4\"></a>Milestone Report for Past Season</h3>\n<p><strong>Legend:</strong> <br>\n<img src=\"https://gov.gitcoin.co/images/emoji/twitter/green_circle.png?v=12\" title=\":green_circle:\" class=\"emoji\" alt=\":green_circle:\" loading=\"lazy\" width=\"20\" height=\"20\"> Success/Completed/Shipped <br>\n<img src=\"https://gov.gitcoin.co/images/emoji/twitter/yellow_circle.png?v=12\" title=\":yellow_circle:\" class=\"emoji\" alt=\":yellow_circle:\" loading=\"lazy\" width=\"20\" height=\"20\">Incomplete, but partial success <br>\n<img src=\"https://gov.gitcoin.co/images/emoji/twitter/red_circle.png?v=12\" title=\":red_circle:\" class=\"emoji\" alt=\":red_circle:\" loading=\"lazy\" width=\"20\" height=\"20\">Incomplete, Will Not Hit Goal <br>\n<img src=\"https://gov.gitcoin.co/images/emoji/twitter/black_circle.png?v=12\" title=\":black_circle:\" class=\"emoji\" alt=\":black_circle:\" loading=\"lazy\" width=\"20\" height=\"20\"> Canceled</p>\n<table>\n  <tbody><tr>\n   <td><strong>Initiative/Project</strong>\n   </td>\n   <td><strong>Key Results</strong>\n   </td>\n   <td><strong>Value Delivered</strong>\n   </td>\n  </tr>\n  <tr>\n   <td>Ease\n   </td>\n   <td>🟢Simplified Passport user experience\n   </td>\n   <td>Revamped Passport with fewer stamps, credentials, and simplified path to 20 score.\n   </td>\n  </tr>\n  <tr>\n   <td>Effectiveness\n   </td>\n   <td>🟡Updated score weights for all Passports based on previous 6 months of data\n<p>\n🟢Aggregate L2 Models\n   </p></td>\n   <td>In addition the revamp of Passpot and the addition of the new models we’ve made significant progress dropping the False positive rate under 16%, did not hit the target of &lt;10%.\n<p>\nWe’ll have a working model by June 30th..\n   </p></td>\n  </tr>\n  <tr>\n   <td>Adoption\n   </td>\n   <td>🟢1.4M Passports\n<p>\n🟢Scored 400k addresses with MDB \n   </p></td>\n   <td>Continued to drive top line growth of unique Passports by adding 255k new Passports exceeding our target of 1.3M driven by new partners Initia and zkLink. Strong prospects to continue to grow by end of year.\n<p>\nModel based detection used to support zkLink airdrop which resulted in ~400k addresses scored\n   </p></td>\n  </tr>\n  <tr>\n   <td>GTC utility\n   </td>\n   <td>🟡1.75M GTC Staked\n   </td>\n   <td>Staking remains strong, having increased another 95k GTC staked, but tracking to be just shy of the 1.87M target by end of June. We deprioritized the new staking experience to support partners and top line growth, but should launch in the next 30 days.\n   </td>\n  </tr>\n  <tr>\n   <td>Partnerships\n   </td>\n   <td>🟢 64 API Partners\n<p>\n🔴0 new onchain partners \n   </p></td>\n   <td>Hit our target of 64 API partners before the end of the season, which has helped drive strong topline growth.\n<p>\nWe did not hit our target of adding 5 new partners. We have 3 partners in the pipeline expected to go live in the next 60 days.\n   </p></td>\n  </tr>\n</tbody></table>\n<p><strong>Observations:</strong></p>\n<ul>\n<li>We had strong growth in top line numbers driven by ‘surprise’ partners that were not initially in our funnel including both Initia, protecting their testnet, and zkLink, supporting their airdrop.</li>\n<li>Despite strong top line growth being above average, we’re underperforming on GTC staking. We’re excited to see if the new updated staking site will increase GTC staking and we’ll begin marketing efforts to help the community understand that GTC staked on an address is another strong signal in addition to the address Passport score.</li>\n</ul>\n<p>For more granular details on our past work and plans, please refer to our previous budgets for <a href=\"https://gov.gitcoin.co/t/s17-proposal-integrated-gitcoin-passport-budget-request/12727\">S17</a>, <a href=\"https://gov.gitcoin.co/t/proposal-gitcoin-passport-workstream-season-18-19-budget-request/14121\">S18 &amp; S19</a>, <a href=\"https://gov.gitcoin.co/t/s19-proposal-amended-passport-s19-budget-request/16184\">S19 (Amended)</a>, <a href=\"https://gov.gitcoin.co/t/proposal-passport-season-20-21-budget-request/16765\">S20 &amp; S21</a>, <a href=\"https://gov.gitcoin.co/t/proposal-s22-gitcoin-passport-business-unit-budget-proposal/18731\">S22</a>, and also our updated <a href=\"https://github.com/orgs/gitcoinco/projects/25/views/1\">Passport Roadmap</a>.</p>\n<h2><a name=\"budget-update-season-23-5\" class=\"anchor\" href=\"https://gov.gitcoin.co#budget-update-season-23-5\"></a>Budget Update: Season 23</h2>\n<p>We are only increasing the budget $36k to handle non-DAO compliance costs, otherwise the budget is flat for Season 23 compared to Season 22. No new additional hires for this season.</p>\n<p><strong>Team Composition</strong></p>\n<p><strong>Full-Time Contributors:</strong> 13 (after hiring marketing in S22)</p>\n<ul>\n<li>Developers: 4</li>\n<li>Product Manager: 1</li>\n<li>Data Scientists: 2</li>\n<li>Business Unit Co-leads: 2</li>\n<li>Marketing: 1</li>\n<li>Support: 2</li>\n<li>Design: 1</li>\n</ul>\n<p>**Part-Time or Shared Contributors: **4</p>\n<ul>\n<li>DevRel: 2</li>\n<li>DevOps: 1</li>\n<li>Operations: 1</li>\n</ul>\n<h2><a name=\"funding-request-for-season-23-6\" class=\"anchor\" href=\"https://gov.gitcoin.co#funding-request-for-season-23-6\"></a>Funding Request for Season 23</h2>\n<p><strong>Requested Amount:</strong> Gitcoin Passport is requesting a net allocation of [TBD] GTC*, equivalent to approximately $1,604,857 out of the treasury to cover this final season.</p>\n<p><strong>Budget Evolution</strong></p>\n<table>\n  <tbody><tr>\n   <td>\n   </td>\n   <td><strong>S17</strong>\n   </td>\n   <td><strong>S18</strong>\n   </td>\n   <td><strong>Amended S19</strong>\n   </td>\n   <td><strong>S20</strong>\n   </td>\n   <td><strong>S21</strong>\n   </td>\n   <td><strong>S22 </strong>\n<p>\n<strong>(May &amp; June)</strong>\n   </p></td>\n   <td><strong>S23</strong>\n<p>\n<strong>(6 months)</strong>\n   </p></td>\n  </tr>\n  <tr>\n   <td>Passport Budget \n   </td>\n   <td>$515,254\n   </td>\n   <td>$589,846\n   </td>\n   <td>$494,116\n   </td>\n   <td>$478,591\n   </td>\n   <td>$642,216\n   </td>\n   <td>$460,405*\n   </td>\n   <td>$1,604,857\n   </td>\n  </tr>\n</tbody></table>\n<p>*** Note: **The GTC amount requested and reserves will be updated based on market conditions when this proposal moves to Tally, using the lower of the current price or the 20-day moving average.</p>\n<h2><a name=\"budget-breakdown-7\" class=\"anchor\" href=\"https://gov.gitcoin.co#budget-breakdown-7\"></a>Budget Breakdown</h2>\n<p><strong>Breakdown staffing, contracting, operational expenses</strong></p>\n<p>We have accounted for upcoming expenses, aiming for a lean but comprehensive budget. Our 16-member team comprises roles in Product, Design, Engineering, DevRel, Operations, and Support.</p>\n<table>\n  <tbody><tr>\n   <td>\n   </td>\n   <td>S18 (Actual Spend)\n   </td>\n   <td>S19 (Projected Actuals)\n   </td>\n   <td>S20 (Requested)\n   </td>\n   <td>S21 (Adjusted)\n   </td>\n   <td>S22\n<p>\n(May &amp; June)\n   </p></td>\n   <td>S23 \n<p>\n(Jul-Dec)\n   </p></td>\n  </tr>\n  <tr>\n   <td>Contributor Rewards\n   </td>\n   <td>$373,791\n   </td>\n   <td>$318,102\n   </td>\n   <td>$341,674\n   </td>\n   <td>$426,799\n   </td>\n   <td>$378,496\n   </td>\n   <td>$1,297,891\n   </td>\n  </tr>\n  <tr>\n   <td>Contracting (Dev Ops, DevRel, design, Marketing)\n   </td>\n   <td>$114,192\n   </td>\n   <td>$70,969\n   </td>\n   <td>$75,192\n   </td>\n   <td>$149,192\n   </td>\n   <td>$11,000\n   </td>\n   <td>$125,004\n   </td>\n  </tr>\n  <tr>\n   <td>OpEx (Software subscriptions, gas, audits, travel, professional development)\n   </td>\n   <td>$31,835\n   </td>\n   <td>$42,236\n   </td>\n   <td>$61,725\n   </td>\n   <td>$66,225\n   </td>\n   <td>$70,908\n   </td>\n   <td>$181,962\n   </td>\n  </tr>\n  <tr>\n   <td><strong><em>Total</em></strong>\n   </td>\n   <td><strong><em>$519,818</em></strong>\n   </td>\n   <td><strong><em>$431,307</em></strong>\n   </td>\n   <td><strong><em>$478,591</em></strong>\n   </td>\n   <td><strong><em>$642,216</em></strong>\n   </td>\n   <td><strong><em>$460,404</em></strong>\n   </td>\n   <td><strong><em>$1,604,857</em></strong>\n   </td>\n  </tr>\n</tbody></table>\n<p>Thanks for reviewing and the consideration!</p>\n            <p><small>12 posts - 10 participants</small></p>\n            <p><a href=\"https://gov.gitcoin.co/t/passed-s23-gitcoin-passport-business-unit-budget-proposal/18958\">Read full topic</a></p>","link":"https://gov.gitcoin.co/t/passed-s23-gitcoin-passport-business-unit-budget-proposal/18958","pubDate":"Fri, 07 Jun 2024 17:41:18 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"gov.gitcoin.co-topic-18958"},"source":{"@url":"https://gov.gitcoin.co/t/passed-s23-gitcoin-passport-business-unit-budget-proposal/18958.rss","#text":"[PASSED] S23 - Gitcoin Passport Business Unit Budget Proposal"}},{"title":"Community Owned Eco-Resort Through Fractional Property Use Rights","dc:creator":"PaigeDAO","category":"🧙 🧙‍♀️ Ideas and Open Discussion","description":"<p>From:   Paige Donner, Oxygene, LLC &amp; Alex Kim, Homebase</p>\n<p>“2024 is the Year of RWAs” - Blockworks</p>\n<p><strong>The Why:</strong></p>\n<p>The intention of this proposal is to provide a method of Treasury diversification by investing into real world assets (RWAs) or ‘hard assets’. We propose a Gitcoin DAO managed investment in revenue yielding real estate such as a working Eco-resort, or co-working residence, where accommodation provides recurring revenue.</p>\n<p>The equally pragmatic reasoning behind this proposal is to provide the wider Gitcoin community/ecosystem anchor <em><strong>‘Schelling Points’</strong></em> that foster relationship building, work retreats and work-life balance. The property could also include a winery or agricultural holdings enhancing the resort’s self-sustainability and providing on-site community building diversions during staycations and work retreats.</p>\n<p>The fundamental model here is less one of ‘Wooffing’ and more one of Jimmy Buffett’s <a href=\"https://en.wikipedia.org/wiki/Jimmy_Buffett%27s_Margaritaville\" rel=\"noopener nofollow ugc\">Margaritaville</a> style resorts (currently<a href=\"https://www.barrons.com/articles/jimmy-buffett-death-margaritaville-net-worth-9d7b825c\" rel=\"noopener nofollow ugc\"> valued </a>at well over $1B)</p>\n<p><em>I</em>mportantly, property management and upkeep will be governed on-chain using a bespoke governance platform in order to decentralize property management and facilitate remote stewardship of logistics, staff, maintenance and upkeep.*</p>\n<p>The ownership of the RWA will be held by the GitcoinDAO and/or Gitcoin Foundation. The fractional Property Use Rights will be shared among the wider Gitcoin community with the <em>sole qualification for fractional property purchase</em> being that the purchaser must be a current or past Gitcoin grantee or matching funder.</p>\n<p>This basic model is built upon a synthesis of <a href=\"https://www.homebasedao.io/\" rel=\"noopener nofollow ugc\">HomebaseDAO</a> and<a href=\"https://drive.google.com/file/d/1HCay0WwpWtpSSlKHI7kWBaf5WhxwlzHK/view?usp=sharing\" rel=\"noopener nofollow ugc\"> ChateauDAO</a> with advisory by Homebase.</p>\n<p><strong>TL;DR</strong>  <img src=\"https://gov.gitcoin.co/images/emoji/twitter/arrow_down.png?v=12\" title=\":arrow_down:\" class=\"emoji\" alt=\":arrow_down:\" loading=\"lazy\" width=\"20\" height=\"20\"></p>\n<ul>\n<li>RWA (real property) as Treasury Diversification</li>\n<li>RWA (real property) for co-working and remote site team building</li>\n<li>RWA as simplified, more accessible property accrual for wider Gitcoin Ecosystem orgs and QF Round participants</li>\n<li>Travel &amp; Luxury: an industry that will not be displaced by AI</li>\n<li>EcoResort / Remote Work &amp; Co-working Residency (more in the style of Buffett’s Margaritaville franchise, less in the style of Wooffing)</li>\n<li>Sustainable energy integration</li>\n<li>Historical Building Renovation in France - 40% subsidy provided by French government for qualifying properties</li>\n<li>DAO (or Gitcoin Foundation) retains Property Deed</li>\n<li>Property Rights Users - own, are free to sell or keep, their Property Use Rights</li>\n<li>Revenue generation model based on accommodation use and fractional, tokenized lease purchase</li>\n<li>Native dApp for calendar booking, property maintenance and property management governance</li>\n<li>Low cost SBA loans available for such purchases</li>\n</ul>\n<p><strong>We propose that the property deed be held by the Gitcoin Foundation (or DAO) as a hard asset used for treasury diversification, fiscal conservation and as a potential revenue stream for the foundation and the DAO.</strong></p>\n<p><img src=\"https://gov.gitcoin.co/images/emoji/twitter/seedling.png?v=12\" title=\":seedling:\" class=\"emoji\" alt=\":seedling:\" loading=\"lazy\" width=\"20\" height=\"20\">The Fractional Use shares that are offered for purchase to the wider community will be for designated time use. <img src=\"https://gov.gitcoin.co/images/emoji/twitter/seedling.png?v=12\" title=\":seedling:\" class=\"emoji\" alt=\":seedling:\" loading=\"lazy\" width=\"20\" height=\"20\"></p>\n<p>For example, in the case of an Eco-Resort that can accommodate up to 100 guests at a time in 50 double-occupancy rooms, the fractional shares will be made available in increments of <strong>2-weeks per year use time for a 5 year block</strong>. This means that a purchaser can pay $XX to use the property two weeks per year for a consecutive 5 year period.</p>\n<p>We propose that these Property Use Rights be represented by RWA digital asset (NFT) holdership. We propose that Property Use Rights have a 5-year duration before mandatory renewal or re-selling. We also suggest that each fractional Property Use Right ‘owner’ must hold the access token (RWA digital asset) for at least 12 months (to prevent flipping) prior to selling on the secondary market.</p>\n<p><img src=\"https://gov.gitcoin.co/images/emoji/twitter/house_with_garden.png?v=12\" title=\":house_with_garden:\" class=\"emoji only-emoji\" alt=\":house_with_garden:\" loading=\"lazy\" width=\"20\" height=\"20\"> <img src=\"https://gov.gitcoin.co/images/emoji/twitter/sunflower.png?v=12\" title=\":sunflower:\" class=\"emoji only-emoji\" alt=\":sunflower:\" loading=\"lazy\" width=\"20\" height=\"20\"><br>\nAn example of how this could break down for a 35 Room B/BA former 4-star resort in the South of France surrounded by 3 hectares of property, a small lake, a river. The property comes fully furnished, has a beautiful large dining room, common living room, on-site restaurant, professional grade kitchen, outside terrace and comes with a separate caretaker’s house.</p>\n<p><strong>Eco-Resort Uses Case: Property Price $3.9 M (Images below Property Ex. B)</strong></p>\n<ul>\n<li>This 4* HOTEL property is: 35 en suite Bed/Bath rooms, dining room, lounge, game area, grounds of 3 hectares.</li>\n<li>COST $3.9 M</li>\n<li>Each unit (B/BA room) is sold for one month use per year for a total unit availability of 11 months per year.</li>\n</ul>\n<p>(One month is reserved for property upkeep and maintenance.)</p>\n<ul>\n<li>11 x 35 = 385 units to sell = $10,130 at cost</li>\n<li>Units sell for base price of $17K —--------&gt; Total Revenue Potential $6,545,000</li>\n<li>Annual usage and property maintenance fee is also due from RWA token holders (like a Membership due)</li>\n<li>This particular property has a 2 B/BA Owner’s House. This is reserved for the founders’ &amp; friends use.</li>\n</ul>\n<p>** Gitcoin ecosystem organizations will also have the privilege of reserving rooms or privatizing the entire resort for Remote Team Meetups and other org functions.*</p>\n<p>Property Use Right digital asset RWAs can also be ‘gifted’ to org or company employees and contributors. This means that partners and contributors can earn and receive a Property Use Right RWA digital asset for their consistency in providing matching funds for QF rounds or other contributions. The Property Use Right RWA digital asset does not confer title to property or property ownership rights but does allow for 2 weeks annually of fractional property use rights (TUP = Time Unit Purchase) per RWA held for 5 years (total use per RWA token is 10 weeks over the course of 5 years).</p>\n<p><strong>2nd USE Case - Co-Working Residency</strong></p>\n<p>Property Example A</p>\n<p>Biarritz, France.</p>\n<p>€2,550,000 9 BD/BA Pool &amp; Pool House, 3 hectares, stables, private pontoon</p>\n<p>*Biarritz is a Web3 hub in France, is a beautiful coastal town on the Atlantic, just on the border of Spain. It has a strong surf, tech and culinary culture.</p>\n<p></p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://gov.gitcoin.co/uploads/db4391/original/2X/c/c41af59902a3aacebad894915a3dfce2353a9ecf.jpeg\" data-download-href=\"https://gov.gitcoin.co/uploads/db4391/c41af59902a3aacebad894915a3dfce2353a9ecf\" title=\"EcoResort Property Images Biarritz 1\"><img src=\"https://gov.gitcoin.co/uploads/db4391/optimized/2X/c/c41af59902a3aacebad894915a3dfce2353a9ecf_2_617x500.jpeg\" alt=\"EcoResort Property Images Biarritz 1\" data-base62-sha1=\"rYPllOb9HTqvP7bpV8f4gDxKwvd\" width=\"617\" height=\"500\" srcset=\"https://gov.gitcoin.co/uploads/db4391/optimized/2X/c/c41af59902a3aacebad894915a3dfce2353a9ecf_2_617x500.jpeg, https://gov.gitcoin.co/uploads/db4391/original/2X/c/c41af59902a3aacebad894915a3dfce2353a9ecf.jpeg 1.5x, https://gov.gitcoin.co/uploads/db4391/original/2X/c/c41af59902a3aacebad894915a3dfce2353a9ecf.jpeg 2x\" data-dominant-color=\"749393\"></a></div><p></p>\n<p><em>23 minutes from Biarritz, on the banks of the Adour, this bourgeois house of more than 560 m2 is built on a beautiful 2.7 ha park. Beautiful 18th century residence, it has beautiful outbuildings, a large swimming pool with its comfortable pool house, horse boxes and a tack room. and its private pontoon on the banks of this busy river. Historical and dear to the people of Bayonne. The house has three levels with fourteen rooms including nine bedrooms. The living rooms consist of a library lounge, a reception lounge, a dining room opening onto a very spacious sheltered terrace, and a large kitchen with refined decor. There is a laundry room, a pantry and two spacious offices. The house is surrounded by lawns, large trees, beautiful stones and dominates the surrounding fauna and flora. This property is above all an exceptional site which brings a good quality of life and an atmosphere of authenticity with the most up-to-date comfort.</em></p>\n<p></p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://gov.gitcoin.co/uploads/db4391/original/2X/9/997bbf269308796566d6f445b041e7d7ca0e8911.jpeg\" data-download-href=\"https://gov.gitcoin.co/uploads/db4391/997bbf269308796566d6f445b041e7d7ca0e8911\" title=\"EcoResort Property Images Biarritz 2\"><img src=\"https://gov.gitcoin.co/uploads/db4391/optimized/2X/9/997bbf269308796566d6f445b041e7d7ca0e8911_2_680x500.jpeg\" alt=\"EcoResort Property Images Biarritz 2\" data-base62-sha1=\"lTMb6aakAzR8EzYBhqMLbdXxFWp\" width=\"680\" height=\"500\" srcset=\"https://gov.gitcoin.co/uploads/db4391/optimized/2X/9/997bbf269308796566d6f445b041e7d7ca0e8911_2_680x500.jpeg, https://gov.gitcoin.co/uploads/db4391/original/2X/9/997bbf269308796566d6f445b041e7d7ca0e8911.jpeg 1.5x, https://gov.gitcoin.co/uploads/db4391/original/2X/9/997bbf269308796566d6f445b041e7d7ca0e8911.jpeg 2x\" data-dominant-color=\"887963\"></a></div><br>\n<img src=\"https://gov.gitcoin.co/uploads/db4391/original/2X/e/e7976576f1edcbf91a88f6060a1f9ca77ab6dd78.jpeg\" alt=\"EcoResort Property Images Table 1\" data-base62-sha1=\"x2KEYiWBWbZsr9xnb7aI1CDaF0Q\" width=\"648\" height=\"223\"><p></p>\n<p><strong>WHY France?</strong></p>\n<p>In homage to public goods and public goods funding, the properties that will be considered are properties that are of historical and/or cultural value that are in need of partial restoration.</p>\n<p><strong>Why?</strong></p>\n<p>The French government offers a <em>40% subsidy</em> for restoration and preservation costs for historical and/or cultural buildings. The country has a wealth of chateaux that are withering in neglect.</p>\n<p>With astute curation, a property can be purchased, restored with the help of the French government’s subsidies, thus providing needed work for regional artisans and craftsmen.  The final result is that of cultural preservation and public goods longevity while enhancing the personal wealth of the property owner.</p>\n<p><strong>USE CASE Example (Already Exists in Market)</strong></p>\n<p><img src=\"https://gov.gitcoin.co/images/emoji/twitter/sushi.png?v=12\" title=\":sushi:\" class=\"emoji only-emoji\" alt=\":sushi:\" loading=\"lazy\" width=\"20\" height=\"20\"><em>Chateaushi</em> - This is an historical property development consortium that is crypto friendly. They offer fractional ownership of properties using a membership model. Their approach is one of luxury with strategic partnerships now in place with the former editor of the Michelin Guide, several celebrity chefs and other luxury travel tie-ins.</p>\n<p><strong>Tokenized Property As A Public Good</strong></p>\n<p>Here in this proposal, we seek to honor the Gitcoin Community’s dedication to public goods, ecosystem cultivation and growth, and shared, enriching experiences that offer sustainable outcomes.</p>\n<p>In this regard, we propose that we entertain strategic partnerships with Solar Punk, ReGen, Kundalini Yoga and clean energy communities and more like minded tribes…</p>\n<p>Clean Energy Hubs: The really long vision is to build these RWA communities into clean energy hubs where solar energy, and one day, fusion energy, is farmed for our own use and the use of the surrounding communities. (More on that to come…).</p>\n<p><strong>Business Model</strong></p>\n<p>We are considering two business models, with an emphasis on the first:</p>\n<p>An <strong>EcoResort &amp;/or Co-Working Residence</strong> with suitable accommodations for multiples of groups, can be purchased outright by GitcoinDAO or the Gitcoin Foundation or a partnership between the two. The RWA is held in trust and maintained in the Treasury portfolio as a valuable, tradeable hard asset.</p>\n<p>This approach works for the following reasons:</p>\n<ul>\n<li>\n<p><strong>2024 is the \"year of RWAs’ (BlockWorks)</strong></p>\n</li>\n<li>\n<p>Gitcoin DAO is looking to be a ‘product/ protocol’ DAO with diverse offerings to the community</p>\n</li>\n<li>\n<p>Diversifying treasury holdings into something tangible and substantive such as real estate further strengthens the responsible fiscal position of the DAO</p>\n</li>\n</ul>\n<p>Offering fractional Property Use Rights into RWA holdings for the larger Gitcoin community means that the community members can begin their own real estate fractional use  journey ( such as like Pacaso, Homebase, traditional timeshares);</p>\n<p>Community members and the different grantee orgs can continue building community and relationships within and among the Gitcoin Grantee ecosystems; Depending on the strategic property investments - agriculture yielding / winery/ EcoResort - the property could be self-sustaining and,  eventually, show revenue from local production in addition to revenue generated by accommodations use and appreciation of real value in real estate ownership.</p>\n<p><strong>Business Model <span class=\"hashtag-raw\">#2</span></strong></p>\n<p>Launch on Grant Stack as a funding round.  We approach capital investors who would then take the position of the holder of the RWA asset. In return, they would match fund in a QF round the Property Use Right fractional ownership purchases that the individual Gitcoin grantee community members and orgs raise.</p>\n<p>This would function as a traditional QF Round, except in this case the match funders would retain the deed to the property that is purchased using their capital. But they would share their capital investment by match funding using the QF formula. Each amount raised by community members, who seek to become fractional owners in the property by purchasing Property Use Rights as outlined above, would be match funded by said benefactor/ capital investor.</p>\n<p><strong>Monetization Models  -  Gitcoin Foundation Retains Property Deed, Fractionalizes Time Unit Purchases (TUP - see monetization break down above)</strong></p>\n<p><strong>Property Example B:</strong></p>\n<p>Eco-Resort -  Former 4-star hotel property near Sarlat, Dordogne, France</p>\n<ul>\n<li>Fully Furnished, recently renovated</li>\n<li>Restaurant</li>\n<li>Lounge</li>\n<li>Reception</li>\n<li>Staff Accommodations (Four Bedroom/ Four Living Room Stone House)</li>\n<li>Barns and Outbuildings</li>\n<li>Suitable for Horses</li>\n<li>Guesthouse/Gite</li>\n<li>Swimming Pool</li>\n<li>Two estuaries</li>\n<li>Wooded Park, hundred year old trees</li>\n<li>Lake</li>\n<li>Wheelchair accessible</li>\n<li>Outdoor Terrace and Lounge</li>\n</ul>\n<p></p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://gov.gitcoin.co/uploads/db4391/original/2X/0/0bcce7290490375bc483fbe2f15abe450fae68dd.jpeg\" data-download-href=\"https://gov.gitcoin.co/uploads/db4391/0bcce7290490375bc483fbe2f15abe450fae68dd\" title=\"EcoResort Property Images 39 room 4 Star Resort\"><img src=\"https://gov.gitcoin.co/uploads/db4391/optimized/2X/0/0bcce7290490375bc483fbe2f15abe450fae68dd_2_690x473.jpeg\" alt=\"EcoResort Property Images 39 room 4 Star Resort\" data-base62-sha1=\"1GofNj5wX4Tm7k7z6lVBqAiJCBn\" width=\"690\" height=\"473\" srcset=\"https://gov.gitcoin.co/uploads/db4391/optimized/2X/0/0bcce7290490375bc483fbe2f15abe450fae68dd_2_690x473.jpeg, https://gov.gitcoin.co/uploads/db4391/original/2X/0/0bcce7290490375bc483fbe2f15abe450fae68dd.jpeg 1.5x, https://gov.gitcoin.co/uploads/db4391/original/2X/0/0bcce7290490375bc483fbe2f15abe450fae68dd.jpeg 2x\" data-dominant-color=\"556541\"></a></div><p></p>\n<p></p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://gov.gitcoin.co/uploads/db4391/original/2X/d/d2de0bb5553d2f09f8f1f724eb3ae2056114504e.jpeg\" data-download-href=\"https://gov.gitcoin.co/uploads/db4391/d2de0bb5553d2f09f8f1f724eb3ae2056114504e\" title=\"EcoResort Property Images Table 2\"><img src=\"https://gov.gitcoin.co/uploads/db4391/optimized/2X/d/d2de0bb5553d2f09f8f1f724eb3ae2056114504e_2_690x240.jpeg\" alt=\"EcoResort Property Images Table 2\" data-base62-sha1=\"u5pZYq1TzG7LmLq9bpucUZujv0G\" width=\"690\" height=\"240\" srcset=\"https://gov.gitcoin.co/uploads/db4391/optimized/2X/d/d2de0bb5553d2f09f8f1f724eb3ae2056114504e_2_690x240.jpeg, https://gov.gitcoin.co/uploads/db4391/original/2X/d/d2de0bb5553d2f09f8f1f724eb3ae2056114504e.jpeg 1.5x, https://gov.gitcoin.co/uploads/db4391/original/2X/d/d2de0bb5553d2f09f8f1f724eb3ae2056114504e.jpeg 2x\" data-dominant-color=\"CAD1C7\"></a></div><p></p>\n<p>**35 Rooms - Time Unit 2 weeks =  Total  875 Units **</p>\n<p>**Each Unit sells for EURO 8000  =    EURO  7 Million **</p>\n<p>**Time Unit Purchase (TUP) entitles owner to: **</p>\n<p><strong>Use of 2 consecutive weeks of double occupancy room during the calendar year (of the 50 available weeks)</strong></p>\n<p>Duration of use is 5 years (i.e. 2 weeks per year for 5 years) at which time the holder has the option to renew at a highly favorable market price or to ‘sell’ back to the foundation or on the second market within the Gitcoin ecosystem. (This is to prevent single owners or groups from sitting on Property Use Right units for unlimited lengths of time).</p>\n<p>Owner Use fee - while in residence, the owner-guests will pay a weekly linen, property use and upkeep fee (about EURO 500 per week). This may or may not include light snacks and breakfast. The owner use fees will go towards property upkeep, housekeeping and maintenance.</p>\n<p>*At full occupancy of 35 rooms x 500 Per Owners Use Fee = €17500 per week  (for staff, food, property upkeep, etc).</p>\n<p><strong>Owner Qualifications:</strong></p>\n<ul>\n<li>Past or present Gitcoin Grantee</li>\n</ul>\n<p>Must hold onto the TUP NFT for at least 12 months (before trading or selling)<br>\nCan trade time/ use with other Approved Members (on internal booking site)<br>\nAfter 5 years have priority to renew TUP purchase for an additional 5 years at a preferential price (If they don’t renew, the TUP reverts to the marketplace administered by Gitcoin where the holder/seller is credited with the majority of the selling price, less an admin fee kept by Gitcoin Foundation/DAO)<br>\nGitcoin adjacent groups (example Optimism, Arbitrum, Giveth, Polygon, Filecoin, Lido, 1Inch, etc.) can pre-book entire property for DAO/Org functions with due consideration for others’ booked time.</p>\n<p></p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://gov.gitcoin.co/uploads/db4391/original/2X/5/5ed2acfe8770d00136f3a7f4544fa2f0f4f8e1df.jpeg\" data-download-href=\"https://gov.gitcoin.co/uploads/db4391/5ed2acfe8770d00136f3a7f4544fa2f0f4f8e1df\" title=\"EcoResort Property Images  Chateau with additional buildings\"><img src=\"https://gov.gitcoin.co/uploads/db4391/optimized/2X/5/5ed2acfe8770d00136f3a7f4544fa2f0f4f8e1df_2_690x388.jpeg\" alt=\"EcoResort Property Images  Chateau with additional buildings\" data-base62-sha1=\"dwQfGlXD4Od0W1buYO4lYA4Z41V\" width=\"690\" height=\"388\" srcset=\"https://gov.gitcoin.co/uploads/db4391/optimized/2X/5/5ed2acfe8770d00136f3a7f4544fa2f0f4f8e1df_2_690x388.jpeg, https://gov.gitcoin.co/uploads/db4391/original/2X/5/5ed2acfe8770d00136f3a7f4544fa2f0f4f8e1df.jpeg 1.5x, https://gov.gitcoin.co/uploads/db4391/original/2X/5/5ed2acfe8770d00136f3a7f4544fa2f0f4f8e1df.jpeg 2x\" data-dominant-color=\"59614A\"></a></div><p></p>\n<ul>\n<li>7 Rooms, 7 Baths</li>\n<li>2 Bedroom (separate) Apartment</li>\n<li>2 Bedroom (separate) Gite</li>\n<li>52 HA forest and Agricultural land</li>\n<li>Extensive Outbuildings - including Pigeon House</li>\n<li>Swimming pool, tennis courts, Stables</li>\n<li>Near Lake</li>\n<li>2 Hours to Nice airport</li>\n<li>Property Cost: EURO 2.5M + tax</li>\n<li>Fractional Ownership of 50 weeks X 11 Rooms (TUP = Time Unit Purchase)</li>\n</ul>\n<p><img src=\"https://gov.gitcoin.co/uploads/db4391/original/2X/9/9c3c943ebf21fa12d2b31ef796510005dbc98eb0.jpeg\" alt=\"EcoResort Property Images Table 3\" data-base62-sha1=\"mi8h4VxRgPJ4rcGSU3OmrA5RAC4\" width=\"649\" height=\"310\"></p>\n<p>1 Room -  Time Unit 2 weeks (of 50 week year)  =   25 Units</p>\n<p>7 Rooms - Time Unit 2 weeks =  Total  175 Units</p>\n<p>1 Separate Two Bedroom House = Total 25 Units</p>\n<p>1 Separate Two Bedroom Apartment = Total 25 Units</p>\n<p>Each Room Unit sells for EURO 12000<br>\nEach 2BD Single Dwelling sells for EURO 22K Per Unit   =    EURO  3.2 Million</p>\n<p>*The water availability and acreage of this property opens up the possibility to construct Tiny Homes around the land for use as dwellings sold as RWAs per Time Unit Purchase.</p>\n<p><strong>Time Unit Purchase (TUP) entitles owner to:</strong></p>\n<ul>\n<li>Use of 2 consecutive weeks of double occupancy room during the calendar year (of the 50 available weeks)</li>\n<li>Use is for 5 years, after which the RWA leasehold must be renewed at purchaser’s original price or can be sold on the secondary market at market competitive prices</li>\n<li>Note: Use cost while on-premise for linens, upkeep, housekeeping, grounds maintenance an additional  $500/ wk</li>\n</ul>\n<p><strong>OPTIONS for Loan Funding - SBA Loans 7(a) and 504</strong></p>\n<p><strong>SBA 7(a)</strong> loans are more common and can be used to purchase or refinance owner-occupied commercial real estate at any amount up to $5 million. To qualify, investors must have good credit and put down at least 10 percent of the property’s purchase price. The term of the loan can be up to 25 years, and interest rates can vary based on current market conditions and the applicant’s qualifications.</p>\n<p><strong>SBA 504</strong> loans are similar to their 7(a) counterparts; however, there is no limit to how much an investor can borrow. Investors must have good credit and provide a down payment of 10 percent of the purchase price. The term of the loan is typically 20 years, and the investor must occupy at least 51 percent of the property. Unlike SBA 7(a) loans, these mortgages are not funded entirely through a private lender. Instead, they are made available through Certified Development Companies (CDCs), nonprofit entities that promote economic development within their communities. Typically, a commercial lender funds 50 percent of the project, and a CDC finances up to 40 percent.</p>\n<p>Please post your thoughts, suggestions, feedback here <img src=\"https://gov.gitcoin.co/images/emoji/twitter/pray/4.png?v=12\" title=\":pray:t4:\" class=\"emoji\" alt=\":pray:t4:\" loading=\"lazy\" width=\"20\" height=\"20\">.</p>\n<p>And feel free to reach out to Paige &amp;/or Alex on Telegram:<br>\n<a class=\"mention\" href=\"https://gov.gitcoin.co/u/paigedao\">@PaigeDAO</a><br>\n<span class=\"mention\">@akim0x</span></p>\n            <p><small>14 posts - 4 participants</small></p>\n            <p><a href=\"https://gov.gitcoin.co/t/community-owned-eco-resort-through-fractional-property-use-rights/18957\">Read full topic</a></p>","link":"https://gov.gitcoin.co/t/community-owned-eco-resort-through-fractional-property-use-rights/18957","pubDate":"Fri, 07 Jun 2024 17:40:17 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"gov.gitcoin.co-topic-18957"},"source":{"@url":"https://gov.gitcoin.co/t/community-owned-eco-resort-through-fractional-property-use-rights/18957.rss","#text":"Community Owned Eco-Resort Through Fractional Property Use Rights"}},{"title":"CCN Climate Solutions Round Retro","dc:creator":"jon-spark-eco","category":"🌱 Gitcoin Grants","description":"<p></p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://gov.gitcoin.co/uploads/db4391/original/2X/2/212df3f905d9d4f5233db7ac3e68c0e66dc59afa.png\" data-download-href=\"https://gov.gitcoin.co/uploads/db4391/212df3f905d9d4f5233db7ac3e68c0e66dc59afa\" title=\"CCN Logo 2.0 Banner\"><img src=\"https://gov.gitcoin.co/uploads/db4391/optimized/2X/2/212df3f905d9d4f5233db7ac3e68c0e66dc59afa_2_345x153.png\" alt=\"CCN Logo 2.0 Banner\" data-base62-sha1=\"4Jwd2PiKluUHLVe83VyT9c4OOpQ\" width=\"345\" height=\"153\" srcset=\"https://gov.gitcoin.co/uploads/db4391/optimized/2X/2/212df3f905d9d4f5233db7ac3e68c0e66dc59afa_2_345x153.png, https://gov.gitcoin.co/uploads/db4391/optimized/2X/2/212df3f905d9d4f5233db7ac3e68c0e66dc59afa_2_517x229.png 1.5x, https://gov.gitcoin.co/uploads/db4391/optimized/2X/2/212df3f905d9d4f5233db7ac3e68c0e66dc59afa_2_690x306.png 2x\" data-dominant-color=\"D1DADD\"></a></div><p></p>\n<h2><a name=\"round-description-1\" class=\"anchor\" href=\"https://gov.gitcoin.co#round-description-1\"></a>Round Description</h2>\n<p>The <a href=\"https://climatecoordination.org/\" rel=\"noopener nofollow ugc\">Climate Coordination Network</a> believes that Climate Action is the ultimate public good. Why? Because climate change increasingly impacts everyone worldwide. Our mission is to accelerate community-supported climate solutions on a global scale, catalyzing diverse forms of climate action to create a sustainable and equitable future for all.</p>\n<p>The GG20 Climate Solutions Round provides strategic grant distribution to support global climate solutions projects.</p>\n<h2><a name=\"round-objectives-2\" class=\"anchor\" href=\"https://gov.gitcoin.co#round-objectives-2\"></a>Round Objectives</h2>\n<ol>\n<li>To empower climate projects that are dedicated to reducing greenhouse gas emissions and serve as core infrastructure for Web3 climate solutions.</li>\n<li>To build community and accelerate coordination to help grow the greater public goods for climate solutions worldwide.</li>\n<li>To test and improve impact metrics tools that enable climate projects to showcase their real-world impact for more effective and streamlined measurement and evaluation.</li>\n</ol>\n<h2><a name=\"target-audience-and-participation-3\" class=\"anchor\" href=\"https://gov.gitcoin.co#target-audience-and-participation-3\"></a>Target Audience and Participation</h2>\n<p>The Climate Solutions Round focuses on supporting early-stage projects within the following 9 categories of climate solutions:</p>\n<ol>\n<li>Renewable Energy</li>\n<li>Oracles &amp; dMRV</li>\n<li>Carbon Accounting</li>\n<li>Climate Activism/Education</li>\n<li>Nature-Based Solutions</li>\n<li>Ocean-Based Solutions</li>\n<li>Climate Adaptation/Climate Resilience</li>\n<li>Supply Chain Solutions</li>\n<li>Built Environment/Transportation</li>\n</ol>\n<h2><a name=\"climate-solution-round-implementation-4\" class=\"anchor\" href=\"https://gov.gitcoin.co#climate-solution-round-implementation-4\"></a>Climate Solution Round Implementation</h2>\n<p>The Climate Coordination Network (CCN) is a dedicated team of six people from around the world who have served for the past two years on the Gitcoin Climate Advisory team and have managed the decentralized climate round since GG19. The team is familiar with Gitcoin Grants round setup and management, and we divide up the many tasks based on skill set and availability. To set up the GG20 Climate Solutions round, we reviewed the <a href=\"https://climatecoordination.org/climate-solutions-round-eligibility\" rel=\"noopener nofollow ugc\">eligibility criteria</a>, updated the <a href=\"https://climatecoordination.org/\" rel=\"noopener nofollow ugc\">CCN Climate Solutions Portal</a>, started communications and outreach, created the new Climate Solutions Metrics Garden and updated grantee resources such as onboarding videos and review process documentation.</p>\n<p>Our main challenges for GG20 involved our Climate Grantee review process. Most of our projects are making IRL impact, which is difficult to evaluate as it tends to be qualitative vs. quantitative. We strive to improve this process each round and for GG20, we utilized Checker (<a href=\"https://gov.gitcoin.co/t/introducing-checker/17292\">a new tool built by Gitcoin</a>) to help with the lengthy process of reviewing 173 diverse grantee applications. Unlike OSS rounds, Checkers AI features didn’t really help us review climate projects. In the future, the AI model could be trained to provide useful feedback but for now, it was not effective. In past rounds, we used spreadsheet tools for the evaluation process. Checker provided a nice interface that gathered the information needed to complete our reviews. We hope to see something like Checker integrated into Grants Stack, as the approvals and rejections are still manual. We experienced technical issues with Grants Stack which did not allow us to export our grantee contact information, which caused a breakdown in communication with our grantees for most of the round.</p>\n<p>Going forward, we are discussing a new process that will streamline, simplify, and clarify climate reviews by requiring dMRV for certain types of projects and impact reporting using tools such as Hypercerts and KarmaGAP. We will require all of our grantees to use KarmaGAP to provide 2-3 milestones they will accomplish with the funding received during GG20. This requirement will enable grantees to showcase their impact and significantly reduce our time during the review process in future rounds.</p>\n<p>The Climate Solutions Round’s unique feature/approach is that we cultivate a supportive community that results in ongoing productive relationships and collaborations. During our review of grant proposals from projects that have been in multiple rounds, we found clear examples of grantees helping each other and working together to accomplish goals and address challenges. For example, as we transition to clearer requirements for impact metrics, many grantees are working with a Silvi Protocol, a long-time trusted dMRV project with an amazing web3 tech stack. Another example of climate grantees supporting each other is Helpers Social Development Foundation, a community-led NGO in Nigeria that is developing solar-powered community centers in partnership with The Solar Foundation and is also working to pilot a IoT smart metering device built by Switch Electric (also a grantee based in Nigeria).</p>\n<h2><a name=\"outcomes-and-statistics-5\" class=\"anchor\" href=\"https://gov.gitcoin.co#outcomes-and-statistics-5\"></a>Outcomes and Statistics</h2>\n<ul>\n<li><a href=\"https://reportcards.gitcoin.co/42161/29\" rel=\"noopener nofollow ugc\">Report card</a></li>\n<li>129 Climate Solutions Grantees</li>\n<li>Total crowdfunding: $58k</li>\n<li>9,314 contributions</li>\n<li>2,262 unique donors</li>\n<li>Average contribution: $4.08</li>\n</ul>\n<p>Summary of the past three rounds shows growth round over round.<br>\n<img src=\"https://gov.gitcoin.co/uploads/db4391/original/2X/7/714564dcaaeddfc1458f3be061ee1c51aeaeabe1.png\" alt=\"\" data-base62-sha1=\"ga2D47egHIife87SZQMWa5ES4xz\" width=\"572\" height=\"163\" role=\"presentation\"></p>\n<h2><a name=\"round-matching-results-6\" class=\"anchor\" href=\"https://gov.gitcoin.co#round-matching-results-6\"></a>Round Matching Results</h2>\n<p>After the round, we evaluated the matching estimates using several different methods: COCM, QF, and Pairwise. We then had a long internal debate about the best way to calculate the results. While most, if not all, other rounds followed Gitcoins’ lead and used COCM, we found it was not a good fit for our community. COCM looks at the interconnection between donors and their donation behavior and rewards projects with diverse donors who contribute to a variety of other projects and penalizes those that have donors who only contributed to one project. COCM produces a fairer outcome in many rounds and helps with sybil defense.</p>\n<p>The issue we found is that the climate round is a closely connected community. Most donors contribute to many projects in the round which we love to see. We are proud of the coordination we see within the community, but the issue we saw was the round results were flattened when using the COCM calculations. The projects that had received the most support and signal from the community would not receive a fair share of the matching pool. In some cases this was 60-70% less than they would receive using the QF calculations.</p>\n<p>If we had moved forward with COCM, we would have disincentivized some of our top grantees who had worked so hard in marketing during the round. Because of this, we decided to use the standard QF calculations.</p>\n<p>The round results can be found <a href=\"https://docs.google.com/spreadsheets/d/1n9N9hKp4S4M3DgSblEOuCAexjwl5xzTkdNq2cHdMJk4/edit?usp=sharing\" rel=\"noopener nofollow ugc\">here</a>.</p>\n<h2><a name=\"impact-assessment-7\" class=\"anchor\" href=\"https://gov.gitcoin.co#impact-assessment-7\"></a>Impact Assessment</h2>\n<p>In sum, the GG20 CCN Climate Solutions round impacted 129 climate solutions worldwide (see Climate Impact Map) reducing GHGe, building core infrastructure and—perhaps most importantly—facilitating cooperation and coordination to accelerate climate action. This round, we introduced the <a href=\"https://climatecoordination.org/climate-solutions-metrics-garden-1\" rel=\"noopener nofollow ugc\">Climate Solution Metrics Garden</a> and encouraged Climate Grantees to start utilizing metrics tools such as KarmaGAP and Hypercerts to showcase their impact and set the stage for impact tools, which will be required for participation in future rounds.</p>\n<p>Impact Map for GG20</p>\n<p></p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://gov.gitcoin.co/uploads/db4391/original/2X/0/001a31708ac4d59ae481a1ad9a5ddba98c20d99e.jpeg\" data-download-href=\"https://gov.gitcoin.co/uploads/db4391/001a31708ac4d59ae481a1ad9a5ddba98c20d99e\" title=\"\"><img src=\"https://gov.gitcoin.co/uploads/db4391/optimized/2X/0/001a31708ac4d59ae481a1ad9a5ddba98c20d99e_2_624x351.jpeg\" alt=\"\" data-base62-sha1=\"U7lxQnYaysGb6fBQO4DhUPfVc\" width=\"624\" height=\"351\" role=\"presentation\" srcset=\"https://gov.gitcoin.co/uploads/db4391/optimized/2X/0/001a31708ac4d59ae481a1ad9a5ddba98c20d99e_2_624x351.jpeg, https://gov.gitcoin.co/uploads/db4391/optimized/2X/0/001a31708ac4d59ae481a1ad9a5ddba98c20d99e_2_936x526.jpeg 1.5x, https://gov.gitcoin.co/uploads/db4391/optimized/2X/0/001a31708ac4d59ae481a1ad9a5ddba98c20d99e_2_1248x702.jpeg 2x\" data-dominant-color=\"BBB283\"></a></div><p></p>\n<h2><a name=\"participant-feedback-8\" class=\"anchor\" href=\"https://gov.gitcoin.co#participant-feedback-8\"></a>Participant Feedback</h2>\n<p>“The<a href=\"https://twitter.com/climate_program\" rel=\"noopener nofollow ugc\"> @climate_program</a> is critical. We cannot overstate its importance, through the bear &amp; the bull, this program has provided necessary resources to projects leveraging Web3 for solving real world, real hard problems” — Irthu, Atlantis</p>\n<p>“Silvi would not be here without the support of Gitcoin and the CCN Climate Solutions Rounds. The climate rounds help support our mission to build tools that empower community driven reforestation around the world.” — Djimo Serodio, founder, Silvi Protocol</p>\n<p>“Yes so grateful! Thanks CCN &amp; Gitcoin. This funding is crucial for our ongoing operations and growth.” – Isaiah, co-founder Litter Token</p>\n<h2><a name=\"lessons-learned-and-areas-for-improvements-9\" class=\"anchor\" href=\"https://gov.gitcoin.co#lessons-learned-and-areas-for-improvements-9\"></a>Lessons Learned and Areas for Improvements</h2>\n<ul>\n<li>Utilizing Checker helped for reviewing grants in terms of format and user interface, however, it would be extremely helpful to be able to use the AI to help us in the next round and have Checker integrated into Manager.</li>\n<li>We need to improve and streamline our review process and are currently working on creating the CCN Project Grader to facilitate this goal.</li>\n<li>We have outlined and tested a new process for dispute resolutions and will be refining this process for GG21.</li>\n<li>We’ll work on updating the Eligibility Criteria of the Climate Round based on learning from this round.</li>\n</ul>\n<h2><a name=\"a-big-thank-you-goes-out-to-momus-collective-gitcoin-arbitrum-thankarb-and-celo-public-goods-for-your-support-funding-our-matching-pool-10\" class=\"anchor\" href=\"https://gov.gitcoin.co#a-big-thank-you-goes-out-to-momus-collective-gitcoin-arbitrum-thankarb-and-celo-public-goods-for-your-support-funding-our-matching-pool-10\"></a>A big thank you goes out to Momus Collective, Gitcoin, Arbitrum, ThankARB and Celo Public Goods for your support funding our matching pool!</h2>\n<p><strong>A Note from the Celo Public Goods team</strong></p>\n<p>The preliminary results are in for the Celo Climate bonus round! You can check them out <a href=\"https://x.com/CeloPublicGoods/status/1794339642277523763\" rel=\"noopener nofollow ugc\">here</a>.</p>\n<p>For the payout process, we are first asking that accepted projects visit the new <a href=\"https://gap.karmahq.xyz/celopg\" rel=\"noopener nofollow ugc\">Celo Public Goods Community Grants Karma GAP</a> dashboard to review the Celo-related claims made in your applications and to add specific Milestones or Updates related to your project’s development with Celo. For an excellent example, take a look at <a href=\"https://gap.karmahq.xyz/project/kokonut-network-perpetual-value-ecosystem-1/grants?grantId=0x90ca32b750fc99e360b0af45c05bb10a083e879fff845d1ca83062dc73b8d71f&amp;tab=milestones-and-updates\" rel=\"noopener nofollow ugc\">Kokonut Network’s</a> page. Projects that effectively provide these updates may also increase their eligibility and reward potential for future Celo rounds coming soon!</p>\n<p>A heartfelt thank you to CCN and the entire Climate and ReFi community for your continuous support and dedication. We look forward to seeing the incredible progress you will make with the support of these grants and are excited for the opportunities ahead.</p>\n<h2><a name=\"closing-thoughts-11\" class=\"anchor\" href=\"https://gov.gitcoin.co#closing-thoughts-11\"></a>Closing Thoughts</h2>\n<p>CCN greatly appreciated the opportunity to participate as a Gitcoin Community Round for GG20 and we look forward to mutually beneficial partnerships and collaborations in the future.</p>\n<p><img src=\"https://gov.gitcoin.co/uploads/db4391/original/2X/0/00aff23752372edb5ded9c09fb17f8b14490a894.jpeg\" alt=\"8st9gh\" data-base62-sha1=\"64XHowhq7wng9vASv1rQSogWkk\" width=\"588\" height=\"424\"></p>\n            <p><small>9 posts - 7 participants</small></p>\n            <p><a href=\"https://gov.gitcoin.co/t/ccn-climate-solutions-round-retro/18940\">Read full topic</a></p>","link":"https://gov.gitcoin.co/t/ccn-climate-solutions-round-retro/18940","pubDate":"Wed, 05 Jun 2024 01:53:30 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"gov.gitcoin.co-topic-18940"},"source":{"@url":"https://gov.gitcoin.co/t/ccn-climate-solutions-round-retro/18940.rss","#text":"CCN Climate Solutions Round Retro"}},{"title":"Retrospective of the Zuzalu Gitcoin Rounds and Suggestions","dc:creator":"noahchonlee","category":"🌱 Gitcoin Grants","description":"<p>There have been multiple <strong>Zuzalu Gitcoin rounds</strong>:<br>\n<strong>The Zuzalu Continuous Innovation round</strong> from 15 Aug 2023 to 29 Aug 2023 focused on tech projects with a few events included that I was the manager of: <a href=\"https://reportcards.gitcoin.co/10/0x5b95acf46c73fd116f0fedadcbedf453530e35d0\" class=\"inline-onebox\" rel=\"noopener nofollow ugc\">Zuzalu Continuous Innovation | Gitcoin Round Report Card</a><br>\n(Love the new report cards BTW, thank you whoever did that)</p>\n<p><strong>The Q1 tech round and events round</strong> from 30 Jan to 23 Feb that Chance was the manager of:<br>\nTech - <a href=\"https://reportcards.gitcoin.co/10/0xd875fa07bedce182377ee54488f08f017cb163d4\" class=\"inline-onebox\" rel=\"noopener nofollow ugc\">Zuzalu Q1-Tech Round | Gitcoin Round Report Card</a><br>\nEvents - <a href=\"https://reportcards.gitcoin.co/10/0xf89aad3fad6c3e79ffa3ccc835620fcc7e55f919\" class=\"inline-onebox\" rel=\"noopener nofollow ugc\">Zuzalu Q1-Events Round | Gitcoin Round Report Card</a></p>\n<p>This post is suddenly relevant as the <strong>stewards for the third series of Zuzalu rounds were chosen yesterday.</strong></p>\n<p>Writing this now to gather my thoughts to hopefully learn from the previous experiences. Sharing here in case it is helpful for anyone else and so the Gitcoin community who has helped make Zuzalu possible can be included.</p>\n<p><strong>Process for choosing the manager for Continuous Innovation:</strong><br>\nBasically Janine called me up and asked if I wanted to do it and offered me $35/hr in pay and I tracked my time in ClickUp.</p>\n<p><strong>Process for choosing the manager for the Q1 rounds:</strong><br>\nI think a few people including Vitalik, Janine, Nicole etc. reached out to Chance who managed the round as a volunteer (Huge kudos for that and I wish I was working with him on the upcoming round.)</p>\n<p><strong>Process for choosing the managers/stewards for Q2 rounds</strong> (one event and one tech round):<br>\nSejal posted in the Zuzalu forum that people could self-nominate to be a steward, and voting was held where three stewards would be chosen for each round. Voters could choose their top three choices for each round and whichever 3 at the end who had the most were chosen yesterday. I’m one of the tech round stewards.<br>\n<strong>I think people should be able to form parties</strong> and have 3 people apply together. The reason is because otherwise individuals might end up being chosen who do not want to work together. (I’m happy with the people I’m working with in the tech round luckily but I see how this can go wrong) This should avoid getting locked into a 2-party system if we are using approval voting instead of first pas the post.</p>\n<p><strong>What I did for the first round:</strong><br>\n-Announcements about the round reminding people to apply<br>\n-DMing Zuzaluans with projects we thought should be included<br>\n-Messaging and calling with some applicants who I didn’t know to see if they were ligit<br>\n-Co-writing video calls during which people wrote up their projects and sharing tips on how to write it or use markdown such as how to include pictures<br>\nAnswering a bunch of community questions, mostly when people were having difficulty donating.</p>\n<p>Then for choosing which projects to accept in the end, there were a couple calls with Marine, Janine, and Nicole where we looked through the applicants, their twitters, websites, if we knew them, and if they matched the criteria.</p>\n<p><strong>Donations:</strong><br>\nDuring donations, we received a lot of feedback that adding enough stamps to Gitcoin passport for many people was impossible for achieving a matching score and that the process was excruciating. I am very glad we have other options now.</p>\n<p>For the Q1 rounds, we ended up saying if anyone has a Zupass they would receive full matching, and after some discussion with Umar and others matching funds were disbursed half according to what Zupass holders donated to and half according to what others donated to.</p>\n<p>For these Q2 rounds, I made this <strong>suggestion of adding someone’s legal name as a proof of personhood</strong> deciding whether to match a donor’s contributions. That can be obtained with a credit card payment: <a href=\"https://gov.gitcoin.co/t/10-000-donated-to-gitcoin-zuzalu-round-with-credit-card-pilot-project-proposal/18827\" class=\"inline-onebox\">$10,000 Donated to Gitcoin Zuzalu Round with Credit Card Pilot Project Proposal</a><br>\nConsidering someone could get matching with on-chain history using model based detection and/or this method, that means they could donate two times total using each method once and get more matching. This would allow a sort of 2x Sybil, but may also encourage more total donations and could allow donations for billions of non-crypto users. With that trade-off in mind, it depends on if the current Zuzalu round stewards decide to also accept this proof of personhood.</p>\n<p><strong>Criteria:</strong><br>\n<strong>For the Continuous Innovation Round</strong> it was super broad basically saying if it supports the Zuzalu mission and values it can qualify (plus looking ligit), it’s open source, and noting that if you are a Zuzaluan then you are more likely to have the project accepted.<br>\nZuzalu mission (from a workshop I and Rachel and Dimi held during Zuzalu where we broke participants into small groups to answer a form with 10 questions, then a smaller team reviewed those answers and refined it into this) - to foster a global network of communities to advance humanity by creating playgrounds at the intersection of free and open technology, health, science and social innovation<br>\nValues: Authentic Kindness, Mutual Respect, Personal Growth, Freedom</p>\n<p><strong>For the Q1 rounds the criteria was:</strong><br>\n“Technology projects must be fully open-source, relevant to the needs of in-person Zuzalu events, and blockchain components must be maximally compatible with applicable Ethereum ecosystem standards.<br>\nEvents projects must be what is reasonably understood as a “Zuzalu event”: roughly, a long-duration in-person gathering whose goal is to experiment with open frontier digital and social technologies.<br>\nContributions may be retroactive in intent, supporting events that have already happened! So eg. an event that takes place in Q1 is eligible for funding in both Q1 and Q2, just as an event that takes place in Q2 would be.”</p>\n<p>In the end, the events round was somewhat controversial considering it featured everything from a small retreat of several friends living together to hackerhouses to a single person’s efforts supporting an event to an entire team with a full on 8 week pop up village with 200 people.</p>\n<p>I am not an events round steward but made this suggestion:</p>\n<ul>\n<li>Is at least 2 weeks in duration</li>\n<li>Has a topic focused on at least one of the original Zuzalu tracks</li>\n<li>Core team includes at least one resident of Zuzalu or participant in ZuConnect</li>\n<li>Includes aspects of co-living</li>\n<li>Includes a co-created schedule</li>\n<li>Includes coworking on meaningful projects</li>\n<li>Between 50-300 residents anticipated</li>\n</ul>\n<p>There won’t be any perfect criteria but since we need to pick something it might be nice to add some minimum numbers for residents and how long it has to be. I figure if it is longer than 2 weeks without any limit for how long it can be maybe that even incentivizes some long-term projects, permanent village projects, etc. (without it just being another grouphouse, hackerhouse, or paid for vacation of friends) Also maybe it’s worth adding a cap to how many residents it can be (somewhere 150-300.) I think a lot of the magic of the original Zuzalu is that it was close to a Dunbar sized number and I wonder if it would lose that if it got too big</p>\n<p>For tech round I think there has not been much controversy, so perhaps we can stick to similar criteria:</p>\n<ul>\n<li>Matches the Zuzalu mission and values</li>\n<li>Open source</li>\n<li>Fits into one of the original Zuzalu topic tracks</li>\n<li>More likely to be chosen if there are Zuzalu or Zuconnect residents as team members</li>\n<li>Blockchain components must be maximally compatible with applicable Ethereum ecosystem standards</li>\n<li>Relevant to the needs of in-person Zuzalu events</li>\n</ul>\n<p>For what a Zuzalu event is, here’s the best I can think of on that: <a href=\"https://www.noahchonlee.com/post/what-is-a-zuzalu-style-event\" rel=\"noopener nofollow ugc\">https://www.noahchonlee.com/post/what-is-a-zuzalu-style-event</a></p>\n<p>I am writing this while in Zanzalu in Zanzibar. It’s funny that one year ago as I was managing the first Zuzalu round I was also in Zanzibar and there had only been Zuzalu event and now there has been around 7ish (see here: <a href=\"https://nsforum.net/post/kjzl6cwe1jw149zs6m44uatxf7329r981pm9zb21fm87co39vl5igm0xnuezp5d\" rel=\"noopener nofollow ugc\">https://nsforum.net/post/kjzl6cwe1jw149zs6m44uatxf7329r981pm9zb21fm87co39vl5igm0xnuezp5d</a>)<br>\nI am very grateful to Vitalik and Gitcoin for all their support and it makes the work I am doing today possible (I ran out of funds last time I was in Africa until Gitcoin saved my ass, see here: <a href=\"https://gov.gitcoin.co/t/gitcoin-appreciations-thread/18332/2\" class=\"inline-onebox\">Gitcoin Appreciations Thread - #2 by Sov</a>)</p>\n<p>I’m sure we will make plenty more mistakes along the way but it’s great to see this progress and I’m glad for this whole community! I would welcome input on all this, how could we could improve this process or criteria?</p>\n            <p><small>1 post - 1 participant</small></p>\n            <p><a href=\"https://gov.gitcoin.co/t/retrospective-of-the-zuzalu-gitcoin-rounds-and-suggestions/18933\">Read full topic</a></p>","link":"https://gov.gitcoin.co/t/retrospective-of-the-zuzalu-gitcoin-rounds-and-suggestions/18933","pubDate":"Tue, 04 Jun 2024 09:25:48 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"gov.gitcoin.co-topic-18933"},"source":{"@url":"https://gov.gitcoin.co/t/retrospective-of-the-zuzalu-gitcoin-rounds-and-suggestions/18933.rss","#text":"Retrospective of the Zuzalu Gitcoin Rounds and Suggestions"}},{"title":"Retrospective of the Hypercerts Ecosystem Round during GG20","dc:creator":"holke","category":"🌱 Gitcoin Grants","description":"<h1><a name=\"first-ever-hypercerts-ecosystem-round-1\" class=\"anchor\" href=\"https://gov.gitcoin.co#first-ever-hypercerts-ecosystem-round-1\"></a>First ever Hypercerts Ecosystem Round</h1>\n<p>The Hypercerts Foundation and Community proudly conducted our first community round on Gitcoin during GG20.</p>\n<p>Thank you to <a class=\"mention\" href=\"https://gov.gitcoin.co/u/jon-spark-eco\">@jon-spark-eco</a>, <a class=\"mention\" href=\"https://gov.gitcoin.co/u/decentralizedceo\">@Decentralizedceo</a> and <a class=\"mention\" href=\"https://gov.gitcoin.co/u/mortech\">@mortech</a> for the support from the Hypercerts Community and <a class=\"mention\" href=\"https://gov.gitcoin.co/u/mathildadv\">@MathildaDV</a>, <a class=\"mention\" href=\"https://gov.gitcoin.co/u/sov\">@Sov</a>, Lina, <a class=\"mention\" href=\"https://gov.gitcoin.co/u/cici\">@cici</a>, Drew, <a class=\"mention\" href=\"https://gov.gitcoin.co/u/meglister\">@meglister</a> from the Gitcoin team and support!</p>\n<h1><a name=\"the-hypercerts-ecosystem-2\" class=\"anchor\" href=\"https://gov.gitcoin.co#the-hypercerts-ecosystem-2\"></a>The Hypercerts Ecosystem</h1>\n<p>The mission of the Hypercerts Foundation is to advance the development and adoption of open-source protocols for funding and rewarding positive impact.</p>\n<p>We organised this round for the hypercerts ecosystem to empower and support projects that build on the hypercerts primitives. By increasing the adoption of hypercerts across funding mechanisms and platforms, we aim to transform isolated platforms into <strong>interconnected, dynamic funding networks</strong>.</p>\n<h2><a name=\"types-of-projects-in-the-hypercerts-ecosystem-3\" class=\"anchor\" href=\"https://gov.gitcoin.co#types-of-projects-in-the-hypercerts-ecosystem-3\"></a>Types of Projects in the Hypercerts Ecosystem</h2>\n<p>We focused on supporting projects in the following categories:</p>\n<ol>\n<li><strong>New Applications</strong>: Projects developing new applications, like prize competitions leveraging the hypercerts infrastructure.</li>\n<li><strong>Integrations</strong>: Projects integrating hypercerts into existing funding platforms, similar to the integration with Gitcoin.</li>\n<li><strong>Tooling</strong>: Projects building tools to extend functionality for multiple integrations and applications, such as Deresy for coordinating evaluators.</li>\n<li><strong>Pilot Use Cases</strong>: Tangible use cases piloting new functionalities, e.g., implementing retroactive funding rounds with hypercerts or using hyperboards.</li>\n<li><strong>Community Support (DevRel)</strong>: Projects or individuals providing technical expertise to the community.</li>\n</ol>\n<p></p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://gov.gitcoin.co/uploads/db4391/original/2X/1/1f31019de7de8be8f948b56708a6b3d3771fc26f.png\" data-download-href=\"https://gov.gitcoin.co/uploads/db4391/1f31019de7de8be8f948b56708a6b3d3771fc26f\" title=\"Hypercerts Ecosystem components\"><img src=\"https://gov.gitcoin.co/uploads/db4391/optimized/2X/1/1f31019de7de8be8f948b56708a6b3d3771fc26f_2_495x375.png\" alt=\"Hypercerts Ecosystem components\" data-base62-sha1=\"4rVNqaEAGfmB5Hc4uMsNbGzqyLB\" width=\"495\" height=\"375\" srcset=\"https://gov.gitcoin.co/uploads/db4391/optimized/2X/1/1f31019de7de8be8f948b56708a6b3d3771fc26f_2_495x375.png, https://gov.gitcoin.co/uploads/db4391/optimized/2X/1/1f31019de7de8be8f948b56708a6b3d3771fc26f_2_742x562.png 1.5x, https://gov.gitcoin.co/uploads/db4391/optimized/2X/1/1f31019de7de8be8f948b56708a6b3d3771fc26f_2_990x750.png 2x\" data-dominant-color=\"DDDDDD\"></a></div><p></p>\n<p>These categories reflect our vision for the Hypercerts Ecosystem. Our goal is to develop a diverse array of components to support various use cases, such as open-source software, journalism, AI safety contributions, and nature regeneration.</p>\n<p>Improving and maintaining the hypercerts protocol, the ecosystem’s base layer, is managed by the Hypercerts Foundation and was not part of this ecosystem round. We participated in the apps &amp; apps round of GG20 with the Hypercerts Foundation separately.</p>\n<h1><a name=\"applications-exceeding-expectations-4\" class=\"anchor\" href=\"https://gov.gitcoin.co#applications-exceeding-expectations-4\"></a>Applications: Exceeding Expectations</h1>\n<p>We received more applications than anticipated:</p>\n<ul>\n<li>Accepted: 35 projects</li>\n<li>Rejected: 12 projects</li>\n</ul>\n<p>Projects by category:</p>\n<ul>\n<li><strong>New platform (5)</strong>: VoiceDeck, Hyperstaker, HPGF Ecosystem Support Machine, viaPrize, Hyperchange</li>\n<li><strong>Integrations (13)</strong>: ReFi DAO, Silvi, Sovereign Nature Initiative, Gainforest, GreenPill Network x GPN Dev Guild, Proof of Philanthropy, Atlantis, Change Code, NERD DAO, Hyperfiles, RWA x Public Goods | BASIN, Drivyx ESG, dMeter</li>\n<li><strong>Tooling (2)</strong>: Spark | Deresy &amp; Hyperminter, LiquiCert</li>\n<li><strong>Pilot use cases (13)</strong>: Blocktrend, Funding the Commons, PGF Ethereal Mexico, FAB DAO, MesoReefDAO, AgroforestDAO, Armitage, DWeb Camp, LexDAO, Solarpunk Guild, $Earth, DeepVentures, Public Optimism</li>\n<li><strong>DevRel &amp; community support (2)</strong>: sodofi, bitbeckers</li>\n</ul>\n<p>We are thrilled to have so many projects building on hypercerts or serving as pilot use cases. A significant benefit of this round was uncovering more activity within our ecosystem and making it transparent to the entire community.</p>\n<p>Our initial goal was to support a small round of 10-15 projects. However, we ended up with more than double that number, which led to the matching funds being spread thinner than we had anticipated. We will reconsider our criteria for future rounds to ensure what we believe will be a more effective distribution of funds.</p>\n<h1><a name=\"crowdfunded-donations-over-9000-raised-5\" class=\"anchor\" href=\"https://gov.gitcoin.co#crowdfunded-donations-over-9000-raised-5\"></a>Crowdfunded Donations: Over $9,000 Raised</h1>\n<ul>\n<li><strong>VoiceDeck</strong>: Highest crowdfunding and total amount ($1,745)</li>\n<li><strong>Atlantis</strong>: Highest contributor count (113)</li>\n<li><strong>Spark | Deresy &amp; Hyperminter</strong>: Highest matching amount ($4,658)</li>\n</ul>\n<p>Full results: <a href=\"https://reportcards.gitcoin.co/42161/28\" class=\"inline-onebox\" rel=\"noopener nofollow ugc\">Hypercerts Ecosystem Round | Gitcoin Round Report Card</a></p>\n<p></p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://gov.gitcoin.co/uploads/db4391/original/2X/b/bb0d10eea3892bf8cdceec7d3d7727d856223cf0.png\" data-download-href=\"https://gov.gitcoin.co/uploads/db4391/bb0d10eea3892bf8cdceec7d3d7727d856223cf0\" title=\"Distribution of funds in the Hypercerts Ecosystem Round\"><img src=\"https://gov.gitcoin.co/uploads/db4391/optimized/2X/b/bb0d10eea3892bf8cdceec7d3d7727d856223cf0_2_690x288.png\" alt=\"Distribution of funds in the Hypercerts Ecosystem Round\" data-base62-sha1=\"qGJhqmIUgc7toVuvaJLNhk2YMMg\" width=\"690\" height=\"288\" srcset=\"https://gov.gitcoin.co/uploads/db4391/optimized/2X/b/bb0d10eea3892bf8cdceec7d3d7727d856223cf0_2_690x288.png, https://gov.gitcoin.co/uploads/db4391/optimized/2X/b/bb0d10eea3892bf8cdceec7d3d7727d856223cf0_2_1035x432.png 1.5x, https://gov.gitcoin.co/uploads/db4391/optimized/2X/b/bb0d10eea3892bf8cdceec7d3d7727d856223cf0_2_1380x576.png 2x\" data-dominant-color=\"CCCDC7\"></a></div><p></p>\n<h1><a name=\"thank-you-to-our-matching-funders-for-60000-6\" class=\"anchor\" href=\"https://gov.gitcoin.co#thank-you-to-our-matching-funders-for-60000-6\"></a>Thank You to Our Matching Funders for $60,000</h1>\n<p>We are incredibly grateful to our matching funders—Gitcoin, Thank ARB, and Protocol Labs—for their support in pushing the young Hypercerts Ecosystem forward.</p>\n<p></p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://gov.gitcoin.co/uploads/db4391/original/2X/5/5be527b17f34ea427903036ffbea41160ccdd2ff.png\" data-download-href=\"https://gov.gitcoin.co/uploads/db4391/5be527b17f34ea427903036ffbea41160ccdd2ff\" title=\"matching funders\"><img src=\"https://gov.gitcoin.co/uploads/db4391/optimized/2X/5/5be527b17f34ea427903036ffbea41160ccdd2ff_2_690x72.png\" alt=\"matching funders\" data-base62-sha1=\"d6WpyFI4Ut9VPPD01PFDi5wlr7F\" width=\"690\" height=\"72\" srcset=\"https://gov.gitcoin.co/uploads/db4391/optimized/2X/5/5be527b17f34ea427903036ffbea41160ccdd2ff_2_690x72.png, https://gov.gitcoin.co/uploads/db4391/optimized/2X/5/5be527b17f34ea427903036ffbea41160ccdd2ff_2_1035x108.png 1.5x, https://gov.gitcoin.co/uploads/db4391/optimized/2X/5/5be527b17f34ea427903036ffbea41160ccdd2ff_2_1380x144.png 2x\" data-dominant-color=\"B9BABB\"></a></div><p></p>\n<h1><a name=\"excited-about-projects-progress-7\" class=\"anchor\" href=\"https://gov.gitcoin.co#excited-about-projects-progress-7\"></a>Excited About Projects’ Progress</h1>\n<p>We will follow up with all projects to provide support and understand further needs. Additionally, we are eager to learn how the distribution of matching funds correlates with the projects’ success.</p>\n<h1><a name=\"get-involved-8\" class=\"anchor\" href=\"https://gov.gitcoin.co#get-involved-8\"></a>Get involved</h1>\n<p>If reading this makes you interested in joining the Hypercerts Ecosystem as a funder, contributor, or new project, please reach out to us at team [at] <a href=\"http://hypercerts.org\" rel=\"noopener nofollow ugc\">hypercerts.org</a></p>\n            <p><small>2 posts - 2 participants</small></p>\n            <p><a href=\"https://gov.gitcoin.co/t/retrospective-of-the-hypercerts-ecosystem-round-during-gg20/18908\">Read full topic</a></p>","link":"https://gov.gitcoin.co/t/retrospective-of-the-hypercerts-ecosystem-round-during-gg20/18908","pubDate":"Sat, 01 Jun 2024 05:51:29 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"gov.gitcoin.co-topic-18908"},"source":{"@url":"https://gov.gitcoin.co/t/retrospective-of-the-hypercerts-ecosystem-round-during-gg20/18908.rss","#text":"Retrospective of the Hypercerts Ecosystem Round during GG20"}},{"title":"[Discussion & Feedback Request] Dspyt and EVM Explorer Rejected in AAVE & GHO Round Without Feedback","dc:creator":"DSPYT","category":"🧙 🧙‍♀️ Ideas and Open Discussion","description":"<p>Hi everyone,<br>\n<a href=\"https://dspyt.com/\" rel=\"noopener nofollow ugc\">Dspyt - into CodeVerse</a> &amp; <a href=\"https://evmexplorer.com/explore/Aave\" rel=\"noopener nofollow ugc\">EVM Explorer</a> project was rejected into Gitcoin Round, Aave &amp; GHO Ecosystem Advancement and <strong>we didn’t get any feedback.</strong></p>\n<h2><a name=\"experience-with-aave-1\" class=\"anchor\" href=\"https://gov.gitcoin.co#experience-with-aave-1\"></a>Experience with AAVE</h2>\n<p>We had a bad experience with AAVE, we applied for a grant regarding the low voting rate, wrote about it on their governance forum, but <a href=\"https://x.com/DmitriFedotov/status/1753073926232785153\" rel=\"noopener nofollow ugc\">we were banned!</a>  As a result, we made a large post with all the information about low voting and our ideas, which is available on our website - <a href=\"https://dspyt.com/low-participation-rates-aave\" class=\"inline-onebox\" rel=\"noopener nofollow ugc\">Addressing Low Participation Rates in AAVE Governance</a><br>\n</p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://gov.gitcoin.co/uploads/db4391/original/2X/e/ef741c44ab79b2f9ea8b20f8568defd489423b66.png\" data-download-href=\"https://gov.gitcoin.co/uploads/db4391/ef741c44ab79b2f9ea8b20f8568defd489423b66\" title=\"image\"><img src=\"https://gov.gitcoin.co/uploads/db4391/optimized/2X/e/ef741c44ab79b2f9ea8b20f8568defd489423b66_2_342x375.png\" alt=\"image\" data-base62-sha1=\"yaiSC4cESsDwbZolHCgFB8wVFQO\" width=\"342\" height=\"375\" srcset=\"https://gov.gitcoin.co/uploads/db4391/optimized/2X/e/ef741c44ab79b2f9ea8b20f8568defd489423b66_2_342x375.png, https://gov.gitcoin.co/uploads/db4391/optimized/2X/e/ef741c44ab79b2f9ea8b20f8568defd489423b66_2_513x562.png 1.5x, https://gov.gitcoin.co/uploads/db4391/optimized/2X/e/ef741c44ab79b2f9ea8b20f8568defd489423b66_2_684x750.png 2x\" data-dominant-color=\"3A3A3B\"></a></div><p></p>\n<h2><a name=\"project-description-into-the-gitcoin-round-aave-gho-ecosystem-advancement-2\" class=\"anchor\" href=\"https://gov.gitcoin.co#project-description-into-the-gitcoin-round-aave-gho-ecosystem-advancement-2\"></a>Project Description into the Gitcoin Round, Aave &amp; GHO Ecosystem Advancement</h2>\n<p>We applied <a href=\"https://dspyt.com/\" rel=\"noopener nofollow ugc\">Dspyt - into CodeVerse</a> &amp; <a href=\"https://evmexplorer.com/explore/Aave\" rel=\"noopener nofollow ugc\">EVM Explorer</a><br>\nDspyt achieved 416k views for last 16 months<br>\n</p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://gov.gitcoin.co/uploads/db4391/original/2X/0/036eb016825e7d199f2afd2e195c3905cc885c48.jpeg\" data-download-href=\"https://gov.gitcoin.co/uploads/db4391/036eb016825e7d199f2afd2e195c3905cc885c48\" title=\"image\"><img src=\"https://gov.gitcoin.co/uploads/db4391/optimized/2X/0/036eb016825e7d199f2afd2e195c3905cc885c48_2_345x143.jpeg\" alt=\"image\" data-base62-sha1=\"umzXBxJHbKFMKPmwIlTt0fzPkc\" width=\"345\" height=\"143\" srcset=\"https://gov.gitcoin.co/uploads/db4391/optimized/2X/0/036eb016825e7d199f2afd2e195c3905cc885c48_2_345x143.jpeg, https://gov.gitcoin.co/uploads/db4391/optimized/2X/0/036eb016825e7d199f2afd2e195c3905cc885c48_2_517x214.jpeg 1.5x, https://gov.gitcoin.co/uploads/db4391/optimized/2X/0/036eb016825e7d199f2afd2e195c3905cc885c48_2_690x286.jpeg 2x\" data-dominant-color=\"E7EAF8\"></a></div><p></p>\n<p>We made articles about AAVE and big research about low participation available on <a href=\"http://dspyt.com\" rel=\"noopener nofollow ugc\">dspyt.com</a><br>\n</p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://gov.gitcoin.co/uploads/db4391/original/2X/6/6863e1b22e275474ac6954089a09041965a9bbbc.jpeg\" data-download-href=\"https://gov.gitcoin.co/uploads/db4391/6863e1b22e275474ac6954089a09041965a9bbbc\" title=\"image\"><img src=\"https://gov.gitcoin.co/uploads/db4391/optimized/2X/6/6863e1b22e275474ac6954089a09041965a9bbbc_2_345x192.jpeg\" alt=\"image\" data-base62-sha1=\"eTtErwtbQRfy4j8L7J7awwW9l8w\" width=\"345\" height=\"192\" srcset=\"https://gov.gitcoin.co/uploads/db4391/optimized/2X/6/6863e1b22e275474ac6954089a09041965a9bbbc_2_345x192.jpeg, https://gov.gitcoin.co/uploads/db4391/optimized/2X/6/6863e1b22e275474ac6954089a09041965a9bbbc_2_517x288.jpeg 1.5x, https://gov.gitcoin.co/uploads/db4391/optimized/2X/6/6863e1b22e275474ac6954089a09041965a9bbbc_2_690x384.jpeg 2x\" data-dominant-color=\"8B96A4\"></a></div><p></p>\n<p>Google Search Console data about articles<br>\n</p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://gov.gitcoin.co/uploads/db4391/original/2X/c/cd6c45a85842af28c359a277bdb7322fd55f5d5a.png\" data-download-href=\"https://gov.gitcoin.co/uploads/db4391/cd6c45a85842af28c359a277bdb7322fd55f5d5a\" title=\"image\"><img src=\"https://gov.gitcoin.co/uploads/db4391/optimized/2X/c/cd6c45a85842af28c359a277bdb7322fd55f5d5a_2_690x33.png\" alt=\"image\" data-base62-sha1=\"tjfQUglENlygGtFN9ybZDkGihGq\" width=\"690\" height=\"33\" srcset=\"https://gov.gitcoin.co/uploads/db4391/optimized/2X/c/cd6c45a85842af28c359a277bdb7322fd55f5d5a_2_690x33.png, https://gov.gitcoin.co/uploads/db4391/optimized/2X/c/cd6c45a85842af28c359a277bdb7322fd55f5d5a_2_1035x49.png 1.5x, https://gov.gitcoin.co/uploads/db4391/optimized/2X/c/cd6c45a85842af28c359a277bdb7322fd55f5d5a_2_1380x66.png 2x\" data-dominant-color=\"EDEDED\"></a></div><br>\n<div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://gov.gitcoin.co/uploads/db4391/original/2X/b/b6ee120ce94211c5bb09224d71c4189a9d820b59.png\" data-download-href=\"https://gov.gitcoin.co/uploads/db4391/b6ee120ce94211c5bb09224d71c4189a9d820b59\" title=\"image\"><img src=\"https://gov.gitcoin.co/uploads/db4391/optimized/2X/b/b6ee120ce94211c5bb09224d71c4189a9d820b59_2_690x33.png\" alt=\"image\" data-base62-sha1=\"q6gXJ3VQyvtEjbfLpxZ34uEYKCd\" width=\"690\" height=\"33\" srcset=\"https://gov.gitcoin.co/uploads/db4391/optimized/2X/b/b6ee120ce94211c5bb09224d71c4189a9d820b59_2_690x33.png, https://gov.gitcoin.co/uploads/db4391/optimized/2X/b/b6ee120ce94211c5bb09224d71c4189a9d820b59_2_1035x49.png 1.5x, https://gov.gitcoin.co/uploads/db4391/optimized/2X/b/b6ee120ce94211c5bb09224d71c4189a9d820b59_2_1380x66.png 2x\" data-dominant-color=\"EDEDED\"></a></div><p></p>\n<h3><a name=\"evm-explorer-3\" class=\"anchor\" href=\"https://gov.gitcoin.co#evm-explorer-3\"></a>Evm Explorer</h3>\n<p>EVM Smart Contract Explorer is the part of DSPYT, <strong>it displays AAVE transactions</strong> and it is an OSS.<br>\nIt has a simple and initiative interface. This project improves every day and getting better.</p>\n<p><strong>Gho Token information</strong><br>\n</p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://gov.gitcoin.co/uploads/db4391/original/2X/4/4b7df3a076fc0977bcd584ca8c54b879e8f4d279.png\" data-download-href=\"https://gov.gitcoin.co/uploads/db4391/4b7df3a076fc0977bcd584ca8c54b879e8f4d279\" title=\"image\"><img src=\"https://gov.gitcoin.co/uploads/db4391/optimized/2X/4/4b7df3a076fc0977bcd584ca8c54b879e8f4d279_2_690x321.png\" alt=\"image\" data-base62-sha1=\"aLPEWUmlDaeu8wK7wypO8cNcXCF\" width=\"690\" height=\"321\" srcset=\"https://gov.gitcoin.co/uploads/db4391/optimized/2X/4/4b7df3a076fc0977bcd584ca8c54b879e8f4d279_2_690x321.png, https://gov.gitcoin.co/uploads/db4391/optimized/2X/4/4b7df3a076fc0977bcd584ca8c54b879e8f4d279_2_1035x481.png 1.5x, https://gov.gitcoin.co/uploads/db4391/optimized/2X/4/4b7df3a076fc0977bcd584ca8c54b879e8f4d279_2_1380x642.png 2x\" data-dominant-color=\"E4F1FA\"></a></div><p></p>\n<p></p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://gov.gitcoin.co/uploads/db4391/original/2X/7/739fa9dc892b409ecf8ab18345312b2e425b1fec.png\" data-download-href=\"https://gov.gitcoin.co/uploads/db4391/739fa9dc892b409ecf8ab18345312b2e425b1fec\" title=\"image\"><img src=\"https://gov.gitcoin.co/uploads/db4391/optimized/2X/7/739fa9dc892b409ecf8ab18345312b2e425b1fec_2_690x341.png\" alt=\"image\" data-base62-sha1=\"guQZayOAXUDtjSosFKmL0CkSxl2\" width=\"690\" height=\"341\" srcset=\"https://gov.gitcoin.co/uploads/db4391/optimized/2X/7/739fa9dc892b409ecf8ab18345312b2e425b1fec_2_690x341.png, https://gov.gitcoin.co/uploads/db4391/optimized/2X/7/739fa9dc892b409ecf8ab18345312b2e425b1fec_2_1035x511.png 1.5x, https://gov.gitcoin.co/uploads/db4391/optimized/2X/7/739fa9dc892b409ecf8ab18345312b2e425b1fec_2_1380x682.png 2x\" data-dominant-color=\"D7E8F9\"></a></div><p></p>\n<p>In conclusion to this part of the text, I would like to add that all of the above is <strong>fully consistent with the selection criteria for the round</strong>.</p>\n<h2><a name=\"rejection-and-feedback-4\" class=\"anchor\" href=\"https://gov.gitcoin.co#rejection-and-feedback-4\"></a>Rejection and “Feedback”</h2>\n<p>Dspyt - into CodeVerse &amp; EVM Explorer was rejected and we didn’t receive any feedback.<br>\n</p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://gov.gitcoin.co/uploads/db4391/original/2X/0/02617270a7e8bc1aa36122de764c012253fa9ab4.png\" data-download-href=\"https://gov.gitcoin.co/uploads/db4391/02617270a7e8bc1aa36122de764c012253fa9ab4\" title=\"image\"><img src=\"https://gov.gitcoin.co/uploads/db4391/optimized/2X/0/02617270a7e8bc1aa36122de764c012253fa9ab4_2_690x109.png\" alt=\"image\" data-base62-sha1=\"l3JwqF8McaJ9dct0uk3f58STGY\" width=\"690\" height=\"109\" srcset=\"https://gov.gitcoin.co/uploads/db4391/optimized/2X/0/02617270a7e8bc1aa36122de764c012253fa9ab4_2_690x109.png, https://gov.gitcoin.co/uploads/db4391/optimized/2X/0/02617270a7e8bc1aa36122de764c012253fa9ab4_2_1035x163.png 1.5x, https://gov.gitcoin.co/uploads/db4391/original/2X/0/02617270a7e8bc1aa36122de764c012253fa9ab4.png 2x\" data-dominant-color=\"F7F8F8\"></a></div><br>\nAlthough, in past Gitcoin Rounds, I received emails in which I could contact support and file an appeal, which I successfully did (thanks Gitcoin).<p></p>\n<p>The only thing I found was a link to the Aave Discord channel on the Gitcoin Builder on the page of my project, but the most interesting thing is that when I click on the button, it says that I do not have access to this link!<br>\n</p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://gov.gitcoin.co/uploads/db4391/original/2X/3/35ed371b885728592e53af7a6bda7cada11694c4.png\" data-download-href=\"https://gov.gitcoin.co/uploads/db4391/35ed371b885728592e53af7a6bda7cada11694c4\" title=\"image\"><img src=\"https://gov.gitcoin.co/uploads/db4391/optimized/2X/3/35ed371b885728592e53af7a6bda7cada11694c4_2_393x375.png\" alt=\"image\" data-base62-sha1=\"7H3xjlTjRYuushQy2ytnNmWC2KE\" width=\"393\" height=\"375\" srcset=\"https://gov.gitcoin.co/uploads/db4391/optimized/2X/3/35ed371b885728592e53af7a6bda7cada11694c4_2_393x375.png, https://gov.gitcoin.co/uploads/db4391/original/2X/3/35ed371b885728592e53af7a6bda7cada11694c4.png 1.5x, https://gov.gitcoin.co/uploads/db4391/original/2X/3/35ed371b885728592e53af7a6bda7cada11694c4.png 2x\" data-dominant-color=\"F7F6FA\"></a></div><p></p>\n<p><img src=\"https://gov.gitcoin.co/uploads/db4391/original/2X/8/867eec2ed573605ce63088b3f242a32254bf3551.png\" alt=\"image\" data-base62-sha1=\"jbNUvyjK7MxlCEfNouqta43JfQR\" width=\"407\" height=\"272\"></p>\n<h2><a name=\"conclusion-5\" class=\"anchor\" href=\"https://gov.gitcoin.co#conclusion-5\"></a>Conclusion</h2>\n<p>In conclusion, I want to say that I would like to receive some kind of feedback, why the project was rejected, what can I do better?</p>\n<p>Thank you</p>\n            <p><small>5 posts - 3 participants</small></p>\n            <p><a href=\"https://gov.gitcoin.co/t/discussion-feedback-request-dspyt-and-evm-explorer-rejected-in-aave-gho-round-without-feedback/18897\">Read full topic</a></p>","link":"https://gov.gitcoin.co/t/discussion-feedback-request-dspyt-and-evm-explorer-rejected-in-aave-gho-round-without-feedback/18897","pubDate":"Fri, 31 May 2024 00:53:13 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"gov.gitcoin.co-topic-18897"},"source":{"@url":"https://gov.gitcoin.co/t/discussion-feedback-request-dspyt-and-evm-explorer-rejected-in-aave-gho-round-without-feedback/18897.rss","#text":"[Discussion & Feedback Request] Dspyt and EVM Explorer Rejected in AAVE & GHO Round Without Feedback"}},{"title":"[PASSED] Delegate Gitcoin's RAD Tokens to Sov","dc:creator":"CoachJonathan","category":"🧙 🧙‍♀️ Ideas and Open Discussion","description":"<h2><a name=\"abstract-1\" class=\"anchor\" href=\"https://gov.gitcoin.co#abstract-1\"></a>Abstract:</h2>\n<p>This proposal seeks to delegate the voting power of the Gitcoin Treasury’s RAD tokens to <a class=\"mention\" href=\"https://gov.gitcoin.co/u/sov\">@Sov</a>, one of the current strategic leads of the Gitcoin Grants program. This delegation will empower Sov to effectively represent Gitcoin’s interests in governance decisions and support the RadWorks ecosystem through his expertise.</p>\n<h2><a name=\"motivation-2\" class=\"anchor\" href=\"https://gov.gitcoin.co#motivation-2\"></a>Motivation:</h2>\n<ul>\n<li><strong>Strategic Alignment:</strong> Sov, as the strategic lead of the Grants program, possesses deep understanding of the program’s needs and priorities. Delegating voting power to Sov ensures that the Treasury’s voice in governance aligns with the best interests of the Grants program and its beneficiaries.</li>\n<li><strong>Transparency and Accountability:</strong> The delegation will be clearly documented and communicated to the Gitcoin community. Sov will be held accountable for exercising the voting power in a manner that aligns with the overall goals and values of the Gitcoin ecosystem.</li>\n</ul>\n<h2><a name=\"details-3\" class=\"anchor\" href=\"https://gov.gitcoin.co#details-3\"></a>Details:</h2>\n<ul>\n<li>Delegate the voting power of the Gitcoin Treasury’s 680.27K RAD tokens to Sov at eth address: sovereignsignal.eth</li>\n<li>The delegation will be for a period of 1 year, subject to renewal</li>\n<li>Sov will be responsible for exercising the voting power in a manner that aligns with the best interests of the Gitcoin Grants program and the Gitcoin ecosystem as a whole.</li>\n<li>Sov will provide regular updates to the community on the use of the delegated voting power.</li>\n</ul>\n<h2><a name=\"voting-options-4\" class=\"anchor\" href=\"https://gov.gitcoin.co#voting-options-4\"></a>Voting options:</h2>\n<ul>\n<li>Yes, approve the delegation</li>\n<li>No, reject the delegation</li>\n<li>Abstain</li>\n</ul>\n            <p><small>12 posts - 10 participants</small></p>\n            <p><a href=\"https://gov.gitcoin.co/t/passed-delegate-gitcoins-rad-tokens-to-sov/18892\">Read full topic</a></p>","link":"https://gov.gitcoin.co/t/passed-delegate-gitcoins-rad-tokens-to-sov/18892","pubDate":"Thu, 30 May 2024 16:40:45 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"gov.gitcoin.co-topic-18892"},"source":{"@url":"https://gov.gitcoin.co/t/passed-delegate-gitcoins-rad-tokens-to-sov/18892.rss","#text":"[PASSED] Delegate Gitcoin's RAD Tokens to Sov"}},{"title":"OpenCivics Consortium Round 02 Insights & Learnings","dc:creator":"omniharmonic","category":"🌱 Gitcoin Grants","description":"<p>The OpenCivics Consortium Round 02 was a massive success. We grew the matching pool from $15,000 USD to $66,000 USD and were able to provide sizable grants to 16 incredible projects. We learned a tremendous amount from running the round and look forward to continuing our efforts to provide coordination and funding infrastructure to our members. To date, we’ve now distributed over $100,000 USD to OpenCivics members!</p>\n<p>We’re building upon the success of the grants program thus far to explore building a prototype for Streaming Quadratic Funding that will provide our members with ongoing financial support for their critical social impact work, leveraging the collective intelligence of the Consortium to allocate funds outside of one-off grant rounds. We’ll have more to share about that prototype experimentation soon!</p>\n<p>In the mean time, continue reading to see what we learned from <span class=\"hashtag-raw\">#GG20</span>!</p>\n<h1><a name=\"results-overview-1\" class=\"anchor\" href=\"https://gov.gitcoin.co#results-overview-1\"></a>Results Overview</h1>\n<p>OpenCivics Consortium Round 02 distributed <strong>$66,000 USDC</strong> in matching funds to <strong>16 projects</strong>. The round raised <strong>$10,309.37 in crowdfunding</strong> from community donations, <strong>totaling $76,309.37</strong> in funds distributed. A total of <strong>492 donors</strong> generated <strong>1,090 donations</strong>, averaging <strong>$9.45 per donation</strong>. Overall, donors generated a <strong>7.4X multiplier</strong> of their donations in matching funds.</p>\n<p>Compared with our last round, the second iteration of OpenCivics Grants was the most successful round we’ve run so far with <strong>40% more donors</strong>, <strong>20% more crowdfunding donations</strong>, and <strong>200% larger matching grants</strong> for the top grantees.</p>\n<p><a href=\"https://reportcards.gitcoin.co/42161/31\" rel=\"noopener nofollow ugc\">Click here to view the automatically generated Gitcoin Report Card for the round.</a></p>\n<p><strong>For a detailed data analysis of the grant round results, check out <a href=\"https://www.notion.so/Consortium-Grant-Round-02-Analytics-9f206f580d93462d80a55c3132a7c829?pvs=21\" rel=\"noopener nofollow ugc\">Consortium Grant Round 02 Analytics</a> on our wiki.</strong></p>\n<p></p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://gov.gitcoin.co/uploads/db4391/original/2X/1/103c42de19a00ebe488096e266429e10de009888.png\" data-download-href=\"https://gov.gitcoin.co/uploads/db4391/103c42de19a00ebe488096e266429e10de009888\" title=\"Screenshot 2024-05-28 at 2.49.58 PM\"><img src=\"https://gov.gitcoin.co/uploads/db4391/optimized/2X/1/103c42de19a00ebe488096e266429e10de009888_2_511x499.png\" alt=\"Screenshot 2024-05-28 at 2.49.58 PM\" data-base62-sha1=\"2jCKprPC5rBsExEx4I3zcKOHRd6\" width=\"511\" height=\"499\" srcset=\"https://gov.gitcoin.co/uploads/db4391/optimized/2X/1/103c42de19a00ebe488096e266429e10de009888_2_511x499.png, https://gov.gitcoin.co/uploads/db4391/optimized/2X/1/103c42de19a00ebe488096e266429e10de009888_2_766x748.png 1.5x, https://gov.gitcoin.co/uploads/db4391/optimized/2X/1/103c42de19a00ebe488096e266429e10de009888_2_1022x998.png 2x\" data-dominant-color=\"F0F0F0\"></a></div><p></p>\n<h1><a name=\"overall-data-insights-2\" class=\"anchor\" href=\"https://gov.gitcoin.co#overall-data-insights-2\"></a>Overall Data Insights</h1>\n<ol>\n<li><strong>Significant Matching Contributions</strong>\n<ul>\n<li><strong>Ethereal Forest</strong>, <strong>Urbánika’s bus</strong>, and <strong>Metagov</strong> received substantial matching funds. This indicates that these projects were able to leverage their donor base effectively to secure matching contributions. It suggests a high confidence level from matching funders in these projects’ potential impact.</li>\n</ul>\n</li>\n<li><strong>Top Fundraisers</strong>\n<ul>\n<li><strong>Ethereal Forest</strong> stands out with the highest total amount received ($14,227.02). This project not only received the most substantial total funds but also had the highest number of donations (165), reflecting both broad and deep support. The high number of donations and matching funds indicates effective fundraising strategies and strong donor engagement.</li>\n</ul>\n</li>\n<li><strong>Potential for Increased Engagement</strong>\n<ul>\n<li>Projects like <strong>Mycelial Civic Knowledge Networks</strong> and <strong>Exploring Post-Capitalist Crypto Pathways</strong> have moderate total funds and a relatively high number of donations. These projects could potentially increase their total funds by focusing on increasing the size of individual donations.</li>\n</ul>\n</li>\n<li><strong>Low Engagement with High Potential</strong>\n<ul>\n<li><strong>VoiceDeck: A Marketplace for Journalism Impact Certificates</strong> and <strong>Moos: A Berlin hub for reimagining our cities</strong> received substantial total funds but have relatively low ratios of donations to total funds. This suggests that these projects received significant donations from fewer contributors. They may benefit from strategies aimed at broadening their donor base to enhance sustainability.</li>\n</ul>\n</li>\n<li><strong>Diverse Fundraising Success</strong>\n<ul>\n<li>The diversity in donation patterns and matching fund success across projects indicates varied effectiveness in fundraising strategies. Projects with lower total amounts but high donation counts might explore methods to increase individual donation amounts. Conversely, projects with high total amounts but fewer donations could focus on broadening their engagement strategies.</li>\n</ul>\n</li>\n</ol>\n<h1><a name=\"round-operator-insights-3\" class=\"anchor\" href=\"https://gov.gitcoin.co#round-operator-insights-3\"></a>Round Operator Insights</h1>\n<p>Overall, we learned that Quadratic Funding is unpredictable and, even by constraining some variables, the outcomes are very hard to sculpt or shape. We failed in our goal of ensuring each project walked away from the round with at least $3,000 - $5,000 USD, a goal driven by our first hand experience as grantees of extremely low returns of grant funding when compared with the time it takes grantees to promote their grants.</p>\n<h2><a name=\"limiting-grantees-hypothesis-4\" class=\"anchor\" href=\"https://gov.gitcoin.co#limiting-grantees-hypothesis-4\"></a>Limiting Grantees Hypothesis</h2>\n<p>This round, we were experimenting with the hypothesis that reducing the total number of projects while increasing the matching pool would ensure that the minimum grant allocation would be large enough for all projects to create meaningful, documentable impacts created through the grant funding. We calculated the range of matching pool distributions based on our Genesis Round which reflected a 2-3x spread between the smallest matching amount and the largest. To achieve our goal of significant funding for each project, we chose to restrict the total number of projects to 16, a number derived from our analysis of the previous round’s outcomes and the volume of matching funds available for our second round.</p>\n<p>Our insights from this aspect of the round were twofold. First, the matching distribution for this round was far more extreme than anticipated. The range from the lowest matching amount to the highest amount was closer to 10x, a significant increase from our previous round. In one sense, this is a positive discovery because it shows that the Quadratic Funding mechanism is successfully allocating funds based on the preferences of the collective intelligence of donors. On the other hand, it means that the hypothesis we were testing failed to achieve our desired goals. Rather than seeing this as a failure, we see it as a learning opportunity that reveals the high variability of matching amounts and the impossibility of using the variables that <em>are</em> within our control to influence the outcome, even if our desired influence on the outcome is holistically considered and well intentioned. This feeds into the second insight from this aspect of the round. As round operators, we struggled to limit participation in the round to only 16 projects. There were many deserving projects who submitted applications whom we rejected simply based on the premise that we had an obligation to test our hypothesis that a smaller number of projects would yield significant funding for each project. Filling the final spots in the round was a painful process that required over a week of deliberation, weighing a number of variables like use of funds, project history and track record, and available grant size vs scope of the project.</p>\n<p>Based on the feedback and data generated by this round, we are unlikely to limit the number of projects in future rounds in the same way. This doesn’t solve the issue of unpredictable results and the potential for grantees to spend 10s or 100s of hours on project promotion only to receive a few hundred or a thousand dollars in matching funds, but it does embrace the philosophy of quadratic funding which places the entire allocation process in the hands of donors. Accepting and acknowledging this as a fundamental limitation and benefit of Quadratic Funding, we will encourage grantees to consider allocating only the number of hours they are willing to lose (without a guarantee of earning the value of that time back in donations) for their grant promotion.</p>\n<h2><a name=\"updates-to-gitcoin-passport-5\" class=\"anchor\" href=\"https://gov.gitcoin.co#updates-to-gitcoin-passport-5\"></a>Updates To Gitcoin Passport</h2>\n<p>For those not familiar, Gitcoin Passport is a sybil resistance mechanism for Quadratic Funding rounds that attempts to ensure donors are unique human individuals and not bots or scammers attempting to rig the system for their benefit. Prior to this round, the Gitcoin Passport was based on Stamps, attestations of identity that included a number of different identity verification mechanisms like Google and GitHub accounts. This round, Gitcoin introduced Cluster Matching, an AI-enabled system that autonomously reviewed the on-chain transaction history of each donor to verify their “proof of humanity.”</p>\n<p>Comparing the Gitcoin Passport Stamp-based matching results with the newly created Cluster Matching-based results, we were pleased to discover that the new Cluster Matching approach generated a more equitable and holistic distribution of funds. We believe this occurred because the Stamps system was an unwieldy user experience that took tremendous time and effort to reach a “passport score” that made a user eligible for matching funds. Even as web3 experts, it took us extensive time and energy to achieve a passing score and we imagine that the user experience was so challenging for most ordinary donors that they were discouraged from completing their passport or perhaps even donating to projects. Cluster matching reduces friction for donors and empowers non-web3 savvy individuals to make donations that qualify for matching funds.</p>\n<h2><a name=\"arbitrum-x-gitcoin-user-experience-6\" class=\"anchor\" href=\"https://gov.gitcoin.co#arbitrum-x-gitcoin-user-experience-6\"></a>Arbitrum x Gitcoin User Experience</h2>\n<p>This was also our first round using Arbitrum, having run our previous round on a more obscure Layer 2 blockchain, the Public Goods Network. Overall, this was an incredibly positive experience. While the user interface for program managers is almost entirely the same other than a slightly different process for bridging and adding funds to the smart contract, as a donor, the experience of donating across multiple rounds on the same chain was incredibly streamlined and supported the cross-promotion of projects with grants in multiple rounds. Gas fees on Arbitrum are incredibly low which was another massive benefit for our grantees, donors and the round overall.</p>\n<p>With that said, many of our donors still expressed challenges with bridging funds from Ethereum mainnet to a Layer 2 blockchain. We look forward to a future in which the donor experience on Gitcoin can include fiat donations as well as some kind of inter-chain mechanism that makes it irrelevant to the front end donors which chain the rounds themselves choose to operate. These challenges are persistent across the web3 ecosystem and are not unique to Arbitrum or Gitcoin, but we look forward to collaborating with both teams to co-develop the underlying infrastructures that help Quadratic Funding enter the mainstream, a path that serves the entire public goods ecosystem.</p>\n<h1><a name=\"looking-forward-7\" class=\"anchor\" href=\"https://gov.gitcoin.co#looking-forward-7\"></a>Looking Forward</h1>\n<p>We’re excited to continue offering Gitcoin Grants rounds as a service to our members. We are well positioned to advocate on behalf of the entire Consortium of civic innovators we serve to raise matching funds and provide the support structures for funding rounds. We are currently exploring a large grant from ThankArb to develop a new funding mechanism for our members that distributes drips of funding to each project on an ongoing basis. This method, Streaming Quadratic Funding, will be developed by a new initiative called <em>Flow State</em> and we’re excited to collaborate with them to explore adding specific functionality that is custom-made for the OpenCivics Consortium. The platform will offer a token-gated environment where OpenCivics members can use Quadratic Voting to express their preferences on where the continuous drips of grant funding are allocated. This mechanism breaks fund allocation out of the time-locked grant round context into an ongoing stream of funding that supports the sustainability of projects over time.</p>\n<p>Additionally, we forged lasting bonds with the other community grant round operators who all expressed an interest in co-hosting a collaborative round in the future. As ever, Gitcoin is all about relationships and this round deeply strengthened the relationships between community round operators. There seemed to be a universal sentiment that the entire public goods funding space could benefit from a funding round tailored to synergistic collaboration between different impact sectors, working together as ephemeral DAOs to generate outputs based on the unique contributions of multiple projects. We’re excited to explore this possibility and to work with other community round operators to continue serving our grantees in innovative ways.</p>\n<h1><a name=\"conclusion-8\" class=\"anchor\" href=\"https://gov.gitcoin.co#conclusion-8\"></a>Conclusion</h1>\n<p>We believe Quadratic Funding for public goods funding allocations is one of the most promising and useful contributions of web3 infrastructure to the social impact space. This round taught us an immense amount about the limitations and benefits of Quadratic Funding related to ways we can improve the donor experience, grantee experience, and overall impact of the grants themselves. We are currently engaging our grantees in a participatory process to identify and report on the milestones they achieve with the funds they’ve received from our Consortium Round 02 which we will share with you here in a few months. Our grantees have already started to identify pathways to synergize their project efforts within the context of emerging collaborative initiatives within the Consortium and we can’t wait to see what we’re able to create together.</p>\n<p>Thank you to all our donors, grantees, and members for supporting public goods and for funding the critical work of civic innovation.</p>\n<p>In Us We Trust,</p>\n<p>OpenCivics Stewards</p>\n            <p><small>4 posts - 4 participants</small></p>\n            <p><a href=\"https://gov.gitcoin.co/t/opencivics-consortium-round-02-insights-learnings/18879\">Read full topic</a></p>","link":"https://gov.gitcoin.co/t/opencivics-consortium-round-02-insights-learnings/18879","pubDate":"Tue, 28 May 2024 21:24:19 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"gov.gitcoin.co-topic-18879"},"source":{"@url":"https://gov.gitcoin.co/t/opencivics-consortium-round-02-insights-learnings/18879.rss","#text":"OpenCivics Consortium Round 02 Insights & Learnings"}}]}}}