{"rss":{"@version":"2.0","@xmlns:discourse":"http://www.discourse.org/","@xmlns:atom":"http://www.w3.org/2005/Atom","@xmlns:dc":"http://purl.org/dc/elements/1.1/","channel":{"title":"Gitcoin Governance - Latest topics","link":"https://gov.gitcoin.co/latest","description":"Latest topics","lastBuildDate":"Wed, 22 May 2024 23:28:54 +0000","atom:link":{"@href":"https://gov.gitcoin.co/latest.rss","@rel":"self","@type":"application/rss+xml"},"item":[{"title":"GTC Price Vision/Plan","dc:creator":"Mrtn","category":"🤖 DAO Governance and Vision","description":"<p>Hey Team, hope all going well.<br>\nFrom investors point of view, seems there’s no campaign or narrative towards GTC token, when other useful projects such as Chromia there’s a remarkable support in their projects &amp; Token (CHR) at the same time.<br>\nChecking on the web &amp; social media about Gitcoin, and people’s reaction is actually very negative towards the token, and honestly it makes sense as GTC token hasn’t moved yet when most of the well known tokens are behaving remarkably well.<br>\nIs there any serious Vision, roadmap, or attention toward GTC price movement? Thank you.</p>\n            <p><small>1 post - 1 participant</small></p>\n            <p><a href=\"https://gov.gitcoin.co/t/gtc-price-vision-plan/18860\">Read full topic</a></p>","link":"https://gov.gitcoin.co/t/gtc-price-vision-plan/18860","pubDate":"Wed, 22 May 2024 23:28:54 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"gov.gitcoin.co-topic-18860"},"source":{"@url":"https://gov.gitcoin.co/t/gtc-price-vision-plan/18860.rss","#text":"GTC Price Vision/Plan"}},{"title":"GTC Token Center","dc:creator":"owocki","category":"🧙 🧙‍♀️ Ideas and Open Discussion","description":"<h2><a name=\"tldr-1\" class=\"anchor\" href=\"https://gov.gitcoin.co#tldr-1\"></a>TLDR</h2>\n<p>GTC is a governance token that you can use to get utility within the Gitcoin network.</p>\n<p>This post describes a new resource, the GTC Token Center.  With the GTC Token Center, Gitcoin citizens have a source of truth for what GTC is used for, and can manage their GTC balance, and the benefits that come with it.</p>\n<p>GTC stands for GTC Token Center</p>\n<h2><a name=\"introduction-2\" class=\"anchor\" href=\"https://gov.gitcoin.co#introduction-2\"></a>Introduction</h2>\n<p>Gitcoin is a network that provides benefits to it’s constituents in the form of</p>\n<ol>\n<li>sybil resistance &amp; identity (Gitcoin Passport)</li>\n<li>capital allocation &amp; grants funding (Gitcoin Grants)</li>\n</ol>\n<p>The GTC Token center is a place that allows GTC holders to manage their benefits of the Gitcoin network + Allo protocol + passport protocols.</p>\n<h2><a name=\"gtc-token-center-3\" class=\"anchor\" href=\"https://gov.gitcoin.co#gtc-token-center-3\"></a>GTC Token Center</h2>\n<p>Today, we are beginning to quietly share the GTC Token Center, an app hosted at <a href=\"http://gtc.gitcoin.co\">gtc.gitcoin.co</a>.</p>\n<p>With the GTC Token Center, citizens can manage their GTC balance and the benefits that come with it.  Over time, more abilities will unlock for GTC holders as more and more people stake.</p>\n<p>To start, the benefit that are available to token holders will be:</p>\n<ol>\n<li>Govern Gitcoin</li>\n<li>Passport Staking - Stake GTC to earn sybil resistance.</li>\n</ol>\n<p>These benefits are quite minimal at this time, but it is possible that more benefits could be added over time - as they are ratified by governance and/or put onto product roadmaps.</p>\n<h1><a name=\"feedback-welcome-4\" class=\"anchor\" href=\"https://gov.gitcoin.co#feedback-welcome-4\"></a>Feedback welcome.</h1>\n<p>What types of benefits would you like to see come with holding GTC or being delegated GTC?  In what places are there open problems that governors or Gitcoin could add value?  Please comment below</p>\n            <p><small>4 posts - 3 participants</small></p>\n            <p><a href=\"https://gov.gitcoin.co/t/gtc-token-center/18859\">Read full topic</a></p>","link":"https://gov.gitcoin.co/t/gtc-token-center/18859","pubDate":"Wed, 22 May 2024 23:25:17 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"gov.gitcoin.co-topic-18859"},"source":{"@url":"https://gov.gitcoin.co/t/gtc-token-center/18859.rss","#text":"GTC Token Center"}},{"title":"Reflections from hosting our first round (Ma Earth / GG20)","dc:creator":"metahands","category":"🌱 Gitcoin Grants","description":"<p>Hi Gitcoin community,</p>\n<p>While <span class=\"hashtag-raw\">#GG20</span> is fresh, here are some reflections on Ma Earth’s experience hosting a round. We put up a matching pool of 35 ETH for 23 Regenerative Land Projects. This was our first time hosting a Gitcoin round.</p>\n<ul>\n<li>\n<p>Overall, the experience was great. The tools you’ve created are impressive, and I think they are really important and impactful. And they keep getting better.</p>\n</li>\n<li>\n<p>I went through the “Round Managers Training Program” last year, which helped prepare me for operating the round. The training program was difficult to fully engage with from New Zealand timezones (recordings were crucial), but it successfully got me more confident with the Grants Manager interface. <img src=\"https://gov.gitcoin.co/images/emoji/twitter/+1.png?v=12\" title=\":+1:\" class=\"emoji\" alt=\":+1:\" loading=\"lazy\" width=\"20\" height=\"20\"></p>\n</li>\n<li>\n<p>Having a consistent person from the Gitcoin community to communicate with during GG20 was super helpful. At first I was reaching out to different folks for support, but it wasn’t clear who was best for what, and response times varied. Once I locked in with <a class=\"mention\" href=\"https://gov.gitcoin.co/u/mathildadv\">@MathildaDV</a> things became a lot easier. It would be helpful for round operators to have clearer expectations upfront about how to get assistance from Gitcoin along the way.</p>\n</li>\n<li>\n<p>We applied to be a community round, but weren’t chosen this time. The transparency of the process and thoughtful feedback afterwards was really top-notch. Importantly, it supported us in thinking through how to structure the application and communication process for our own applicants.</p>\n</li>\n<li>\n<p>Over a third of the projects in Ma Earth’s round were completely new to web3. And given our focus on land projects, many of the donors were new to crypto as well. So we spent a lot of our time and energy around tutorials, tech support, walking people through wallets and bridging, etc. This was very much intentional and anticipated, as we believe/hope these communities will benefit from getting onchain.</p>\n</li>\n</ul>\n<p>What I observed during these onboarding processes is simply how difficult the wallet UX still is for most people. Especially anything related to layer 2’s (some common issues: not understanding bridging to begin with, confusing USDC.e with USDC, struggling to bridge out of Base, and confusing ARB with Arbitrum). These UX challenges seem well recognized in the crypto community, and are mostly outside of Gitcoin’s control. I’m optimistic things like smart wallets and fiat payment flows will make things smoother in the future. But clearly, Ethereum is not ready for mainstream adoption with the current wallets and L2 UX.</p>\n<ul>\n<li>\n<p>Another adoption issue is getting organizations (not just individuals) onboarded into exchanges. It seems easier to get individuals signed up on Coinbase and Kraken, but there are more AML/KYC hurdles for organizations, at least outside the US.</p>\n</li>\n<li>\n<p>We set a $5 minimum for matching threshold, and decided to use the new COCM model as our strategy for sybil resistance. We disabled Passport, out of fear of creating additional hurdles for our non-web3 audience. The $5 minimum skewed our results more than I expected, as we still received a lot of ~$1 donations during the round. Presumably this has become a learned behavior from the Gitcoin donor community who are used to making ‘vonations’ of ~$1. I felt like the COCM model improved results effectively, though it felt a bit black box. Generally speaking, COCM made the outcomes better for our grantees newer to web3, and it appropriately ticked down the matching for a couple outliers.</p>\n</li>\n<li>\n<p>My understanding is that Gitcoin is spinning out Passport and continuing to evolve these sybil-attack systems. Without knowing many details, this does seem like a good move. In the current GG20 incarnation, it almost feels like there are competing goals on Gitcoin around community crowdfunding versus web3 identity/fraud tools.</p>\n</li>\n<li>\n<p>We benefitted from the guidance of <a class=\"mention\" href=\"https://gov.gitcoin.co/u/omniharmonic\">@omniharmonic</a> at OpenCivic and <a class=\"mention\" href=\"https://gov.gitcoin.co/u/jon-spark-eco\">@jon-spark-eco</a> at Climate Coordination Network. There is value in linking the round operators together, and I’m grateful for their support.</p>\n</li>\n</ul>\n<p>Some specific UX suggestions/ideas:</p>\n<ul>\n<li>\n<p>More prominent indication on checkout if the donor’s contribution won’t unlock matching for some reason.</p>\n</li>\n<li>\n<p>We had set up our round for 30 ETH matching (~100k USD at the time). Then ETH’s price declined, so we decided to fund the contract with 35 ETH. The Grants Manager interface explicitly said we could add more. What confused/surprised me is that the extra 5 ETH didn’t filter through to the matching pool, and basically all signs of it ‘disappeared’ afterwards in the interface. I’m assuming we’ll be able to reclaim these funds after the waiting period, but would suggest some improved messaging on Grants Manager around this.</p>\n</li>\n<li>\n<p>I understand this was a shared issue, but after the round was over we were stuck for about a week on distributing funds to grantees, as the interface wasn’t responding. More upfront/broadcast communication on this would’ve helped, as we were in the dark on what the issue was, and wasted cycles and nerves trying to get to the bottom of it. <img src=\"https://gov.gitcoin.co/images/emoji/twitter/grimacing.png?v=12\" title=\":grimacing:\" class=\"emoji\" alt=\":grimacing:\" loading=\"lazy\" width=\"20\" height=\"20\"></p>\n</li>\n<li>\n<p>The Gitcoin interface had some slight inconsistencies between the report card versus the “round stats” versus the CSV exports. The discrepancies were small and not enough to cause problems, but it’s just generally not a good feeling when numbers don’t match up.</p>\n</li>\n<li>\n<p>We had non-crypto people helping us field initial applications. It would be great to be able to export these applications from the interface in a cleaner way. As it stands, I could only get the text out in CSV format, so our other panelists weren’t able to see all the images submitted by the applicants.</p>\n</li>\n<li>\n<p>Probably a big ask, but it would be nice to have more real-time visibility into incoming donations in the Grants Manager interface. In particular, I could imagine donors having the optional ability to include their Twitter handles or email addresses with their contributions, and there being an easier way to give thanks/acknowledgements to donors. I think it’d increase sharing overall, and importantly, give projects a better opportunity to express their gratitude to those donors.</p>\n</li>\n<li>\n<p>When projects share their Explorer links on Twitter, the current preview is just a generic thumbnail and text. Given there are already logos/banners added to the project profiles, maybe those graphics could be included in the metadata to make the UX on Twitter more appealing and unique. Same for the round pages.</p>\n</li>\n</ul>\n<p>Okay those are the main points that come to mind, hope they’re helpful. I’ll do a separate write-up for the Ma Earth community with tips for any other funders who might be considering running a QF round on Gitcoin in the future. I’ll add a link to the comments below when that’s done.</p>\n<p>Also, we’d love to hear your feedback, and suggestions for how we build in the future! Quick survey here, would really appreciate your takes: <a href=\"https://forms.gle/zyJwTfdvXWkpxb899\" rel=\"noopener nofollow ugc\">https://forms.gle/zyJwTfdvXWkpxb899</a></p>\n<p>You’re all legends, keep up the amazing work, and thanks for helping allocate funds to the <span class=\"hashtag-raw\">#regeneration</span>.</p>\n<p>Matthew Monahan<br>\nMa Earth</p>\n<p>Farcaster: <span class=\"mention\">@maearth</span> and <span class=\"mention\">@mjm</span><br>\nTwitter: <span class=\"mention\">@maearthmedia</span> and <span class=\"mention\">@matthewmutual</span></p>\n<p>Round recap on:<br>\nFarcaster: <a href=\"https://warpcast.com/maearth/0xbc6ed7dd\" class=\"inline-onebox\" rel=\"noopener nofollow ugc\">Warpcast</a><br>\nTwitter: <a href=\"https://x.com/maearthmedia/status/1791385853723635753\" class=\"inline-onebox\" rel=\"noopener nofollow ugc\">x.com</a><br>\nLinkedIn: <a href=\"https://www.linkedin.com/feed/update/urn:li:activity:7197144176675758080\" class=\"inline-onebox\" rel=\"noopener nofollow ugc\">Ma Earth on LinkedIn: Round Recap - Ma Earth Grants Round 1</a><br>\nInstagram: <a href=\"https://www.instagram.com/p/C7D326ULsm7/\" class=\"inline-onebox\" rel=\"noopener nofollow ugc\">Ma Earth on Instagram: \"Here's our Round Recap from Ma Earth's first grants round, quadratic funding for regenerative land projects. We'd love to hear your feedback about the round at this quick survey, and help us shape future efforts: https://forms.gle/zyJwTfdvXWkpxb899 Thank you to all the donors, land projects, Gitcoin, and many community weavers for supporting the #regeneration. ❤️ 🌎 @amazonheadwater @brave_earth_ @chateau_du_fey @regenfdn @koangainstitute @papawhakaritorito_trust @opencivics @arikiestate @silvi.earth @learningenvironmentnz @traditionaldreamfactory @wilburhotsprings @matthewmutual #FundWhatMatters #GG20\"</a></p>\n            <p><small>4 posts - 3 participants</small></p>\n            <p><a href=\"https://gov.gitcoin.co/t/reflections-from-hosting-our-first-round-ma-earth-gg20/18834\">Read full topic</a></p>","link":"https://gov.gitcoin.co/t/reflections-from-hosting-our-first-round-ma-earth-gg20/18834","pubDate":"Sat, 18 May 2024 05:05:38 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"gov.gitcoin.co-topic-18834"},"source":{"@url":"https://gov.gitcoin.co/t/reflections-from-hosting-our-first-round-ma-earth-gg20/18834.rss","#text":"Reflections from hosting our first round (Ma Earth / GG20)"}},{"title":"$10,000 Donated to Gitcoin Zuzalu Round with Credit Card Pilot Project Proposal","dc:creator":"noahchonlee","category":"🧙 🧙‍♀️ Ideas and Open Discussion","description":"<p>What if users could donate with credit card to Gitcoin campaigns?</p>\n<p>This would more than 100x the reach from EVM L2 users to all credit card users (billions of people.)</p>\n<p><strong>How it would work</strong></p>\n<p>A user creates an account on the <a href=\"http://viaPrize.org\" rel=\"noopener nofollow ugc\">viaPrize.org</a> platform and adds Gitcoin projects to their cart to fund. In essence, we would test this out with our front-end just being one more way to access Gitcoin projects so Gitcoin doesn’t need to make any big changes before seeing results. (To create an account, we use Privy which creates a wallet for a user with account abstraction with simply an OTC sent to an email, so web2 people can easily do this.) Then…</p>\n<ol>\n<li>The user types in how much they are donating</li>\n<li>They sign permission for us to send that amount of an ERC-20 stablecoin from their wallet</li>\n<li>They are taken to a Stripe credit card checkout page which has that amount they are donating pre-filled so they just click send<br>\n(From the user’s perspective, they are done. Here’s what happens next internally…)</li>\n<li>The fiat funds show up in our Stripe account, and we turn it into USDC for example with Circle mint</li>\n<li>We send the USDC into the user’s wallet, and since we already have their permission to send that amount out of their wallet, we immediately send it to the projects they are donating to.</li>\n</ol>\n<p>In this way, the user has on-chain history of their donations even though they donated with credit card.</p>\n<p><strong>Why do this instead of an onramp?</strong><br>\nCheck out this ad from Onramper on my LinkedIn feed from when I and the viaPrize team were testing several onramps:<br>\n</p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://gov.gitcoin.co/uploads/db4391/original/2X/e/e5240a239b9346b53063045ed7770323b3da7a7b.jpeg\" data-download-href=\"https://gov.gitcoin.co/uploads/db4391/e5240a239b9346b53063045ed7770323b3da7a7b\" title=\"photo1715874807\"><img src=\"https://gov.gitcoin.co/uploads/db4391/optimized/2X/e/e5240a239b9346b53063045ed7770323b3da7a7b_2_230x500.jpeg\" alt=\"photo1715874807\" data-base62-sha1=\"wH4yqjnMfQsjfTfW2ote7uy1Uz9\" width=\"230\" height=\"500\" srcset=\"https://gov.gitcoin.co/uploads/db4391/optimized/2X/e/e5240a239b9346b53063045ed7770323b3da7a7b_2_230x500.jpeg, https://gov.gitcoin.co/uploads/db4391/optimized/2X/e/e5240a239b9346b53063045ed7770323b3da7a7b_2_345x750.jpeg 1.5x, https://gov.gitcoin.co/uploads/db4391/original/2X/e/e5240a239b9346b53063045ed7770323b3da7a7b.jpeg 2x\" data-dominant-color=\"E0E1E0\"></a></div><br>\nA 52% increase of fiat-to-crypto transactions succeeding from 22% equals… 33%? If I did that math right, then still <strong>2/3 of all attempts to onramp fail</strong> through Onramper which is an aggregator offering many onramps (btw Onramper is hard to work with and we honestly feel kinda scammed into spending money on them. Shoutout to Guardarian/ChangeNow for working well so far)<br>\nAnd that’s if the user is even willing to sit through the process of doing KYC if this is their first time buying crypto.<p></p>\n<p>Compare that with the proposal to: have users send fiat, then we convert that into crypto for them with a trusted solution that works consistently.</p>\n<p><strong>Background</strong></p>\n<p>At Zuzalu last year, I started testing out crowdfunded prizes as a concept with an MVP for viaPrize. (Details here: <a href=\"https://gov.gitcoin.co/t/gitcoin-appreciations-thread/18332\" class=\"inline-onebox\">Gitcoin Appreciations Thread</a>)<br>\nSince then, a team of five has come together with 100% of our funding so far coming from Gitcoin donations.</p>\n<p>We made a tiny bit of revenue in January with some paying users, but to be honest have been slowed down since then spending months talking about how to make web3 easier to use. We think we may finally have found a strategy that addresses this (we already built USDC based contracts so it is a familiar currency, gasless transactions, and ability to send funds to usernames instead of public keys, full roadmap here: <a href=\"https://docs.google.com/document/d/1lwtuuvofkaK1c-zHEgaplcOzVgg_TXCiPeLL-Bwg488/edit?usp=sharing\" class=\"inline-onebox\" rel=\"noopener nofollow ugc\">viaPrize Development Roadmap - Google Docs</a> )</p>\n<p>It is thanks to Gitcoin that we exist, and we would love to build something that gives back to the community and pioneers a way for many web3 platforms to be easier for web2 users to interact with.</p>\n<p><strong>Pilot Project</strong></p>\n<p>For this system to work immediately, we need a “buffer reserve” of funds (see “deep dive into issues” below for an explanation.)</p>\n<p>We are suggesting a pool of $10,000 be available in the upcoming Zuzalu Gitcoin round so that users may be able to donate up to $10,000 total to projects in that round with credit card.</p>\n<p>If this works well, we can expand this to more rounds, and perhaps viaPrize even creates vpfinance - a b2b saas consultancy that works with web3 platforms to make them easier for web2 users to interact with.</p>\n<p><strong>Deep Dive into Issues (For Nerds Like Me)</strong></p>\n<p>To send fiat from Stripe to a minting service, a wire transfer will take around 3 business days. We are looking into sending from Stripe to a bank account (which adds a different few days wait unless we pay 1% fee for instant stripe withdrawal) then manually buying crypto in an exchange (there’s no APIs to automate this) or use CBIT transfers or Hong Kong’s special real time gross settlement (which would require opening a Hong Kong company.)</p>\n<p>But if those fall through, basically we need to have a “buffer reserve” so we can immediately send the crypto upon receiving the fiat, and that buffer is replenished once the fiat we received has finished turning into crypto.</p>\n<p>There are many more considerations, some of which we have simplified in this blog post: <a href=\"https://www.noahchonlee.com/post/how-to-bring-credit-card-payments-to-web3-crowdfunding-platforms\" rel=\"noopener nofollow ugc\">https://www.noahchonlee.com/post/how-to-bring-credit-card-payments-to-web3-crowdfunding-platforms</a></p>\n<p>The most important tradeoff is that we COULD use dev-controlled wallets and do everything on behalf of the user at the cost of the user giving up sovereignty of their wallet (this would remove the need for users to click “sign” with a wallet pop up which might confuse people unfamiliar with web3.)<br>\nWe would still keep the option for people to use their own self-sovereign/non-custodial wallet, but if someone just wants things to work easier they could select “normal account” instead of a “web3 account” when creating their profile.</p>\n<p><strong>Funding for This Project</strong></p>\n<p>We see 3 ways this could be funded:</p>\n<ol>\n<li>A proposal and DAO vote to make a prize for someone to build in credit card payments to donate to Gitcoin campaigns (which we anticipate winning, but at least it’s an open invitation then and it is a results based reward system, and there’s another prize on our platform <img src=\"https://gov.gitcoin.co/images/emoji/twitter/stuck_out_tongue_winking_eye.png?v=12\" title=\":stuck_out_tongue_winking_eye:\" class=\"emoji\" alt=\":stuck_out_tongue_winking_eye:\" loading=\"lazy\" width=\"20\" height=\"20\">)</li>\n<li>The community appreciates our work and donates more to us during GG rounds (and maybe in the citizens round?)</li>\n<li>We make revenue through a platform fee (we are thinking 5% flat fee, 2.9% of which goes to the credit card fees and potentially 1% goes to Stripe instant payout fee which leaves 2.1%-1.1% for us)</li>\n</ol>\n<p>We would prefer all three, and would love feedback from the community on what they think is reasonable.</p>\n<p><strong>Conclusion</strong></p>\n<p>Gitcoin is making big changes!</p>\n<p>Congrats to the switch to the new cluster based matching and model based detection strategy that removes the need for Gitcoin passport stamps!<br>\nSee <a class=\"mention\" href=\"https://gov.gitcoin.co/u/umarkhaneth\">@umarkhaneth</a> great article on that and cheers to him encouraging me to write this: <a href=\"https://gov.gitcoin.co/t/our-sybil-resistance-strategy-for-gg20/18524\" class=\"inline-onebox\">Our Sybil Resistance Strategy for GG20</a></p>\n<p>This change combined with credit card payments may make it orders of magnitude easier to donate and receive matching.</p>\n<p>This could be the start of an even brighter era for Gitcoin, QF, and web3 crowdfunding at large.</p>\n<p>What do <em>you</em> think? <img src=\"https://gov.gitcoin.co/images/emoji/twitter/thinking.png?v=12\" title=\":thinking:\" class=\"emoji\" alt=\":thinking:\" loading=\"lazy\" width=\"20\" height=\"20\"></p>\n            <p><small>10 posts - 4 participants</small></p>\n            <p><a href=\"https://gov.gitcoin.co/t/10-000-donated-to-gitcoin-zuzalu-round-with-credit-card-pilot-project-proposal/18827\">Read full topic</a></p>","link":"https://gov.gitcoin.co/t/10-000-donated-to-gitcoin-zuzalu-round-with-credit-card-pilot-project-proposal/18827","pubDate":"Fri, 17 May 2024 10:08:00 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"gov.gitcoin.co-topic-18827"},"source":{"@url":"https://gov.gitcoin.co/t/10-000-donated-to-gitcoin-zuzalu-round-with-credit-card-pilot-project-proposal/18827.rss","#text":"$10,000 Donated to Gitcoin Zuzalu Round with Credit Card Pilot Project Proposal"}},{"title":"DAO Digest #6 2024","dc:creator":"system","category":"👋 News and Community","description":"<p></p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://gov.gitcoin.co/uploads/db4391/original/2X/c/c3444a25c726eb7619d370be1430934531274ba8.png\" data-download-href=\"https://gov.gitcoin.co/uploads/db4391/c3444a25c726eb7619d370be1430934531274ba8\" title=\"\"><img src=\"https://gov.gitcoin.co/uploads/db4391/original/2X/c/c3444a25c726eb7619d370be1430934531274ba8.png\" alt=\"\" data-base62-sha1=\"rRppPsPSuDart1cCnfMBqYIgBdK\" width=\"690\" height=\"164\" role=\"presentation\" data-dominant-color=\"F4D87A\"></a></div><p></p>\n<p>Shoutout to <a class=\"mention\" href=\"https://gov.gitcoin.co/u/gaoa97\">@gaoa97</a> <a class=\"mention\" href=\"https://gov.gitcoin.co/u/rohit\">@rohit</a> <a class=\"mention\" href=\"https://gov.gitcoin.co/u/quaylawn\">@quaylawn</a> for coordinating this Digest!</p>\n<h1><a name=\"hot-topics-1\" class=\"anchor\" href=\"https://gov.gitcoin.co#hot-topics-1\"></a><img src=\"https://gov.gitcoin.co/images/emoji/twitter/fire.png?v=12\" title=\":fire:\" class=\"emoji\" alt=\":fire:\" loading=\"lazy\" width=\"20\" height=\"20\"> Hot Topics</h1>\n<p></p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://gov.gitcoin.co/uploads/db4391/original/2X/e/e2e01351fd55bf0c70e975a357af3af5a248da26.png\" data-download-href=\"https://gov.gitcoin.co/uploads/db4391/e2e01351fd55bf0c70e975a357af3af5a248da26\" title=\"\"><img src=\"https://gov.gitcoin.co/uploads/db4391/optimized/2X/e/e2e01351fd55bf0c70e975a357af3af5a248da26_2_690x341.png\" alt=\"\" data-base62-sha1=\"wn1Zf6KcsCitG8OQkh0ts9kyuxw\" width=\"690\" height=\"341\" role=\"presentation\" srcset=\"https://gov.gitcoin.co/uploads/db4391/optimized/2X/e/e2e01351fd55bf0c70e975a357af3af5a248da26_2_690x341.png, https://gov.gitcoin.co/uploads/db4391/optimized/2X/e/e2e01351fd55bf0c70e975a357af3af5a248da26_2_1035x511.png 1.5x, https://gov.gitcoin.co/uploads/db4391/optimized/2X/e/e2e01351fd55bf0c70e975a357af3af5a248da26_2_1380x682.png 2x\" data-dominant-color=\"F7F8F8\"></a></div><p></p>\n<p><img src=\"https://gov.gitcoin.co/images/emoji/twitter/white_check_mark.png?v=12\" title=\":white_check_mark:\" class=\"emoji\" alt=\":white_check_mark:\" loading=\"lazy\" width=\"20\" height=\"20\"> GG20 has successfully concluded with significant improvements from GG19, excellent operational feedback and overwhelming support from the community.</p>\n<p><img src=\"https://gov.gitcoin.co/images/emoji/twitter/new.png?v=12\" title=\":new:\" class=\"emoji\" alt=\":new:\" loading=\"lazy\" width=\"20\" height=\"20\"> GG20 introduced an external council for community grant review and governance process who <a href=\"https://gov.gitcoin.co/t/gg20-community-round-governance-a-retrospective/18766\">provided detailed insights and valuable feedback</a> (avg. satisfaction rating = 4.71/5) for future iterations.</p>\n<p><img src=\"https://gov.gitcoin.co/images/emoji/twitter/calendar.png?v=12\" title=\":calendar:\" class=\"emoji\" alt=\":calendar:\" loading=\"lazy\" width=\"20\" height=\"20\"> When initially elected, the Community Council members were elected to select the Community Rounds only for GG20. <a href=\"https://gov.gitcoin.co/t/proposal-extending-the-term-of-gg-community-council/18776\">Should this proposal pass</a>, we would extend that term beyond GG20 until December 31, 2024.</p>\n<p><img src=\"https://gov.gitcoin.co/images/emoji/twitter/cowboy_hat_face.png?v=12\" title=\":cowboy_hat_face:\" class=\"emoji\" alt=\":cowboy_hat_face:\" loading=\"lazy\" width=\"20\" height=\"20\"> Gitcoin Citizens Retro <span class=\"hashtag-raw\">#3</span> concluded with $55K crowdfunded, 50K GTC in matching and extra matching from <span class=\"mention\">@ThankArbitrum</span>, bringing it to a total of $140K, making this the most successful round to date.</p>\n<p>.<img src=\"https://gov.gitcoin.co/images/emoji/twitter/arrows_counterclockwise.png?v=12\" title=\":arrows_counterclockwise:\" class=\"emoji\" alt=\":arrows_counterclockwise:\" loading=\"lazy\" width=\"20\" height=\"20\"> <a href=\"https://gov.gitcoin.co/t/gitcoin-citizens-rounds-value-generation-opportunities/18727\">Read this brief overview</a> of how Gitcoin Citizens rounds contribute to increasing Allo GMV through strategic value loops that compound over time.</p>\n<p><img src=\"https://gov.gitcoin.co/images/emoji/twitter/star2.png?v=12\" title=\":star2:\" class=\"emoji\" alt=\":star2:\" loading=\"lazy\" width=\"20\" height=\"20\"> Our primary objective for 2024 is to triple our Gross Merchandise Value (GMV) from 2023, aiming for $15 million, with a Big Hairy Audacious Goal (BHAG) of reaching $50 million, <a class=\"mention\" href=\"https://gov.gitcoin.co/u/meglister\">@meglister</a> outlines in <a href=\"https://gov.gitcoin.co/t/2024-gmv-strategy-overview-grants-lab/18805\">this post</a>.</p>\n<p><img src=\"https://gov.gitcoin.co/images/emoji/twitter/flashlight.png?v=12\" title=\":flashlight:\" class=\"emoji\" alt=\":flashlight:\" loading=\"lazy\" width=\"20\" height=\"20\"> <a class=\"mention\" href=\"https://gov.gitcoin.co/u/kyle\">@kyle</a> follows the <a href=\"https://gov.gitcoin.co/t/another-passing-of-the-torch/18704\">passing of the torch tradition</a>, departing from official Gitcoin interactions and moving into the Passport business unit to co-lead the spin-out.</p>\n<p><img src=\"https://gov.gitcoin.co/images/emoji/twitter/thinking.png?v=12\" title=\":thinking:\" class=\"emoji\" alt=\":thinking:\" loading=\"lazy\" width=\"20\" height=\"20\"> Leveraging our technology and community levers will optimize growth and catalyze meaningful change. After all, Gitcoin <a href=\"https://gov.gitcoin.co/t/harmonizing-community-and-technology-gitcoin/18799\">has always</a> been about advancing the common good through public goods funding.</p>\n<p><img src=\"https://gov.gitcoin.co/images/emoji/twitter/city_sunrise.png?v=12\" title=\":city_sunrise:\" class=\"emoji\" alt=\":city_sunrise:\" loading=\"lazy\" width=\"20\" height=\"20\"> Public Goods Network <a href=\"https://gov.gitcoin.co/t/pgn-shutdown-a-recap/18794\">(PGN) is shutting down</a>. Despite calls for a new management plan, no viable long term options emerged. Still have unclaimed assets on the network? <a href=\"https://gov.gitcoin.co/t/public-goods-network-retrospective-recommendation-discussion/18772\">Join the discussion</a>.</p>\n<p><img src=\"https://gov.gitcoin.co/images/emoji/twitter/money_with_wings.png?v=12\" title=\":money_with_wings:\" class=\"emoji\" alt=\":money_with_wings:\" loading=\"lazy\" width=\"20\" height=\"20\"> <a href=\"https://gov.gitcoin.co/t/proposal-delegate-gitcoins-glodollar-to-fund-public-goods-via-glodollar/18804\">Read this quick recap</a> and share your thoughts on delegating $100K in GloDollars to passively fund public goods through GloDollar’s “Automatic Public Goods Funding” mechanism.</p>\n<p><img src=\"https://gov.gitcoin.co/images/emoji/twitter/green_circle.png?v=12\" title=\":green_circle:\" class=\"emoji\" alt=\":green_circle:\" loading=\"lazy\" width=\"20\" height=\"20\"> The Greenpill Podcast is seeking guest co-hosts from the regen space for seasons 5 to 7! <a href=\"https://gov.gitcoin.co/t/greenpill-podcast-guest-seasons-call-for-proposals/18754\">Submit a proposal before June 3</a> for a chance to co-host with <a class=\"mention\" href=\"https://gov.gitcoin.co/u/owocki\">@owocki</a> and shape the future of the show.</p>\n<p><img src=\"https://gov.gitcoin.co/images/emoji/twitter/earth_americas.png?v=12\" title=\":earth_americas:\" class=\"emoji\" alt=\":earth_americas:\" loading=\"lazy\" width=\"20\" height=\"20\"> Gitcoin contributors recently met in Lisbon for a 3-day retreat. Read the <a href=\"https://gov.gitcoin.co/t/lisbon-offsite-recap/18641\">Offsite Recap</a> by <a class=\"mention\" href=\"https://gov.gitcoin.co/u/meglister\">@meglister</a> for all the takeaways and stay tuned for more follow ups.</p>\n<p><img src=\"https://gov.gitcoin.co/images/emoji/twitter/nerd_face.png?v=12\" title=\":nerd_face:\" class=\"emoji\" alt=\":nerd_face:\" loading=\"lazy\" width=\"20\" height=\"20\"> The Regenlearnings.xyz group has been steadily making progress and working in public, <a href=\"https://www.youtube.com/watch?v=MoALFsYyrBg&amp;list=PLvTrX8LNPbPlaAaefsyGqbGOaM9O0fT9x&amp;t=530s\">checkout the latest 3 meeting recordings</a> in this youtube playlist!</p>\n<p><img src=\"https://gov.gitcoin.co/images/emoji/twitter/tada.png?v=12\" title=\":tada:\" class=\"emoji\" alt=\":tada:\" loading=\"lazy\" width=\"20\" height=\"20\"> ICYMI the <a href=\"https://gitcoin.co/whitepaper\">Gitcoin 2.0 White Paper</a> launched while the team was at ETHDenver hosting the inaugural Ecosystem Growth Summit with Electric Capital. Top insights can be found <a href=\"https://ecosystemgrowth.gitcoin.co/\">here</a>.</p>\n<p><img src=\"https://gov.gitcoin.co/images/emoji/twitter/video_camera.png?v=12\" title=\":video_camera:\" class=\"emoji\" alt=\":video_camera:\" loading=\"lazy\" width=\"20\" height=\"20\"> Watch the Gitcoin 2.0 whitepaper presentation by <a class=\"mention\" href=\"https://gov.gitcoin.co/u/owocki\">@owocki</a> and <a class=\"mention\" href=\"https://gov.gitcoin.co/u/meglister\">@meglister</a> at the Ecosystem Growth Summit, hosted earlier this year at ETH Denver – <a href=\"https://www.youtube.com/watch?v=rBFSavB82hw\">Grants as a Growth Vehicle</a>.</p>\n<p><img src=\"https://gov.gitcoin.co/images/emoji/twitter/thought_balloon.png?v=12\" title=\":thought_balloon:\" class=\"emoji\" alt=\":thought_balloon:\" loading=\"lazy\" width=\"20\" height=\"20\"> After the articulation of <a href=\"https://gov.gitcoin.co/t/the-case-capital-allocation-strategy-exchange/18271\">CASE</a> we are starting to see Gitcoin become a <a href=\"https://gov.gitcoin.co/t/case-prioritization-framework/18489\">Capital Allocation Strategy Exchange</a>.</p>\n<p><img src=\"https://gov.gitcoin.co/images/emoji/twitter/star2.png?v=12\" title=\":star2:\" class=\"emoji\" alt=\":star2:\" loading=\"lazy\" width=\"20\" height=\"20\"> Read ‘<a href=\"https://gov.gitcoin.co/t/a-north-star-for-gitcoin/17265\">A North Star for Gitcoin (and the decade-long path to get there)</a>’ to learn more about our current course towards the north star, and how your work can support reaching it.</p>\n<p><img src=\"https://gov.gitcoin.co/images/emoji/twitter/open_book.png?v=12\" title=\":open_book:\" class=\"emoji\" alt=\":open_book:\" loading=\"lazy\" width=\"20\" height=\"20\"> Freshen up on essential <a href=\"https://gov.gitcoin.co/t/vocabulary-gitcoin-grants-programs-rounds-etc/16773\">Gitcoin Vocabulary</a>.</p>\n<p>—</p>\n<h2><a name=\"gitcoindao-governance-overview-2\" class=\"anchor\" href=\"https://gov.gitcoin.co#gitcoindao-governance-overview-2\"></a><img src=\"https://gov.gitcoin.co/images/emoji/twitter/ballot_box.png?v=12\" title=\":ballot_box:\" class=\"emoji\" alt=\":ballot_box:\" loading=\"lazy\" width=\"20\" height=\"20\"> <strong>GitcoinDAO Governance Overview:</strong></h2>\n<ul>\n<li>Snapshot polls GTC Stewards. Tally performs on-chain actions.</li>\n<li>Proposals that have on-chain steps, such as budget requests, are approved on Snapshot before moving on to Tally.</li>\n</ul>\n<h3><a name=\"active-proposals-3\" class=\"anchor\" href=\"https://gov.gitcoin.co#active-proposals-3\"></a><img src=\"https://gov.gitcoin.co/images/emoji/twitter/bar_chart.png?v=12\" title=\":bar_chart:\" class=\"emoji\" alt=\":bar_chart:\" loading=\"lazy\" width=\"20\" height=\"20\"> <strong>Active Proposals:</strong></h3>\n<ul>\n<li>[<a href=\"https://snapshot.org/#/gitcoindao.eth/proposal/0xd83c3f76d615f387e5f828f1ba683194061ee1573da7739bff64f78f29ccc5cb\">Vote on Snapshot before May 21</a>] SGTM 001: Converting $5M GTC to Stables</li>\n<li>[<a href=\"https://gov.gitcoin.co/t/discussion-gitcoins-dapp-eligibility-in-the-gitcoin-grants-rounds-gg20/18622\">Discussion</a>] Gitcoin’s dApp eligibility in the Gitcoin Grants Rounds (GG20)</li>\n<li>[<a href=\"https://gov.gitcoin.co/t/proposal-sgtm-001-converting-5m-gtc-to-stables/18583\">PROPOSAL</a>] SGTM 001: Converting $5M GTC to Stables</li>\n</ul>\n<p>—</p>\n<h1><a name=\"biweekly-workstream-update-4\" class=\"anchor\" href=\"https://gov.gitcoin.co#biweekly-workstream-update-4\"></a><img src=\"https://gov.gitcoin.co/images/emoji/twitter/compass.png?v=12\" title=\":compass:\" class=\"emoji\" alt=\":compass:\" loading=\"lazy\" width=\"20\" height=\"20\"> Biweekly Workstream Update</h1>\n<p></p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://gov.gitcoin.co/uploads/db4391/original/2X/a/af5ec4ef7d6ea5b3c23f7cbf09dec46af4c4b05b.jpeg\" data-download-href=\"https://gov.gitcoin.co/uploads/db4391/af5ec4ef7d6ea5b3c23f7cbf09dec46af4c4b05b\" title=\"\"><img src=\"https://gov.gitcoin.co/uploads/db4391/optimized/2X/a/af5ec4ef7d6ea5b3c23f7cbf09dec46af4c4b05b_2_690x387.jpeg\" alt=\"\" data-base62-sha1=\"p1oBaL3TI4JcmEF4NMi5Cf92YnV\" width=\"690\" height=\"387\" role=\"presentation\" srcset=\"https://gov.gitcoin.co/uploads/db4391/optimized/2X/a/af5ec4ef7d6ea5b3c23f7cbf09dec46af4c4b05b_2_690x387.jpeg, https://gov.gitcoin.co/uploads/db4391/optimized/2X/a/af5ec4ef7d6ea5b3c23f7cbf09dec46af4c4b05b_2_1035x580.jpeg 1.5x, https://gov.gitcoin.co/uploads/db4391/optimized/2X/a/af5ec4ef7d6ea5b3c23f7cbf09dec46af4c4b05b_2_1380x774.jpeg 2x\" data-dominant-color=\"E1DEDB\"></a></div><p></p>\n<h1><a name=\"foundation-5\" class=\"anchor\" href=\"https://gov.gitcoin.co#foundation-5\"></a>Foundation</h1>\n<h2><a name=\"whats-new-6\" class=\"anchor\" href=\"https://gov.gitcoin.co#whats-new-6\"></a>What’s new?</h2>\n<p>The <a href=\"https://www.gitcoin.co/whitepaper/read\">Gitcoin 2.0 whitepaper</a> was published on FEB 2024 by Kevin Owocki &amp; Meg Lister, and announced at ETH Denver.</p>\n<ul>\n<li><a href=\"https://gov.gitcoin.co/t/announcing-the-gitcoin-2-0-whitepaper/18294\">Announcing the Gitcoin 2.0 Whitepaper</a></li>\n</ul>\n<p></p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://gov.gitcoin.co/uploads/db4391/original/2X/3/3ccd47ad23691de919f2bcecca7b18416efadd1a.jpeg\" data-download-href=\"https://gov.gitcoin.co/uploads/db4391/3ccd47ad23691de919f2bcecca7b18416efadd1a\" title=\"\"><img src=\"https://gov.gitcoin.co/uploads/db4391/optimized/2X/3/3ccd47ad23691de919f2bcecca7b18416efadd1a_2_690x487.jpeg\" alt=\"\" data-base62-sha1=\"8FSsqJxvNLldKNCIODmrPdAqOSK\" width=\"690\" height=\"487\" role=\"presentation\" srcset=\"https://gov.gitcoin.co/uploads/db4391/optimized/2X/3/3ccd47ad23691de919f2bcecca7b18416efadd1a_2_690x487.jpeg, https://gov.gitcoin.co/uploads/db4391/optimized/2X/3/3ccd47ad23691de919f2bcecca7b18416efadd1a_2_1035x730.jpeg 1.5x, https://gov.gitcoin.co/uploads/db4391/optimized/2X/3/3ccd47ad23691de919f2bcecca7b18416efadd1a_2_1380x974.jpeg 2x\" data-dominant-color=\"EEF1ED\"></a></div><p></p>\n<ul>\n<li><a href=\"https://gov.gitcoin.co/t/the-case-capital-allocation-strategy-exchange/18271\">The CASE - Capital Allocation Strategy Exchange</a></li>\n</ul>\n<p>Recently passed proposals:</p>\n<ul>\n<li>Grants Lab S21 Budget</li>\n<li>Passport S21 Budget</li>\n<li>GG20 Eligibility Criteria</li>\n</ul>\n<h1><a name=\"grants-lab-7\" class=\"anchor\" href=\"https://gov.gitcoin.co#grants-lab-7\"></a>Grants Lab</h1>\n<h2><a name=\"whats-new-8\" class=\"anchor\" href=\"https://gov.gitcoin.co#whats-new-8\"></a>What’s new?</h2>\n<p>The Grants Lab unit is focused on product development and adoption, aiming to increase total grant value through Allo platform usage and prioritizing product, developer relations, marketing, and Grants Stack operations! Check out the latest Grants Stack <a href=\"https://gitcoin.notion.site/What-s-New-Gitcoin-Grants-Stack-8495cce451bf4bc6881539746902e7c5\">Release Notes</a> <img src=\"https://gov.gitcoin.co/images/emoji/twitter/slightly_smiling_face.png?v=12\" title=\":slightly_smiling_face:\" class=\"emoji\" alt=\":slightly_smiling_face:\" loading=\"lazy\" width=\"20\" height=\"20\"></p>\n<p><strong>Unit Updates</strong></p>\n<ul>\n<li>\n<p>COMPLETED:</p>\n<ul>\n<li>Grants Stack is now live on Allo v2!</li>\n<li>Collections feature for Grants Stack projects</li>\n<li>Bring back search &amp; explore projects for GG20</li>\n<li>Updates to cart and donation history page</li>\n<li>Allo v2 is now live on SEI, zkSync, Lukso, and Filecoin</li>\n<li>Community-built Farcaster Frames to receive Grant donations</li>\n<li>Updates to report cards</li>\n</ul>\n</li>\n<li>\n<p>IN PROGRESS:</p>\n<ul>\n<li>Featuring Collections on homepage</li>\n<li>Updates to Karma GAP</li>\n<li>OSO integration with explorer</li>\n</ul>\n</li>\n<li>\n<p>ON THE HORIZON:</p>\n<ul>\n<li>Grantee dashboard to see who has donated to a specific project</li>\n</ul>\n</li>\n</ul>\n<h1><a name=\"ecosystem-collective-9\" class=\"anchor\" href=\"https://gov.gitcoin.co#ecosystem-collective-9\"></a>Ecosystem Collective</h1>\n<h2><a name=\"whats-new-10\" class=\"anchor\" href=\"https://gov.gitcoin.co#whats-new-10\"></a>What’s new?</h2>\n<p>Gitcoin’s community is now being fostered under the banner of the<a href=\"https://gov.gitcoin.co/t/introducing-gitcoin-s-ecosystem-collective/17954\"> Ecosystem Collective</a>.</p>\n<p></p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://gov.gitcoin.co/uploads/db4391/original/2X/8/8c340c40197cad962fbcbc9e1a60bda0f69a01f4.png\" data-download-href=\"https://gov.gitcoin.co/uploads/db4391/8c340c40197cad962fbcbc9e1a60bda0f69a01f4\" title=\"\"><img src=\"https://gov.gitcoin.co/uploads/db4391/optimized/2X/8/8c340c40197cad962fbcbc9e1a60bda0f69a01f4_2_690x353.png\" alt=\"\" data-base62-sha1=\"k0imbFlCg4UbZ2N1VNdzVvfRvX6\" width=\"690\" height=\"353\" role=\"presentation\" srcset=\"https://gov.gitcoin.co/uploads/db4391/optimized/2X/8/8c340c40197cad962fbcbc9e1a60bda0f69a01f4_2_690x353.png, https://gov.gitcoin.co/uploads/db4391/optimized/2X/8/8c340c40197cad962fbcbc9e1a60bda0f69a01f4_2_1035x529.png 1.5x, https://gov.gitcoin.co/uploads/db4391/optimized/2X/8/8c340c40197cad962fbcbc9e1a60bda0f69a01f4_2_1380x706.png 2x\" data-dominant-color=\"1A5750\"></a></div><p></p>\n<ul>\n<li>\n<p>Objectives for DAO2DAO Governance StableLab Partnership:</p>\n<ul>\n<li>Explore opportunities for DAO-to-DAO collaborations</li>\n<li>Facilitate strategic partnerships and collaborative ventures with other DAOs to amplify Gitcoin’s influence and drive adoption of Gitcoin’s products within the broader Web3 ecosystem</li>\n<li>Leverage Gitcoin’s governance token allocations to engage in Metagovernance efforts</li>\n<li>Orchestrate token swaps with strategically aligned partners to foster mutual governance participation and ecosystem growth</li>\n</ul>\n</li>\n<li>\n<p>Feedback from GG20 grantees was overall positive. Some other points of info include:</p>\n<ul>\n<li>A unique subscription was created for grantees on the Gitcoin Grants email list, with nearly 50 sign ups so far.</li>\n<li>Nearly 500 people joined the twitter spaces held ahead of GG20.</li>\n<li>Average email open rates (donors): 28%</li>\n<li>Average email open rates (grantees): 70%</li>\n<li>Over 1,000 visits to the portal since April 16</li>\n</ul>\n</li>\n</ul>\n<p><img src=\"https://gov.gitcoin.co/uploads/db4391/original/2X/2/28faa6ac2dbd37d67856ab8924b0cdd00e1237df.png\" alt=\"\" data-base62-sha1=\"5Qw7cR1BIXlA2Qv5BAMezKEIhLp\" width=\"690\" height=\"435\" role=\"presentation\"></p>\n<ul>\n<li>The <img src=\"https://gov.gitcoin.co/images/emoji/twitter/purple_circle.png?v=12\" title=\":purple_circle:\" class=\"emoji\" alt=\":purple_circle:\" loading=\"lazy\" width=\"20\" height=\"20\"> 360 Team is responsible for guiding the EC’s strategy, holding context for <img src=\"https://gov.gitcoin.co/images/emoji/twitter/large_blue_circle.png?v=12\" title=\":large_blue_circle:\" class=\"emoji\" alt=\":large_blue_circle:\" loading=\"lazy\" width=\"20\" height=\"20\"> Gitcoin Citizens, and acting as points of accountability for <img src=\"https://gov.gitcoin.co/images/emoji/twitter/white_circle.png?v=12\" title=\":white_circle:\" class=\"emoji\" alt=\":white_circle:\" loading=\"lazy\" width=\"20\" height=\"20\"> Citizens who spin up new initiatives through the Citizen Grants program.</li>\n</ul>\n<h2><a name=\"events-updateshttpsgitcoinnotionsiteupcoming-events-d749e53de96147a88a2f4864ea381afc-11\" class=\"anchor\" href=\"https://gov.gitcoin.co#events-updateshttpsgitcoinnotionsiteupcoming-events-d749e53de96147a88a2f4864ea381afc-11\"></a><img src=\"https://gov.gitcoin.co/images/emoji/twitter/date.png?v=12\" title=\":date:\" class=\"emoji\" alt=\":date:\" loading=\"lazy\" width=\"20\" height=\"20\"> <a href=\"https://gitcoin.notion.site/Upcoming-Events-d749e53de96147a88a2f4864ea381afc\">Events Updates</a></h2>\n<h3><a name=\"gitcoin-community-call-12\" class=\"anchor\" href=\"https://gov.gitcoin.co#gitcoin-community-call-12\"></a><strong>Gitcoin Community Call</strong></h3>\n<p>Catch up on recordings of recent X conversations here:</p>\n<ul>\n<li>May 13: <a href=\"https://x.com/gitcoin/status/1789760102997602484\">GG20 Recap: Impact, Innovation &amp; Insights</a></li>\n<li>May 7: <a href=\"https://x.com/gitcoin/status/1787965573038751784\">GG20 FINALE: Closing Space</a></li>\n<li>May 6: <a href=\"https://x.com/gitcoin/status/1787588012567920932\">GG20 Shill Space</a></li>\n</ul>\n<h1><a name=\"new-to-gitcoin-13\" class=\"anchor\" href=\"https://gov.gitcoin.co#new-to-gitcoin-13\"></a><img src=\"https://gov.gitcoin.co/images/emoji/twitter/wave.png?v=12\" title=\":wave:\" class=\"emoji\" alt=\":wave:\" loading=\"lazy\" width=\"20\" height=\"20\"> New to Gitcoin?</h1>\n<p>Explore the future of Gitcoin at <a href=\"https://www.gitcoin.co/\">our new website</a>, and check out <a href=\"https://community.gitcoin.co/\">Gitcoin Community Hub</a> for key resources and events. Thanks for reading!</p>\n<ul>\n<li>\n<p><strong>Gitcoin Contributors Twitter/X List</strong> – Drop your name <a href=\"https://gitcoin.notion.site/Who-wants-to-be-on-a-Twitter-X-List-5a2cba83d8264839a0f1b158f172fda3?pvs=4\">in this Notion table</a> if you’d like to be added to <a href=\"https://twitter.com/i/lists/1704549232525590692\">this Twitter list </a>so it’s easy to find and follow you and other contributors.</p>\n</li>\n<li>\n<p><strong>Brand Assets Hub</strong> – Get creative assets from <a href=\"https://gitcoin.notion.site/Brand-Assets-Hub-778cf077589842dd8ff47b84aae210e2\">Notion </a>and customize your media templates on <a href=\"https://www.canva.com/design/DAFltpaQTq0/bVujn0RMK7WER4Qd_Gh-Jg/edit\">Canva</a>.</p>\n</li>\n</ul>\n<p>PS: Click <a href=\"https://share.hsforms.com/1qr4-szfGQAmHKqItMstzoAd0r2h\">here</a> to subscribe to the DAO Digest / search <a href=\"https://twitter.com/hashtag/GitcoinDigest\">#GitcoinDigest</a> on X</p>\n            <p><small>1 post - 1 participant</small></p>\n            <p><a href=\"https://gov.gitcoin.co/t/dao-digest-6-2024/18818\">Read full topic</a></p>","link":"https://gov.gitcoin.co/t/dao-digest-6-2024/18818","pubDate":"Fri, 17 May 2024 00:39:20 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"gov.gitcoin.co-topic-18818"},"source":{"@url":"https://gov.gitcoin.co/t/dao-digest-6-2024/18818.rss","#text":"DAO Digest #6 2024"}},{"title":"GG20 Program Round Matching Results","dc:creator":"umarkhaneth","category":"🌱 Gitcoin Grants","description":"<p>UPDATE: We are <a href=\"https://snapshot.org/#/gitcoindao.eth/proposal/0x3527cb7a0c0e2100fc508b3d3b95e255ab34b95a18fd5fe6ab41c928d8aa5901\" rel=\"noopener nofollow ugc\">live on snapshot</a> for voting until May 28th</p>\n<p>Hey y’all, our GG20 OSS program round matching results are live <a href=\"https://docs.google.com/spreadsheets/d/1rZ9JPldY1AjzMdGgfqpfRfxlUyQdGLoVAZJ90Eamxq4/edit#gid=1546480797\" rel=\"noopener nofollow ugc\">here</a>! We’ll have five days for review and feedback then, barring any major issues, will move to ratify on snapshot on May 22nd and payout on May 28th.</p>\n<p>Special thanks to  <a class=\"mention\" href=\"https://gov.gitcoin.co/u/joel_m\">@Joel_m</a>, <a class=\"mention\" href=\"https://gov.gitcoin.co/u/mathildadv\">@MathildaDV</a>, <a class=\"mention\" href=\"https://gov.gitcoin.co/u/sejalrekhan\">@sejalrekhan</a>, <a class=\"mention\" href=\"https://gov.gitcoin.co/u/m0nkeyfl0wer\">@M0nkeyFl0wer</a>, <a class=\"mention\" href=\"https://gov.gitcoin.co/u/jeremy\">@Jeremy</a>, <a class=\"mention\" href=\"https://gov.gitcoin.co/u/meglister\">@meglister</a>, <a class=\"mention\" href=\"https://gov.gitcoin.co/u/owocki\">@owocki</a>  and <a class=\"mention\" href=\"https://gov.gitcoin.co/u/deltajuliet\">@deltajuliet</a> for their eyes, comments, and feedback!</p>\n<h1><a name=\"tldr-1\" class=\"anchor\" href=\"https://gov.gitcoin.co#tldr-1\"></a>TL;DR</h1>\n<ul>\n<li>GG20 saw a <a href=\"https://www.gitcoin.co/blog/announcing-gg20\" rel=\"noopener nofollow ugc\">number of exciting developments</a> including a $1M OSS matching pool, the election of a grants council, an upgrade to our core protocol, and a deepened partnership with our friends at Arbitrum.</li>\n<li>We implemented a two-pronged <a href=\"https://gov.gitcoin.co/t/our-sybil-resistance-strategy-for-gg20/18524\">sybil resistance strategy</a>. We used a <a href=\"https://gov.gitcoin.co/t/nerd-post-updates-to-cluster-mapping-matching/18705\">pluralistic variant of QF</a> and we used Passport’s model based detection system. We did not do any closed-source silencing of sybils/donors. Instead, we’re solely relying on our mechanism and Gitcoin Passport.</li>\n<li>Discussion will be open for five days before moving to snapshot on May 22nd.</li>\n</ul>\n<h1><a name=\"gg20-overview-2\" class=\"anchor\" href=\"https://gov.gitcoin.co#gg20-overview-2\"></a><img src=\"https://gov.gitcoin.co/images/emoji/twitter/earth_americas.png?v=12\" title=\":earth_americas:\" class=\"emoji\" alt=\":earth_americas:\" loading=\"lazy\" width=\"20\" height=\"20\"> GG20 Overview</h1>\n<p>Every round sees new developments. Some of the most exciting in GG20 included:</p>\n<ul>\n<li>Returning to our <a href=\"https://gov.gitcoin.co/t/gg20-project-charter/18307\">Open Source Software</a> roots, doubling the number of rounds, projects, and matching funding available since GG19.</li>\n<li>Initiating <a href=\"https://gov.gitcoin.co/t/gg20-community-round-governance-a-retrospective/18766\">Community Rounds Governance</a>, electing a council to allocate matching funds for community-led QF rounds. Read <a href=\"https://gov.gitcoin.co/t/gg20-community-round-governance-a-retrospective/18766\">the retro</a> and see the <a href=\"https://gov.gitcoin.co/t/proposal-extending-the-term-of-gg-community-council/18776\">proposal to extend the council’s term</a>.</li>\n<li>Upgrading our core protocol to enable more permissionless building, going from <a href=\"https://docs.allo.gitcoin.co/\" rel=\"noopener nofollow ugc\">allo v1 to allo v2</a>, with GG20 being the first rounds to run on our new protocol!</li>\n<li>Providing the same sybil resistance tooling we use for our rounds to every community using Grants Stack by creating a <a href=\"http://github.com/gitcoinco/qf-calculator\" rel=\"noopener nofollow ugc\">cluster-matching calculator</a> and integrating with <a href=\"https://support.passport.xyz/passport-knowledge-base/stamps/guide-to-model-based-detection\" rel=\"noopener nofollow ugc\">Passport’s model based detection</a>.</li>\n<li>Expanding our collections feature, enabling more people to add their own grant collections.</li>\n<li>Seeing the proliferation of side-apps and tooling, following our <a href=\"https://gov.gitcoin.co/t/gitcoin-could-embrace-the-unix-philosophy-to-create-exponential-innovation/18602\">modular, unix philosophy</a>. GG20 launches included <a href=\"https://ggwrapped.gitcoin.co/\" rel=\"noopener nofollow ugc\">GG Wrapped</a>, <a href=\"https://grantscan.gitcoin.co/\" rel=\"noopener nofollow ugc\">Grants Scan</a>, <a href=\"https://www.idriss.xyz/\" rel=\"noopener nofollow ugc\">IDriss cross-chain donations on Twitter</a>, <a href=\"http://gitcoindonordata.xyz\" rel=\"noopener nofollow ugc\">gitcoindonordata.xyz</a>, and <a href=\"http://github.com/gitcoinco/qf-calculator\" rel=\"noopener nofollow ugc\">a QF calculator</a> for round managers.</li>\n<li>Consolidating all of our program rounds onto Arbitrum, partnering with <a href=\"https://gov.gitcoin.co/t/thriving-gg20-thank-arb-and-gitcoin/18565\">Arbitrum and Thrive Coin</a> to expand the matching pool and incentives for contributors and grantees.</li>\n</ul>\n<h2><a name=\"key-metrics-3\" class=\"anchor\" href=\"https://gov.gitcoin.co#key-metrics-3\"></a>Key Metrics:</h2>\n<h3><a name=\"overall-4\" class=\"anchor\" href=\"https://gov.gitcoin.co#overall-4\"></a>Overall</h3>\n<ul>\n<li>11 Total Rounds</li>\n<li>$1.647M Matching Pool</li>\n<li>$633,431.29 Crowdfunded</li>\n<li>35,109 Unique Donors</li>\n<li>629 Projects</li>\n<li>More data <a href=\"http://gitcoin.co/grants-data\" rel=\"noopener nofollow ugc\">here</a></li>\n</ul>\n<h3><a name=\"oss-program-5\" class=\"anchor\" href=\"https://gov.gitcoin.co#oss-program-5\"></a>OSS Program</h3>\n<ul>\n<li>4 Program Rounds</li>\n<li>$1.0M Matching Pool</li>\n<li>$484,487.00 Crowdfunded</li>\n<li>28, 393 Unique Donors</li>\n<li>327 Projects</li>\n</ul>\n<h1><a name=\"round-and-results-calculation-details-6\" class=\"anchor\" href=\"https://gov.gitcoin.co#round-and-results-calculation-details-6\"></a><img src=\"https://gov.gitcoin.co/images/emoji/twitter/abacus.png?v=12\" title=\":abacus:\" class=\"emoji\" alt=\":abacus:\" loading=\"lazy\" width=\"20\" height=\"20\"> Round and Results Calculation Details</h1>\n<p>Before GG20 began, we proposed a two-pronged <a href=\"https://gov.gitcoin.co/t/our-sybil-resistance-strategy-for-gg20/18524\">sybil resistance strategy</a>. To recap it briefly, we would continue to use COCM (Connection-Oriented Cluster Matching) as we had in GG19 and we would additionally introduce passport’s model-based detection system.</p>\n<p>As explained in the post, and the <a href=\"https://papers.ssrn.com/sol3/papers.cfm?abstract_id=4311507\" rel=\"noopener nofollow ugc\">paper</a> which introduced this mechanism to the world, COCM is much less vulnerable to Sybil Attacks than ordinary QF because it reduces the matching of donors who look similar.</p>\n<p>In addition, testing Passport’s model-based detection system (PMBDS) on GG19 donor data yielded greater sybil resistance than the stamp-based system without any of the user friction. When used together, we believe these two tools produce the most sybil-resistant results we’ve ever had.</p>\n<p>We also continue the precedent we began in GG19 of not doing any black-box squelching of donor accounts. All of the code we used to calculate results is <a href=\"http://github.com/gitcoinco/qf-calculator\" rel=\"noopener nofollow ugc\">available on GitHub</a>. Turning off squelching has allowed us to increase transparency of matching result calculations and reduced our time to payouts. In addition, it enabled us to scale the same sybil resistance methods we use to our partners through integrations with Grants Stack.</p>\n<h2><a name=\"recap-of-cocm-connection-oriented-cluster-matchinghttpspapersssrncomsol3paperscfmabstract_id4311507-7\" class=\"anchor\" href=\"https://gov.gitcoin.co#recap-of-cocm-connection-oriented-cluster-matchinghttpspapersssrncomsol3paperscfmabstract_id4311507-7\"></a>Recap of COCM: <a href=\"https://papers.ssrn.com/sol3/papers.cfm?abstract_id=4311507\" rel=\"noopener nofollow ugc\">Connection-Oriented Cluster Matching</a></h2>\n<p>Quadratic Funding empowers a decentralized network to prioritize the public goods that need funding most. In doing so, it amplifies the voices of those with less money, ensuring bigger crowds receive more matching funds than larger wallets. However, it can be exploited by sybils or colluding groups who align their funding choices to unfairly influence matching fund distribution.</p>\n<p><a href=\"https://www.gitcoin.co/blog/wtf-is-cluster-matching-qf\" rel=\"noopener nofollow ugc\">COCM</a> is one of the tools we use to address this issue. It identifies projects with the most diverse bases of support and increases their matching funds. It offers a bridging bonus for projects that find common ground across different groups, rewarding cross-tribal support and broad reach. In this way, COCM values not only the number of voters supporting a project but also the diversity of tribes supporting it.</p>\n<p>Recently, Joel upgraded the mechanism further with a <a href=\"https://gov.gitcoin.co/t/nerd-post-updates-to-cluster-mapping-matching/18705\">Markov chain approach</a>, which assesses the likelihood of a user’s connection to a project based on intermediate connections. In experiments, this provided more sybil resistance by a large margin.</p>\n<p>As an unintended side effect, COCM also tends to distribute funding away from top projects and toward the long tail.</p>\n<h2><a name=\"passports-model-based-detection-system-8\" class=\"anchor\" href=\"https://gov.gitcoin.co#passports-model-based-detection-system-8\"></a>Passport’s Model Based Detection System</h2>\n<p>The Gitcoin Passport team has recently introduced a Model-Based Detection System that analyzes the on-chain history of addresses, comparing them to known human and sybil addresses. The model assigns each address a probability of being a genuine human user.</p>\n<p>In GG20, this model detected 42.39% of participating wallets as very likely belonging to sybils, and these wallets were excluded from matching. The unmatched wallets accounted for 22.55% of all crowdfunded dollars.</p>\n<p>While the model isn’t perfect and sometimes mistakes new users or those with few mainnet transactions for sybils, the team is continuously improving the dataset and expanding the model to L2s. Overall, it effectively reduced the impact of sybil accounts on matching results.</p>\n<h1><a name=\"project-spotlight-9\" class=\"anchor\" href=\"https://gov.gitcoin.co#project-spotlight-9\"></a><img src=\"https://gov.gitcoin.co/images/emoji/twitter/bulb.png?v=12\" title=\":bulb:\" class=\"emoji\" alt=\":bulb:\" loading=\"lazy\" width=\"20\" height=\"20\"> Project Spotlight</h1>\n<p>Here are the top five projects by total matching funding and per voter matching funding for each of our four rounds (gleaned from the <a href=\"https://docs.google.com/spreadsheets/d/1rZ9JPldY1AjzMdGgfqpfRfxlUyQdGLoVAZJ90Eamxq4/edit#gid=1546480797\" rel=\"noopener nofollow ugc\">overall matching results</a>). The “total matching” list highlights those who received the most support overall, while the “matching per voter” list showcases those who received the most diverse support, benefiting from the use of COCM. The projects on this list are the ones with the most diverse bases of support, regardless of the size of the base.</p>\n<h3><a name=\"developer-tooling-libraries-top-5-by-total-matching-10\" class=\"anchor\" href=\"https://gov.gitcoin.co#developer-tooling-libraries-top-5-by-total-matching-10\"></a>Developer Tooling &amp; Libraries - Top 5 by Total Matching</h3>\n<div class=\"md-table\">\n<table>\n<thead>\n<tr>\n<th>Rank</th>\n<th>Project</th>\n<th>Matching Funds</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>1</td>\n<td><a href=\"https://explorer.gitcoin.co/#/round/42161/27/3\" rel=\"noopener nofollow ugc\">ethers.js</a></td>\n<td>$29,637.50</td>\n</tr>\n<tr>\n<td>2</td>\n<td><a href=\"https://explorer.gitcoin.co/#/round/42161/27/41\" rel=\"noopener nofollow ugc\">OpenZeppelin Contracts</a></td>\n<td>$23,281.82</td>\n</tr>\n<tr>\n<td>3</td>\n<td><a href=\"https://explorer.gitcoin.co/#/round/42161/27/12\" rel=\"noopener nofollow ugc\">Blockscout Block Explorer - Decentralized, Open-Source, Transparent Block Explorer for All Chains</a></td>\n<td>$17,741.54</td>\n</tr>\n<tr>\n<td>4</td>\n<td><a href=\"https://explorer.gitcoin.co/#/round/42161/27/33\" rel=\"noopener nofollow ugc\">Swiss-Knife.xyz</a></td>\n<td>$16,518.84</td>\n</tr>\n<tr>\n<td>5</td>\n<td><a href=\"https://explorer.gitcoin.co/#/round/42161/27/30\" rel=\"noopener nofollow ugc\">Wagmi</a></td>\n<td>$16,243.91</td>\n</tr>\n</tbody>\n</table>\n</div><h3><a name=\"developer-tooling-libraries-top-5-by-matching-per-voter-11\" class=\"anchor\" href=\"https://gov.gitcoin.co#developer-tooling-libraries-top-5-by-matching-per-voter-11\"></a>Developer Tooling &amp; Libraries - Top 5 by Matching per Voter</h3>\n<div class=\"md-table\">\n<table>\n<thead>\n<tr>\n<th>Rank</th>\n<th>Project</th>\n<th>Matching Per Voter (Avg)</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>1</td>\n<td><a href=\"https://explorer.gitcoin.co/#/round/42161/27/33\" rel=\"noopener nofollow ugc\">Swiss-Knife.xyz</a></td>\n<td>$83.43</td>\n</tr>\n<tr>\n<td>2</td>\n<td><a href=\"https://explorer.gitcoin.co/#/round/42161/27/20\" rel=\"noopener nofollow ugc\">Viem</a></td>\n<td>$64.28</td>\n</tr>\n<tr>\n<td>3</td>\n<td><a href=\"https://explorer.gitcoin.co/#/round/42161/27/15\" rel=\"noopener nofollow ugc\">Ape Framework</a></td>\n<td>$60.40</td>\n</tr>\n<tr>\n<td>4</td>\n<td><a href=\"https://explorer.gitcoin.co/#/round/42161/27/8\" rel=\"noopener nofollow ugc\">ethui</a></td>\n<td>$60.34</td>\n</tr>\n<tr>\n<td>5</td>\n<td><a href=\"https://explorer.gitcoin.co/#/round/42161/27/35\" rel=\"noopener nofollow ugc\">Pentacle</a></td>\n<td>$57.51</td>\n</tr>\n</tbody>\n</table>\n</div><h3><a name=\"hackathon-alumni-top-5-by-total-matching-12\" class=\"anchor\" href=\"https://gov.gitcoin.co#hackathon-alumni-top-5-by-total-matching-12\"></a>Hackathon Alumni - Top 5 by Total Matching</h3>\n<div class=\"md-table\">\n<table>\n<thead>\n<tr>\n<th>Rank</th>\n<th>Project</th>\n<th>Matching Funds</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>1</td>\n<td><a href=\"https://explorer.gitcoin.co/#/round/42161/23/36\" rel=\"noopener nofollow ugc\">NFC wallet</a></td>\n<td>$10,000.00</td>\n</tr>\n<tr>\n<td>2</td>\n<td><a href=\"https://explorer.gitcoin.co/#/round/42161/23/0\" rel=\"noopener nofollow ugc\">WalletX  A Gasless Smart Wallet</a></td>\n<td>$7,592.87</td>\n</tr>\n<tr>\n<td>3</td>\n<td><a href=\"https://explorer.gitcoin.co/#/round/42161/23/27\" rel=\"noopener nofollow ugc\">Fluidpay</a></td>\n<td>$7,228.21</td>\n</tr>\n<tr>\n<td>4</td>\n<td><a href=\"https://explorer.gitcoin.co/#/round/42161/23/32\" rel=\"noopener nofollow ugc\">RejuvenateAI</a></td>\n<td>$6,121.22</td>\n</tr>\n<tr>\n<td>5</td>\n<td><a href=\"https://explorer.gitcoin.co/#/round/42161/23/40\" rel=\"noopener nofollow ugc\">Mosaic: Earn rewards for using your favorite web3 apps and protocols</a></td>\n<td>$3,801.02</td>\n</tr>\n</tbody>\n</table>\n</div><h3><a name=\"hackathon-alumni-top-5-by-matching-per-voter-13\" class=\"anchor\" href=\"https://gov.gitcoin.co#hackathon-alumni-top-5-by-matching-per-voter-13\"></a>Hackathon Alumni - Top 5 by Matching per Voter</h3>\n<div class=\"md-table\">\n<table>\n<thead>\n<tr>\n<th>Rank</th>\n<th>Project</th>\n<th>Matching Per Voter (Avg)</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>1</td>\n<td><a href=\"https://explorer.gitcoin.co/#/round/42161/23/48\" rel=\"noopener nofollow ugc\">hashlists</a></td>\n<td>$69.02</td>\n</tr>\n<tr>\n<td>2</td>\n<td><a href=\"https://explorer.gitcoin.co/#/round/42161/23/49\" rel=\"noopener nofollow ugc\">Gnomish</a></td>\n<td>$66.79</td>\n</tr>\n<tr>\n<td>3</td>\n<td><a href=\"https://explorer.gitcoin.co/#/round/42161/23/34\" rel=\"noopener nofollow ugc\">DeStealth</a></td>\n<td>$63.23</td>\n</tr>\n<tr>\n<td>4</td>\n<td><a href=\"https://explorer.gitcoin.co/#/round/42161/23/40\" rel=\"noopener nofollow ugc\">Mosaic: Earn rewards for using your favorite web3 apps and protocols</a></td>\n<td>$60.33</td>\n</tr>\n<tr>\n<td>5</td>\n<td><a href=\"https://explorer.gitcoin.co/#/round/42161/23/2\" rel=\"noopener nofollow ugc\">Margari</a></td>\n<td>$60.23</td>\n</tr>\n</tbody>\n</table>\n</div><h3><a name=\"web3-infrastructure-top-5-by-total-matching-14\" class=\"anchor\" href=\"https://gov.gitcoin.co#web3-infrastructure-top-5-by-total-matching-14\"></a>Web3 Infrastructure - Top 5 by Total Matching</h3>\n<div class=\"md-table\">\n<table>\n<thead>\n<tr>\n<th>Rank</th>\n<th>Project</th>\n<th>Matching Funds</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>1</td>\n<td><a href=\"https://explorer.gitcoin.co/#/round/42161/26/14\" rel=\"noopener nofollow ugc\">DefiLlama</a></td>\n<td>$30,000.00</td>\n</tr>\n<tr>\n<td>2</td>\n<td><a href=\"https://explorer.gitcoin.co/#/round/42161/26/66\" rel=\"noopener nofollow ugc\">L2BEAT</a></td>\n<td>$25,206.67</td>\n</tr>\n<tr>\n<td>3</td>\n<td><a href=\"https://explorer.gitcoin.co/#/round/42161/26/67\" rel=\"noopener nofollow ugc\">Umbra</a></td>\n<td>$17,319.34</td>\n</tr>\n<tr>\n<td>4</td>\n<td><a href=\"https://explorer.gitcoin.co/#/round/42161/26/48\" rel=\"noopener nofollow ugc\">Dappnode</a></td>\n<td>$16,165.74</td>\n</tr>\n<tr>\n<td>5</td>\n<td><a href=\"https://explorer.gitcoin.co/#/round/42161/26/42\" rel=\"noopener nofollow ugc\">Ethereum Attestation Service (EAS)</a></td>\n<td>$16,022.61</td>\n</tr>\n</tbody>\n</table>\n</div><h3><a name=\"web3-infrastructure-top-5-by-matching-per-voter-15\" class=\"anchor\" href=\"https://gov.gitcoin.co#web3-infrastructure-top-5-by-matching-per-voter-15\"></a>Web3 Infrastructure - Top 5 by Matching per Voter</h3>\n<div class=\"md-table\">\n<table>\n<thead>\n<tr>\n<th>Rank</th>\n<th>Project</th>\n<th>Matching Per Voter (Avg)</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>1</td>\n<td><a href=\"https://explorer.gitcoin.co/#/round/42161/26/30\" rel=\"noopener nofollow ugc\">Ethereum on ARM</a></td>\n<td>$14.65</td>\n</tr>\n<tr>\n<td>2</td>\n<td><a href=\"https://explorer.gitcoin.co/#/round/42161/26/24\" rel=\"noopener nofollow ugc\">The Tor Project</a></td>\n<td>$14.55</td>\n</tr>\n<tr>\n<td>3</td>\n<td><a href=\"https://explorer.gitcoin.co/#/round/42161/26/69\" rel=\"noopener nofollow ugc\">Lighthouse by Sigma Prime</a></td>\n<td>$14.41</td>\n</tr>\n<tr>\n<td>4</td>\n<td><a href=\"https://explorer.gitcoin.co/#/round/42161/26/9\" rel=\"noopener nofollow ugc\">eth.limo</a></td>\n<td>$10.69</td>\n</tr>\n<tr>\n<td>5</td>\n<td><a href=\"https://explorer.gitcoin.co/#/round/42161/26/98\" rel=\"noopener nofollow ugc\">libp2p General</a></td>\n<td>$10.63</td>\n</tr>\n<tr>\n<td>HM</td>\n<td><a href=\"https://explorer.gitcoin.co/#/round/42161/26/38\" rel=\"noopener nofollow ugc\">Lodestar</a></td>\n<td>$10.58</td>\n</tr>\n</tbody>\n</table>\n</div><h3><a name=\"dapps-apps-top-5-by-total-matching-16\" class=\"anchor\" href=\"https://gov.gitcoin.co#dapps-apps-top-5-by-total-matching-16\"></a>dApps &amp; Apps - Top 5 by Total Matching</h3>\n<div class=\"md-table\">\n<table>\n<thead>\n<tr>\n<th>Rank</th>\n<th>Project</th>\n<th>Matching Funds</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>1</td>\n<td><a href=\"https://explorer.gitcoin.co/#/round/42161/25/96\" rel=\"noopener nofollow ugc\">JediSwap</a></td>\n<td>$15,000.00</td>\n</tr>\n<tr>\n<td>2</td>\n<td><a href=\"https://explorer.gitcoin.co/#/round/42161/25/92\" rel=\"noopener nofollow ugc\">IDriss - A more usable web3 for everyone</a></td>\n<td>$15,000.00</td>\n</tr>\n<tr>\n<td>3</td>\n<td><a href=\"https://explorer.gitcoin.co/#/round/42161/25/1\" rel=\"noopener nofollow ugc\">Hey.xyz (formerly Lenster)</a></td>\n<td>$15,000.00</td>\n</tr>\n<tr>\n<td>4</td>\n<td><a href=\"https://explorer.gitcoin.co/#/round/42161/25/25\" rel=\"noopener nofollow ugc\">Revoke.cash</a></td>\n<td>$15,000.00</td>\n</tr>\n<tr>\n<td>5</td>\n<td><a href=\"https://explorer.gitcoin.co/#/round/42161/25/105\" rel=\"noopener nofollow ugc\">Event Horizon</a></td>\n<td>$12,098.09</td>\n</tr>\n</tbody>\n</table>\n</div><h3><a name=\"dapps-apps-top-5-matching-per-voter-17\" class=\"anchor\" href=\"https://gov.gitcoin.co#dapps-apps-top-5-matching-per-voter-17\"></a>dApps &amp; Apps - Top 5 Matching per Voter</h3>\n<div class=\"md-table\">\n<table>\n<thead>\n<tr>\n<th>Rank</th>\n<th>Project</th>\n<th>Matching Per Voter (Avg)</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>1</td>\n<td><a href=\"https://explorer.gitcoin.co/#/round/42161/25/8\" rel=\"noopener nofollow ugc\">rotki</a></td>\n<td>$27.93</td>\n</tr>\n<tr>\n<td>2</td>\n<td><a href=\"https://explorer.gitcoin.co/#/round/42161/25/83\" rel=\"noopener nofollow ugc\">Karma GAP</a></td>\n<td>$26.87</td>\n</tr>\n<tr>\n<td>3</td>\n<td><a href=\"https://explorer.gitcoin.co/#/round/42161/25/55\" rel=\"noopener nofollow ugc\">Giveth</a></td>\n<td>$25.94</td>\n</tr>\n<tr>\n<td>4</td>\n<td><a href=\"https://explorer.gitcoin.co/#/round/42161/25/95\" rel=\"noopener nofollow ugc\">Funding the Commons</a></td>\n<td>$22.78</td>\n</tr>\n<tr>\n<td>5</td>\n<td><a href=\"https://explorer.gitcoin.co/#/round/42161/25/51\" rel=\"noopener nofollow ugc\">Glo Dollar</a></td>\n<td>$22.06</td>\n</tr>\n</tbody>\n</table>\n</div><h1><a name=\"code-of-conduct-18\" class=\"anchor\" href=\"https://gov.gitcoin.co#code-of-conduct-18\"></a>Code of Conduct</h1>\n<p>As a reminder to all projects, <a href=\"https://support.gitcoin.co/gitcoin-knowledge-base/about-gitcoin/policy/understanding-potential-attack-vectors/bribery-quid-pro-quo\" rel=\"noopener nofollow ugc\">quid pro quo</a> is explicitly against <a href=\"https://grants-portal.gitcoin.co/gitcoin-grants-grantee-portal/gg19-eligibility\" rel=\"noopener nofollow ugc\">our agreement</a>. Providing an incentive or reward for individuals to donate to specific projects can affect your ability to participate in future rounds. If you see someone engaging in this type of behavior, please <a href=\"https://forms.gle/n3b5MDgHskehNQ7s8\" rel=\"noopener nofollow ugc\">let us know.</a></p>\n<h1><a name=\"next-steps-19\" class=\"anchor\" href=\"https://gov.gitcoin.co#next-steps-19\"></a>Next Steps</h1>\n<p>We plan to distribute the matching by May 28th, after the <a href=\"https://docs.google.com/spreadsheets/d/1rZ9JPldY1AjzMdGgfqpfRfxlUyQdGLoVAZJ90Eamxq4/edit#gid=1546480797\" rel=\"noopener nofollow ugc\">results</a> are ratified through governance. We are leaving five days of discussion on this post, and barring any major problems or issues found with these results, will proceed to a Snapshot vote that is open for five days.</p>\n<p>It’s worth noting that GG19 pre-approved the matching fund to be paid out before results were posted. This is a strong precedent and, if the community agrees, we could pass a policy that matching payouts for all future rounds not require ratification.</p>\n<p>We are also hosting an internal retro on May 20th and will publish further results and learnings. And as always, a detailed blog post will be published on the day that payouts are distributed.</p>\n<p>We’re also always looking for direct feedback from the community on which improvements would make GG21 even better. Please don’t hesitate to let us know!</p>\n<p></p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://gov.gitcoin.co/uploads/db4391/original/2X/c/c044d33255fc49956701d2371c2e3578d299c4db.jpeg\" data-download-href=\"https://gov.gitcoin.co/uploads/db4391/c044d33255fc49956701d2371c2e3578d299c4db\" title=\"\"><img src=\"https://gov.gitcoin.co/uploads/db4391/optimized/2X/c/c044d33255fc49956701d2371c2e3578d299c4db_2_560x500.jpeg\" alt=\"\" data-base62-sha1=\"rqT88fXJEsoViTuugd299v5m59p\" width=\"560\" height=\"500\" role=\"presentation\" srcset=\"https://gov.gitcoin.co/uploads/db4391/optimized/2X/c/c044d33255fc49956701d2371c2e3578d299c4db_2_560x500.jpeg, https://gov.gitcoin.co/uploads/db4391/optimized/2X/c/c044d33255fc49956701d2371c2e3578d299c4db_2_840x750.jpeg 1.5x, https://gov.gitcoin.co/uploads/db4391/optimized/2X/c/c044d33255fc49956701d2371c2e3578d299c4db_2_1120x1000.jpeg 2x\" data-dominant-color=\"898278\"></a></div><p></p>\n            <p><small>35 posts - 16 participants</small></p>\n            <p><a href=\"https://gov.gitcoin.co/t/gg20-program-round-matching-results/18816\">Read full topic</a></p>","link":"https://gov.gitcoin.co/t/gg20-program-round-matching-results/18816","pubDate":"Thu, 16 May 2024 22:24:31 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"gov.gitcoin.co-topic-18816"},"source":{"@url":"https://gov.gitcoin.co/t/gg20-program-round-matching-results/18816.rss","#text":"GG20 Program Round Matching Results"}},{"title":"DAO Financial Report - April2024","dc:creator":"Sor03","category":"🧙 🧙‍♀️ Ideas and Open Discussion","description":"<p><strong>Summary</strong></p>\n<p><a href=\"https://gov.gitcoin.co/t/gitcoin-entering-the-end-game/17560\">In the final month of Season 21, we witnessed the continued evolution of Gitcoin as it transitions into its new phase</a>. Notably, both the Business Units and the Ecosystem Collective achieved significant improvements in their financial positions. Operational expenses for the month totaled $743,343, representing a commendable 21.28% reduction from budgeted expenses. This reduction underscores our unwavering commitment to financial prudence.</p>\n<p>As of the end of April 2024, the present value of the DAO treasury stands at $49,251,125. Throughout the month, there were fluctuations in prices, with an average of $1.311785 per unit. This decrease can be attributed primarily to the broader downturn in the cryptocurrency market, which experienced a decline from a total market cap of $2.7 trillion to $2.4 trillion over the past 30 days. Notably, both BTC and ETH, the two primary assets, saw declines of 8.5% and 9%, respectively. As an alternative coin, GTC token has experienced a decline in price of 35.74% since the last report.</p>\n<p>GTC saw a marginal price increase of 1.20% in the last 7 days. However, it is important to note that it underperformed against the backdrop of the global cryptocurrency market, which rose by 5.60% during the same period. Moreover, when compared to similar Ethereum ecosystem cryptocurrencies, Gitcoin lagged behind, with those cryptocurrencies experiencing a 12.70% increase.</p>\n<p>This report offers a comprehensive overview of our financial performance for April 2024, emphasizing key metrics and budget analysis.</p>\n<h2><a name=\"overviewhttpsdunecomumarkhanethgitcoin-treasury-1\" class=\"anchor\" href=\"https://gov.gitcoin.co#overviewhttpsdunecomumarkhanethgitcoin-treasury-1\"></a><a href=\"https://dune.com/umarkhaneth/gitcoin-treasury\" rel=\"noopener nofollow ugc\">Overview</a></h2>\n<ul>\n<li><strong>Last Month’s Treasury Holdings</strong>: $74,203,656</li>\n<li><strong>Current Month Treasury Holdings</strong>: $49,251,125</li>\n<li><strong>Variance</strong> ($24,952,531 - 33.63%): Primarily driven by the volatile price of the token, which experienced a downturn the past month, coupled with a the impact of our monthly operating expenses across all workstreams, totaling $743,343</li>\n<li><strong>Budget Variance</strong>: 21.28% lower than the budget across all Business Units and the Ecosystem Collective ($944,312).</li>\n</ul>\n<h2><a name=\"runway-2\" class=\"anchor\" href=\"https://gov.gitcoin.co#runway-2\"></a>Runway</h2>\n<p>The decrease in the value of our treasury’s GTC holdings, primarily influenced by the performance of GTC, has impacted our Runway. Presently, our Runway is estimated to be 52 months (4 years).</p>\n<p>The total GTC held within the DAO amounts to $39,249,344, with each token averaging a value of $1.20.</p>\n<p>Currently, our dependency on GTC stands at 79.69%, highlighting the significant impact of this token’s performance on our treasury. To mitigate associated risks and ensure financial resilience amidst market fluctuations, it is imperative to vigilantly monitor and explore strategies to diversify our treasury holdings.</p>\n<p>Last Month’s Expenditure: Our expenditure for the previous month totaled $743,343, demonstrating a commendable reduction of 21.28% (equivalent to $200,969) from our budgeted amount of $944,312. This disciplined adherence to the budget underscores our steadfast commitment to efficient resource allocation.</p>\n<p>April*</p>\n<p></p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://gov.gitcoin.co/uploads/db4391/original/2X/6/65f64b7a3a97250f714c50c5f9ff9fb38f699be4.png\" data-download-href=\"https://gov.gitcoin.co/uploads/db4391/65f64b7a3a97250f714c50c5f9ff9fb38f699be4\" title=\"Chart\"><img src=\"https://gov.gitcoin.co/uploads/db4391/optimized/2X/6/65f64b7a3a97250f714c50c5f9ff9fb38f699be4_2_288x244.png\" alt=\"\" title=\"Chart\" data-base62-sha1=\"exZUlhHCH4zQ4FTyklEhDfW3VWc\" width=\"288\" height=\"244\" role=\"presentation\" srcset=\"https://gov.gitcoin.co/uploads/db4391/optimized/2X/6/65f64b7a3a97250f714c50c5f9ff9fb38f699be4_2_288x244.png, https://gov.gitcoin.co/uploads/db4391/optimized/2X/6/65f64b7a3a97250f714c50c5f9ff9fb38f699be4_2_432x366.png 1.5x, https://gov.gitcoin.co/uploads/db4391/optimized/2X/6/65f64b7a3a97250f714c50c5f9ff9fb38f699be4_2_576x488.png 2x\" data-dominant-color=\"F1C3BA\"></a></div><p></p>\n<ul>\n<li>Figures ran on March 6 2024</li>\n</ul>\n<p>March*</p>\n<p></p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://gov.gitcoin.co/uploads/db4391/original/2X/9/9f1def7b7365918b02307e5fb42673ef6ed44d02.png\" data-download-href=\"https://gov.gitcoin.co/uploads/db4391/9f1def7b7365918b02307e5fb42673ef6ed44d02\" title=\"Chart\"><img src=\"https://gov.gitcoin.co/uploads/db4391/optimized/2X/9/9f1def7b7365918b02307e5fb42673ef6ed44d02_2_288x243.png\" alt=\"\" title=\"Chart\" data-base62-sha1=\"mHC3mB7yId1LnqCad3Upe5ydSBs\" width=\"288\" height=\"243\" role=\"presentation\" srcset=\"https://gov.gitcoin.co/uploads/db4391/optimized/2X/9/9f1def7b7365918b02307e5fb42673ef6ed44d02_2_288x243.png, https://gov.gitcoin.co/uploads/db4391/optimized/2X/9/9f1def7b7365918b02307e5fb42673ef6ed44d02_2_432x364.png 1.5x, https://gov.gitcoin.co/uploads/db4391/optimized/2X/9/9f1def7b7365918b02307e5fb42673ef6ed44d02_2_576x486.png 2x\" data-dominant-color=\"F4C4B9\"></a></div><p></p>\n<ul>\n<li>Figures ran on April 8 2024</li>\n</ul>\n<h3><a name=\"token-spend-in-april-3\" class=\"anchor\" href=\"https://gov.gitcoin.co#token-spend-in-april-3\"></a>Token spend in April</h3>\n<p>During April, our total expenditure in USD reached $743,343. This breakdown comprises $577,769 in USDC, 41,040 GTC valued at $48,535, 0.3038 in ETH (~$1,393) and $115,645 in USDC on Rain.</p>\n<h2><a name=\"key-financial-insights-april-4\" class=\"anchor\" href=\"https://gov.gitcoin.co#key-financial-insights-april-4\"></a>Key Financial Insights April</h2>\n<h3><a name=\"total-contributor-costs-5\" class=\"anchor\" href=\"https://gov.gitcoin.co#total-contributor-costs-5\"></a>Total Contributor Costs</h3>\n<ul>\n<li>The total expenses associated with contributors, encompassing both full-time team members and part-time support (including headcount and external consultants), stand at $633,088. This marks a decrease of $148,574, representing a reduction of -19.01%. Furthermore, the revised budgets for Grants Lab, Passport, and the Ecosystem Collective incorporate allocations for vacant positions that may be filled during this season. Despite these adjustments, we have successfully maintained expenditures within the confines of the original budgetary framework.</li>\n</ul>\n<h3><a name=\"other-notable-operating-expenses-6\" class=\"anchor\" href=\"https://gov.gitcoin.co#other-notable-operating-expenses-6\"></a>Other Notable Operating Expenses</h3>\n<ul>\n<li>There were no significant expenses recorded in April that required a detailed breakdown.\n<ul>\n<li>Software &amp; Subscriptions: $26,464, reflecting an 18.47% increase over the budget ($22,337). This rise is primarily attributed to unforeseen costs from DataDog and Alchemy.</li>\n<li>Travel, Lodging, and Meals: $11,124, marking a significant 28.35% increase over budget ($8,667). This increase is primarily related to the Offsite. However, under GCP 016, the workstreams are entitled to claim back close to $50K from the amount allocated to the Offsite.</li>\n<li>General and Administrative: $72,667, which is 44.80% below budget ($131,646), attributed to unspent for RFP (Ecosystem Collective) and Marketing (Passport)</li>\n</ul>\n</li>\n</ul>\n<p>This breakdown showcases our commitment to careful and effective spending, resulting in significant savings across a range of expense categories.</p>\n<h2><a name=\"summary-7\" class=\"anchor\" href=\"https://gov.gitcoin.co#summary-7\"></a>Summary</h2>\n<p></p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://gov.gitcoin.co/uploads/db4391/original/2X/1/1a63de7bb7f2fcfc7edc5a6f6d7f765f7937675c.png\" data-download-href=\"https://gov.gitcoin.co/uploads/db4391/1a63de7bb7f2fcfc7edc5a6f6d7f765f7937675c\" title=\"Chart\"><img src=\"https://gov.gitcoin.co/uploads/db4391/optimized/2X/1/1a63de7bb7f2fcfc7edc5a6f6d7f765f7937675c_2_549x339.png\" alt=\"\" title=\"Chart\" data-base62-sha1=\"3LsnJflnTeqlT5YEzV67C14wZGs\" width=\"549\" height=\"339\" role=\"presentation\" srcset=\"https://gov.gitcoin.co/uploads/db4391/optimized/2X/1/1a63de7bb7f2fcfc7edc5a6f6d7f765f7937675c_2_549x339.png, https://gov.gitcoin.co/uploads/db4391/optimized/2X/1/1a63de7bb7f2fcfc7edc5a6f6d7f765f7937675c_2_823x508.png 1.5x, https://gov.gitcoin.co/uploads/db4391/optimized/2X/1/1a63de7bb7f2fcfc7edc5a6f6d7f765f7937675c_2_1098x678.png 2x\" data-dominant-color=\"CFC9E3\"></a></div><p></p>\n<div class=\"md-table\">\n<table>\n<thead>\n<tr>\n<th></th>\n<th>Actuals</th>\n<th>Budget</th>\n<th>Variance</th>\n<th>% Difference</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>April</td>\n<td>$743,343</td>\n<td>$944,312</td>\n<td>-$200,969</td>\n<td>-21.28%</td>\n</tr>\n</tbody>\n</table>\n</div><h2><a name=\"monthly-breakdown-8\" class=\"anchor\" href=\"https://gov.gitcoin.co#monthly-breakdown-8\"></a>Monthly Breakdown</h2>\n<h3><a name=\"april-9\" class=\"anchor\" href=\"https://gov.gitcoin.co#april-9\"></a>April</h3>\n<div class=\"md-table\">\n<table>\n<thead>\n<tr>\n<th></th>\n<th>Actuals</th>\n<th>Budget</th>\n<th>Variance</th>\n<th>% Difference</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>Headcount</td>\n<td>$564,744</td>\n<td>$592,845</td>\n<td>-$28,101</td>\n<td>-4.74%</td>\n</tr>\n<tr>\n<td>Other Consultants</td>\n<td>$68,344</td>\n<td>$188,817</td>\n<td>-$120,473</td>\n<td>-63.80%</td>\n</tr>\n<tr>\n<td>Software &amp; Subscriptions</td>\n<td>$26,464</td>\n<td>$22,337</td>\n<td>$4,127</td>\n<td>18.47%</td>\n</tr>\n<tr>\n<td>Travel, Lodging and Meals</td>\n<td>$11,124</td>\n<td>$8,667</td>\n<td>$2,457</td>\n<td>28.35%</td>\n</tr>\n<tr>\n<td>General and Administrative</td>\n<td>$1,330</td>\n<td>$16,196</td>\n<td>-$14,866</td>\n<td>-91.79%</td>\n</tr>\n<tr>\n<td>Miscellaneous</td>\n<td>$71,337</td>\n<td>$115,450</td>\n<td>-$44,113</td>\n<td>-38.21%</td>\n</tr>\n</tbody>\n</table>\n</div><p><strong>Breakdown by business unit / workstream:</strong></p>\n<p>The <strong>Ecosystem Collective</strong> exhibited remarkable financial efficiency by operating well below budget, with expenses amounting to just $223,451, significantly lower than the allocated budget of $260,013. Despite substantial expenditures incurred during the month, the Ecosystem Collective adeptly concluded April with ample breathing room under budget constraints.</p>\n<p></p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://gov.gitcoin.co/uploads/db4391/original/2X/a/aba28a8fa1aac55a3e64cf0e366d39754e938bc2.png\" data-download-href=\"https://gov.gitcoin.co/uploads/db4391/aba28a8fa1aac55a3e64cf0e366d39754e938bc2\" title=\"Chart\"><img src=\"https://gov.gitcoin.co/uploads/db4391/optimized/2X/a/aba28a8fa1aac55a3e64cf0e366d39754e938bc2_2_336x208.png\" alt=\"\" title=\"Chart\" data-base62-sha1=\"oulTcZLPZQd2L7xVEQD5VfwsXfQ\" width=\"336\" height=\"208\" role=\"presentation\" srcset=\"https://gov.gitcoin.co/uploads/db4391/optimized/2X/a/aba28a8fa1aac55a3e64cf0e366d39754e938bc2_2_336x208.png, https://gov.gitcoin.co/uploads/db4391/optimized/2X/a/aba28a8fa1aac55a3e64cf0e366d39754e938bc2_2_504x312.png 1.5x, https://gov.gitcoin.co/uploads/db4391/optimized/2X/a/aba28a8fa1aac55a3e64cf0e366d39754e938bc2_2_672x416.png 2x\" data-dominant-color=\"DFDFEE\"></a></div><p></p>\n<ul>\n<li>January, February and March represent MMM workstream performance.</li>\n</ul>\n<p>Within the <strong>Grants Lab</strong> business unit, expenditures totaled $322,686 against the allocated budget of $434,484, resulting in a surplus of $111,798. The team showcased astute budget management by diligently adhering to financial parameters, strategically balancing underspending in certain areas with necessary investments in others.</p>\n<p></p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://gov.gitcoin.co/uploads/db4391/original/2X/e/e61af43e2e2ffe25b03d3c7bb8fa2eadaeaf64ea.png\" data-download-href=\"https://gov.gitcoin.co/uploads/db4391/e61af43e2e2ffe25b03d3c7bb8fa2eadaeaf64ea\" title=\"Chart\"><img src=\"https://gov.gitcoin.co/uploads/db4391/optimized/2X/e/e61af43e2e2ffe25b03d3c7bb8fa2eadaeaf64ea_2_336x208.png\" alt=\"\" title=\"Chart\" data-base62-sha1=\"wPBz9HwrtCCe4iRjvNAgRTkfjD4\" width=\"336\" height=\"208\" role=\"presentation\" srcset=\"https://gov.gitcoin.co/uploads/db4391/optimized/2X/e/e61af43e2e2ffe25b03d3c7bb8fa2eadaeaf64ea_2_336x208.png, https://gov.gitcoin.co/uploads/db4391/optimized/2X/e/e61af43e2e2ffe25b03d3c7bb8fa2eadaeaf64ea_2_504x312.png 1.5x, https://gov.gitcoin.co/uploads/db4391/optimized/2X/e/e61af43e2e2ffe25b03d3c7bb8fa2eadaeaf64ea_2_672x416.png 2x\" data-dominant-color=\"D4D4E9\"></a></div><p></p>\n<ul>\n<li>January represents Grants Stack workstream performance.</li>\n</ul>\n<p>In the <strong>Passport</strong> business unit, $197,206 was utilized out of the allocated budget of $249,815, leaving $52,609 unspent. Despite initial expectations of heightened infrastructure expenses, Passport’s BU adeptly navigated April, comfortably concluding the month under budget.</p>\n<p></p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://gov.gitcoin.co/uploads/db4391/original/2X/6/68ce04c7fda60f2a3f57ecb9c80efdfff4db89ef.png\" data-download-href=\"https://gov.gitcoin.co/uploads/db4391/68ce04c7fda60f2a3f57ecb9c80efdfff4db89ef\" title=\"Chart\"><img src=\"https://gov.gitcoin.co/uploads/db4391/optimized/2X/6/68ce04c7fda60f2a3f57ecb9c80efdfff4db89ef_2_336x208.png\" alt=\"\" title=\"Chart\" data-base62-sha1=\"eX935PUYRHz2gkxB28VmLbHYwy3\" width=\"336\" height=\"208\" role=\"presentation\" srcset=\"https://gov.gitcoin.co/uploads/db4391/optimized/2X/6/68ce04c7fda60f2a3f57ecb9c80efdfff4db89ef_2_336x208.png, https://gov.gitcoin.co/uploads/db4391/optimized/2X/6/68ce04c7fda60f2a3f57ecb9c80efdfff4db89ef_2_504x312.png 1.5x, https://gov.gitcoin.co/uploads/db4391/optimized/2X/6/68ce04c7fda60f2a3f57ecb9c80efdfff4db89ef_2_672x416.png 2x\" data-dominant-color=\"CFD1EA\"></a></div><p></p>\n            <p><small>1 post - 1 participant</small></p>\n            <p><a href=\"https://gov.gitcoin.co/t/dao-financial-report-april2024/18814\">Read full topic</a></p>","link":"https://gov.gitcoin.co/t/dao-financial-report-april2024/18814","pubDate":"Thu, 16 May 2024 10:51:07 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"gov.gitcoin.co-topic-18814"},"source":{"@url":"https://gov.gitcoin.co/t/dao-financial-report-april2024/18814.rss","#text":"DAO Financial Report - April2024"}},{"title":"2024 GMV Strategy Overview - Grants Lab","dc:creator":"meglister","category":"🧙 🧙‍♀️ Ideas and Open Discussion","description":"<h3><a name=\"h-2024-gmv-strategy-overview-grants-lab-1\" class=\"anchor\" href=\"https://gov.gitcoin.co#h-2024-gmv-strategy-overview-grants-lab-1\"></a>2024 GMV Strategy Overview - Grants Lab</h3>\n<h4><a name=\"summary-2\" class=\"anchor\" href=\"https://gov.gitcoin.co#summary-2\"></a>Summary</h4>\n<p>Our primary objective for 2024 is to triple our Gross Merchandise Value (GMV) from 2023, aiming for $15 million, with a Big Hairy Audacious Goal (BHAG) of reaching $50 million. Although we’ve had a slow start, achieving only 10% of the $15 million target in the first quarter, numerous opportunities remain to be seized. This document outlines our strategic bets across product opportunities and the investments necessary to reach our GMV goals this year.</p>\n<h4><a name=\"key-points-3\" class=\"anchor\" href=\"https://gov.gitcoin.co#key-points-3\"></a>Key Points</h4>\n<ul>\n<li><strong>Market Focus</strong>: Maintain a focus on web3 and EVM, as we believe this market is sufficient to meet our targets and we have the most strategic advantages in.</li>\n<li><strong>Go-to-Market (GTM) Strategy</strong>: Expand the scope to accelerate opportunity creation, emphasize a land-and-expand approach, and improve our software development process to create more impactful features.</li>\n<li><strong>Product Strategy</strong>: We predict 60-70% of our GMV will come from QF on Grants Stack, with the remaining 30-40% from other initiatives like EasyRetroPGF and Allo builds. Other product bets will be limited in Q2, with a review planned at the end of the quarter.</li>\n</ul>\n<h3><a name=\"detailed-strategy-4\" class=\"anchor\" href=\"https://gov.gitcoin.co#detailed-strategy-4\"></a>Detailed Strategy</h3>\n<h4><a name=\"qf-on-grants-stack-5\" class=\"anchor\" href=\"https://gov.gitcoin.co#qf-on-grants-stack-5\"></a>QF on Grants Stack</h4>\n<p><strong>Main Objective</strong>: Enhance our QF business via Grants Stack GTM and product improvements to achieve the majority of our GMV this year.</p>\n<p><strong>Challenges and Solutions</strong>:</p>\n<ul>\n<li><strong>GTM Execution</strong>: We need to accelerate our GTM efforts with newly hired key personnel, focusing on rapid execution.</li>\n<li><strong>Product Improvement</strong>: Elevate our Grants Stack product from good to great, demonstrating our capability and innovation to the market.</li>\n</ul>\n<p><strong>Key Actions</strong>:</p>\n<ol>\n<li><strong>Expand Opportunities</strong>: Move beyond L2s to target large tokenized treasuries, such as LSTs/LRSTs, GameFi, DePIN, and DeFi 2.0 memecoins.\n<ul>\n<li><em>Q2 Goal</em>: Identify and pitch to new segments, securing a new client in one of these areas.</li>\n</ul>\n</li>\n<li><strong>Land and Expand Strategy</strong>: Increase initial commitment sizes and provide a clear roadmap for clients to increase their spend.\n<ul>\n<li><em>Q2 Goal</em>: Ensure client satisfaction and higher investment through excellent service and new service models. Target commitments from Avalanche, Polygon, and Zuzalu for larger subsequent rounds.</li>\n</ul>\n</li>\n<li><strong>Product Advancements</strong>: Implement enhancements based on customer feedback, such as MACI, whitelabel solutions, fiat checkout, and support for new tokens/chains.\n<ul>\n<li><em>Q2 Goal</em>: Improve core QF product and UX, embracing the Unix philosophy and enhancing the user experience, particularly for managers and builders.</li>\n</ul>\n</li>\n</ol>\n<h4><a name=\"other-bets-allo-builds-and-easy-rpgf-6\" class=\"anchor\" href=\"https://gov.gitcoin.co#other-bets-allo-builds-and-easy-rpgf-6\"></a>Other Bets: Allo Builds and Easy RPGF</h4>\n<p><strong>Objective</strong>: Generate $10M+ in GMV from innovative product bets, with a focus on Allo builds and Easy RPGF.</p>\n<p><strong>Key Initiatives</strong>:</p>\n<ol>\n<li><strong>Allo Builds</strong>: Engage with integrators like REDACTED, 1Hive, Streaming QF and explore future opportunities.</li>\n<li><strong>Easy RPGF</strong>: Build on the success of the OP RPGF Version 3 and evaluate scaling opportunities post-pilot.\n<ul>\n<li><em>Q2 Goal</em>: Achieve $1M+ commitment from the large pilot program and build a pipeline to $5-10M for the year.</li>\n</ul>\n</li>\n</ol>\n<p><strong>Direct Grants</strong>: If Allo builds and Easy RPGF don’t gain expected traction, shift focus to Direct Grants v2.</p>\n<h3><a name=\"long-term-vision-and-experiments-7\" class=\"anchor\" href=\"https://gov.gitcoin.co#long-term-vision-and-experiments-7\"></a>Long-Term Vision and Experiments</h3>\n<p><strong>Builder Ecosystem</strong>: Encourage other builders to develop on top of Allo, prioritizing high-potential opportunities like the Arbitrum LTIP.</p>\n<p><strong>Continued Innovation</strong>: Conduct ongoing experiments with new ideas like Easy Protocol Guild and other initiatives from the Rainbowpaper.</p>\n<h3><a name=\"ambitious-targets-8\" class=\"anchor\" href=\"https://gov.gitcoin.co#ambitious-targets-8\"></a>Ambitious Targets</h3>\n<p><strong>Why $50M?</strong>: Despite the ambitious nature of the $50M target, it serves as a stretch goal to drive innovation and growth. We are leveraging a favorable market, recent product releases, and our strong brand and community to aim high.</p>\n<h3><a name=\"conclusion-9\" class=\"anchor\" href=\"https://gov.gitcoin.co#conclusion-9\"></a>Conclusion</h3>\n<p>By setting quarterly targets and continually refining our strategies, we aim to achieve our GMV goals while fostering growth and innovation. Our focus remains on leveraging existing strengths, expanding into new opportunities, and maintaining a customer-centric approach to drive success throughout 2024.</p>\n            <p><small>7 posts - 4 participants</small></p>\n            <p><a href=\"https://gov.gitcoin.co/t/2024-gmv-strategy-overview-grants-lab/18805\">Read full topic</a></p>","link":"https://gov.gitcoin.co/t/2024-gmv-strategy-overview-grants-lab/18805","pubDate":"Wed, 15 May 2024 14:27:20 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"gov.gitcoin.co-topic-18805"},"source":{"@url":"https://gov.gitcoin.co/t/2024-gmv-strategy-overview-grants-lab/18805.rss","#text":"2024 GMV Strategy Overview - Grants Lab"}},{"title":"[Proposal] Delegate Gitcoin's GloDollar to fund public goods via GloDollar","dc:creator":"deltajuliet","category":"🧙 🧙‍♀️ Ideas and Open Discussion","description":"<p>Following community discussions and previous successful collaborations with the Glo Consortium, we’re proposing to delegate our existing $100K worth of GloDollars specifically for funding public goods. This proposal aligns with our mission to utilize decentralized finance tools for societal benefit.</p>\n<p>You can find the original proposal <a href=\"https://gov.gitcoin.co/t/proposal-exchange-100k-usdc-in-matching-pool-funds-for-100k-glo-dollar/16796\">here</a>. Thanks to <a class=\"mention\" href=\"https://gov.gitcoin.co/u/garm\">@garm</a> <a class=\"mention\" href=\"https://gov.gitcoin.co/u/jengajojo\">@jengajojo</a> and <a class=\"mention\" href=\"https://gov.gitcoin.co/u/coachjonathan\">@CoachJonathan</a> for support on drafting this update.</p>\n<p>We propose the delegation (in this case referring to donating the yield) of GloDollars to directly fund chosen public goods using <a href=\"https://www.glodollar.org/articles/glo-dollar-2-0\">Glo Dollar 2.0</a>. This proposal does not directly fall within our core operations of financial diversification but is in harmony with our broader mission to fund impactful initiatives. The unique mechanism of GloDollar allows our community to engage in Public Goods Funding passively, while continuing our mission directly.</p>\n<h2><a name=\"a-quick-recap-understanding-glodollars-public-goods-funding-and-gitcoins-participation-1\" class=\"anchor\" href=\"https://gov.gitcoin.co#a-quick-recap-understanding-glodollars-public-goods-funding-and-gitcoins-participation-1\"></a>A quick recap - Understanding GloDollars, Public Goods Funding and Gitcoin’s Participation</h2>\n<p><strong>TL:DR</strong> GloDollars generate yield through the earnings on reserves backing the stablecoin. With Glo Dollar 2.0, this yield is automatically directed to fund public goods and charities—a process GloDollar term’s “Automatic Public Goods Funding” (AutoPGF).</p>\n<p>Here’s how it works:</p>\n<ul>\n<li>The reserves that back GloDollars generate a financial return. These reserves are managed to ensure stability and profitability.</li>\n<li>Through AutoPGF, the yield from GloDollars within the \"Web3 Public Goods” is allocated to various charitable causes which are: Gitcoin, Giveth and Protocol Guild. GloDollar holders can influence where this yield is directed via the GloDollar platform, choosing from a range of public goods and charities. Read more <a href=\"https://twitter.com/glodollar/status/1785670745089270259\">here</a>.</li>\n<li>The term “delegate” is used to describe the process whereby GloDollars are allocated to generate yield that is then directed towards funding public goods. Delegating GloDollars does not involve transferring ownership or voting rights. Instead, it involves directing the financial benefits (yield) generated by these stablecoins to support chosen causes, without the need to donate the tokens themselves. For more detailed insights, you can visit GloDollar’s recently published page: <a href=\"https://www.glodollar.org/articles/how-were-funding-public-goods\">How We’re Funding Public Goods</a>.</li>\n</ul>\n<p>Upon approval, we will proceed to work with GloDollar to manually delegate the amount of GloDollars in the matching pool to fund public goods for a period of 12 months from the funds sitting in the multi-sig. At the end of this 12 month period, as per the initial agreement - we can choose to keep the funds or initiate the swap back for $100K USDC to the Matching Pool after the delegation period.</p>\n<p>We are committed to transparency and will keep the community informed about significant developments regarding our GloDollar activities. We value your input and engagement, which are crucial in steering our collective efforts toward the most meaningful impacts.</p>\n<p>*<em>once the community has weighed in on this update, we can move to a formal proposal or as an update on the original proposal <a href=\"https://gov.gitcoin.co/t/proposal-exchange-100k-usdc-in-matching-pool-funds-for-100k-glo-dollar/16796\">here</a>.</em></p>\n<p>Yes: Approve the delegation of GloDollars for the funding of public goods.</p>\n<p>No: Do not proceed with this delegation.</p>\n<p>Abstain: Choose not to vote on this proposal.</p>\n            <p><small>2 posts - 2 participants</small></p>\n            <p><a href=\"https://gov.gitcoin.co/t/proposal-delegate-gitcoins-glodollar-to-fund-public-goods-via-glodollar/18804\">Read full topic</a></p>","link":"https://gov.gitcoin.co/t/proposal-delegate-gitcoins-glodollar-to-fund-public-goods-via-glodollar/18804","pubDate":"Wed, 15 May 2024 12:43:41 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"gov.gitcoin.co-topic-18804"},"source":{"@url":"https://gov.gitcoin.co/t/proposal-delegate-gitcoins-glodollar-to-fund-public-goods-via-glodollar/18804.rss","#text":"[Proposal] Delegate Gitcoin's GloDollar to fund public goods via GloDollar"}},{"title":"Harmonizing Community and Technology @ Gitcoin","dc:creator":"Viriya","category":"🧙 🧙‍♀️ Ideas and Open Discussion","description":"<h3><a name=\"tldr-1\" class=\"anchor\" href=\"https://gov.gitcoin.co#tldr-1\"></a><strong>tl;dr</strong></h3>\n<ul>\n<li>Gitcoin’s technology, including the Grants Stack and Allo Protocol, provides credibly neutral tools for capital distribution, while the community is an enthusiastic group of public goods champions.</li>\n<li>Gitcoin’s technology and community are distinct yet complementary parts in supporting our purpose-driven flywheel &amp; mission.</li>\n<li>Harmonizing technology and community efforts is key to Gitcoin’s future success, as it will drive growth and catalyze change in line with the organization’s mission and values.</li>\n</ul>\n<h3><a name=\"introduction-2\" class=\"anchor\" href=\"https://gov.gitcoin.co#introduction-2\"></a>Introduction</h3>\n<p>Since the introduction of our technology, the problem I’ve continued to bump up against is that our tech stack (Grants Stack and Allo Protocol) is a credibly neutral set of tools that allows anyone to distribute capital to fund what matters most to them.</p>\n<p>and this feels distinct from…</p>\n<p>The community, a sincere group of people who believe that crypto can be used to promote human thriving — I can say with certainty that the people deep in our orbit are anything but “credibly neutral”.</p>\n<p>I know that others at Gitcoin have struggled to see the connection and so I think these two concepts are worth defining and distinguishing to drive more clarity on how they can coexist with each other.</p>\n<p>The purpose of each of these entities are more or less defined as such:</p>\n<ol>\n<li>\n<p>Technology: Drive development and adoption of our products to support our mission at scale. This work is wholly owned and stewarded by Grants Lab</p>\n</li>\n<li>\n<p>Community: Foster a thriving, passionate community that acts as an exemplar for model for our mission. This work is wholly owned and stewarded by The Ecosystem Collective</p>\n</li>\n</ol>\n<p>Here’s how I think we can do both and do them well:</p>\n<p></p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://gov.gitcoin.co/uploads/db4391/original/2X/3/340278b8291c72fa54e851e809020fc471aade76.png\" data-download-href=\"https://gov.gitcoin.co/uploads/db4391/340278b8291c72fa54e851e809020fc471aade76\" title=\"Screenshot 2024-05-15 at 10.54.56 AM\"><img src=\"https://gov.gitcoin.co/uploads/db4391/optimized/2X/3/340278b8291c72fa54e851e809020fc471aade76_2_625x500.png\" alt=\"Screenshot 2024-05-15 at 10.54.56 AM\" data-base62-sha1=\"7q67FIBLlJod0cKe8iQATROWviK\" width=\"625\" height=\"500\" srcset=\"https://gov.gitcoin.co/uploads/db4391/optimized/2X/3/340278b8291c72fa54e851e809020fc471aade76_2_625x500.png, https://gov.gitcoin.co/uploads/db4391/optimized/2X/3/340278b8291c72fa54e851e809020fc471aade76_2_937x750.png 1.5x, https://gov.gitcoin.co/uploads/db4391/original/2X/3/340278b8291c72fa54e851e809020fc471aade76.png 2x\" data-dominant-color=\"F4F4F4\"></a></div><p></p>\n<h3><a name=\"what-is-gitcoin-3\" class=\"anchor\" href=\"https://gov.gitcoin.co#what-is-gitcoin-3\"></a>What is Gitcoin?</h3>\n<p>With the emergence of Gitcoin 2.0, our whitepaper and other planned initiatives, we are working to reinforce our position as leaders in the web3 grants/capital allocation space. Gitcoin = Grants and we enable communities to fund what matters to them with grants.</p>\n<p>Under the umbrella of Gitcoin, we strive to be a thought leader and an exemplar model for how our capital allocation can be leveraged both for ecosystem growth and to fund the common good.</p>\n<p>We have a purpose-driven flywheel centered around our mission of funding OSS that is currently poised to look something like:</p>\n<p></p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://gov.gitcoin.co/uploads/db4391/original/2X/2/2ca0006c68d40e4e21af46b357a4f9d193f9dc7c.png\" data-download-href=\"https://gov.gitcoin.co/uploads/db4391/2ca0006c68d40e4e21af46b357a4f9d193f9dc7c\" title=\"Screenshot 2024-05-15 at 11.01.18 AM\"><img src=\"https://gov.gitcoin.co/uploads/db4391/optimized/2X/2/2ca0006c68d40e4e21af46b357a4f9d193f9dc7c_2_351x375.png\" alt=\"Screenshot 2024-05-15 at 11.01.18 AM\" data-base62-sha1=\"6mLOgbFfSAQTSDeYaIRyGrALvpa\" width=\"351\" height=\"375\" srcset=\"https://gov.gitcoin.co/uploads/db4391/optimized/2X/2/2ca0006c68d40e4e21af46b357a4f9d193f9dc7c_2_351x375.png, https://gov.gitcoin.co/uploads/db4391/original/2X/2/2ca0006c68d40e4e21af46b357a4f9d193f9dc7c.png 1.5x, https://gov.gitcoin.co/uploads/db4391/original/2X/2/2ca0006c68d40e4e21af46b357a4f9d193f9dc7c.png 2x\" data-dominant-color=\"F7F7F7\"></a></div><p></p>\n<p>**<em>Given we are pre-revenue, what the DAO chooses to do with profits is yet to be exactly codified but I think this is a fairly safe model to assume given our shared desire to make impact and the org’s historical values.</em></p>\n<p>We make this happen with two levers: our technology and our community.</p>\n<h3><a name=\"technology-4\" class=\"anchor\" href=\"https://gov.gitcoin.co#technology-4\"></a>Technology</h3>\n<p>Our tools are made to enable any community to fund what matters to them. Most communities focus their grants programs on fuelling growth of some nature and so Grants = Growth reflects Grants Stack’s purpose of enabling any community to use grants to fulfil their mission.</p>\n<p>There are a variety of tactics that will support product adoption, some of which are listed in the above diagram as examples, some of which live in internal-facing GTM plans that will continue to be executed on <img src=\"https://gov.gitcoin.co/images/emoji/twitter/slightly_smiling_face.png?v=12\" title=\":slightly_smiling_face:\" class=\"emoji\" alt=\":slightly_smiling_face:\" loading=\"lazy\" width=\"20\" height=\"20\"></p>\n<h3><a name=\"community-5\" class=\"anchor\" href=\"https://gov.gitcoin.co#community-5\"></a>Community</h3>\n<p>As Gitcoin evolves, I feel that the lever of “community” is slighly more ambiguous of the two and deserves some attention with regard to how we’re thinking about efforts from the Ecosystem Collective contribute to Gitcoin’s overall mission, vision and Allo GMV.</p>\n<p>As a collective, we strive to be the exemplar model for how to use our tech stack. We work to exemplify the power of community-driven capital allocation to fuel growth and we want to fuel growth for (the common) good — because it matters to us.</p>\n<p>We do this through:</p>\n<ol>\n<li>The Gitcoin Grants (GG) program, which includes:\n<ul>\n<li>Funding OSS as a lever to advance the common good through Gitcoin’s flagship OSS GG rounds</li>\n<li>Giving values-aligned, adjacent communities opportunities to fund what matters to them through GG community rounds</li>\n</ul>\n</li>\n<li>Citizen Grants, which encompasses:\n<ul>\n<li>funding strategic initiatives that add value to our network with the aim of expediting our mission at scale</li>\n</ul>\n</li>\n</ol>\n<p>Among other initiatives, these two in particular use our tech stack and drive GMV through Allo (aligning to our north star goal) and positions our community as an examplar model of how to use our stack — both from a technical standpoint and from the vantage point of fulfilling Gitcoin’s vision (a world shaped by community-led positive change).</p>\n<p>As a community of purpose-driven public goods champions, I think that these are important things to articulate and discuss to drive more clarity around how we are (and always will be) working toward our impact mission—specifically enabled by Gitcoin Grants—how that mission is bolstered (not hindered) by the emergence of our tech in the Gitcoin 2.0 future.</p>\n<p>In essence, by harmonizing our technology and community efforts, I believe that Gitcoin is poised to drive growth and catalyze meaningful change in line with our mission and values.</p>\n<p></p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://gov.gitcoin.co/uploads/db4391/original/2X/c/c070829c6f9a3890fcc38c187d9516c225fc8b56.jpeg\" data-download-href=\"https://gov.gitcoin.co/uploads/db4391/c070829c6f9a3890fcc38c187d9516c225fc8b56\" title=\"8q3ywx\"><img src=\"https://gov.gitcoin.co/uploads/db4391/optimized/2X/c/c070829c6f9a3890fcc38c187d9516c225fc8b56_2_517x290.jpeg\" alt=\"8q3ywx\" data-base62-sha1=\"rsoJ1XFGGaOtzsmtjmeWoWl4Ovs\" width=\"517\" height=\"290\" srcset=\"https://gov.gitcoin.co/uploads/db4391/optimized/2X/c/c070829c6f9a3890fcc38c187d9516c225fc8b56_2_517x290.jpeg, https://gov.gitcoin.co/uploads/db4391/optimized/2X/c/c070829c6f9a3890fcc38c187d9516c225fc8b56_2_775x435.jpeg 1.5x, https://gov.gitcoin.co/uploads/db4391/original/2X/c/c070829c6f9a3890fcc38c187d9516c225fc8b56.jpeg 2x\" data-dominant-color=\"404248\"></a></div><p></p>\n            <p><small>3 posts - 3 participants</small></p>\n            <p><a href=\"https://gov.gitcoin.co/t/harmonizing-community-and-technology-gitcoin/18799\">Read full topic</a></p>","link":"https://gov.gitcoin.co/t/harmonizing-community-and-technology-gitcoin/18799","pubDate":"Wed, 15 May 2024 09:02:43 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"gov.gitcoin.co-topic-18799"},"source":{"@url":"https://gov.gitcoin.co/t/harmonizing-community-and-technology-gitcoin/18799.rss","#text":"Harmonizing Community and Technology @ Gitcoin"}},{"title":"Razon Existensial","dc:creator":"Alex1","category":"🤖 DAO Governance and Vision","description":"<h2><a name=\"diferencias-entre-pensamiento-abstracto-y-pensamiento-concreto-1\" class=\"anchor\" href=\"https://gov.gitcoin.co#diferencias-entre-pensamiento-abstracto-y-pensamiento-concreto-1\"></a>Diferencias entre pensamiento abstracto y pensamiento concreto.</h2>\n<p>Al inicio del artículo, hemos hecho alusión al pensamiento concreto como un tipo de pensamiento opuesto al que nos ocupa. Pero, ¿en qué se diferencian estos dos tipos de pensamiento? Vamos a verlo.</p>\n<ul>\n<li><strong>El abstracto nos permite procesar, describir y manipular la información mental, mientras que el pensamiento concreto hace lo mismo, pero con objetos del mundo físico</strong>.</li>\n<li>Por otro lado, el abstracto sigue un proceso</li>\n</ul>\n<p>hipotético-deductivo, es decir, que nos permite realizar hipótesis sin necesidad de ponerlas a prueba de forma empírica. En cambio, a través del pensamiento concreto solo pueden formularse conocimientos a través de la experiencia) directa con el fenómeno en cuestión (es decir, este sería un tipo de pensamiento inductivo).</p>\n<ul>\n<li>El abstracto va lo de lo general a lo particular (lo cual permite formular leyes y teorías, por ejemplo). En cambio, el concreto va de lo particular a lo general.</li>\n<li>Finalmente, <strong>el abstracto permite dar paso a la reflexión y al <a href=\"https://lamenteesmaravillosa.com/habilidades-para-el-debate/\" rel=\"noopener nofollow ugc\">debate</a></strong> (se trata de un pensamiento flexible), y el pensamiento concreto, por contra, no permite variaciones, ya que se fundamenta en lo tangible y lo evidente.#</li>\n</ul>\n<h2><a name=\"patologas-que-afectan-a-este-tipo-de-pensamiento-2\" class=\"anchor\" href=\"https://gov.gitcoin.co#patologas-que-afectan-a-este-tipo-de-pensamiento-2\"></a>Patologías que afectan a este tipo de pensamiento</h2>\n<p>Las personas que sufren patologías que afectan a su cognición abstracta suelen fallar en tareas de extrapolación, planificación y pensar de manera simbólica. <strong>Entre ellos se encuentran la esquizofrenia, las demencias o la discalculia.</strong> Para todos ellos es necesario un diagnóstico que, aparte de detectar este déficit en la abstracción de pensamiento, les aplique un tratamiento que garantice calidad de vida.</p>\n<p>Como hemos visto, el pensamiento abstracto “se encuentra en todas partes” y presenta notables ventajas a la hora de estimular otros tipos de pensamiento como la reflexión o el razonamiento. Existen múltiples tipos de pensamiento: convergente, divergente, práctico, teórico, literal… <strong>¿Cuál es el mejor? Todos y ninguno; siempre lo será el que mejor se adapte a la tarea que queramos desarrollar</strong>, por eso la flexibilidad es otro valor añadido a nuestra cognición.</p>\n            <p><small>1 post - 1 participant</small></p>\n            <p><a href=\"https://gov.gitcoin.co/t/razon-existensial/18798\">Read full topic</a></p>","link":"https://gov.gitcoin.co/t/razon-existensial/18798","pubDate":"Wed, 15 May 2024 06:30:02 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"gov.gitcoin.co-topic-18798"},"source":{"@url":"https://gov.gitcoin.co/t/razon-existensial/18798.rss","#text":"Razon Existensial"}},{"title":"Reduce TTV on Custom Builds -- Allo Starter Kit","dc:creator":"owocki","category":"🧙 🧙‍♀️ Ideas and Open Discussion","description":"<h1><a name=\"tldr-1\" class=\"anchor\" href=\"https://gov.gitcoin.co#tldr-1\"></a>TLDR</h1>\n<ul>\n<li>Gitcoin Grants Lab offers two types of partnerships: pre-baked products and completely customized builds.</li>\n<li>The Allo Starter Kit aims to address the tradeoff between customization and scalability by enabling quick creation of fully customized Allo builds.</li>\n<li>A Proof of Concept (POC) demonstrates basic components for an Allo app, with plans for an MVP including UI refinement, documentation creation, and internal testing.</li>\n<li>The Allo Starter Kit has the potential to reduce time-to-value (TTV) for new builds, increase market agility, but open questions remain regarding maintenance, customer demand, breadth of Allo builds, and potential cross-selling opportunities.</li>\n</ul>\n<h1><a name=\"context-2\" class=\"anchor\" href=\"https://gov.gitcoin.co#context-2\"></a>Context</h1>\n<p>Gitcoin Grants Lab currently has two modalities of customer partnership.</p>\n<ol>\n<li>We sell you a pre-baked product (QF on Grants Stack, RetroPGF on EasyRetroPGF) which is customizable up to a certain point.</li>\n<li>We sell you a completely customized product for your build (Arbitrum LTIP, Maci on Allo).</li>\n</ol>\n<p>There is an important tradeoff space here.</p>\n<ol>\n<li>The formerly is only partially customizable but comes with economies of scale because the COGS (costs of good sold) scales sublinearly to the number of customers (after the first one).</li>\n<li>The latter is completely customizable (increasing the chance of a win at the cost of dev/product/account manager bandwidth) at the cost of COGS scaling linearly with customers.\n<ol>\n<li>Note: If we succeed in graduating a product from the latter to the former, then COGS would scale sublinearly.</li>\n<li>Thereby, we can currently build custom things only (1) for important customers (2) for large expected value (on a GMV basis) customers or (3) if we think that we can resale the product to another customer.</li>\n</ol>\n</li>\n</ol>\n<h1><a name=\"the-design-space-3\" class=\"anchor\" href=\"https://gov.gitcoin.co#the-design-space-3\"></a>The Design Space</h1>\n<p>The design space can be drawn as:</p>\n<p></p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://gov.gitcoin.co/uploads/db4391/original/2X/4/4b9a00f8f7f5fdfffa2e986287f61b84302278e8.jpeg\" data-download-href=\"https://gov.gitcoin.co/uploads/db4391/4b9a00f8f7f5fdfffa2e986287f61b84302278e8\" title=\"\"><img src=\"https://gov.gitcoin.co/uploads/db4391/optimized/2X/4/4b9a00f8f7f5fdfffa2e986287f61b84302278e8_2_457x401.jpeg\" alt=\"\" data-base62-sha1=\"aMNLeKoyp2kVFu2FZJuHW4QkDxK\" width=\"457\" height=\"401\" role=\"presentation\" srcset=\"https://gov.gitcoin.co/uploads/db4391/optimized/2X/4/4b9a00f8f7f5fdfffa2e986287f61b84302278e8_2_457x401.jpeg, https://gov.gitcoin.co/uploads/db4391/optimized/2X/4/4b9a00f8f7f5fdfffa2e986287f61b84302278e8_2_685x601.jpeg 1.5x, https://gov.gitcoin.co/uploads/db4391/optimized/2X/4/4b9a00f8f7f5fdfffa2e986287f61b84302278e8_2_914x802.jpeg 2x\" data-dominant-color=\"FAFAFC\"></a></div><p></p>\n<h1><a name=\"solving-for-this-tradeoff-space-4\" class=\"anchor\" href=\"https://gov.gitcoin.co#solving-for-this-tradeoff-space-4\"></a>Solving for this tradeoff space.</h1>\n<p>I think that we can solve for this tradeoff space by creating an Allo Starter Kit that allows anyone to create a new completely customized build within hours (not days/weeks).</p>\n<p>Such a tool would reduce the TTV (Time to Value) for new Allo based builds, enabling more strategic agility in our GTM.</p>\n<h2><a name=\"allo-starter-kit-poc-5\" class=\"anchor\" href=\"https://gov.gitcoin.co#allo-starter-kit-poc-5\"></a>Allo Starter Kit POC</h2>\n<p><a class=\"mention\" href=\"https://gov.gitcoin.co/u/carlb\">@carlb</a> recently did some exploration of this. He created an Allo UI Component SDK dev kit.</p>\n<p>For scope he just did some very basic components to demonstrate</p>\n<ul>\n<li>\n<p>Components for Discover Rounds &amp; Projects, Details for Round and Project</p>\n</li>\n<li>\n<p>Wallet components (connect button) with the configuration Gitcoin / Allo supports/prefers</p>\n</li>\n<li>\n<p>Data fetching is happening inside these components so the dev only has to send a query prop to define what data to fetch (only show rounds with specific strategies, sorting, pagination, …)</p>\n</li>\n<li>\n<p>Uses tailwind and can easily be themed with colors and fonts</p>\n</li>\n</ul>\n<p>This is a proof of concept of an app that would enable a developer to create an Allo app from an existing strategy in 10 min.</p>\n<p>He Recorded a loom showing it in action:</p>\n          <video title=\"Allo SDK for Components Exploration\" width=\"695\" height=\"434\" style=\"max-width:100%\" poster=\"https://cdn.loom.com/sessions/thumbnails/5ad67d683eef4011adf5bb7a86837d8b-00001.gif\" controls=\"\">\n            <source src=\"https://cdn.loom.com/sessions/transcoded/5ad67d683eef4011adf5bb7a86837d8b.mp4?Policy=eyJTdGF0ZW1lbnQiOlt7IlJlc291cmNlIjoiaHR0cHM6Ly9jZG4ubG9vbS5jb20vc2Vzc2lvbnMvdHJhbnNjb2RlZC81YWQ2N2Q2ODNlZWY0MDExYWRmNWJiN2E4NjgzN2Q4Yi5tcDQiLCJDb25kaXRpb24iOnsiRGF0ZUxlc3NUaGFuIjp7IkFXUzpFcG9jaFRpbWUiOjE3MTU3OTUxNDl9fX1dfQ__&amp;Key-Pair-Id=KQOSYIR44AIC0&amp;Signature=dU%7EBy2oVqGY0%7EjGqds2wDdVJrzetEZ1sbE0PFl3nX3R9P%7EJUPZgYNT55mkfhzF27MyC3-Y9WSjxCfDVGC4P1fxDpPxe893JgK3SBF3fnNlBn1hfg0CKU%7Ek-RUr%7Ev-fCS34ms-RZmOAmA9cT2zIKhjc%7EAu1SPtGT3q3sGs4IIazYe0oTfn98V2jMsVYANEL7dldkucgRfO3aMKrkIGQyzHB3r5HaFYEzYVYSI1md8BPZdSP7AusCugxYzs2xiEu5W8641JpgnymOrD-QWBHsuWZhNj1bfcyg9C71xXDZEbwtnS8u2yg%7EOdY54oU-w1C8yrT1w0RvuvlUGY4kj5l2mmQ__\">\n          </video>\n\n<p>Watch this ^^ then continue</p>\n<h2><a name=\"allo-starter-kit-mvp-6\" class=\"anchor\" href=\"https://gov.gitcoin.co#allo-starter-kit-mvp-6\"></a>Allo Starter Kit MVP</h2>\n<p>What would an MVP of this app look like?</p>\n<ol>\n<li>Design team skin the starter kit in such a way that the components look good.</li>\n<li>Carl continues to build out Starter Kit.</li>\n<li>DevRel\n<ol>\n<li>Create documentation about how to use the starter kit to create a full webapp in &lt; 1 hour.</li>\n<li>Create documentation about how to (1) use existing Allo strategies or (2) create a new Allo strategy in &lt; 1 hour.</li>\n</ol>\n</li>\n<li>Ship it</li>\n<li>Start using it internally for important builds we have coming up (MACI for QF, Arbitrum LTIP, or other things on <a href=\"https://docs.google.com/document/d/1zhUsjdaeyImnaECIsVf2hFg2VUmysUhPGYP6efGjOIE/edit\">Megs $50m GMV roadmap</a>) to realize cost savings for existing projects.</li>\n<li>If it works internally, start shipping it to Gitcoin Citizens + broader Gitcoin community (along with a list of requested builds).</li>\n</ol>\n<h1><a name=\"the-design-space-in-a-year-7\" class=\"anchor\" href=\"https://gov.gitcoin.co#the-design-space-in-a-year-7\"></a>The Design Space in a year</h1>\n<p>Once the <a href=\"https://gov.gitcoin.co/t/opening-up-grants-stack-allo-to-more-community-contributions/17145\">Grants Stack plugin system is built</a> and the Allo starter kit has shipped, I think the design space looks like this:</p>\n<p></p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://gov.gitcoin.co/uploads/db4391/original/2X/f/f6a2c4e5e5a325557cff0981020d53b87fe6430d.png\" data-download-href=\"https://gov.gitcoin.co/uploads/db4391/f6a2c4e5e5a325557cff0981020d53b87fe6430d\" title=\"\"><img src=\"https://gov.gitcoin.co/uploads/db4391/optimized/2X/f/f6a2c4e5e5a325557cff0981020d53b87fe6430d_2_622x500.png\" alt=\"\" data-base62-sha1=\"zbQbItu4NmArkUBGC6OOHF37tgx\" width=\"622\" height=\"500\" role=\"presentation\" srcset=\"https://gov.gitcoin.co/uploads/db4391/optimized/2X/f/f6a2c4e5e5a325557cff0981020d53b87fe6430d_2_622x500.png, https://gov.gitcoin.co/uploads/db4391/optimized/2X/f/f6a2c4e5e5a325557cff0981020d53b87fe6430d_2_933x750.png 1.5x, https://gov.gitcoin.co/uploads/db4391/optimized/2X/f/f6a2c4e5e5a325557cff0981020d53b87fe6430d_2_1244x1000.png 2x\" data-dominant-color=\"F7F7FB\"></a></div><p></p>\n<h1><a name=\"conclusion-8\" class=\"anchor\" href=\"https://gov.gitcoin.co#conclusion-8\"></a>Conclusion</h1>\n<p>By investing in an Allo Starter Kit, we can reduce the TTV of new builds, and therefore strategically increase agility of our go to market with customers.</p>\n<p>Though it is not a primary consideration in this document, there are secondary benefits to this investment. This Allo starter kit would complement and accelerate bottoms-up leadership initiatives already in motion such as those outlined in briefs on <a href=\"https://gov.gitcoin.co/t/gitcoin-could-embrace-the-unix-philosophy-to-create-exponential-innovation/18602\">Unix Philosophy</a>.</p>\n<h1><a name=\"open-questions-9\" class=\"anchor\" href=\"https://gov.gitcoin.co#open-questions-9\"></a>Open Questions</h1>\n<ol>\n<li>Once we’ve built something successfully for a customer, who maintains it? How does an app progress from a POC to a fully maintained app?</li>\n<li>How many customers demand completely custom build outs, vs can be satisfied with our existing toolsets?\n<ol>\n<li>Right now we have a goal to go DEEP on Allo GMV in 2024… How BROAD will we need to go on Allo builds to create that?</li>\n<li>Can we cross-sell a product suite with enormous agility/breadth to enable further landing + expanding at customers? Does this become a USP for us?</li>\n</ol>\n</li>\n</ol>\n            <p><small>1 post - 1 participant</small></p>\n            <p><a href=\"https://gov.gitcoin.co/t/reduce-ttv-on-custom-builds-allo-starter-kit/18796\">Read full topic</a></p>","link":"https://gov.gitcoin.co/t/reduce-ttv-on-custom-builds-allo-starter-kit/18796","pubDate":"Tue, 14 May 2024 17:49:35 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"gov.gitcoin.co-topic-18796"},"source":{"@url":"https://gov.gitcoin.co/t/reduce-ttv-on-custom-builds-allo-starter-kit/18796.rss","#text":"Reduce TTV on Custom Builds -- Allo Starter Kit"}},{"title":"PGN Shutdown - A Recap","dc:creator":"deltajuliet","category":"PGN","description":"<h2><a name=\"tldr-1\" class=\"anchor\" href=\"https://gov.gitcoin.co#tldr-1\"></a>TL;DR:</h2>\n<ul>\n<li>PGN is shutting down as planned; over the last 4 months, no viable proposals have been presented to take over.</li>\n<li>Gitcoin is focused on funding public goods through our quarterly rounds + building software to allow people to run their own rounds.</li>\n<li>PGN was an experiment in a new way to fund public goods.  While it didnt work the way we’d hoped, we learned a lot.  We are proud to be a place where bold new experiments are tried, even at the risk of failure.</li>\n<li>We are actively collaborating with partners to help users retrieve their funds. The PGN team is currently working to ensure that all assets will still be available and claimable post shut down. Users can sign up to an email list here to stay updated on the latest: <a href=\"https://share.hsforms.com/1Pyt-MWlERGqdWPQNx_EUtQd0r2h\" class=\"inline-onebox\">Form</a></li>\n</ul>\n<p>It seems some clarification is still needed on the shutdown of PGN. I want to address any confusion about our lack of detailed rollout on the Gitcoin Foundation’s end. As we reflect on the Public Goods Network (PGN) journey, it’s essential to understand both the successes and challenges we’ve encountered and why we’re not especially excited to hand over the keys given the community’s communication and the challenges we encountered. I want to reiterate notes that Kyle, Nicole, and Sophia have surfaced in their posts  <a href=\"https://gov.gitcoin.co/t/announcing-the-spin-down-of-pgn-eol-june-2024/17430\">here</a>, <a href=\"https://gov.gitcoin.co/t/public-goods-network-retrospective-recommendation-discussion/18772\">here</a> and <a href=\"https://gov.gitcoin.co/t/pgn-technical-transparency-and-the-path-forward/17304\">here</a>.</p>\n<p>The goal of PGN was to create a network dedicated to funding public goods through low transaction fees and innovative mechanisms like Contract Secured Revenue (CSR). Despite incredible community and partner support, we faced significant hurdles. Critical infrastructure was missing at launch, leading to high costs and a subpar user experience. Expensive bridging fees and the absence of essential tools like decentralized exchanges (DEX) made it difficult for users, particularly those with limited resources, to fully engage with the network. Some issues have been fixed, but the overall challenges remain relevant. I’ve talked with partners who have done deep dives into the numbers, mechanisms, and apps to be built on PGN much more intelligently than I have, and ultimately, they also agree that keeping the network alive is not worth it.</p>\n<p>We still plan to shut down the network by June 2024.  In the interim, we are working diligently to ensure a smooth and affordable migration of user assets off the network. This experiment helped us establish meaningful partnerships with organizations like Zora, Base, and OP. It’s those partnerships now that will be helping us get funds back to the users of the network.</p>\n<p><strong>We encourage all users to bridge their assets off PGN</strong> and will provide detailed instructions and support throughout this process as well as double down on sending out comms.</p>\n<h2><a name=\"reiterating-important-learnings-2\" class=\"anchor\" href=\"https://gov.gitcoin.co#reiterating-important-learnings-2\"></a>Reiterating important learnings</h2>\n<p>Many have taken the time to detail PGN’s shortcomings and the learnings we took from this experiment, and what would need to be true for it to be successful in the future. I’ve summed up some of these + other takeaways below for transparency and for the benefit of us learning together:</p>\n<ul>\n<li>We launched PGN without critical infrastructure, which led to high costs and a poor user experience.</li>\n<li>Expensive bridging fees and the lack of essential tools like decentralized exchanges (DEX) made it tough for users to fully engage with the network.</li>\n<li>We struggled to attract the necessary resources to compete with established networks.</li>\n<li>The costs of running PGN exceeded our initial estimates, and we couldn’t provide the high-quality, reliable, and affordable platform users deserved.</li>\n<li>Integrating Contract Secured Revenue (CSR) was harder than we thought, and attracting users without a fully functional network was a challenge.</li>\n<li>Missing essential components like improved wallet integration and a functional DEX created significant barriers for our users.</li>\n<li>Even with strong community and partner support, we couldn’t sustain the network due to these foundational issues.</li>\n<li>Running the experiment at the Foundation level allowed us to iterate quickly but left a bad taste in many mouths due to communication and execution issues.</li>\n<li>We learned that having a dedicated and well-resourced team is crucial to ensure consistent progress and user satisfaction.</li>\n<li>A lack of a detailed and transparent roadmap is essential for communicating shutdown plans led to mis-aligned communication w/ the community.</li>\n<li>This experience underscored the importance of decentralization and involving the community in decision-making processes for future projects.</li>\n</ul>\n<p>Despite this, we haven’t seen substantial proposals submitted to our DAO that include a detailed approach to solve the challenges and meet the necessary qualifications. Key criteria include (as noted by Owocki) but aren’t limited to:</p>\n<ul>\n<li><strong>Financial Backing:</strong> Who is going to pay for it?</li>\n<li><strong>Team:</strong> Who will make it successful? What combination of skillsets and time commitment?</li>\n<li><strong>Unique Selling Proposition (USP):</strong> Specifically, why will builders deploy here and why users will bridge?</li>\n<li><strong>Feasibility:</strong> Why will this succeed when the first PGN experiment failed?</li>\n<li><strong>Support from Gitcoin:</strong> What do you need from Gitcoin, and how will this ensure the successful separation from Gitcoin’s brand?</li>\n</ul>\n<p>Given that the PGN shutdown was announced in January, and it is now May, we believe that we are unlikely to see any legitimate proposals.</p>\n<p>Given these gaps, we will not be planning to pass off any PGN assets in the near future. <strong><em>The future of public goods funding remains central to Gitcoin’s mission</em></strong>, and we must consider all aspects of the organization and its mission, including the pairing of Gitcoin’s name with any further work on the PGN network.</p>\n<h2><a name=\"a-note-to-our-community-3\" class=\"anchor\" href=\"https://gov.gitcoin.co#a-note-to-our-community-3\"></a>A note to our community</h2>\n<p>We appreciate the enthusiasm of our community and hear your calls to revive PGN. While we don’t always agree with the approach taken by some community members, we recognize the underlying passion for securing the future and funding of digital public goods.</p>\n<p>We deeply value our community’s role and acknowledge that our wind-down process, including a detailed roadmap of our plans, wasn’t thoroughly communicated. Moving forward, we are committed to decentralization and involving the community in more decision-making at the DAO level. We aim to be more transparent and inclusive in our processes, ensuring that the community has a voice in shaping the future of public goods funding.</p>\n<p><strong><em>Again, we are working with our team and partners to ensure everyone can get their funds off the network smoothly</em></strong>. We expect to have some updates in the next day or two regarding the migration process and will keep everyone informed through our official channels.</p>\n<p>While PGN itself is winding down, the vision of sustainable public goods funding continues to guide us. We are committed to supporting public goods through our core initiatives, and <a href=\"https://gov.gitcoin.co/t/capturing-value-like-a-slime-mold/17190\">likely other future experiments</a>. The lessons learned from PGN will inform future projects, ensuring that we build on this experience to create more robust and resilient funding mechanisms.</p>\n<p><strong>Users can sign up to an email list here to stay updated on the latest: <a href=\"https://share.hsforms.com/1Pyt-MWlERGqdWPQNx_EUtQd0r2h\" class=\"inline-onebox\">Form</a></strong></p>\n            <p><small>3 posts - 3 participants</small></p>\n            <p><a href=\"https://gov.gitcoin.co/t/pgn-shutdown-a-recap/18794\">Read full topic</a></p>","link":"https://gov.gitcoin.co/t/pgn-shutdown-a-recap/18794","pubDate":"Tue, 14 May 2024 14:34:30 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"gov.gitcoin.co-topic-18794"},"source":{"@url":"https://gov.gitcoin.co/t/pgn-shutdown-a-recap/18794.rss","#text":"PGN Shutdown - A Recap"}},{"title":"Public Goods Funding - generic category","dc:creator":"mars","category":"🧙 🧙‍♀️ Ideas and Open Discussion","description":"<p>A reflection about public goods funding.</p>\n<p>Currently it is separated by categories <em>(climate, tokens, ENS, hackathons, open civics, infra, tooling, apps, …)</em></p>\n<h3><a name=\"what-about-public-goods-funding-in-general-1\" class=\"anchor\" href=\"https://gov.gitcoin.co#what-about-public-goods-funding-in-general-1\"></a>What about public goods funding in general?</h3>\n<p>Two use cases that come to mind, something that I’ve experienced personally.</p>\n<p>Helping a homeless person: improves public safety.</p>\n<p>Reporting bugs to BigTech: saves time for billions of people.</p>\n<p>Real life example. I was editing some event on Facebook, multiple tabs, editing description, switching to another tab with the dates, my entire description reverted to initial version without any warning, I wasn’t happy about it and it made me think about all the settings / defaults / ethical and non-ethical patterns that can literally save lifetimes per day.</p>\n<p></p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://gov.gitcoin.co/uploads/db4391/original/2X/9/9e34d9017701dc47631b245c31f1ee3e6a1433c7.png\" data-download-href=\"https://gov.gitcoin.co/uploads/db4391/9e34d9017701dc47631b245c31f1ee3e6a1433c7\" title=\"image\"><img src=\"https://gov.gitcoin.co/uploads/db4391/optimized/2X/9/9e34d9017701dc47631b245c31f1ee3e6a1433c7_2_690x341.png\" alt=\"image\" data-base62-sha1=\"mzyFhWX9vWF6XrHo09u7xoGIjen\" width=\"690\" height=\"341\" srcset=\"https://gov.gitcoin.co/uploads/db4391/optimized/2X/9/9e34d9017701dc47631b245c31f1ee3e6a1433c7_2_690x341.png, https://gov.gitcoin.co/uploads/db4391/optimized/2X/9/9e34d9017701dc47631b245c31f1ee3e6a1433c7_2_1035x511.png 1.5x, https://gov.gitcoin.co/uploads/db4391/optimized/2X/9/9e34d9017701dc47631b245c31f1ee3e6a1433c7_2_1380x682.png 2x\" data-dominant-color=\"F3F3F4\"></a></div><p></p>\n<h3><a name=\"i-think-there-is-no-downside-2\" class=\"anchor\" href=\"https://gov.gitcoin.co#i-think-there-is-no-downside-2\"></a>I think there is no downside</h3>\n<p>Generic category for all the public goods that do not fit into a specific round.</p>\n            <p><small>6 posts - 4 participants</small></p>\n            <p><a href=\"https://gov.gitcoin.co/t/public-goods-funding-generic-category/18787\">Read full topic</a></p>","link":"https://gov.gitcoin.co/t/public-goods-funding-generic-category/18787","pubDate":"Mon, 13 May 2024 18:04:57 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"gov.gitcoin.co-topic-18787"},"source":{"@url":"https://gov.gitcoin.co/t/public-goods-funding-generic-category/18787.rss","#text":"Public Goods Funding - generic category"}},{"title":"[PASSED] Extending the Term of GG Community Council","dc:creator":"MathildaDV","category":"🌱 Gitcoin Grants","description":"<h2><a name=\"proposal-for-extending-the-term-of-gg-community-council-1\" class=\"anchor\" href=\"https://gov.gitcoin.co#proposal-for-extending-the-term-of-gg-community-council-1\"></a>Proposal for Extending the Term of GG Community Council</h2>\n<h2><a name=\"introduction-2\" class=\"anchor\" href=\"https://gov.gitcoin.co#introduction-2\"></a>Introduction</h2>\n<p>This post is to propose the extension of the term of 7 <a href=\"https://gov.gitcoin.co/t/gg20-community-council/17749\">previously elected Community Council members</a>. When initially elected, the Community Council members were elected to select the Community Rounds only for GG20. Should this proposal pass, we would extend that term beyond GG20 until December 31, 2024.</p>\n<h2><a name=\"details-3\" class=\"anchor\" href=\"https://gov.gitcoin.co#details-3\"></a>Details</h2>\n<p><strong>Reasoning:</strong> to allow them the opportunity to further deepen their involvement with Gitcoin Grants and to shepherd us towards more decentralization and community-led direction. They hold a significant amount of context coming out of GG20, and it would be highly beneficial to keep them on so that they can help shape the future of GG community rounds.</p>\n<p>Each council member has shown deep dedication and commitment to this initiative, as well as providing thoughtful and excellent ideas on how we can improve the process. I would like to see us offer them the opportunity to continue working with us more long term.</p>\n<p>Compensation for council members will reflect their new time commitments. It’s estimated that payments per round will likely increase to $1,500 - $2,000 p/council member, depending on the hours spent. The exact number of rounds that will take place in this calendar year will be confirmed in the coming weeks.</p>\n<p>ICYMI, <a href=\"https://gov.gitcoin.co/t/gg20-community-round-governance-a-retrospective/18766\">read the full Community Round Gov retrospective</a>.</p>\n<h3><a name=\"risks-4\" class=\"anchor\" href=\"https://gov.gitcoin.co#risks-4\"></a>Risks</h3>\n<p>It would delay us inviting new council members until early next year, which could delay us in providing even more diversity within the council.</p>\n<h3><a name=\"vote-5\" class=\"anchor\" href=\"https://gov.gitcoin.co#vote-5\"></a>Vote</h3>\n<p>I would like to have us vote to extend the term of the 7 Community Council members.<br>\n1 - Yes to extending the term of the 7 Community Council members<br>\n2 - No to extending the term of the 7 Community Council members<br>\n3 - Abstain from extending the term of the 7 Community Council members</p>\n            <p><small>13 posts - 10 participants</small></p>\n            <p><a href=\"https://gov.gitcoin.co/t/passed-extending-the-term-of-gg-community-council/18776\">Read full topic</a></p>","link":"https://gov.gitcoin.co/t/passed-extending-the-term-of-gg-community-council/18776","pubDate":"Fri, 10 May 2024 16:39:44 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"gov.gitcoin.co-topic-18776"},"source":{"@url":"https://gov.gitcoin.co/t/passed-extending-the-term-of-gg-community-council/18776.rss","#text":"[PASSED] Extending the Term of GG Community Council"}},{"title":"Public Goods Network Retrospective & Recommendation - Discussion","dc:creator":"sophia","category":"PGN","description":"<p><strong>UPDATE: No fault proofs does not mean money is stuck. We are actively working with key stakeholders to ensure the safety of ALL funds on the network.</strong></p>\n<p><strong>TLDR;</strong></p>\n<p>There’s been a lot of discussion about the future of PGN. We recommend that further questions and conversations about a possible transition move to the Gitcoin forum so that the decision-makers and related community can be involved.</p>\n<p>This post is to provide a space for these discussions to occur.</p>\n<p><strong>Summary of Public Goods Network Retrospective &amp; Recommendation</strong></p>\n<p><a class=\"mention\" href=\"https://gov.gitcoin.co/u/enidavis\">@enidavis</a> shared her learnings and recommendations for continuing the network wind down here on the Gitcoin forum. <strong>Please read this entire post BEFORE offering future plan suggestions.</strong></p>\n<aside class=\"quote quote-modified\" data-post=\"14\" data-topic=\"17430\">\n  <div class=\"title\">\n    <div class=\"quote-controls\"></div>\n    <img loading=\"lazy\" alt=\"\" width=\"24\" height=\"24\" src=\"https://gov.gitcoin.co/user_avatar/gov.gitcoin.co/enidavis/48/11716_2.png\" class=\"avatar\">\n    <a href=\"https://gov.gitcoin.co/t/announcing-the-spin-down-of-pgn-eol-june-2024/17430/14\">Announcing the spin down of PGN (EoL June 2024)</a> <a class=\"badge-category__wrapper \" href=\"https://gov.gitcoin.co/c/pgn/19\"><span data-category-id=\"19\" style=\"--category-badge-color: #9EB83B; --category-badge-text-color: #FFFFFF;\" data-drop-close=\"true\" class=\"badge-category \"><span class=\"badge-category__name\">PGN</span></span></a>\n  </div>\n  <blockquote>\n    Since announcing the network shutdown, many have approached me with questions about why the network is shutting down and with a desire to keep it going and transition ownership. While it is important to note that ultimately PGN is an experiment run by the Gitcoin Foundation, and so the decision to wind it down or transition it remains in the Foundation’s hands, I understand that my perspective is valuable, as I was most involved day to day. For that reason, I’m sharing the below in the hopes of …\n  </blockquote>\n</aside>\n\n<p>Quick summary of post:</p>\n<ul>\n<li>Key Learnings from Running PGN</li>\n<li>Criteria Needed for Future Success</li>\n<li>Wind Down Plan and Asset Migration</li>\n</ul>\n<p>Ultimately, <a class=\"mention\" href=\"https://gov.gitcoin.co/u/enidavis\">@enidavis</a> and my priorities are protecting the users who trusted us with PGN. If there is a transition to a new team, we owe it to the community to ensure that all of the listed criteria are met before green-lighting a transition. If there is a wind-down, it is only fair that we are transparent about the exact shutdown date and the risks associated with spinning down the network in its current state.</p>\n<p><strong>Prepparing for a Successful Wind Down</strong></p>\n<p>Please note that:</p>\n<aside class=\"quote no-group\" data-username=\"enidavis\" data-post=\"14\" data-topic=\"17430\">\n<div class=\"title\">\n<div class=\"quote-controls\"></div>\n<img loading=\"lazy\" alt=\"\" width=\"24\" height=\"24\" src=\"https://gov.gitcoin.co/user_avatar/gov.gitcoin.co/enidavis/48/11716_2.png\" class=\"avatar\"><a href=\"https://gov.gitcoin.co/t/announcing-the-spin-down-of-pgn-eol-june-2024/17430/14\">Announcing the spin down of PGN (EoL June 2024)</a></div>\n<blockquote>\n<p><em><strong>At the current state of interoperability infrastructure, there is no seamless way to wind down without risking freezing or burning assets that remain on PGN. For this reason, we highly recommend users bridge their assets off the network.</strong></em></p>\n</blockquote>\n</aside>\n<p>However, we are currently exploring options to extend the wind-down date past June, and we do not intend to shut down the chain until 99% of assets are bridged off the network. <strong>It is my personal recommendation that we renew our RaaS contract for an extra 12 months to prevent the loss of funds.</strong></p>\n<aside class=\"quote no-group\" data-username=\"enidavis\" data-post=\"14\" data-topic=\"17430\">\n<div class=\"title\">\n<div class=\"quote-controls\"></div>\n<img loading=\"lazy\" alt=\"\" width=\"24\" height=\"24\" src=\"https://gov.gitcoin.co/user_avatar/gov.gitcoin.co/enidavis/48/11716_2.png\" class=\"avatar\"><a href=\"https://gov.gitcoin.co/t/announcing-the-spin-down-of-pgn-eol-june-2024/17430/14\">Announcing the spin down of PGN (EoL June 2024)</a></div>\n<blockquote>\n<p>Through conversations with Conduit, our rollup provider, and Optimism, the hope is that as Superchain infrastructure matures, opportunities for seamless asset movement will become available.</p>\n</blockquote>\n</aside>\n<p>The current state of infrastructure makes the shutdown of PGN difficult and painful for users. I cannot stand behind the current shutdown date in good faith, knowing that ~$1.35 million worth of assets from our community is still stuck on our chain.</p>\n<p>The cost to pay Conduit, our RaaS provider, to extend PGN for another year is ~$70k ($36k for RaaS fees + $30k in DA fees in the bear case that we are not profitable). I’m amazed by the communities’ abilities to rally together and come up with the funds to maintain the network. Over the past few months, I’ve been involved in many discussions and have seen a ton of momentum to revive the network. I appreciate the commitment from strong teams, prospective funders, and dedicated individuals who offered clear guidelines for a path forward. <strong>However, neither Nicole nor I are the final decision-makers on this matter.</strong></p>\n<p>I would appreciate any clarity on who decides next steps. I would also urge decision makers to fully understand the risks associated with shutting down at the current proposed date.</p>\n<hr>\n<p><strong>Transition Plans</strong></p>\n<p>I understand the concerns of an unsuccessful transition. And I fully agree with <a class=\"mention\" href=\"https://gov.gitcoin.co/u/enidavis\">@enidavis</a> that there are a lot of criteria needed to ensure a successful future (ie liquidity, dedicated team, killer app, etc). However, the downsides of shutting down this June far outweigh the downsides of a mediocre transition plan.</p>\n<p>Since the <a href=\"https://gov.gitcoin.co/t/announcing-the-spin-down-of-pgn-eol-june-2024/17430\">announcement of the spin down of PGN</a> in mid January, we’ve had many interested players with strong social and financial capital propose plans to transition the network. These conversations are <em>still</em> occurring nearly 4 months later. It’s a waste of our time and energy to beat around the bush and slowly let this bleed. <strong>Let’s make a decision.</strong></p>\n<p>As it stands right now, there is an interested party with the funds and approval from Conduit to pay for/maintain the network for a guaranteed 12 months. Our options are:</p>\n<ol>\n<li>Say no and continue with June shutdown date.</li>\n<li>Say no and Gitcoin Foundation pays for an extended shut down date.</li>\n<li>Say yes and allow a new party to bear the costs/responsibilities of running PGN.</li>\n</ol>\n<p>Again, I sincerely appreciate everyone who has dedicated their time, energy, and resources into this experiment. I care deeply about the community PGN brought together. I remain committed to the mission of this network and hope its goals can one day be realized.</p>\n<p>In the spirit of transparency, if you have thoughts, opinions, or suggestions, please post them publicly here.</p>\n<p>For any users who need support in bridging their funds off the network, reach out on our <a href=\"https://t.me/pgn_eth\">Telegram</a>, where Nicole and I would be more than happy to assist you.</p>\n            <p><small>14 posts - 7 participants</small></p>\n            <p><a href=\"https://gov.gitcoin.co/t/public-goods-network-retrospective-recommendation-discussion/18772\">Read full topic</a></p>","link":"https://gov.gitcoin.co/t/public-goods-network-retrospective-recommendation-discussion/18772","pubDate":"Thu, 09 May 2024 21:38:27 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"gov.gitcoin.co-topic-18772"},"source":{"@url":"https://gov.gitcoin.co/t/public-goods-network-retrospective-recommendation-discussion/18772.rss","#text":"Public Goods Network Retrospective & Recommendation - Discussion"}},{"title":"Grants Lab Monthly Meeting - May 2024","dc:creator":"meglister","category":"🧙 🧙‍♀️ Ideas and Open Discussion","description":"<p>At the start of each month, the Grants Lab team has an hour-long meeting that primarily focuses on strategy and progress against our goals. This month, we focused on our 2024 strategy as well as how we’re pacing against our Q2 goals. I’m linking the presentation here, as well as including an AI-assisted summary of the notes for anyone interested!</p>\n<p>Link: <a href=\"https://drive.google.com/file/d/1FEkkE6vMF-bTpmkiTCezacMr3q9G7Ps3/view?usp=sharing\" class=\"inline-onebox\">Grants Lab Monthly_May24_Forum.pdf - Google Drive</a></p>\n<p><strong>Overview</strong>:<br>\nThe meeting at Gitcoin discussed the significance of GMV and network effects for success, emphasizing GMV as a key metric for growth and value creation. It aligns with the mission to fund Web3 initiatives while tracking contract sizes, pipeline commitments, customer numbers, and activated rounds for progress assessment. Measuring network effects, like market expansion, is crucial to recognize the growing value from more participants.</p>\n<p>There was a commitment to financial sustainability through increased GMV without losing focus on supporting public goods funding in Web3. The 2024 strategy aims to maintain a focus on Web3 and EVM initiatives to solidify Gitcoin’s position in the industry before diversification. The meeting outlined key points related to market strategy, product development, strategic goals, innovation pipeline progress, and investment in culture and technology.</p>\n<p>Improving GTM and enhancing product quality were core discussions. Strategic goals included initiatives in Web3 and EVM, grants programs, and improving core products. The meeting emphasized rapid prototyping of ideas, collaborations with partners, and smart bet strategies to drive GMV growth.</p>\n<p>Efforts to foster high-performance teamwork, encourage collaboration, and iterate structures were highlighted. The meeting showcased achieved strategic milestones and ongoing innovative pipeline advancements. Organizational development initiatives aim to enhance market presence and product excellence across multiple domains within the company, ensuring long-term success while staying true to Gitcoin’s core values.</p>\n<p><strong>Notes</strong>:<br>\n<img src=\"https://gov.gitcoin.co/images/emoji/twitter/bar_chart.png?v=12\" title=\":bar_chart:\" class=\"emoji\" alt=\":bar_chart:\" loading=\"lazy\" width=\"20\" height=\"20\"> Grants Canvas<br>\nCoachJ introduced the Grants Canvas as a new piece of content that will be introduced at EthCC. The goal is to educate grants managers.</p>\n<p><img src=\"https://gov.gitcoin.co/images/emoji/twitter/date.png?v=12\" title=\":date:\" class=\"emoji\" alt=\":date:\" loading=\"lazy\" width=\"20\" height=\"20\"> ethCC Logistics<br>\nMeg Lister and Jess discussed setting up forms for headcount and budget allocation. Mentioned creating a form to gauge interest in certain initiatives.</p>\n<p><img src=\"https://gov.gitcoin.co/images/emoji/twitter/moneybag.png?v=12\" title=\":moneybag:\" class=\"emoji\" alt=\":moneybag:\" loading=\"lazy\" width=\"20\" height=\"20\"> Financial Reviews<br>\nMeg Lister highlighted the importance of more financial reviews with the team. April financial report reviewed.</p>\n<p><img src=\"https://gov.gitcoin.co/images/emoji/twitter/chart_with_upwards_trend.png?v=12\" title=\":chart_with_upwards_trend:\" class=\"emoji\" alt=\":chart_with_upwards_trend:\" loading=\"lazy\" width=\"20\" height=\"20\"> Goals and Metrics<br>\nTeam discussed GMV goals and the significance of understanding business goals.<br>\nEncouraged engagement and understanding the importance of GMV in the overall strategy.</p>\n<p><img src=\"https://gov.gitcoin.co/images/emoji/twitter/arrows_counterclockwise.png?v=12\" title=\":arrows_counterclockwise:\" class=\"emoji\" alt=\":arrows_counterclockwise:\" loading=\"lazy\" width=\"20\" height=\"20\"> Q2 Progress Review<br>\nMeg Lister noted the creation of a doc and strategy for Q2 goals shared with the team. Emphasized market focus and the need for to be excellent at our core focus (Grants Stack GTM &amp; product) to ensure short-term success &amp; long term growth opportunities.</p>\n<p><img src=\"https://gov.gitcoin.co/images/emoji/twitter/mag.png?v=12\" title=\":mag:\" class=\"emoji\" alt=\":mag:\" loading=\"lazy\" width=\"20\" height=\"20\"> Sales Pipeline and Metrics<br>\nDaniel Schuman detailed pipeline restructuring for better tracking against GMV goals.<br>\nIntroduced a weighted GMV metric as a “vibe check” and the use of simple CRM for detailed breakdowns.</p>\n<p><img src=\"https://gov.gitcoin.co/images/emoji/twitter/rocket.png?v=12\" title=\":rocket:\" class=\"emoji\" alt=\":rocket:\" loading=\"lazy\" width=\"20\" height=\"20\"> Strategic Initiatives<br>\nKevin Owocki discussed exploring ways to leverage Allo v2 for capital allocation.<br>\nHighlighted the importance of strategic context for proposals aligned with team goals.</p>\n            <p><small>1 post - 1 participant</small></p>\n            <p><a href=\"https://gov.gitcoin.co/t/grants-lab-monthly-meeting-may-2024/18767\">Read full topic</a></p>","link":"https://gov.gitcoin.co/t/grants-lab-monthly-meeting-may-2024/18767","pubDate":"Wed, 08 May 2024 22:26:23 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"gov.gitcoin.co-topic-18767"},"source":{"@url":"https://gov.gitcoin.co/t/grants-lab-monthly-meeting-may-2024/18767.rss","#text":"Grants Lab Monthly Meeting - May 2024"}},{"title":"GG20 Community Round Governance: A Retrospective","dc:creator":"MathildaDV","category":"🌱 Gitcoin Grants","description":"<h3><a name=\"community-round-gov-process-retrospective-1\" class=\"anchor\" href=\"https://gov.gitcoin.co#community-round-gov-process-retrospective-1\"></a>Community Round Gov Process Retrospective</h3>\n<p>I’m excited to post this retrospective on the newly implemented governance process for community rounds during Gitcoin Grants rounds. With GG20 wrapping up this week, I wanted to bring some learnings from this process to light. This post will include:</p>\n<ul>\n<li>Retro on Community Council and their experience</li>\n<li>Retro on the selection criteria, additional learnings and how we might move forward differently.</li>\n</ul>\n<p>Thank you to <a class=\"mention\" href=\"https://gov.gitcoin.co/u/sov\">@Sov</a> for spearheading the initial idea of the evolution of Community Rounds, and to the 7 members of the council, <a class=\"mention\" href=\"https://gov.gitcoin.co/u/mashal\">@mashal</a>, <a class=\"mention\" href=\"https://gov.gitcoin.co/u/thedevanshmehta\">@thedevanshmehta</a>, <a class=\"mention\" href=\"https://gov.gitcoin.co/u/azeem\">@azeem</a>, <a class=\"mention\" href=\"https://gov.gitcoin.co/u/zer8\">@ZER8</a>, <a class=\"mention\" href=\"https://gov.gitcoin.co/u/lanzdingz\">@lanzdingz</a>, <a class=\"mention\" href=\"https://gov.gitcoin.co/u/wasabi\">@wasabi</a>, <a class=\"mention\" href=\"https://gov.gitcoin.co/u/feems\">@feems</a>, who embarked on this experiment with us! It was an honour to coordinate this undertaking and learn alongside everyone throughout the process.</p>\n<p>As a recap, the new governance process included enabling communities to upload proposals to our forum, and applying for extra matching funds from Gitcoin to run in a Gitcoin Grants round (GG20 was the first iteration). The Community Council then reviewed and voted on the proposals, with the top 5 being selected for matching funds. If you’re unfamiliar with this process, read the following posts for further context: <a href=\"https://gov.gitcoin.co/t/gg20-eligibility-criteria-community-rounds/17846\">GG20 Eligibility Criteria - Community Rounds</a>, <a href=\"https://gov.gitcoin.co/t/gg20-community-rounds-announced/18402\">GG20 Community Rounds Announced</a>, <a href=\"https://gov.gitcoin.co/t/gg20-community-council/17749\">GG20 Community Council</a>.</p>\n<h3><a name=\"community-council-retro-2\" class=\"anchor\" href=\"https://gov.gitcoin.co#community-council-retro-2\"></a>Community Council retro:</h3>\n<p>This being the first iteration of Gitcoin electing an external GG Community Council, I have been personally very pleased with the results and the council that was elected. The council’s diversity and experience put us in a strong position to govern GG20.</p>\n<p>A detailed survey was presented to the council gathering feedback on their experience and ways we could improve the process. They had to scale their overall experience from 1-5 (1 being “poor” and 5 being “excellent”). The results revealed that the average rating for the council’s overall experience was approximately 4.71 out of 5. This indicates a highly positive experience among the council members. <em>Each member also roughly spent 10 hours on this initiative, in line with what we set predicted.</em></p>\n<p><em>“For how fast everything moved and the care needed to effectively carry this out with a tight timeline I thought it was done as well as it could have been when you factor in everything. We were able to identify what needed to be changed in the future, without letting that affect our ability to get the current task done on time now. everything was handled in a way that gives me a lot of confidence for the foundation of what we’re building/Gitcoin is working towards helping create.”</em> - Lana</p>\n<h3><a name=\"retro-on-the-selection-criteria-learning-3\" class=\"anchor\" href=\"https://gov.gitcoin.co#retro-on-the-selection-criteria-learning-3\"></a>Retro on the selection criteria, learning:</h3>\n<h4><a name=\"using-charmverse-as-a-platform-to-review-vote-4\" class=\"anchor\" href=\"https://gov.gitcoin.co#using-charmverse-as-a-platform-to-review-vote-4\"></a>Using CharmVerse as a platform to review &amp; vote:</h4>\n<p>Other options we explored before selecting CharmVerse: Ranked Voting through Google Sheets, which tested unsuccessful due to the results needing more than 7 voters and reviewers. We also looked at manual reviews, which is labour intensive and not favourable. We wanted a platform where the council could easily review and comment on proposals as well as vote using a rubric, which was why CharmVerse was a great option.</p>\n<p>Within the same survey, the council was asked to rank their experience with the platform chosen on a scale of 1-5 (1 being “poor” and 5 being “excellent”). The average rating for using CharmVerse as a platform was 4.14 out of 5. This suggests a generally positive consensus towards continuing to use CharmVerse, with most members indicating satisfaction, though a couple of members saw room for improvement. We have given the CharmVerse team some feedback on how we would like the UI to be improved in the future, but with this outcome in the survey, we will most likely keep CharmVerse as the platform moving forward, making sure that the improvements are implemented by GG21, <em>barring any necessary changes due to adaptations of the rubric and eligibility criteria detailed below.</em></p>\n<h4><a name=\"improvements-to-the-rubric-5\" class=\"anchor\" href=\"https://gov.gitcoin.co#improvements-to-the-rubric-5\"></a>Improvements to the Rubric:</h4>\n<p><em>Here are some suggestions that surfaced in the survey that we would like to implement in the rubric for future rounds. <strong>NOTE:</strong> these are not set in stone right now, as we will circle back with the council on this and ensure the rubrics are created in collaboration with what the council suggests.</em></p>\n<ul>\n<li>Include ‘community reach/impact’ and details about community leaders’ public/social impact.</li>\n<li>Introduce a rubric for round deliverables or milestones, possibly weighing the network effects.</li>\n<li>Expand and refine rubric definitions to ensure clarity, such as defining terms like ‘leverage’ more explicitly.\n<ul>\n<li>Introduction of mechanics that determine the ratio of matching being received by a Community Round; this could be a subset of the rubric focused on the financial aspects of the application.</li>\n</ul>\n</li>\n<li>Add more measurement criteria tied to application questions for easier referencing.</li>\n<li>Incorporate individual or group sessions with applicants and add a measurement for more diversity of projects to prevent monopoly by well-known names and popular/ same projects getting funding.</li>\n</ul>\n<h4><a name=\"changes-to-eligibility-criteria-6\" class=\"anchor\" href=\"https://gov.gitcoin.co#changes-to-eligibility-criteria-6\"></a>Changes to Eligibility Criteria:</h4>\n<p><em>Strong eligibility criteria that are also closely linked to the rubrics used for evaluation can ensure high-quality, values-aligned funding rounds that serve the community well. The council’s input will set the eligibility criteria for future rounds.</em></p>\n<p>Here are some suggestions:</p>\n<ul>\n<li>Consider restrictions such as disallowing back-to-back funding rounds for previous recipients, with a potential reinstatement after a cycle or annually.</li>\n<li>Require previous recipients to provide impact tracking metrics and improvement plans for subsequent rounds.</li>\n<li>Standardize metrics more comprehensively to enhance comparability across different projects and rounds.</li>\n<li>To share progress, community size, and all other relevant stats</li>\n<li>Address transparency and conflict of interest concerns, such as disclosure of relationships between applicants and round participants.</li>\n<li>Disclose all forms of funding</li>\n</ul>\n<h4><a name=\"those-not-selected-for-matching-felt-excluded-7\" class=\"anchor\" href=\"https://gov.gitcoin.co#those-not-selected-for-matching-felt-excluded-7\"></a>Those not selected for matching felt “excluded”:</h4>\n<p>One thing that we picked up is the rounds not selected for matching funds felt excluded and disempowered to still continue and run a round during GG20. This is not something that we intentionally set up and one of the biggest pieces of this process I would like to change. How might we ensure each round that applies feels empowered, but still upholds the resources that Gitcoin can give community rounds during a round?</p>\n<p>For example, when it comes to marketing rounds outside of those selected for matching, there are many factors to consider: resources, vetting of the rounds, intentional coordination, etc. We are actively working on creating a system that is inclusive and impactful for all involved and making sure the process is fair, vetted, and well resourced.</p>\n<h3><a name=\"moving-forward-8\" class=\"anchor\" href=\"https://gov.gitcoin.co#moving-forward-8\"></a>Moving forward:</h3>\n<ul>\n<li>On the topic of making the process more inclusive for all involved, I suggest the following:</li>\n</ul>\n<p>The top 5 are still selected for matching through the same review and voting process, but the top [ X ] will be included in our marketing efforts. The exact number of rounds we can support and what this marketing support will look like will be discussed internally and fleshed out in another post leading up to GG21.</p>\n<ul>\n<li>\n<p>We will update the rubrics and eligibility criteria with the council, as we would like to give them more autonomy in this regard.</p>\n</li>\n<li>\n<p>An updated Roles &amp; Responsibilities doc will be posted to the forum, outlining the new and updated responsibilities of the council as their roles will evolve moving forward.</p>\n</li>\n</ul>\n<p><em>“The comms part by the Gitcoin team was excellent. On the whole, I’ve taken this role pretty seriously and have felt that it was a big responsibility to make sound decisions with intentionality and countering bias that comes with decision making. I’d love to stay updated re the results of each round, and to understand how they were run ++ learnings et al from them (would esp like to understand challenges and what went well + didn’t from each). This will help in improving decision making for the next one.”</em> - Mashal</p>\n<p>The goal of Community Rounds is for Gitcoin to continue empowering those within the ecosystem to fund what matters to them most, creating an inclusive and collaborative environment during GG, and further decentralizing our grants program.</p>\n<p>We have taken a great first step, and through these iterations and learnings, we can continue to improve over time.</p>\n            <p><small>13 posts - 5 participants</small></p>\n            <p><a href=\"https://gov.gitcoin.co/t/gg20-community-round-governance-a-retrospective/18766\">Read full topic</a></p>","link":"https://gov.gitcoin.co/t/gg20-community-round-governance-a-retrospective/18766","pubDate":"Wed, 08 May 2024 22:22:11 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"gov.gitcoin.co-topic-18766"},"source":{"@url":"https://gov.gitcoin.co/t/gg20-community-round-governance-a-retrospective/18766.rss","#text":"GG20 Community Round Governance: A Retrospective"}},{"title":"Gitcoin's Continued Path to Decentralized - Executive Director Elections","dc:creator":"CoachJonathan","category":"🤖 DAO Governance and Vision","description":"<h3><a name=\"tldr-1\" class=\"anchor\" href=\"https://gov.gitcoin.co#tldr-1\"></a>TLDR</h3>\n<ul>\n<li>Gitcoin’s structure is about reinforcing the legitimacy of its governance through the GTC token</li>\n<li>Gitcoin’s structure has changed a bit since the launch of the DAO in 2021, but not by much (diagram of the current structure below)</li>\n<li>Starting in Jan 2025, Gitcoin will begin electing its Executive Director on its path to decentralization</li>\n</ul>\n<h3><a name=\"introduction-2\" class=\"anchor\" href=\"https://gov.gitcoin.co#introduction-2\"></a>Introduction</h3>\n<p>With the recent announcement of a<a href=\"https://gov.gitcoin.co/t/another-passing-of-the-torch/18704/9\"> passing of the torch</a> for the Executive Director role at the Gitcoin Foundation, I wanted to take a moment to create some clarity on what I’m seeing as an emerging structure at the DAO.</p>\n<p>This post is intended to be a follow up to <a class=\"mention\" href=\"https://gov.gitcoin.co/u/owocki\">@owocki</a>’s <a href=\"https://gov.gitcoin.co/t/consent-of-the-governed-and-legitimacy-by-process-in-gitcoindao/9778\"> Consent of the Governed post</a> that was released soon after the formation of the DAO. While much of what is the post still stands, there are a few key clarifications that I think are worth flagging for the purpose of building context for Citizens and Stewards.</p>\n<p>Elements of this post will also be integrated into a follow-up post to our<a href=\"https://gov.gitcoin.co/t/gitcoin-dao-governance-process-v3/10358\"> Gov3 post</a>/a<a href=\"https://gov.gitcoin.co/t/discussion-addressing-immediate-gaps-in-dao-governance/18620\"> newly developed Gitcoin Working Constitution</a>.</p>\n<h3><a name=\"background-3\" class=\"anchor\" href=\"https://gov.gitcoin.co#background-3\"></a>Background</h3>\n<p>Gitcoin as a DAO was formed in mid-2021. In order to create the DAO, Gitcoin had to appoint an Executive Director for the Gitcoin Foundation. At that time, <a class=\"mention\" href=\"https://gov.gitcoin.co/u/kyle\">@kyle</a> was given that role and has owned that responsibility until recently.</p>\n<p>Soon after the launch of the DAO, <a class=\"mention\" href=\"https://gov.gitcoin.co/u/owocki\">@owocki</a> created the aforementioned post that starts by defining the idea of the Consent of the Governed:</p>\n<aside class=\"quote no-group\" data-username=\"owocki\" data-post=\"1\" data-topic=\"9778\">\n<div class=\"title\">\n<div class=\"quote-controls\"></div>\n<img loading=\"lazy\" alt=\"\" width=\"24\" height=\"24\" src=\"https://gov.gitcoin.co/user_avatar/gov.gitcoin.co/owocki/48/12006_2.png\" class=\"avatar\"><a href=\"https://gov.gitcoin.co/t/consent-of-the-governed-and-legitimacy-by-process-in-gitcoindao/9778/1\">Consent of the Governed (and Legitimacy by Process) in GitcoinDAO</a></div>\n<blockquote>\n<p> the phrase consent of the governed refers to the idea that a government’s legitimacy and moral right to use state power is justified and lawful only when consented to by the people or society over which that political power is exercised. </p>\n</blockquote>\n</aside>\n<p>It then goes on to list differences between how an organization like Meta structures itself vs. how a DAO like Gitcoin structures itself to create legitimacy by empowering users and contributors to create bottoms-up buy-in.</p>\n<p>At the core of the post is a principle that still stands true at Gitcoin:</p>\n<aside class=\"quote no-group\" data-username=\"owocki\" data-post=\"1\" data-topic=\"9778\">\n<div class=\"title\">\n<div class=\"quote-controls\"></div>\n<img loading=\"lazy\" alt=\"\" width=\"24\" height=\"24\" src=\"https://gov.gitcoin.co/user_avatar/gov.gitcoin.co/owocki/48/12006_2.png\" class=\"avatar\"><a href=\"https://gov.gitcoin.co/t/consent-of-the-governed-and-legitimacy-by-process-in-gitcoindao/9778/1\">Consent of the Governed (and Legitimacy by Process) in GitcoinDAO</a></div>\n<blockquote>\n<p> Legitimacy should flow in circles, not just one way </p>\n</blockquote>\n</aside>\n<p>In order to minimize confusion, I will not repost any diagrams from the initial post—readers can take a look at themselves to get a sense of what the initial vision for governing the DAO was at inception.</p>\n<h3><a name=\"shifting-structure-4\" class=\"anchor\" href=\"https://gov.gitcoin.co#shifting-structure-4\"></a>Shifting Structure</h3>\n<p>Though initial vision might have been a <em>bit</em> ambitious, the structure we’ve landed on is not too far off from the ideal set in Jan 2022.</p>\n<p>Here is a shot at visualizing how (I am seeing) legitimacy currently flowing at Gitcoin:</p>\n<p></p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://gov.gitcoin.co/uploads/db4391/original/2X/7/76409a25b9e2c6c98567fec0e301ee1df34bcf45.jpeg\" data-download-href=\"https://gov.gitcoin.co/uploads/db4391/76409a25b9e2c6c98567fec0e301ee1df34bcf45\" title=\"ConsentoftheGoverned\"><img src=\"https://gov.gitcoin.co/uploads/db4391/optimized/2X/7/76409a25b9e2c6c98567fec0e301ee1df34bcf45_2_324x500.jpeg\" alt=\"ConsentoftheGoverned\" data-base62-sha1=\"gS6KyFKY4145J8lWbfdVcmQQfDT\" width=\"324\" height=\"500\" srcset=\"https://gov.gitcoin.co/uploads/db4391/optimized/2X/7/76409a25b9e2c6c98567fec0e301ee1df34bcf45_2_324x500.jpeg, https://gov.gitcoin.co/uploads/db4391/optimized/2X/7/76409a25b9e2c6c98567fec0e301ee1df34bcf45_2_486x750.jpeg 1.5x, https://gov.gitcoin.co/uploads/db4391/optimized/2X/7/76409a25b9e2c6c98567fec0e301ee1df34bcf45_2_648x1000.jpeg 2x\" data-dominant-color=\"F6F6F6\"></a></div><p></p>\n<p>Users are airdropped tokens. This happened when the DAO launched and continues to happen through our<a href=\"https://www.notion.so/DAO-Structure-and-Legitimacy-Post-0abd268ea95d4c298a1a54f98149a56a?pvs=21\"> Citizen Grants Program</a> and payment to full-time and part-time DAO contributors.</p>\n<p>Those tokens are then delegated to Stewards, who vote on a variety of proposals (<a href=\"https://gov.gitcoin.co/t/discussion-addressing-immediate-gaps-in-dao-governance/18620\">currently under discussion in this thread</a> - please go and comment!).</p>\n<h3><a name=\"why-does-this-matter-5\" class=\"anchor\" href=\"https://gov.gitcoin.co#why-does-this-matter-5\"></a>Why does this matter?</h3>\n<p>This diagram attempts to demonstrate two levers that Stewards can pull to have major sway over decision making at the DAO:</p>\n<p><strong>1. Passing/rejecting of token requests through a Token proposal</strong></p>\n<p>Stewards have the power to approve and withhold on DAO spending. This is one of the highest leverage points where Stewards have a say on how the DAO is operating and spending.</p>\n<p>Should Stewards be dissatisfied with the performance of a unit, they can vote against a budget proposal either until the proposal is amended to their satisfaction <em>or</em> until the unit winds down from a lack of funding.</p>\n<p><strong>2. Election/removal of the Executive Director through a Legal Proposal</strong></p>\n<p>Stewards also have the power to elect and remove the Executive Director of the Gitcoin Foundation. The intention of this mechanism is to create accountability for the Executive Director to properly guide the organization and ensure that all the right people are in the right seats.</p>\n<p>This is essentially a hierarchical structure with the ED at the top and all DAO contributors arranged below. This is a common structure in coops and is a structure (at this point in time) being used at Gitcoin to ensure that goals are being hit and that the DAO is successfully pursuing its mission while achieving financial sustainability.</p>\n<h3><a name=\"whats-next-6\" class=\"anchor\" href=\"https://gov.gitcoin.co#whats-next-6\"></a>What’s Next</h3>\n<p>In the past, Executive Directors have been appointed but have not been elected. This has essentially taken away one of the Stewards’ levers for affecting change at the DAO.</p>\n<p>With the most recent passing of the torch, Gitcoin is taking a large step on its path to decentralization.</p>\n<p>Stewards can expect that starting in January 2025, the Gitcoin Governance Team will kick off an election process and officially begin giving power to the Stewards to decide on who will lead the Gitcoin Foundation, creating more accountability, legitimacy in governance and, ultimately, a more sustainable Gitcoin in the long-term.</p>\n            <p><small>2 posts - 2 participants</small></p>\n            <p><a href=\"https://gov.gitcoin.co/t/gitcoins-continued-path-to-decentralized-executive-director-elections/18759\">Read full topic</a></p>","link":"https://gov.gitcoin.co/t/gitcoins-continued-path-to-decentralized-executive-director-elections/18759","pubDate":"Wed, 08 May 2024 07:27:50 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"gov.gitcoin.co-topic-18759"},"source":{"@url":"https://gov.gitcoin.co/t/gitcoins-continued-path-to-decentralized-executive-director-elections/18759.rss","#text":"Gitcoin's Continued Path to Decentralized - Executive Director Elections"}},{"title":"Greenpill Podcast Guest Seasons - Call for Proposals!","dc:creator":"owocki","category":"🧙 🧙‍♀️ Ideas and Open Discussion","description":"<p><em>TLDR - I am going to step away from the Greenpill Podcast in Q3/Q4 2024 + am looking for ppl to guest cohost during that time.</em></p>\n<p>Hi all,</p>\n<p>For those of you who are unaware, I have been hosting the <a href=\"https://greenpill.network/\">Greenpill Podcast</a> for the last 2 years. This podcast has been a way I can democratize my context + access to the rest of the ecosystem, research in public, vision-cast, and generally just explore the frontiers of regen web3.</p>\n<p>We’ve produced nearly 200 episodes and have had 300k+ listens, as well as about ~2k subscribers. I’m very proud of the content we’ve created and the role Greenpill has played in supporting the regen movement.</p>\n<p>But I think it is time to evolve it forward.</p>\n<p>I am considering decentralizing my hosting duties for seasons 5, 6, and 7 to guest co-hosts who can go deep on a handful of different target niches.</p>\n<p>Why do this?</p>\n<ol>\n<li>I am busy with Gitcoin stuff and dont have cycles to do another season of GP (and do it well) with my current workload.</li>\n<li>Decentralizing the workload (and the spotlight) to other leaders in the GP community.</li>\n<li>Enabling people to go deep in areas where I dont have access.</li>\n</ol>\n<p>Some topics I would love to see covered in season 4,5,6:</p>\n<ol>\n<li>Commons in the 21st century</li>\n<li>ReStaking Ecosystem &lt;&gt; Regen Ecosystems</li>\n<li>Regen Network States</li>\n<li>Weird/Fun Fundraising Experiments</li>\n<li>Crypto in the Global South</li>\n<li>What am I missing?</li>\n</ol>\n<p>If you are interested in being a host of a season, please submit a proposal via comment below.</p>\n<p>Risks</p>\n<ol>\n<li>Need to keep content quality high.</li>\n<li>The audience knows kevin, need to transfer rapport to new hosts.</li>\n</ol>\n<p>Things I would want to see in a proposal to be credible.</p>\n<ul>\n<li>Season Title</li>\n<li>Season Goals</li>\n<li>Why is this relevant to the greenpill audience in H2 2024?</li>\n<li>Timeline</li>\n<li>Proposed Episodes + Guests</li>\n<li>Do you have podcast hosting experience? Links to previous work pls.</li>\n<li>Are you a known quantity to the regen ecosystem? Links to previous work pls.</li>\n<li>Whats your favorite greenpill episode + why?</li>\n<li>Do you have time to record 5-15 episodes in the next couple quarters?</li>\n<li>How will you ensure the episode is quality + relevant to the audience?</li>\n</ul>\n<p>Timeline</p>\n<ul>\n<li>Proposals open May 15th</li>\n<li>Finalists, Top ~7 proposals selected for final round of evaluation - June 3</li>\n<li>Next Seasons selected + Announced - June 10</li>\n<li>Recording + Next Seasons Airing - July - December 2024</li>\n<li>Reevaluate next steps end 2024.</li>\n</ul>\n            <p><small>7 posts - 7 participants</small></p>\n            <p><a href=\"https://gov.gitcoin.co/t/greenpill-podcast-guest-seasons-call-for-proposals/18754\">Read full topic</a></p>","link":"https://gov.gitcoin.co/t/greenpill-podcast-guest-seasons-call-for-proposals/18754","pubDate":"Tue, 07 May 2024 13:08:56 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"gov.gitcoin.co-topic-18754"},"source":{"@url":"https://gov.gitcoin.co/t/greenpill-podcast-guest-seasons-call-for-proposals/18754.rss","#text":"Greenpill Podcast Guest Seasons - Call for Proposals!"}},{"title":"Ephemeral DAOs: An underexplored design space","dc:creator":"owocki","category":"🧙 🧙‍♀️ Ideas and Open Discussion","description":"<p><em>Thanks to <a class=\"mention\" href=\"https://gov.gitcoin.co/u/mathildadv\">@MathildaDV</a> , Soloszo, mr_j_rossman, gnovak, Ethereal Forest community, and other respondents to <a href=\"https://twitter.com/owocki/status/1787196344097992747\">this tweet</a> for helping to shape these ideas.</em></p>\n<h1><a name=\"ephemeral-daos-an-underexplored-design-space-1\" class=\"anchor\" href=\"https://gov.gitcoin.co#ephemeral-daos-an-underexplored-design-space-1\"></a>Ephemeral DAOs: An underexplored design space</h1>\n<h1><a name=\"tldr-2\" class=\"anchor\" href=\"https://gov.gitcoin.co#tldr-2\"></a>TLDR</h1>\n<ul>\n<li>Ephemeral means “lasting for a very short time.”.</li>\n<li>Ephemeral DAOs are DAOs that exist emergently for a short time and then are designed to dissolve.</li>\n<li>Ephemeral DAOs offer a novel approach to decentralized organization, departing from rigid definitions and embracing fluidity in group coordination.</li>\n<li>By embracing ephemerality, we can operate in a design space with lower stakes, pragmatic decision-making, and bold experimentation within shorter timeframes. This opens doors to new opportunities of value creation</li>\n<li>Some examples of Ephemeral DAOs: SealOrg whitehat campaigns, pop up villages, Gitcoin Grants or Optimism Rounds.</li>\n</ul>\n<h1><a name=\"what-are-daos-3\" class=\"anchor\" href=\"https://gov.gitcoin.co#what-are-daos-3\"></a>What are DAOs?</h1>\n<p>A canonical definition of DAOs: A DAO is a digital entity governed by smart contracts and operated by its members rather than a central authority. It allows for decentralized decision-making and management of resources.</p>\n<p>An alternative definition of DAOs: DAOs are how groups of humans coordinate around a shared objective.</p>\n<p>From the perspective of the 2nd definition, it is okay to treat the literal definition of DAOs as more of a spectrum. Some projects will be 100% decentralized, 100% autonomous, + an organization, some will only be partially so. Projects that are not 100% pure, I call “DAO-ey” - as in, they have some attributes of DAOs but not all.</p>\n<h1><a name=\"what-are-ephemeral-daos-4\" class=\"anchor\" href=\"https://gov.gitcoin.co#what-are-ephemeral-daos-4\"></a>What are Ephemeral DAOs?</h1>\n<p>Ephemeral DAOs exist for a finite period of time to achieve specific goals or objectives. Once the goals or objectives of the ephemeral DAO have been achieved, the DAO is dissolved, and its assets, if any, are distributed back to the participants or transferred to another entity.</p>\n<h1><a name=\"why-are-ephemeral-daos-powerful-5\" class=\"anchor\" href=\"https://gov.gitcoin.co#why-are-ephemeral-daos-powerful-5\"></a>Why are Ephemeral DAOs powerful?</h1>\n<p>Ephemerality and DAO-iness are powerful because:</p>\n<ol>\n<li>without the burden of having to last forever, the stakes are lower. Which enables more experimentation.</li>\n<li>without the burden of having to last forever, we can make more pragmatic decisions about what to do over a short period of time without worrying about entrenching power.</li>\n<li>without the burden of having to last forever, we can test/iterate with bold bets in the short term.</li>\n<li>we can learn from decentralized movements of the past, many of which ebbed and flowed, (Occupy Wall St or the Civil Rights movement are two examples) + transcribe their lessons into our ephemeral DAO experiments…</li>\n</ol>\n<h1><a name=\"ephemeral-dao-design-space-6\" class=\"anchor\" href=\"https://gov.gitcoin.co#ephemeral-dao-design-space-6\"></a>Ephemeral DAO Design Space</h1>\n<h2><a name=\"examples-7\" class=\"anchor\" href=\"https://gov.gitcoin.co#examples-7\"></a>Examples</h2>\n<p>Examples of Ephemeral DAOs:</p>\n<ol>\n<li>Pop up villages like Edge City or Zuzalu or Metacamp. <em>(weeks long)</em></li>\n<li><span class=\"mention\">@_SEAL_Org</span> or other “Whitehat group” style fund rescue operations <em>(several hours - several weeks long)</em></li>\n<li>Gitcoin style QF rounds.  <em>(weeks long)</em></li>\n<li>Optimism style Retro Funding Rounds <em>(weeks long)</em></li>\n<li>Accelerator cohorts go through an educational cohort together over an 8 week program (months long)</li>\n<li>Point in time fundraisers like ConstitutionDAO or <a href=\"https://juicebox.money/@free-pertsev-and-storm\">The Free Alexey &amp; Roman Legal Defense Fundraise</a> <em>(weeks long)</em></li>\n<li>Protocol Guild’s first cohort <em>(1 year long)</em></li>\n<li>Projects like Meta Cartel, which dissolved itself after transferring all their remaining assets to the lawyers of tornado cash devs. <em>(years long)</em></li>\n<li>Investment DAOs like those created by <a href=\"https://www.hydraventures.xyz/\">Hydra Ventures</a> last only as long as they have capital to deploy <em>(years long)</em></li>\n</ol>\n<h2><a name=\"dao-purity-8\" class=\"anchor\" href=\"https://gov.gitcoin.co#dao-purity-8\"></a>DAO-purity</h2>\n<p>Some definitions of DAOs out there have rigid adherence to the properties of autonomousness (emphasis on computer code doing most of the work), achieving very high levels of decentralization (e.g. no member can have more power than another) and being an organization (as opposed to a network).</p>\n<p>I find myself gravitating towards a more simple &amp; broad definition: DAOs are how groups of humans coordinate around a shared objective.</p>\n<p>Projects that are in between the more rigid definition of DAOs and the more simple/broad one can be said to be DAO-ey.</p>\n<p>I can hear the naysayers say to me “Kevin those don’t count as DAOs. We shouldn’t be flexible in our interpretation of our design space and should be dogmatic about 100% decentralization + autonomy”. Well, I’m sorry I failed your purity test. But I disagree. We should choose the right amount of autonomy + decentralization for the job. For decentralized money (BTC, ETC), we need 100% purity. For other use cases, it’s okay to work on things that treat DAOiness as a spectrum.</p>\n<p>Here’s what I think the design space for Ephemeral DAOs looks like.</p>\n<p></p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://gov.gitcoin.co/uploads/db4391/original/2X/1/1ec839606914ffe3e895b2a90e0354d78acb30b8.png\" data-download-href=\"https://gov.gitcoin.co/uploads/db4391/1ec839606914ffe3e895b2a90e0354d78acb30b8\" title=\"\"><img src=\"https://gov.gitcoin.co/uploads/db4391/original/2X/1/1ec839606914ffe3e895b2a90e0354d78acb30b8.png\" alt=\"\" data-base62-sha1=\"4ojiK9cKut9u6TcaBAQQsNJgiSI\" width=\"586\" height=\"500\" role=\"presentation\" data-dominant-color=\"F0F1F8\"></a></div><p></p>\n<h2><a name=\"short-longevity-vs-long-longevity-9\" class=\"anchor\" href=\"https://gov.gitcoin.co#short-longevity-vs-long-longevity-9\"></a>Short Longevity vs Long Longevity</h2>\n<p>I also think there is a spectrum of “how much longevity is baked into each Ephemeral DAO?</p>\n<p>Ephemeral DAOs can be shorter lasting (like a SealOrg Whitehat op which could be hours-long) or longer lasting (or MetaCartel, which wound down after several years).</p>\n<p></p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://gov.gitcoin.co/uploads/db4391/original/2X/1/1a92db5da1850b3f9a700b5d70b25a1d0d33f471.png\" data-download-href=\"https://gov.gitcoin.co/uploads/db4391/1a92db5da1850b3f9a700b5d70b25a1d0d33f471\" title=\"Screenshot 2024-05-06 at 1.41.22 PM\"><img src=\"https://gov.gitcoin.co/uploads/db4391/optimized/2X/1/1a92db5da1850b3f9a700b5d70b25a1d0d33f471_2_586x186.png\" alt=\"Screenshot 2024-05-06 at 1.41.22 PM\" data-base62-sha1=\"3N53kmfcCLSvSYSP936lnOetPrz\" width=\"586\" height=\"186\" srcset=\"https://gov.gitcoin.co/uploads/db4391/optimized/2X/1/1a92db5da1850b3f9a700b5d70b25a1d0d33f471_2_586x186.png, https://gov.gitcoin.co/uploads/db4391/optimized/2X/1/1a92db5da1850b3f9a700b5d70b25a1d0d33f471_2_879x279.png 1.5x, https://gov.gitcoin.co/uploads/db4391/optimized/2X/1/1a92db5da1850b3f9a700b5d70b25a1d0d33f471_2_1172x372.png 2x\" data-dominant-color=\"F7F7F7\"></a></div><p></p>\n<h2><a name=\"fixed-vs-variable-intent-10\" class=\"anchor\" href=\"https://gov.gitcoin.co#fixed-vs-variable-intent-10\"></a>Fixed vs Variable Intent</h2>\n<p>Another spectrum that Ephemeral DAOs can be on is fixed intent (eg they were always intended to wind down - like a RetroPGF round) vs variable intent (the decision to wind down was only made after some time - like MetaCartel DAO).</p>\n<p></p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://gov.gitcoin.co/uploads/db4391/original/2X/e/e16b42f7348493c7dfd2a6f0b996d29155e21746.png\" data-download-href=\"https://gov.gitcoin.co/uploads/db4391/e16b42f7348493c7dfd2a6f0b996d29155e21746\" title=\"\"><img src=\"https://gov.gitcoin.co/uploads/db4391/optimized/2X/e/e16b42f7348493c7dfd2a6f0b996d29155e21746_2_624x205.png\" alt=\"\" data-base62-sha1=\"wa9eJRac7PA6vr9ViCeCxjT0Ky2\" width=\"624\" height=\"205\" role=\"presentation\" srcset=\"https://gov.gitcoin.co/uploads/db4391/optimized/2X/e/e16b42f7348493c7dfd2a6f0b996d29155e21746_2_624x205.png, https://gov.gitcoin.co/uploads/db4391/optimized/2X/e/e16b42f7348493c7dfd2a6f0b996d29155e21746_2_936x307.png 1.5x, https://gov.gitcoin.co/uploads/db4391/original/2X/e/e16b42f7348493c7dfd2a6f0b996d29155e21746.png 2x\" data-dominant-color=\"F9F9F9\"></a></div><p></p>\n<h2><a name=\"for-profit-vs-non-profit-ephemeral-daos-11\" class=\"anchor\" href=\"https://gov.gitcoin.co#for-profit-vs-non-profit-ephemeral-daos-11\"></a>For Profit vs Non-Profit Ephemeral DAOs</h2>\n<p>Another spectrum that Ephemeral DAOs can be on is non-profit (like a QF or RetroPGF round) vs for profit (like a <a href=\"https://www.hydraventures.xyz/\">Hydra ventures </a> investment DAO)</p>\n<p></p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://gov.gitcoin.co/uploads/db4391/original/2X/0/072e1b82d985b71ed20df8157dd31c53c4f0643b.png\" data-download-href=\"https://gov.gitcoin.co/uploads/db4391/072e1b82d985b71ed20df8157dd31c53c4f0643b\" title=\"\"><img src=\"https://gov.gitcoin.co/uploads/db4391/optimized/2X/0/072e1b82d985b71ed20df8157dd31c53c4f0643b_2_624x141.png\" alt=\"\" data-base62-sha1=\"11w7SvdxORZDhMTeuNtKW3llH3d\" width=\"624\" height=\"141\" role=\"presentation\" srcset=\"https://gov.gitcoin.co/uploads/db4391/optimized/2X/0/072e1b82d985b71ed20df8157dd31c53c4f0643b_2_624x141.png, https://gov.gitcoin.co/uploads/db4391/optimized/2X/0/072e1b82d985b71ed20df8157dd31c53c4f0643b_2_936x211.png 1.5x, https://gov.gitcoin.co/uploads/db4391/original/2X/0/072e1b82d985b71ed20df8157dd31c53c4f0643b.png 2x\" data-dominant-color=\"F9F9F9\"></a></div><p></p>\n<h2><a name=\"evolutionary-ephemeral-daos-12\" class=\"anchor\" href=\"https://gov.gitcoin.co#evolutionary-ephemeral-daos-12\"></a>Evolutionary Ephemeral DAOs</h2>\n<p>Another attribute of Ephemeral DAOs is how evolutionary they can be. By launching ephemeral DAOs that last for only for a short amount of time, then tweaking their designs, and then launching the next one, DAO designers can iterate towards a design goal. Here is a visual example of how Public Goods Funding rounds (each is a ephemeral DAO) can be evolutionary experiments creating more value over time through learning + iteration.</p>\n<p></p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://gov.gitcoin.co/uploads/db4391/original/2X/0/0e98e05ed9606cfb5f8c852e84bdfeccf2f786a6.png\" data-download-href=\"https://gov.gitcoin.co/uploads/db4391/0e98e05ed9606cfb5f8c852e84bdfeccf2f786a6\" title=\"\"><img src=\"https://gov.gitcoin.co/uploads/db4391/optimized/2X/0/0e98e05ed9606cfb5f8c852e84bdfeccf2f786a6_2_624x463.png\" alt=\"\" data-base62-sha1=\"258dH04O952ikZc7GpvrmcKqQpU\" width=\"624\" height=\"463\" role=\"presentation\" srcset=\"https://gov.gitcoin.co/uploads/db4391/optimized/2X/0/0e98e05ed9606cfb5f8c852e84bdfeccf2f786a6_2_624x463.png, https://gov.gitcoin.co/uploads/db4391/optimized/2X/0/0e98e05ed9606cfb5f8c852e84bdfeccf2f786a6_2_936x694.png 1.5x, https://gov.gitcoin.co/uploads/db4391/optimized/2X/0/0e98e05ed9606cfb5f8c852e84bdfeccf2f786a6_2_1248x926.png 2x\" data-dominant-color=\"FCFCFC\"></a></div><p></p>\n<p>I explored the concept of evolutionary Public Goods Funding Campaigns in the recent post entitled <a href=\"https://gov.gitcoin.co/t/public-goods-funding-must-be-evolutionary/18728\">Public Goods Funding must be evolutionary.</a> Read more there!</p>\n<p>From this perspective, projects like Gitcoin are kind of an Ephemeral DAO factory. Gitcoin launches Grants rounds (Ephemeral DAOs) and then round over round, tweaking the protocols they run on to launch progressively better &amp; better ephemeral DAOs.</p>\n<h1><a name=\"best-practices-for-ephemeral-daos-13\" class=\"anchor\" href=\"https://gov.gitcoin.co#best-practices-for-ephemeral-daos-13\"></a>Best Practices for Ephemeral DAOs</h1>\n<ul>\n<li>Leverage the advantages of Ephemeral DAOs (less stakes, less risk of entrenching power, ability to be iterative) when designing your Ephemeral DAO.</li>\n<li>To be both successful and ephemeral, an org has to have mechanisms for fairly winding down</li>\n<li>Have a hypothesis behind each Ephemeral DAO launch. Design each Ephemeral DAO launch as an experiment + then Learn from it, use those learnings to evolve your DAO design forward in the next launch. (repeat)</li>\n</ul>\n<h1><a name=\"conclusion-14\" class=\"anchor\" href=\"https://gov.gitcoin.co#conclusion-14\"></a>Conclusion</h1>\n<p>In summary, Ephemeral DAOs exemplify a transformative frontier in the realm of decentralized organizations, where the temporary nature of these entities not only promotes innovation but also allows for agile, purpose-driven engagements that dissolve upon goal completion.</p>\n<p>This design strategy minimizes long-term commitments and facilitates rapid experimentation and learning, offering a fresh perspective on collaborative efforts and governance.</p>\n<p>As this underexplored space continues to evolve, it holds the promise of reshaping our understanding of collective action and organizational life cycles in the digital age.</p>\n<h1><a name=\"just-for-fun-15\" class=\"anchor\" href=\"https://gov.gitcoin.co#just-for-fun-15\"></a>Just for fun</h1>\n<p>Ephemeral DAOs remind me of sand mandalas!  A sand mandala is a Tibetan Buddhist art form created with colored sand to represent the universe. They are meticulously swept away upon completion to symbolize impermanence and the transient nature of existence.</p>\n<p><a href=\"https://twitter.com/owocki/status/1787318481291010503\"><img src=\"https://gov.gitcoin.co/uploads/db4391/original/2X/e/ebdd84d652b8f3e0d711b8c4e208f64835f3aff7.gif\" alt=\"Screen Recording 2024-05-06 at 1.37.00 PM\" data-base62-sha1=\"xEyO4pFlqyzbGAZPEr7sn0BkLwb\" width=\"645\" height=\"500\"></a></p>\n            <p><small>3 posts - 3 participants</small></p>\n            <p><a href=\"https://gov.gitcoin.co/t/ephemeral-daos-an-underexplored-design-space/18749\">Read full topic</a></p>","link":"https://gov.gitcoin.co/t/ephemeral-daos-an-underexplored-design-space/18749","pubDate":"Mon, 06 May 2024 19:42:33 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"gov.gitcoin.co-topic-18749"},"source":{"@url":"https://gov.gitcoin.co/t/ephemeral-daos-an-underexplored-design-space/18749.rss","#text":"Ephemeral DAOs: An underexplored design space"}},{"title":"[Proposal]S22 - Gitcoin Passport Business Unit Budget Proposal","dc:creator":"Jeremy","category":"📜 Proposals","description":"<h1>S22 - Gitcoin Passport Business Unit Budget Proposal </h1>\n<p>This seeks funding for the Gitcoin Passport Business Unit for the next 2 months (May 1st - June 30th). Starting July 1st we’ll move from the Seasons concept (made to align previously with Gitcoin Grants rounds) to traditional quarters (Q3 &amp; Q4) and request a budget for the 2nd half of the year, as needed, depending on the spinout. We want and encourage broader DAO feedback and find it crucial to optimize our roadmap.</p>\n<h2>TL;DR</h2>\n<p>Gitcoin Passport aims to be the go-to solution for web3 identity and reputation management. In the next partial season we’ll concentrate on five key pillars:</p>\n<ol>\n<li><strong>Ease:</strong> Improve ease of use for both end users and partners</li>\n<li><strong>Effectiveness:</strong> Improve identity scoring models</li>\n<li><strong>Adoption:</strong> Grow to 1.5M passports</li>\n<li><strong>GTC Utility</strong>: Strengthen GTC-based identity and community ties</li>\n<li><strong>Partnerships:</strong> Increase both API and onchain partnerships</li>\n</ol>\n<h2>Outline</h2>\n<p>Passport is the premier web3 native offering that enables ecosystems to protect, understand and organically grow what matters most – their communities. We see Passport at the confluence of a best in class identity solution, backed by the most relevant and comprehensive data analysis toolset that also offers communities the ability to ascribe reputation.</p>\n<p>Objectives for Seasons 22: This table lists the milestones and deliverables we plan to tackle. While they are in a loose priority order, their final sequencing is still under evaluation.</p>\n<table>\n  <tbody><tr>\n   <td><strong>Initiative/Project\t\t</strong>\n   </td>\n   <td><strong>Outcome</strong>\n   </td>\n   <td><strong>Milestone/ deliverable</strong>\n   </td>\n  </tr>\n  <tr>\n   <td>Ease\n   </td>\n   <td>Reduce time to obtain a passing Passport\n   </td>\n   <td>Average user is able to claim a Passport in &lt;5 minutes\n   </td>\n  </tr>\n  <tr>\n   <td>Effectiveness\n   </td>\n   <td>Enhance the scoring model\n   </td>\n   <td>Develop a scoring model with &lt;10% Type I errors (False positives - Sybils are classified as human)\n<p>\nAggregate L2 Models\n   </p></td>\n  </tr>\n  <tr>\n   <td>Adoption\n   </td>\n   <td>Expand user base\n<p>\n</p><p>Grow Model based detection (MBD)</p>\n   </td>\n   <td>Increase Passport count 150k to 1.3M Passports from a baseline of 1.15M\n<p>\nLaunch MBD and score &gt; 10,000 addresses\n   </p></td>\n  </tr>\n  <tr>\n   <td>GTC Utility\n   </td>\n   <td>Strengthen GTC-based identity and community ties\n   </td>\n   <td>Increase GTC staked 220k to 1.87M GTC from baseline of 1.65M GTC\n   </td>\n  </tr>\n  <tr>\n   <td>Partnerships\n   </td>\n   <td>Increase API integrations\n<p>\nOnboard onchain partners\n   </p></td>\n   <td>Partner &gt; 64 API users from a baseline of 54\n<p>\nEngage &gt; 12 onchain partners from a baseline of 7\n   </p></td>\n  </tr>\n</tbody></table>\n<h2>Milestone Update: Season 21</h2>\n<p>In Season 21, our top line growth picked up quite a bit adding 279k new Passports or 35% total growth in the last 3 months. We continued to underperform against aggressive targets, but excited to see the growth as the markets are becoming more bullish. We have a total of 1.1M unique all time passports. We also continued to drive strongly against our targets in GTC staking, hitting over 1.5M GTC staked.</p>\n<p>We’ve continued to expand our potential service offerings beyond the standard Passport &amp; onchain Passports to include our new Model Based Detection (MBD) system that is now in beta with the Eth activity model. This is proving to be highly effective at classifying Sybils (94% accurate) and enables scoring of addresses without requiring any user interaction. The Ethereum Activity model is the first model with additional models to be added to the MBD endpoint soon. Additions will include: NFT (Eth L1), zkSync (L2), OP (L2) and Polygon (L2) with more in the pipeline.</p>\n<h3>Milestone Report for Past Season</h3>\n<p><strong>Legend:</strong></p>\n<p><img src=\"https://gov.gitcoin.co/images/emoji/twitter/green_circle.png?v=12\" title=\":green_circle:\" class=\"emoji\" alt=\":green_circle:\" loading=\"lazy\" width=\"20\" height=\"20\"> Success/Completed/Shipped<br>\n<img src=\"https://gov.gitcoin.co/images/emoji/twitter/yellow_circle.png?v=12\" title=\":yellow_circle:\" class=\"emoji\" alt=\":yellow_circle:\" loading=\"lazy\" width=\"20\" height=\"20\"> Incomplete, but partial success<br>\n<img src=\"https://gov.gitcoin.co/images/emoji/twitter/red_circle.png?v=12\" title=\":red_circle:\" class=\"emoji\" alt=\":red_circle:\" loading=\"lazy\" width=\"20\" height=\"20\"> Incomplete, Will Not Hit Goal<br>\n<img src=\"https://gov.gitcoin.co/images/emoji/twitter/black_circle.png?v=12\" title=\":black_circle:\" class=\"emoji\" alt=\":black_circle:\" loading=\"lazy\" width=\"20\" height=\"20\"> Canceled</p>\n<table>\n  <tbody><tr>\n   <td><strong>Initiative/Project</strong>\n   </td>\n   <td><strong>Key Results</strong>\n   </td>\n   <td><strong>Value Delivered</strong>\n   </td>\n  </tr>\n  <tr>\n   <td><strong>Improve Effectiveness</strong> \n   </td>\n   <td>\n<p><img src=\"https://gov.gitcoin.co/images/emoji/twitter/green_circle.png?v=12\" title=\":green_circle:\" class=\"emoji\" alt=\":green_circle:\" loading=\"lazy\" width=\"20\" height=\"20\"> 95% accuracy with Eth Stamp</p>\n   </td>\n   <td>Launched new zkSync Activity stamp, NFT stamp, and revamped all credential weights to dramatically improve classification and reduce Sybils able to get a passing score of 20.\n   </td>\n  </tr>\n  <tr>\n   <td><strong>Grow Adoption &amp; Usage</strong>\n   </td>\n   <td>\n<p><img src=\"https://gov.gitcoin.co/images/emoji/twitter/yellow_circle.png?v=12\" title=\":yellow_circle:\" class=\"emoji\" alt=\":yellow_circle:\" loading=\"lazy\" width=\"20\" height=\"20\"> 1.15M Passports</p>\n   </td>\n   <td>Continued to drive top line growth of unique Passports by adding 279k brand new Passports, but were still short of our target of 1.5M\n   </td>\n  </tr>\n  <tr>\n   <td><strong>GTC Utility</strong> \n   </td>\n   <td>\n<p><img src=\"https://gov.gitcoin.co/images/emoji/twitter/yellow_circle.png?v=12\" title=\":yellow_circle:\" class=\"emoji\" alt=\":yellow_circle:\" loading=\"lazy\" width=\"20\" height=\"20\"> 1.65M GTC Staked</p>\n<p>\n</p><p><img src=\"https://gov.gitcoin.co/images/emoji/twitter/yellow_circle.png?v=12\" title=\":yellow_circle:\" class=\"emoji\" alt=\":yellow_circle:\" loading=\"lazy\" width=\"20\" height=\"20\"> 22,100 Community staking addresses</p>\n   </td>\n   <td>Staking remains strong, having increased another 350k GTC staked, but unable to hit the 2M GTC target. It will likely take another ~6 months to achieve.\n<p>\nAlmost hit our target of 25k community staking addresses despite being behind on launching revamped identity staking in S21. Identity staking v2 will launch in S22.\n   </p></td>\n  </tr>\n  <tr>\n   <td><strong>Data</strong>\n   </td>\n   <td>\n<p><img src=\"https://gov.gitcoin.co/images/emoji/twitter/black_circle.png?v=12\" title=\":black_circle:\" class=\"emoji\" alt=\":black_circle:\" loading=\"lazy\" width=\"20\" height=\"20\"> 200,000 Sybils</p>\n<p>\n</p><p><img src=\"https://gov.gitcoin.co/images/emoji/twitter/black_circle.png?v=12\" title=\":black_circle:\" class=\"emoji\" alt=\":black_circle:\" loading=\"lazy\" width=\"20\" height=\"20\"> Catalog ~ 11,000 human users (verified and human)</p>\n   </td>\n   <td>Adjusted our approach to this milestone last season and focused on both growing the human data set and also releasing the first of our L2 models: zkSync. Started building both OP and Polygon models and determing feasiblity for additional L2 models.\n   </td>\n  </tr>\n  <tr>\n   <td><strong>Partnerships</strong>\n   </td>\n   <td>\n<p><img src=\"https://gov.gitcoin.co/images/emoji/twitter/yellow_circle.png?v=12\" title=\":yellow_circle:\" class=\"emoji\" alt=\":yellow_circle:\" loading=\"lazy\" width=\"20\" height=\"20\">  54 API Partners</p>\n<p>\n</p><p><img src=\"https://gov.gitcoin.co/images/emoji/twitter/green_circle.png?v=12\" title=\":green_circle:\" class=\"emoji\" alt=\":green_circle:\" loading=\"lazy\" width=\"20\" height=\"20\"> _circle: 7 onchain partners (users of attestations)</p>\n   </td>\n   <td>Under delivered against a target of 70 which also impacted our top line Passport growth &amp; adoption. \n<p>\nWe exceeded our goal of 5 onchain partners in S21! \n   </p></td>\n  </tr>\n</tbody></table>\n<p><strong>Observations:</strong></p>\n<ul>\n<li>While we fell short again on passport adoption against very aggressive targets of doubling every 6 months. We’re continuing to drive a pipeline for new integration partners to continue growth.</li>\n<li>We’ve found success in both GTC staking and onchain revenue starting to drive the flywheel for both utility and sustainability. The upcoming revamp of identity staking, from smart contracts to UI, should continue to grow the utility of GTC. This was delayed several months from our original go-live estimates as we focused on supporting key partners.</li>\n</ul>\n<p>For more granular details on our past work and plans, please refer to our previous budgets for <a href=\"https://gov.gitcoin.co/t/s17-proposal-integrated-gitcoin-passport-budget-request/12727\">S17</a>, <a href=\"https://gov.gitcoin.co/t/proposal-gitcoin-passport-workstream-season-18-19-budget-request/14121\">S18 &amp; S19</a>, <a href=\"https://gov.gitcoin.co/t/s19-proposal-amended-passport-s19-budget-request/16184\">S19 (Amended)</a>, <a href=\"https://gov.gitcoin.co/t/proposal-passport-season-20-21-budget-request/16765\">S20 &amp; S21</a>, and also our updated <a href=\"https://github.com/orgs/gitcoinco/projects/25/views/1\" rel=\"noopener nofollow ugc\">Passport Roadmap</a>.</p>\n<h2>Budget Update: Season Next (May &amp; June) </h2>\n<p>We are increasing the budget for this season as part of the move to the BU concept; adding 3 additional headcount accounting for resources who were previously shared or part time. The additional budget includes hiring a Sr. Product Marketing Manager (still in progress), moving from part time to full time Operations, adding an additional BD resource dedicated to support growth, and adding Kyle to the team!</p>\n<p><strong>Team Composition</strong></p>\n<p><strong>Full-Time Contributors:</strong> 15 (after hiring the two described above)</p>\n<ul>\n<li>Developers: 4</li>\n<li>Product Manager: 1</li>\n<li>Data Scientists: 2</li>\n<li>Business Unit Co-leads: 2 (Kyle moving in)</li>\n<li>Operations: 1</li>\n<li>Marketing: 1</li>\n<li>Support: 2</li>\n<li>Design: 1 (previously part time, moving to full time role dedicated to Passport)</li>\n<li>BD: 1 (previously cost for BD was out of PGF which is now Grants Labs, moving to fully dedicated to Passport)</li>\n</ul>\n<p><strong>Part-Time or Shared Contributors:</strong> 5</p>\n<ul>\n<li>DevRel: 2</li>\n<li>DevOps: 1</li>\n<li>Operations: 1</li>\n</ul>\n<h2>Funding Request for Seasons S22</h2>\n<p><strong>Requested Amount:</strong> Gitcoin Passport is requesting a net allocation of 0 GTC*, equivalent to approximately $0 out of treasury to cover this season. We have plenty of funds in our reserves, in part due to the Eth revenue from onchain Passports, to cover all funds needed for this shortened season of 2 months.</p>\n<table>\n  <tbody><tr>\n   <td>\n   </td>\n   <td><strong>Budgeted</strong>\n   </td>\n   <td><strong>Budgeted</strong>\n   </td>\n   <td><strong>Budgeted</strong>\n   </td>\n  </tr>\n  <tr>\n   <td>\n   </td>\n   <td><strong>May 2024</strong>\n   </td>\n   <td><strong>Jun 2024</strong>\n   </td>\n   <td><strong>May-2024 - Jun-2024</strong>\n   </td>\n  </tr>\n  <tr>\n   <td>Total GP Budgeted Spend\n   </td>\n   <td>$196,366\n   </td>\n   <td>$198,926\n   </td>\n   <td>$460,405\n   </td>\n  </tr>\n  <tr>\n   <td>33% Reserves\n   </td>\n   <td>\n   </td>\n   <td>\n   </td>\n   <td>$153,468\n   </td>\n  </tr>\n  <tr>\n   <td>Past Season Treasury Balance\n   </td>\n   <td>\n   </td>\n   <td><strong>(We will still have a buffer of at least $225k in treasury)</strong>\n   </td>\n   <td>$840,325\n   </td>\n  </tr>\n  <tr>\n   <td><strong>Total Request</strong>\n   </td>\n   <td>\n   </td>\n   <td>\n   </td>\n   <td><strong>$0</strong>\n   </td>\n  </tr>\n</tbody></table>\n<p><strong>Budget Evolution</strong></p>\n<table>\n  <tbody><tr>\n   <td>\n   </td>\n   <td><strong>S17</strong>\n   </td>\n   <td><strong>S18</strong>\n   </td>\n   <td><strong>Amended S19</strong>\n   </td>\n   <td><strong>S20</strong>\n   </td>\n   <td><strong>S21</strong>\n   </td>\n   <td><strong>S22 </strong>\n<p>\n<strong>(May &amp; June)</strong>\n   </p></td>\n  </tr>\n  <tr>\n   <td>Passport Budget \n   </td>\n   <td>$515,254\n   </td>\n   <td>$589,846\n   </td>\n   <td>$494,116\n   </td>\n   <td>$478,591\n   </td>\n   <td>$642,216\n   </td>\n   <td>$460,405*\n   </td>\n  </tr>\n</tbody></table>\n<p>*** Note: **No GTC is being requested as the team will be using existing reserves.</p>\n<h2>Budget Breakdown</h2>\n<p><strong>Breakdown staffing, contracting, operational expenses</strong></p>\n<p>We have accounted for upcoming expenses, aiming for a lean but comprehensive budget. Our 16-member team comprises roles in Product, Design, Engineering, DevRel, Operations, and Support.</p>\n<table>\n  <tbody><tr>\n   <td>\n   </td>\n   <td>S18 (Actual Spend)\n   </td>\n   <td>S19 (Projected Actuals)\n   </td>\n   <td>S20 (Requested)\n   </td>\n   <td>S21 (Adjusted)\n   </td>\n   <td>S22 (May &amp; June)\n   </td>\n  </tr>\n  <tr>\n   <td>Contributor Rewards\n   </td>\n   <td>$373,791\n   </td>\n   <td>$318,102\n   </td>\n   <td>$341,674\n   </td>\n   <td>$426,799\n   </td>\n   <td>$378,496\n   </td>\n  </tr>\n  <tr>\n   <td>Contracting (Dev Ops, DevRel, design, Marketing)\n   </td>\n   <td>$114,192\n   </td>\n   <td>$70,969\n   </td>\n   <td>$75,192\n   </td>\n   <td>$149,192\n   </td>\n   <td>$11,000\n   </td>\n  </tr>\n  <tr>\n   <td>OpEx (Software subscriptions, gas, audits, travel, professional development)\n   </td>\n   <td>$31,835\n   </td>\n   <td>$42,236\n   </td>\n   <td>$61,725\n   </td>\n   <td>$66,225\n   </td>\n   <td>$70,908\n   </td>\n  </tr>\n  <tr>\n   <td><strong><em>Total</em></strong>\n   </td>\n   <td><strong><em>$519,818</em></strong>\n   </td>\n   <td><strong><em>$431,307</em></strong>\n   </td>\n   <td><strong><em>$478,591</em></strong>\n   </td>\n   <td><strong><em>$642,216</em></strong>\n   </td>\n   <td><strong><em>$460,404</em></strong>\n   </td>\n  </tr>\n</tbody></table>\n<p><strong>We Want Your Input</strong></p>\n<p>We welcome your expertise in several key areas:</p>\n<ul>\n<li>Suggestions for integration partners.</li>\n<li>Introductions to potential onchain pilot programs.</li>\n<li>Participation in user interviews.</li>\n</ul>\n<p>Your novel ideas for expanding the reach of Gitcoin Passport are invaluable.</p>\n<p>Thank you for your time and insights; your input makes us better.</p>\n            <p><small>3 posts - 2 participants</small></p>\n            <p><a href=\"https://gov.gitcoin.co/t/proposal-s22-gitcoin-passport-business-unit-budget-proposal/18731\">Read full topic</a></p>","link":"https://gov.gitcoin.co/t/proposal-s22-gitcoin-passport-business-unit-budget-proposal/18731","pubDate":"Fri, 03 May 2024 21:31:05 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"gov.gitcoin.co-topic-18731"},"source":{"@url":"https://gov.gitcoin.co/t/proposal-s22-gitcoin-passport-business-unit-budget-proposal/18731.rss","#text":"[Proposal]S22 - Gitcoin Passport Business Unit Budget Proposal"}},{"title":"Public Goods Funding MUST be Evolutionary!","dc:creator":"owocki","category":"🧙 🧙‍♀️ Ideas and Open Discussion","description":"<p><em>(Thanks for <a class=\"mention\" href=\"https://gov.gitcoin.co/u/ccerv1\">@ccerv1</a> and <a class=\"mention\" href=\"https://gov.gitcoin.co/u/jonassft\">@Jonassft</a> for reviewing + feedback.)</em></p>\n<h1><a name=\"public-goods-funding-must-be-evolutionary-1\" class=\"anchor\" href=\"https://gov.gitcoin.co#public-goods-funding-must-be-evolutionary-1\"></a>Public Goods Funding MUST be Evolutionary!</h1>\n<h1><a name=\"tldr-2\" class=\"anchor\" href=\"https://gov.gitcoin.co#tldr-2\"></a>Tldr</h1>\n<ul>\n<li>Goodhart’s Law states that when a metric is used as a target, it can no longer serve as an effective measure, leading to behavior focused on optimizing that metric at the cost of broader goals.</li>\n<li>Implications for DAOs and Public Goods Funding: In DAOs, especially in public goods funding mechanisms, there’s a need for systems that evolve over time, using diverse, dynamic metrics and incorporating community feedback to prevent gaming and maintain effectiveness.</li>\n<li>Balance Between Immutability and Evolution: While the crypto community values immutability, the post argues for a balance, suggesting that while some aspects of DAO operations should remain immutable, others should evolve to adapt to new insights and conditions - to avoid Goodharts law.</li>\n</ul>\n<h1><a name=\"goodharts-law-3\" class=\"anchor\" href=\"https://gov.gitcoin.co#goodharts-law-3\"></a>Goodhart’s Law</h1>\n<p></p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://gov.gitcoin.co/uploads/db4391/original/2X/1/18a28058cf2ae01e27b3a9ae1d520ede64c084dd.png\" data-download-href=\"https://gov.gitcoin.co/uploads/db4391/18a28058cf2ae01e27b3a9ae1d520ede64c084dd\" title=\"\"><img src=\"https://gov.gitcoin.co/uploads/db4391/optimized/2X/1/18a28058cf2ae01e27b3a9ae1d520ede64c084dd_2_200x219.png\" alt=\"\" data-base62-sha1=\"3vVCf7S2Oq0CmAcnWVAlKP1QHh3\" width=\"200\" height=\"219\" role=\"presentation\" srcset=\"https://gov.gitcoin.co/uploads/db4391/optimized/2X/1/18a28058cf2ae01e27b3a9ae1d520ede64c084dd_2_200x219.png, https://gov.gitcoin.co/uploads/db4391/optimized/2X/1/18a28058cf2ae01e27b3a9ae1d520ede64c084dd_2_300x328.png 1.5x, https://gov.gitcoin.co/uploads/db4391/optimized/2X/1/18a28058cf2ae01e27b3a9ae1d520ede64c084dd_2_400x438.png 2x\" data-dominant-color=\"E8E8E8\"></a></div><p></p>\n<p>Goodhart’s Law is a principle in economics and statistics that states, “When a measure becomes a target, it ceases to be a good measure.”</p>\n<p>This concept was first articulated by British economist Charles Goodhart in 1975. The reasoning behind this law involves several key ideas:</p>\n<ol>\n<li><strong>Distortion of Incentives</strong>: When a particular metric is chosen as the target for policy or performance evaluation, it often leads to a change in behavior to optimize specifically for that metric. This change in behavior can lead to unintended consequences that distort the original purpose of the measure.</li>\n<li><strong>Overemphasis on Measurable Outcomes</strong>: People tend to focus on what can be easily measured and quantified. When a measure becomes a target, there is a risk that other important but less quantifiable aspects are neglected, leading to a narrower and potentially misleading evaluation of success or progress.</li>\n<li><strong>Manipulation and Gaming:</strong> There is a tendency for individuals or organizations to manipulate or game the system to achieve better scores on targeted metrics, regardless of whether this results in genuine improvements in the underlying objectives. For instance, schools might focus on teaching to the test rather than improving overall educational quality if test scores become the primary measure of educational success.</li>\n<li><strong>Reductionism</strong>: Goodhart’s Law highlights the dangers of reductionism in policy-making and management, where complex systems are reduced to simplistic numbers or targets. This reductionism can oversimplify reality and lead to decisions that might work well for the metric but poorly for the system as a whole.</li>\n</ol>\n<p>The law serves as a caution against over-relying on any single measure or metric for decision-making, especially in complex systems where multiple factors should be considered. It underscores the importance of using a balanced set of measures and remaining vigilant about the ways that incentives can influence behavior.</p>\n<h1><a name=\"goodharts-law-public-goods-funding-4\" class=\"anchor\" href=\"https://gov.gitcoin.co#goodharts-law-public-goods-funding-4\"></a>Goodhart’s Law <img src=\"https://gov.gitcoin.co/images/emoji/twitter/handshake.png?v=12\" title=\":handshake:\" class=\"emoji\" alt=\":handshake:\" loading=\"lazy\" width=\"20\" height=\"20\"> Public Goods Funding</h1>\n<p>In this post, I will argue that this has massive implications for how we fund public goods in the future.</p>\n<p>Why? Public goods funding isn’t one discrete event, its a series of events over time.</p>\n<p>What we hope will happen is this. PGF rounds create massive value creation in your ecosystem.</p>\n<p></p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://gov.gitcoin.co/uploads/db4391/original/2X/1/128ea044de08774b0e5b588a13b262d9cd36eda3.png\" data-download-href=\"https://gov.gitcoin.co/uploads/db4391/128ea044de08774b0e5b588a13b262d9cd36eda3\" title=\"\"><img src=\"https://gov.gitcoin.co/uploads/db4391/optimized/2X/1/128ea044de08774b0e5b588a13b262d9cd36eda3_2_624x461.png\" alt=\"\" data-base62-sha1=\"2Eaav4fPHsrqaqS4OP1fpRaqQg3\" width=\"624\" height=\"461\" role=\"presentation\" srcset=\"https://gov.gitcoin.co/uploads/db4391/optimized/2X/1/128ea044de08774b0e5b588a13b262d9cd36eda3_2_624x461.png, https://gov.gitcoin.co/uploads/db4391/optimized/2X/1/128ea044de08774b0e5b588a13b262d9cd36eda3_2_936x691.png 1.5x, https://gov.gitcoin.co/uploads/db4391/optimized/2X/1/128ea044de08774b0e5b588a13b262d9cd36eda3_2_1248x922.png 2x\" data-dominant-color=\"FBFBFB\"></a></div><p></p>\n<p>But if we take Goodhart’s law into account, what actually happens is less value creative.</p>\n<p></p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://gov.gitcoin.co/uploads/db4391/original/2X/e/e5e49146c41d85dd383287eaf919dc41b3cd1e22.png\" data-download-href=\"https://gov.gitcoin.co/uploads/db4391/e5e49146c41d85dd383287eaf919dc41b3cd1e22\" title=\"\"><img src=\"https://gov.gitcoin.co/uploads/db4391/optimized/2X/e/e5e49146c41d85dd383287eaf919dc41b3cd1e22_2_624x443.png\" alt=\"\" data-base62-sha1=\"wNJ2Kl4YtQTalAui01UeG8gWlSa\" width=\"624\" height=\"443\" role=\"presentation\" srcset=\"https://gov.gitcoin.co/uploads/db4391/optimized/2X/e/e5e49146c41d85dd383287eaf919dc41b3cd1e22_2_624x443.png, https://gov.gitcoin.co/uploads/db4391/optimized/2X/e/e5e49146c41d85dd383287eaf919dc41b3cd1e22_2_936x664.png 1.5x, https://gov.gitcoin.co/uploads/db4391/optimized/2X/e/e5e49146c41d85dd383287eaf919dc41b3cd1e22_2_1248x886.png 2x\" data-dominant-color=\"FAFAFA\"></a></div><p></p>\n<p>In the above diagram, we see that what works in pgf_round(n) wont work in pgf_round(n+1).</p>\n<p>As measures become targets, pgf_rounds will become less effective + thereby create diminishing returns in value creation.</p>\n<p>This applies no matter what mechanism you use! It applies in quadratic funding contexts, badgeholder review contexts, and any other repeat public goods funding round in a adaptive complex system (like a DAO’s political economy).</p>\n<h2><a name=\"so-what-do-we-do-about-it-5\" class=\"anchor\" href=\"https://gov.gitcoin.co#so-what-do-we-do-about-it-5\"></a>So what do we do about it?</h2>\n<p>What I think follows from this is that the best PGF rounds will become infinitely evolutionary games. An evolutionary game is a game theory concept where strategies and behaviors evolve over time based on the success of previous rounds, influenced by natural selection.</p>\n<p>As measures become targets, and targets become measures, the best systems will evolve forward in a way that is hard to be gamed + thereby does not create diminishing returns in value creation.</p>\n<p></p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://gov.gitcoin.co/uploads/db4391/original/2X/a/af6ddf532b018b1c2a5c9687d2b6981df12b4ae1.png\" data-download-href=\"https://gov.gitcoin.co/uploads/db4391/af6ddf532b018b1c2a5c9687d2b6981df12b4ae1\" title=\"Screenshot 2024-05-03 at 10.18.59 AM\"><img src=\"https://gov.gitcoin.co/uploads/db4391/original/2X/a/af6ddf532b018b1c2a5c9687d2b6981df12b4ae1.png\" alt=\"Screenshot 2024-05-03 at 10.18.59 AM\" data-base62-sha1=\"p1UXnHQeHbV91aNGvncjmiFqIb7\" width=\"690\" height=\"201\" data-dominant-color=\"E8E8E8\"></a></div><p></p>\n<p>In the new paradigm, our experiments will look a bit like this.</p>\n<p></p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://gov.gitcoin.co/uploads/db4391/original/2X/6/61514d445044f4d36c4c401f51849fcf41d4e95a.png\" data-download-href=\"https://gov.gitcoin.co/uploads/db4391/61514d445044f4d36c4c401f51849fcf41d4e95a\" title=\"\"><img src=\"https://gov.gitcoin.co/uploads/db4391/optimized/2X/6/61514d445044f4d36c4c401f51849fcf41d4e95a_2_624x447.png\" alt=\"\" data-base62-sha1=\"dSUvbtXXTWOgRPouqf3Zf8ePP8m\" width=\"624\" height=\"447\" role=\"presentation\" srcset=\"https://gov.gitcoin.co/uploads/db4391/optimized/2X/6/61514d445044f4d36c4c401f51849fcf41d4e95a_2_624x447.png, https://gov.gitcoin.co/uploads/db4391/optimized/2X/6/61514d445044f4d36c4c401f51849fcf41d4e95a_2_936x670.png 1.5x, https://gov.gitcoin.co/uploads/db4391/optimized/2X/6/61514d445044f4d36c4c401f51849fcf41d4e95a_2_1248x894.png 2x\" data-dominant-color=\"FBFBFB\"></a></div><p></p>\n<h2><a name=\"designing-measure-m1-6\" class=\"anchor\" href=\"https://gov.gitcoin.co#designing-measure-m1-6\"></a>Designing measure m+1</h2>\n<p>How does measure m evolve measure m +1? We have an evolutionary pressure insofar as the best ecosystems will be continuously evolving their measures forward, but in what ways can we do it?</p>\n<p>This is the frontier, and so unless you’ve run dozens of PGF rounds, you probably don’t know the answer (yet). But we can reason about this. I think there are a couple ways we can think about it though.</p>\n<ol>\n<li><strong>OODA Loop -</strong> Each PGF round is an OODA (Observe Orient Decide Act) loop by the mechanism designers. After each PGF round, mechanism designers will have to learn from that round, and figure out how the measure fared, and evolve it forward based on those learnings.</li>\n<li><strong>Algorithmic Randomness:</strong> Introduce elements of randomness in the reward or evaluation processes to reduce predictability and the effectiveness of gaming strategies. For example, random spot checks or audits can be used to ensure compliance without the system being entirely predictable.\n<ol>\n<li>In RetroPGF, the voting on metrics element of Round 4 design has a good amount of randomness built into it, as well as hard to predict game mechanisms like quorum rules and scoring formulas</li>\n</ol>\n</li>\n<li><strong>Community Feedback Mechanisms</strong>: Implement robust feedback systems that allow participants to report and address concerns about the integrity of the metrics or behaviors in the community. This feedback can be used to refine and improve the system continuously.</li>\n<li><strong>Hard to game metrics</strong> - metrics that are hard, or expensive, to game, will be resistant (but not immune) to goodharts law.</li>\n<li><strong>Diversified Metrics</strong>: Rather than relying on a single metric or indicator, use a diverse set of metrics to assess performance or impact. This helps ensure that different aspects of the desired outcomes are being captured and reduces the risk of any one metric becoming overly dominant.</li>\n<li><strong>Dynamic and Adaptive Metrics</strong>: Implement mechanisms that allow for metrics to be adjusted or replaced as the system evolves. This adaptability can help prevent the gaming of static metrics and ensure that measures continue to align with the underlying goals of the DAO. Metrics should also have counterbalancing forces, eg, new users vs retained users. It’s very hard to do both</li>\n<li><strong>Cap and Rotate Mechanisms</strong>: For critical metrics or roles within the system, consider using caps (limits on the maximum score or benefit) and rotating the focus among various metrics or areas. This can prevent over-optimization for any single metric and encourage broader contributions across different areas. An example of this policy in practice: one metric can never be more than 20% of the allocation.</li>\n</ol>\n<p>A feature in my view — is that this is a competitive landscape. If lots of actors start trying to game a metric, then it’s value collapses. There will always be alpha in looking for areas where you have outsize impact in hard areas.</p>\n<h2><a name=\"immutable-evolutionary-7\" class=\"anchor\" href=\"https://gov.gitcoin.co#immutable-evolutionary-7\"></a>Immutable =&gt; Evolutionary</h2>\n<p>In much of the history of the crypto ecosystem, we have placed a value on complete immutability of our protocols.</p>\n<p>Often, this is for good reason. Immutable protocols are incorruptible. We need this in our protocols for money - which according to crypto lore, should not be subject to the whims of any party. Because of this, we have uncensorable money, unprintable money, in BTC + ETH.</p>\n<p>But do we need immutability in every protocol for everything?</p>\n<p>Crypto-era Public Goods Funding has been born from this era of immutability, but it must also transcend it in order to be successful.</p>\n<ol>\n<li>We can gain the benefits of immutability in some places (eg intra-round, we should depend on credibly neutral protocols where anyone can verify the vote count), while we partially deviate from it in between rounds (for good reasons, outlined above).</li>\n<li>We must recognize that our emphasis on immutability has often made us aim for the perfect solution and think less iteratively. Public Goods Funding experiments could and should take the opposite approach - iterate towards a local maxima over time. Have a bias towards action + have the courage to ship something imperfect soon over never shipping the (theoretically) perfect thing.</li>\n</ol>\n<h2><a name=\"conclusion-8\" class=\"anchor\" href=\"https://gov.gitcoin.co#conclusion-8\"></a>Conclusion</h2>\n<p>Goodhart’s Law, introduced by British economist Charles Goodhart in 1975, articulates that “When a measure becomes a target, it ceases to be a good measure.” This principle highlights how using a specific metric as a target for policy or performance can lead to behaviors aimed at optimizing that metric, often at the expense of the intended goal. This manipulation and overemphasis on measurable outcomes can distort the original purpose of the measure, reduce the complexity of systems to simplistic numbers, and potentially lead to misleading evaluations.</p>\n<p>We think this has massive implications on the funding of public goods in decentralized autonomous organizations (DAOs), particularly through mechanisms like quadratic funding and badgeholder review.</p>\n<p>We suggest that the best public goods funding (PGF) systems would benefit from being evolutionary and adaptable, incorporating strategies such as diversified metrics, dynamic adjustments, and robust community feedback to stay effective and resistant to gaming.</p>\n<p>We advocate for a balance between immutable protocols and adaptable strategies to ensure long-term success in funding public goods.</p>\n            <p><small>3 posts - 3 participants</small></p>\n            <p><a href=\"https://gov.gitcoin.co/t/public-goods-funding-must-be-evolutionary/18728\">Read full topic</a></p>","link":"https://gov.gitcoin.co/t/public-goods-funding-must-be-evolutionary/18728","pubDate":"Fri, 03 May 2024 16:20:07 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"gov.gitcoin.co-topic-18728"},"source":{"@url":"https://gov.gitcoin.co/t/public-goods-funding-must-be-evolutionary/18728.rss","#text":"Public Goods Funding MUST be Evolutionary!"}},{"title":"Gitcoin Citizens Rounds - Value Generation Opportunities","dc:creator":"owocki","category":"🧙 🧙‍♀️ Ideas and Open Discussion","description":"<p>(Thanks to <a class=\"mention\" href=\"https://gov.gitcoin.co/u/viriya\">@Viriya</a> for helping me review, and <a class=\"mention\" href=\"https://gov.gitcoin.co/u/krrisis\">@krrisis</a> <a class=\"mention\" href=\"https://gov.gitcoin.co/u/umarkhaneth\">@umarkhaneth</a> for their role in  pushing Citizens rounds forward.  And to the Citizens themselves)</p>\n<h1><a name=\"tldr-1\" class=\"anchor\" href=\"https://gov.gitcoin.co#tldr-1\"></a>TLDR</h1>\n<p>Here’s a brief overview of how Gitcoin Citizens rounds contribute to increasing Allo GMV through strategic value loops:</p>\n<ul>\n<li>GMV Creation Loop: Gitcoin Citizens retroactive funding rounds directly increase Allo’s Gross Merchandise Value (GMV) by operating on the Allo platform.</li>\n<li>Incentive Alignment Loop: Aligns the broader Gitcoin community with the DAO’s objectives, promoting active contribution and value creation across various roles.</li>\n<li>Dogfood Loop - Enhances product development and organizational structure by using Gitcoin’s own platform for its development, leading to improved empathy and functionality.</li>\n</ul>\n<p>This value compounds over time.</p>\n<h1><a name=\"the-value-loops-of-gitcoin-citizens-2\" class=\"anchor\" href=\"https://gov.gitcoin.co#the-value-loops-of-gitcoin-citizens-2\"></a>The value loops of Gitcoin Citizens</h1>\n<p>The objective of this post is to articulate how Gitcoin Citizens rounds contribute to the goal of Allo GMV.</p>\n<p>I think there are 3 primary value loops that Gitcoin Citizens rounds create for Gitcoin ecosystem.</p>\n<p></p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://gov.gitcoin.co/uploads/db4391/original/2X/6/6d8086d316157ae9a299304e04cf3328e209e167.png\" data-download-href=\"https://gov.gitcoin.co/uploads/db4391/6d8086d316157ae9a299304e04cf3328e209e167\" title=\"\"><img src=\"https://gov.gitcoin.co/uploads/db4391/optimized/2X/6/6d8086d316157ae9a299304e04cf3328e209e167_2_624x475.png\" alt=\"\" data-base62-sha1=\"fCHpvk5OmOfDlyarklHsGL0Unpt\" width=\"624\" height=\"475\" role=\"presentation\" srcset=\"https://gov.gitcoin.co/uploads/db4391/optimized/2X/6/6d8086d316157ae9a299304e04cf3328e209e167_2_624x475.png, https://gov.gitcoin.co/uploads/db4391/optimized/2X/6/6d8086d316157ae9a299304e04cf3328e209e167_2_936x712.png 1.5x, https://gov.gitcoin.co/uploads/db4391/optimized/2X/6/6d8086d316157ae9a299304e04cf3328e209e167_2_1248x950.png 2x\" data-dominant-color=\"F8F8F8\"></a></div><p></p>\n<ol>\n<li><strong>GMV Creation Loop</strong> - The first, and most simplistic, is that Gitcoin Citizens rounds are run on Allo. Thereby they directly create Allo GMV.</li>\n<li><strong>Incentive Alignment Loop</strong> - The second, is that it aligns the incentives of an outer orbit of Gitcoiners to the mission, goals, and north stars of the DAO.\n<ol>\n<li>The most recent citizens round <a href=\"https://twitter.com/GitcoinCitizens/status/1780596740728430821/photo/1\">incentivized lots of value creation at Gitcoin</a> - from data analysts, to educators, to security service providers, to memelords.</li>\n</ol>\n</li>\n<li><strong>Product Dogfood Loop</strong> - The third, is that the people building Gitcoin are using Gitcoin to build Gitcoin. If that sounds like a lot of Gitcoin compounding on itself, it is! And that is where the exponential potential is!\n<ol>\n<li>Dogfooding shakes things up. Software builders in the Gitcoin ecosystem gain new empathy for end users by having to use the software themselves.</li>\n<li>Dogfooding accelerates our builds. Software builders in the Gitcoin ecosystem can delegate their work to people in the community.</li>\n<li>Dogfooding compounds on itself over time. Conway’s Law posits that organizations design systems that mirror their own organizational structure. By using Gitcoin to build Gitcoin, we enable a sort of inverse conways law where the systems we build affect our organizational structure. As it compounds over time, this could create an upward spiral of momentum and positive output</li>\n</ol>\n</li>\n</ol>\n<p></p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://gov.gitcoin.co/uploads/db4391/original/2X/c/ce338a05b1bc27b5300846781326bb24a1f59954.png\" data-download-href=\"https://gov.gitcoin.co/uploads/db4391/ce338a05b1bc27b5300846781326bb24a1f59954\" title=\"\"><img src=\"https://gov.gitcoin.co/uploads/db4391/optimized/2X/c/ce338a05b1bc27b5300846781326bb24a1f59954_2_423x265.png\" alt=\"\" data-base62-sha1=\"tq8MqhvCXGyg2dGVPSFCRPopyWE\" width=\"423\" height=\"265\" role=\"presentation\" srcset=\"https://gov.gitcoin.co/uploads/db4391/optimized/2X/c/ce338a05b1bc27b5300846781326bb24a1f59954_2_423x265.png, https://gov.gitcoin.co/uploads/db4391/optimized/2X/c/ce338a05b1bc27b5300846781326bb24a1f59954_2_634x397.png 1.5x, https://gov.gitcoin.co/uploads/db4391/optimized/2X/c/ce338a05b1bc27b5300846781326bb24a1f59954_2_846x530.png 2x\" data-dominant-color=\"F7F4F3\"></a></div><p></p>\n<h2><a name=\"secondary-effects-3\" class=\"anchor\" href=\"https://gov.gitcoin.co#secondary-effects-3\"></a>Secondary Effects</h2>\n<p>But wait, thats not all. Each of these loops has their own secondary effects that further accelerate the ecosystem.</p>\n<ol>\n<li><strong>The Incentive alignment loop</strong> creates more tools, services, and other resources that enhance the value proposition of Gitcoin, and that indirectly will create more Allo GMV over time as it compounds.</li>\n<li><strong>The dogfood loop</strong> creates better products that enhance the value proposition of Gitcoin, and that indirectly will create more Allo GMV over time as it compounds.</li>\n</ol>\n<p></p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://gov.gitcoin.co/uploads/db4391/original/2X/b/be52effc6c4fe84ca6047fb43c519a0c2f7a2feb.jpeg\" data-download-href=\"https://gov.gitcoin.co/uploads/db4391/be52effc6c4fe84ca6047fb43c519a0c2f7a2feb\" title=\"\"><img src=\"https://gov.gitcoin.co/uploads/db4391/optimized/2X/b/be52effc6c4fe84ca6047fb43c519a0c2f7a2feb_2_624x424.jpeg\" alt=\"\" data-base62-sha1=\"r9GpxTiggCZsMtB51fyij4Lzg6v\" width=\"624\" height=\"424\" role=\"presentation\" srcset=\"https://gov.gitcoin.co/uploads/db4391/optimized/2X/b/be52effc6c4fe84ca6047fb43c519a0c2f7a2feb_2_624x424.jpeg, https://gov.gitcoin.co/uploads/db4391/optimized/2X/b/be52effc6c4fe84ca6047fb43c519a0c2f7a2feb_2_936x636.jpeg 1.5x, https://gov.gitcoin.co/uploads/db4391/optimized/2X/b/be52effc6c4fe84ca6047fb43c519a0c2f7a2feb_2_1248x848.jpeg 2x\" data-dominant-color=\"F6F6F6\"></a></div><p></p>\n<h2><a name=\"compounding-value-4\" class=\"anchor\" href=\"https://gov.gitcoin.co#compounding-value-4\"></a>Compounding Value</h2>\n<p>I think that these Citizens rounds will increase the value of Gitcoin ecosystem in a way that compounds over time. As the product suite grows more powerful and also as the ecosystem around it expands outwards, that will only attract more Citizens, which will in turn repeat and accelerate the cycle again.</p>\n<p></p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://gov.gitcoin.co/uploads/db4391/original/2X/e/ee0c5c982b1a588d75c31c3b8f5b38afcbd1a505.png\" data-download-href=\"https://gov.gitcoin.co/uploads/db4391/ee0c5c982b1a588d75c31c3b8f5b38afcbd1a505\" title=\"\"><img src=\"https://gov.gitcoin.co/uploads/db4391/optimized/2X/e/ee0c5c982b1a588d75c31c3b8f5b38afcbd1a505_2_624x379.png\" alt=\"\" data-base62-sha1=\"xXS7BXZF3mI8b5iluaZW6nohwEZ\" width=\"624\" height=\"379\" role=\"presentation\" srcset=\"https://gov.gitcoin.co/uploads/db4391/optimized/2X/e/ee0c5c982b1a588d75c31c3b8f5b38afcbd1a505_2_624x379.png, https://gov.gitcoin.co/uploads/db4391/optimized/2X/e/ee0c5c982b1a588d75c31c3b8f5b38afcbd1a505_2_936x568.png 1.5x, https://gov.gitcoin.co/uploads/db4391/optimized/2X/e/ee0c5c982b1a588d75c31c3b8f5b38afcbd1a505_2_1248x758.png 2x\" data-dominant-color=\"FEFEFE\"></a></div><p></p>\n<h1><a name=\"conclusion-5\" class=\"anchor\" href=\"https://gov.gitcoin.co#conclusion-5\"></a>Conclusion</h1>\n<p>In Summary: Gitcoin Citizens rounds contribute to Allo GMV through three primary “value loops.”</p>\n<ol>\n<li><strong>The GMV Creation Loop</strong> highlights direct GMV generation as these rounds are run on Allo.</li>\n<li><strong>The Incentive Alignment</strong> Loop aligns the wider Gitcoin community with the DAO’s mission by incentivizing contributions from various roles such as data analysts and educators, fostering value creation within Gitcoin.</li>\n<li><strong>The Dogfood Loop</strong> underscores the recursive benefit of using Gitcoin to develop Gitcoin itself, enhancing system empathy and impacting the organizational structure positively.</li>\n</ol>\n<p>Additionally, each loop has secondary effects that amplify Gitcoin’s value proposition and compound to increase Allo GMV over time.</p>\n            <p><small>2 posts - 2 participants</small></p>\n            <p><a href=\"https://gov.gitcoin.co/t/gitcoin-citizens-rounds-value-generation-opportunities/18727\">Read full topic</a></p>","link":"https://gov.gitcoin.co/t/gitcoin-citizens-rounds-value-generation-opportunities/18727","pubDate":"Fri, 03 May 2024 16:11:49 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"gov.gitcoin.co-topic-18727"},"source":{"@url":"https://gov.gitcoin.co/t/gitcoin-citizens-rounds-value-generation-opportunities/18727.rss","#text":"Gitcoin Citizens Rounds - Value Generation Opportunities"}},{"title":"GG20 Featured Collections Policy","dc:creator":"MathildaDV","category":"🌱 Gitcoin Grants","description":"<p>gm!</p>\n<p>ICYMI, collections are back! Anyone can now create a collection from their cart in Grants Stack. <a href=\"https://x.com/grantsstack/status/1782885164244173283\">Check out this post</a> for a full walkthrough if you haven’t already!</p>\n<p>The team is also featuring collections on the GS homepage for GG20. Right now, we will add all collections that are submitted to us <a href=\"https://forms.gle/Fx9pxfQWHKEjhw2J7\">through this form</a> unless we deem them as scam. Here’s the <a href=\"https://github.com/gitcoinco/grants-stack/pull/3407\">PR for getting the collections up.</a></p>\n<p>For future rounds, what do you think the policy should be on the collections we feature on the homepage? Feedback welcome!</p>\n            <p><small>13 posts - 7 participants</small></p>\n            <p><a href=\"https://gov.gitcoin.co/t/gg20-featured-collections-policy/18718\">Read full topic</a></p>","link":"https://gov.gitcoin.co/t/gg20-featured-collections-policy/18718","pubDate":"Thu, 02 May 2024 15:50:50 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"gov.gitcoin.co-topic-18718"},"source":{"@url":"https://gov.gitcoin.co/t/gg20-featured-collections-policy/18718.rss","#text":"GG20 Featured Collections Policy"}},{"title":"[Pre-Proposal] Grantee Guide - A Profiling Tool for Prospective Grant Applicants","dc:creator":"rohit","category":"📝 Citizen Grants","description":"<p>Thanks to <a class=\"mention\" href=\"https://gov.gitcoin.co/u/harryeastham\">@harryeastham</a> for seeding the concept and to <a class=\"mention\" href=\"https://gov.gitcoin.co/u/umarkhaneth\">@umarkhaneth</a> for reviewing.</p>\n<p>tl;dr The following ideation post proposes a prototype for a data app to inspire confidence in potential grantees on Gitcoin Grants (GG) and Independent Rounds by demonstrating other successful funding journeys on Grants Stack. This post kick-starts an 8-week timeline to accelerate from idea to app using Citizens Innovate by supporting and funding builders with the most robust proposals.</p>\n<p>Timeline:</p>\n<ul>\n<li><strong>May 2 - May 16th:</strong> The post will be open for feedback on the gov forum until May 16th, along with a <a href=\"https://forms.gle/cVZ6voLCmFxY8q3q7\">sign-up form</a> for Citizens interested in opting for a direct grant to build the prototype</li>\n<li><strong>The week of May 20th:</strong> A debrief call and 1:1 sessions the following week with Citizens interested in submitting their proposal for funds to build the prototype</li>\n<li><strong>The week of May 27th:</strong> The Grant Council may approve one or more GCPs to implement the functionality</li>\n<li><strong>June 3rd to June 28th:</strong> 4-week timeline to implement the prototype with interim demos as well as support and mentorship from Gitcoin team members with context on the problem</li>\n</ul>\n<h3><a name=\"hypothesis-1\" class=\"anchor\" href=\"https://gov.gitcoin.co#hypothesis-1\"></a>Hypothesis</h3>\n<blockquote>\n<p>Prospective Gitcoin grantees are more likely to apply for a grant on Grants Stack when they see the journey of similar grantees in their niche who have successfully raised funds on Gitcoin Grants and Independent Rounds.</p>\n</blockquote>\n<h3><a name=\"validation-2\" class=\"anchor\" href=\"https://gov.gitcoin.co#validation-2\"></a>Validation</h3>\n<p>We propose a self-service data app prototype designed to test this hypothesis for potential applicants. This prototype will allow users to input a summary of their project and retrieve information about similar grantees who have previously participated in Gitcoin grants. The prototype will provide answers to questions like:</p>\n<ul>\n<li>Which projects similar to ours have participated on Gitcoin in the past?</li>\n<li>How much funding have these projects raised over time?</li>\n<li>How much funding can we expect to receive for our project?</li>\n<li>Which funding rounds are we eligible to apply for?</li>\n<li>What attributes are key to increasing the chances of being accepted in these rounds?</li>\n<li>What else?</li>\n</ul>\n<h3><a name=\"technical-considerations-3\" class=\"anchor\" href=\"https://gov.gitcoin.co#technical-considerations-3\"></a>Technical Considerations</h3>\n<p>These are for reference only. Interested builders are encouraged to research and opt into most appropriate approaches to address the problem.</p>\n<p><em><strong>Where can I find data about past grantees?</strong></em></p>\n<p>Databases such as <a href=\"https://regendata.xyz/\">RegenData</a> and <a href=\"https://grantsdataportal.xyz/\">Gitcoin Grants Data Portal</a> provide valuable information that can be leveraged to support prospective grantees. These databases can retrieve:</p>\n<ul>\n<li>A list of past grantees whose work is similar to the user’s project.</li>\n<li>The trend of their participation in Gitcoin, including the number of contributors and the amount raised over time.</li>\n</ul>\n<p><em><strong>How do I find grantees similar to the applicant?</strong></em></p>\n<p>To facilitate this, clustering algorithms can be employed to match a given project description with similar grantees. For an example of how feature extraction, dimensionality reduction, and similarity measurement are implemented, refer to the <a href=\"https://gp-octant.streamlit.app/\">GrantsScope App for GreenPill x Octant round</a>. Click <a href=\"https://github.com/rohitmalekar/gp-octant\">here</a> for the GitHub Repo. Advanced approaches involving Retrieval-Augmented Generation (RAG) or fine-tuning LLMs might also be relevant here.</p>\n<p><em><strong>How do I estimate how much funding a prospective grantee can expect?</strong></em></p>\n<p>The <a href=\"https://x.com/RohitMalekar/status/1773102167890559420\">historical curves in the power law distribution</a> of the matching pool could provide a suggestive range of funds that could be raised in a QF round. This estimation requires assumptions for percentile rank and the size of the matching pool.</p>\n<h3><a name=\"limitations-and-risks-4\" class=\"anchor\" href=\"https://gov.gitcoin.co#limitations-and-risks-4\"></a>Limitations and Risks</h3>\n<ul>\n<li>\n<p><strong>User Assumptions and Expectations:</strong> The tool relies on user inputs regarding their assumptions about percentile rank and matching pool size to estimate potential funding. Incorrect assumptions or a lack of understanding about these parameters could lead to unrealistic expectations about the funding amount. Educating users on how to make informed assumptions is crucial.</p>\n</li>\n<li>\n<p><strong>Algorithm Bias and Fairness:</strong> The algorithms used may inadvertently favor certain types of projects or grantees based on the data they have been trained on. This could lead to a lack of diversity in the recommended or seen as successful projects, potentially reinforcing existing biases in funding allocation.</p>\n</li>\n<li>\n<p><strong>Complexity of Clustering Algorithms:</strong> Clustering algorithms are central to matching project descriptions with similar past grantees. However, these algorithms’ complexity could lead to implementation and maintenance challenges. There’s also the risk of overfitting, where the model is too closely fitted to the historical data, potentially making it less effective in predicting or matching new, unseen projects.</p>\n</li>\n</ul>\n<h3><a name=\"next-steps-5\" class=\"anchor\" href=\"https://gov.gitcoin.co#next-steps-5\"></a>Next Steps</h3>\n<ul>\n<li>Share your feedback here on the hypothesis and validation approach before May 16th</li>\n<li>Sign up <a href=\"https://forms.gle/cVZ6voLCmFxY8q3q7\">here</a> if you want to opt in for a deeper dive to submit a proposal to build this prototype or to shadow along the discussions and demos.</li>\n</ul>\n            <p><small>7 posts - 5 participants</small></p>\n            <p><a href=\"https://gov.gitcoin.co/t/pre-proposal-grantee-guide-a-profiling-tool-for-prospective-grant-applicants/18716\">Read full topic</a></p>","link":"https://gov.gitcoin.co/t/pre-proposal-grantee-guide-a-profiling-tool-for-prospective-grant-applicants/18716","pubDate":"Thu, 02 May 2024 14:50:09 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"gov.gitcoin.co-topic-18716"},"source":{"@url":"https://gov.gitcoin.co/t/pre-proposal-grantee-guide-a-profiling-tool-for-prospective-grant-applicants/18716.rss","#text":"[Pre-Proposal] Grantee Guide - A Profiling Tool for Prospective Grant Applicants"}},{"title":"[Nerd post] Updates to Cluster Mapping / Matching!","dc:creator":"Joel_m","category":"🌱 Gitcoin Grants","description":"<p>Hi all,</p>\n<p>I want to briefly share an update to the algorithm we use to calculate QF results. This is a minor tweak, but I like sharing this type of thing with the community because transparency/ community consent for the algorithms we run is is good. I also always love feedback, positive or negative.</p>\n<p>Before I go further, <a href=\"https://github.com/Jmiller4/qf-variants\" rel=\"noopener nofollow ugc\">you can find the code here.</a> The function COCM (with the default inputs) is what I’ll be explaining in this post.</p>\n<p>COCM (Connection Oriented Cluster Match) works in three steps.</p>\n<ol>\n<li>First, it takes in data about “clusters”, which are just different (possibly overlapping) groups of users. You could generate cluster data from POAPs, twitter follower lists, or even the donation records (where if someone donates to project X, they’re put in project X’s cluster). Users can also have “weights” in a cluster, denoting how strongly they belong to it. For example, you could use github repositories as clusters, where if I make <em>n</em> pull requests to that repository, I have a weight of <em>n</em> in that repository’s cluster. In general, round operators can choose what cluster data to use (or they can not use COCM at all, of course).</li>\n<li>COCM calculates “similarity scores” between each user and each cluster.</li>\n<li>Finally, COCM runs QF, but then attenuates each project’s funding if many of its donors are similar according to the scores calculated in step 2.</li>\n</ol>\n<p>Step 2 is what we’ll focus on here. First, here’s how we used to calculate similarity scores. Lets call the user U and call the cluster X. If a U is in X, their similarity score to X is 1. Otherwise, we look at all the other clusters that U is in, and look at all the people in all of those clusters. Then we ask, how many of <em>those</em> people are in X? We use that fraction as the similarity score.</p>\n<p>The issue with this method is that we don’t use any of that juicy weight information I mentioned above. Let’s say user U is in cluster Y, and everybody else in Y is also in X, with a really high weight. If we gave all those people a really low weight instead, it wouldn’t change the similarity score between U and X. But shouldn’t it?</p>\n<p>So our new way of calculating similarity scores essentially does exactly that. You can think of it as an adaptation of the old method but with a weighted average, instead of an unweighted average.</p>\n<p>You can also think of the new method as an analysis of a <a href=\"https://en.wikipedia.org/wiki/Markov_chain\" rel=\"noopener nofollow ugc\">Markov process</a>, like what Google uses in their PageRank algorithm. We can think of a graph of all users and all clusters, where directed edges from users to clusters (and vice versa) are weighted according to that user’s weight in that cluster, and normalized so that all outgoing edges sum to 1 (thus forming a probability distribution). Then, we can start at user U’s node and randomly jump to a cluster that U is in according to the probabilities on their outgoing edges. Then we can randomly jump from that cluster to a user, with probabilities proportional to each user’s weight in that cluster. Then we can jump to another cluster from whatever user we wind up at.</p>\n<p>Now, here’s a question: what’s the probability that after all of that jumping, we wound up at cluster X? If user U is closely connected to X via many intermediate clusters and donors with high weights, the probability will be high. If U isn’t closely connected to X, the probability will be low. So this probability is precisely what we use for the similarity score between U and X.</p>\n<p>This new method of calculating similarity scores really improved the sybil resistance of the algorithm. All of the charts in <a class=\"mention\" href=\"https://gov.gitcoin.co/u/umarkhaneth\">@umarkhaneth</a> 's <a href=\"https://gov.gitcoin.co/t/our-sybil-resistance-strategy-for-gg20/18524/1\">recent post</a> were calculated with this new version of COCM.<br>\n.<br>\nThat’s all for now. Please let me know if you have any questions or feedback!</p>\n            <p><small>4 posts - 4 participants</small></p>\n            <p><a href=\"https://gov.gitcoin.co/t/nerd-post-updates-to-cluster-mapping-matching/18705\">Read full topic</a></p>","link":"https://gov.gitcoin.co/t/nerd-post-updates-to-cluster-mapping-matching/18705","pubDate":"Tue, 30 Apr 2024 21:31:17 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"gov.gitcoin.co-topic-18705"},"source":{"@url":"https://gov.gitcoin.co/t/nerd-post-updates-to-cluster-mapping-matching/18705.rss","#text":"[Nerd post] Updates to Cluster Mapping / Matching!"}},{"title":"Another Passing of the Torch 🔥","dc:creator":"kyle","category":"🤖 DAO Governance and Vision","description":"<p>Hey all - I wanted to share details for me personally as part of our <a href=\"https://gov.gitcoin.co/t/passing-the-torch/10971\">passing the torch</a> tradition, and also what this means for the Gitcoin ecosystem at large. The tl;dr is that I will be stepping out of all official interactions I have with Gitcoin and will be taking over as co-lead of the Passport Business Unit as we work to spin out the business unit. Read on for more details and sappy stories with lots of appreciation!</p>\n<p><strong>Gitcoin entering its endgame</strong></p>\n<p>As I posted a couple months ago, Gitcoin is entering its endgame, and I want to make sure the <a href=\"https://gov.gitcoin.co/t/a-dao-has-no-ceo/9852\">DAO doesn’t have a CEO</a>. As a result, much of the soft power that was accruing to me needed to be diffused in the new BUs, and Ecosystem Collective. At the same time, there are very real requirements that the Gitcoin Foundation both needs to meet, but then also advances for the DAO. <a class=\"mention\" href=\"https://gov.gitcoin.co/u/deltajuliet\">@deltajuliet</a> will be taking over as interim Executive Director (until such time a token vote can ratify the new Exec Director), and she will lead the Gitcoin Foundation. I will let her chime in with more on the details of her role shift, and the timing for an election/formalization of the new ED.</p>\n<p><strong>Passport Future</strong></p>\n<p>I have worked with <a class=\"mention\" href=\"https://gov.gitcoin.co/u/owocki\">@owocki</a> for years to build out &amp; design a proof of personhood approach that was pluralistic by default. He believes in the power that anti-sybil technology creates, and I believe in the power that non-doxxing reputation can bring to the world. On this quest, we wanted to ensure any solution we built protected users’ privacy while enabling them to prove they are unique humans. We launched Passport years ago after many hours were spent combing through usage data to prevent sybil attacks on our Grants Program.</p>\n<p>Today, Passport has evolved a bunch, and Passport.xyz is live (more updates coming soon!). I am excited to narrow my focus to this opportunity where Passport enables web3 citizens to build reputation and prove they are unique humans - combating the sybils and bad actors. I have internalized the need for Passport to decrease user friction, and for us to lead with more data analysis - your voices have been heard and we will keep improving this. Co-leading the Passport team is an honor and I am elated they will have me back (again, and again!).</p>\n<p><strong>The road behind and path ahead</strong></p>\n<p>I joined Gitcoin when we were a small team in Consensys. <a class=\"mention\" href=\"https://gov.gitcoin.co/u/owocki\">@owocki</a>, Joe Lubin (and <a class=\"mention\" href=\"https://gov.gitcoin.co/u/kriak.eth\">@kriak.eth</a>) afforded me the opportunity to grow the Gitcoin team, and work to support our spinout and success. Three years later, I am immensely grateful and proud of what we have accomplished:</p>\n<ul>\n<li>\n<p>Spun out of Consensys</p>\n</li>\n<li>\n<p>Fund raised to capitalize the organization that would launch the DAO and Protocol</p>\n</li>\n<li>\n<p>Launch $GTC and seed the DAO with a compelling purpose</p>\n</li>\n<li>\n<p>Build the decentralized Gitcoin DAO with legal rails for longevity</p>\n</li>\n<li>\n<p>Complete the treasury diversification to ensure stability during the bear</p>\n</li>\n<li>\n<p>Scaling the protocol and GMV (this is where we are now!)</p>\n</li>\n</ul>\n<p>My cup is full, and I am so grateful to have had the opportunity to work with so many amazing leaders and team members, lots of whom are now off and leading other organizations too! The alumni network of Gitcoin is stronger than most. So many great people have contributed to Gitcoin and have helped grow this team, the magic of the mission, and this community have made Gitcoin a household name in Web3.</p>\n<p>I plan to stay connected and participate in the governance of Gitcoin. I also plan to advocate for Gitcoin’s continued decentralization (through the work the Ecosystem Collective is doing) and expansion of GTC utility.</p>\n<p>This community is one of the best in the space, and is generally interested in changing the world for the better. I will always be trying to green pill degens and turn them into regens with moonshot bots, comic books and trading card games. Thanks for the opportunity to make a difference.</p>\n<p><img src=\"https://gov.gitcoin.co/uploads/db4391/original/2X/2/2c2c20cfea6d46c5eb0deddb7177feaa0d67da57.png\" alt=\"image\" data-base62-sha1=\"6iLyhfd50jn6MBA1oE9j00XlMxh\" width=\"262\" height=\"279\"></p>\n            <p><small>9 posts - 8 participants</small></p>\n            <p><a href=\"https://gov.gitcoin.co/t/another-passing-of-the-torch/18704\">Read full topic</a></p>","link":"https://gov.gitcoin.co/t/another-passing-of-the-torch/18704","pubDate":"Tue, 30 Apr 2024 17:41:24 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"gov.gitcoin.co-topic-18704"},"source":{"@url":"https://gov.gitcoin.co/t/another-passing-of-the-torch/18704.rss","#text":"Another Passing of the Torch 🔥"}},{"title":"Individual Contribution Logs - Contribution verification, reputation building, improved funding decisions, SSI adoption and more!","dc:creator":"lovegrovegeorge","category":"🧙 🧙‍♀️ Ideas and Open Discussion","description":"<p></p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://gov.gitcoin.co/uploads/db4391/original/2X/4/4ae7855c9d619a070980fefa279a788f32420958.jpeg\" data-download-href=\"https://gov.gitcoin.co/uploads/db4391/4ae7855c9d619a070980fefa279a788f32420958\" title=\"contribution-logs-header\"><img src=\"https://gov.gitcoin.co/uploads/db4391/optimized/2X/4/4ae7855c9d619a070980fefa279a788f32420958_2_690x230.jpeg\" alt=\"contribution-logs-header\" data-base62-sha1=\"aGDmzMUg4zMa46dK0AnSzswRsOQ\" width=\"690\" height=\"230\" srcset=\"https://gov.gitcoin.co/uploads/db4391/optimized/2X/4/4ae7855c9d619a070980fefa279a788f32420958_2_690x230.jpeg, https://gov.gitcoin.co/uploads/db4391/optimized/2X/4/4ae7855c9d619a070980fefa279a788f32420958_2_1035x345.jpeg 1.5x, https://gov.gitcoin.co/uploads/db4391/optimized/2X/4/4ae7855c9d619a070980fefa279a788f32420958_2_1380x460.jpeg 2x\" data-dominant-color=\"667FA5\"></a></div><p></p>\n<p>Individual contribution logs represent a record of an individuals contribution efforts.</p>\n<p>Some Web3 ecosystems use a process for verifying contribution efforts within their own grants process. This verification process can help with protecting the ecosystems treasury assets by checking that the funding is being used as intended.</p>\n<p>Contribution efforts could be grouped together by using a milestone approach or by using time intervals such as monthly. Alternatively contribution efforts could also be recorded by each individual in monthly time intervals.</p>\n<p>After looking at the problems and opportunities for making group based contribution logs as well as individual contribution logs, we identified that individual contribution logs were the most promising approach worth considering. As well as verifying contribution efforts the individual contribution log approach also had a number of other use cases that could be highly valuable for contributors and Web3 ecosystems.</p>\n<p></p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://gov.gitcoin.co/uploads/db4391/original/2X/1/1d8d816900c0f272e1bd7c9dfce2969a7c72e253.png\" data-download-href=\"https://gov.gitcoin.co/uploads/db4391/1d8d816900c0f272e1bd7c9dfce2969a7c72e253\" title=\"individual-monthly-contribution-logs\"><img src=\"https://gov.gitcoin.co/uploads/db4391/optimized/2X/1/1d8d816900c0f272e1bd7c9dfce2969a7c72e253_2_498x375.png\" alt=\"individual-monthly-contribution-logs\" data-base62-sha1=\"4dr1hWqT0Eo2wPBGKSuCMDq6t5p\" width=\"498\" height=\"375\" srcset=\"https://gov.gitcoin.co/uploads/db4391/optimized/2X/1/1d8d816900c0f272e1bd7c9dfce2969a7c72e253_2_498x375.png, https://gov.gitcoin.co/uploads/db4391/optimized/2X/1/1d8d816900c0f272e1bd7c9dfce2969a7c72e253_2_747x562.png 1.5x, https://gov.gitcoin.co/uploads/db4391/optimized/2X/1/1d8d816900c0f272e1bd7c9dfce2969a7c72e253_2_996x750.png 2x\" data-dominant-color=\"DDDAE3\"></a></div><p></p>\n<br>\n<p><strong>Advantages of individual contribution logs</strong></p>\n<ul>\n<li><strong>Improved contribution verification</strong> - It is more difficult to hide poor contribution performance if efforts are recorded individually and at the end of every month. Individual contribution logs make it easier to verify which contributors have been making sufficient contribution efforts.</li>\n<li><strong>Improved decision making</strong> - If contribution logs are recorded monthly and are focused on individuals contribution efforts the measurability of these logs can be much higher than the group based approaches. This makes it easier for voters to identify the best and worst performers and also can make it easier for them to compare contributors across the ecosystem.</li>\n<li><strong>Retaining top performers</strong> - Some ideas and teams won’t produce the intended outcomes. Individual contribution logs can help with identifying the top performers in different teams that might have not generated much impact. Individual contribution logs could help with making it easier to for voters to see what actually happened.</li>\n<li><strong>Higher self awareness &amp; accountability</strong> - Contributors would be able to more easily review the contribution efforts of other people in the ecosystem and use that information to become more aware of how performant each contributor is. This information can help contributors with becoming more accountable for achieving a similar or higher level of performance.</li>\n<li><strong>Empowers individual contributors</strong> - Individual contribution logs can help to empower contributors by making it easier for them to demonstrate their competencies and performance. Their contribution logs can help them with building a reputation in the ecosystem and wider industry that can make it easier for them to receive future funding and fair compensation for their skill level.</li>\n<li><strong>Removed intermediaries</strong> - Individual contribution logs can help with reducing the influence of certain individuals and project owners from determining someone’s compensation in group based working environments. Contribution logs can help with making it easier for someone to demonstrate themselves what their value is within group working environments.</li>\n<li><strong>Flexible information usage</strong> - More detail about the ideas that are being executed can be highlighted in someones contribution log. These logs could include which milestone would be relevant to the contribution efforts. This added context means that a collection of different peoples individual contribution logs could help with creating project based information such as the total contribution efforts towards an idea in the last month or the amount of contribution efforts that have been made towards a certain project milestone. More granularity and detail about each persons contributions efforts means that it can become easier to group and layer this information into different formats that could be more useful and insightful to the viewer.</li>\n</ul>\n<br>\n<p><strong>Opportunities for individual contribution logs</strong></p>\n<ul>\n<li><strong>Open source contribution data</strong> - The more that individual contribution logs are used over time the more valuable the information becomes. Monthly recordings of individual contribution efforts are much more measurable than the alternative approaches. Individual contribution logs can be used for making historical comparisons as the ecosystem evolves and grows over time.</li>\n<li><strong>Self sovereign identity adoption</strong> - Individual contribution logs can be tied to a persons identity. Contribution logs could be a powerful use case for increasing the adoption of self sovereign identity solutions.</li>\n<li><strong>Trust based networks</strong> - Verifiable contribution data could be used to create some form of trust based network that people use to prove their competency and reliability. Communities could start using this information as a form of identification and a way to trust certain individuals due to the reputation they’ve built and the common connections they share.</li>\n</ul>\n<br>\n<p><strong>Resources</strong></p>\n<p>Read our full analysis, or watch our video summaries, that cover contribution verification and contribution logs:</p>\n<ul>\n<li><a href=\"https://disbursement.treasuries.co/contributions/contribution-verification\" rel=\"noopener nofollow ugc\">Contribution verification</a></li>\n<li><a href=\"https://disbursement.treasuries.co/approaches/contribution-verification-approaches\" rel=\"noopener nofollow ugc\">Contribution verification approaches</a></li>\n</ul>\n<br>\n<p><strong>Experimentation in Gitcoin</strong></p>\n<p>Individual contribution logs could be integrated into the existing grants process or be used by individuals in the ecosystem as an evidence based way to start building up their own reputation. Idea funding and contributor funding could both experiment with individual contribution logs.</p>\n<br> \n<p><strong>Further investigation</strong></p>\n<p>These is an opportunity to create more tooling that could enable individual contributors to easily record and present their contribution efforts. Contribution logs could become increasingly useful and reliable for contributors to build their reputation in the ecosystem and for voters when making funding decisions.</p>\n<p>In the comings months the Web3 Association is going to look at what tooling already exists that could be used and then explore what new tools could be created to make it easier to record and present contribution efforts. We’re especially interested in code contributions which is highly relevant to our <a href=\"https://docs.contributors.org/proposal/open-source-contributors\" rel=\"noopener nofollow ugc\">open source contributor proposal</a> that has been recently shared.</p>\n<br>\n<p><strong>Community discussion</strong></p>\n<p>Share any feedback and thoughts you have around the topic of contribution verification and the different approaches we’ve explored in our analysis. Eager to hear any different perspectives or other approaches and analysis we might be missing that could improve our own understanding and improve our analysis further!</p>\n            <p><small>1 post - 1 participant</small></p>\n            <p><a href=\"https://gov.gitcoin.co/t/individual-contribution-logs-contribution-verification-reputation-building-improved-funding-decisions-ssi-adoption-and-more/18694\">Read full topic</a></p>","link":"https://gov.gitcoin.co/t/individual-contribution-logs-contribution-verification-reputation-building-improved-funding-decisions-ssi-adoption-and-more/18694","pubDate":"Mon, 29 Apr 2024 09:26:02 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"gov.gitcoin.co-topic-18694"},"source":{"@url":"https://gov.gitcoin.co/t/individual-contribution-logs-contribution-verification-reputation-building-improved-funding-decisions-ssi-adoption-and-more/18694.rss","#text":"Individual Contribution Logs - Contribution verification, reputation building, improved funding decisions, SSI adoption and more!"}},{"title":"[Discussion] Avara Labs and Gitcoin","dc:creator":"Pfed-prog","category":"🧙 🧙‍♀️ Ideas and Open Discussion","description":"<p>Gm, I have had so far very unpleasant experiences with Aave and formerly Lenster teams from Avara Labs. Which should not come as a surpise because I am being extraordinarily vocal on Social Media.</p>\n<p>The founder of formerly Lenster questioned the connection between the Lens and Aave. So here is a new article from Techcrunch.</p>\n<aside class=\"onebox allowlistedgeneric\" data-onebox-src=\"https://techcrunch.com/2023/11/16/aave-companies-rebrands-to-avara-and-acquires-crypto-wallet-family-to-expand-its-web3-reach/\">\n  <header class=\"source\">\n      <img src=\"https://gov.gitcoin.co/uploads/db4391/original/2X/9/92d7cafaaa27cbdf87372f2e15dfffbafd6ba058.png\" class=\"site-icon\" data-dominant-color=\"56CE82\" width=\"32\" height=\"32\">\n\n      <a href=\"https://techcrunch.com/2023/11/16/aave-companies-rebrands-to-avara-and-acquires-crypto-wallet-family-to-expand-its-web3-reach/\" target=\"_blank\" rel=\"noopener nofollow ugc\" title=\"05:00PM - 16 November 2023\">TechCrunch – 16 Nov 23</a>\n  </header>\n\n  <article class=\"onebox-body\">\n    <div class=\"aspect-image\" style=\"--aspect-ratio:690/363;\"><img src=\"https://gov.gitcoin.co/uploads/db4391/optimized/2X/4/4d83fb1043a96c5d40350862d71de102b5fa633f_2_690x363.png\" class=\"thumbnail\" data-dominant-color=\"322A20\" width=\"690\" height=\"363\"></div>\n\n<h3><a href=\"https://techcrunch.com/2023/11/16/aave-companies-rebrands-to-avara-and-acquires-crypto-wallet-family-to-expand-its-web3-reach/\" target=\"_blank\" rel=\"noopener nofollow ugc\">Aave Companies rebrands to Avara and acquires crypto wallet Family to expand...</a></h3>\n\n  <p>Web3-focused software technology company Aave Companies is rebranding to Avara, its founder Stani Kulechov told TechCrunch exclusively. The crypto parent</p>\n\n  <p>\n    <span class=\"label1\">Est. reading time: 2 minutes</span>\n  </p>\n\n  </article>\n\n  <div class=\"onebox-metadata\">\n    \n    \n  </div>\n\n  <div style=\"clear: both\"></div>\n</aside>\n\n<p>And a screenshot:</p>\n<p></p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://gov.gitcoin.co/uploads/db4391/original/2X/3/37863935e5973a7f8c064f4d6c35a7d3c8d77139.jpeg\" data-download-href=\"https://gov.gitcoin.co/uploads/db4391/37863935e5973a7f8c064f4d6c35a7d3c8d77139\" title=\"image\"><img src=\"https://gov.gitcoin.co/uploads/db4391/optimized/2X/3/37863935e5973a7f8c064f4d6c35a7d3c8d77139_2_690x431.jpeg\" alt=\"image\" data-base62-sha1=\"7VbPFoYPD0SZIA1qDg33QoL81x7\" width=\"690\" height=\"431\" srcset=\"https://gov.gitcoin.co/uploads/db4391/optimized/2X/3/37863935e5973a7f8c064f4d6c35a7d3c8d77139_2_690x431.jpeg, https://gov.gitcoin.co/uploads/db4391/optimized/2X/3/37863935e5973a7f8c064f4d6c35a7d3c8d77139_2_1035x646.jpeg 1.5x, https://gov.gitcoin.co/uploads/db4391/original/2X/3/37863935e5973a7f8c064f4d6c35a7d3c8d77139.jpeg 2x\" data-dominant-color=\"D3D3D1\"></a></div><p></p>\n<p>All I really want to know why Lens, being under the control of the same/similar teams is still applying and getting accepted as a grantee.</p>\n<p>Full Twitter/X thread: <a href=\"https://x.com/pfedprog/status/1784184469357764777\" rel=\"noopener nofollow ugc\">https://x.com/pfedprog/status/1784184469357764777</a></p>\n            <p><small>22 posts - 2 participants</small></p>\n            <p><a href=\"https://gov.gitcoin.co/t/discussion-avara-labs-and-gitcoin/18689\">Read full topic</a></p>","link":"https://gov.gitcoin.co/t/discussion-avara-labs-and-gitcoin/18689","pubDate":"Sat, 27 Apr 2024 15:12:41 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"gov.gitcoin.co-topic-18689"},"source":{"@url":"https://gov.gitcoin.co/t/discussion-avara-labs-and-gitcoin/18689.rss","#text":"[Discussion] Avara Labs and Gitcoin"}}]}}}