{"rss":{"@version":"2.0","@xmlns:discourse":"http://www.discourse.org/","@xmlns:atom":"http://www.w3.org/2005/Atom","@xmlns:dc":"http://purl.org/dc/elements/1.1/","channel":{"title":"Lido Governance - Latest topics","link":"https://research.lido.fi/latest","description":"Latest topics","lastBuildDate":"Thu, 22 Aug 2024 14:32:12 +0000","atom:link":{"@href":"https://research.lido.fi/latest.rss","@rel":"self","@type":"application/rss+xml"},"item":[{"title":"Organize the Lido Alliance Program as a Lido-DAO-Adjacent BORG","dc:creator":"lex-node","category":"Proposals","description":"<h2><a name=\"p-17171-preamble-1\" class=\"anchor\" href=\"https://research.lido.fi#p-17171-preamble-1\"></a>Preamble</h2>\n<p>Title: Organize the Lido Alliance Program as a Lido-DAO-Adjacent BORG</p>\n<p>Author(s): <span class=\"mention\">@lex_node</span> / Gabriel Shapiro (for MetaLeX Pro LLP)</p>\n<h2><a name=\"p-17171-summary-2\" class=\"anchor\" href=\"https://research.lido.fi#p-17171-summary-2\"></a>Summary</h2>\n<ul>\n<li>\n<p>Following the approval of the <a href=\"https://snapshot.org/#/lido-snapshot.eth/proposal/0xd70197783e2a5ce8d32ab2021ee08c21d12fc3e7f7e942b8cdd6aa3f6edb029a\" rel=\"noopener nofollow ugc\">Lido Alliance Proposal</a> in May, Lido DAO contributors have worked with <a href=\"https://www.metalex.tech/\" rel=\"noopener nofollow ugc\">MetaLeX</a> to propose the creation of a LIDO Alliance workstream, including through the incorporation of a Lido-DAO-adjacent cybernetic organization (BORG) to “legally wrap” the “Alliance workgroup” and the related assets and activities.</p>\n</li>\n<li>\n<p>The Lido Alliance BORG Foundation consists of a memberless, beneficiary-less Cayman foundation whose purposes are restricted to furthering the Alliance Program, including submitting or facilitating the proposal of worthwhile Lido DAO Allies to Lido DAO and owning and holding assets contributed by such Lido DAO Allies in onchain multisigs.</p>\n</li>\n<li>\n<p><a href=\"https://github.com/MetaLex-Tech/publicDocs/tree/main/Lido-Alliance-BORG/coreDocs/coreDocs-08-20-24/pdfs\" rel=\"noopener nofollow ugc\">The Bylaws and other legal docs</a> of the Lido Alliance BORG Foundation provide for legal checks-and-balances between the entity and Lido DAO (explained below).</p>\n</li>\n<li>\n<p>To complement the legal check-and-balance mechanisms expressed in the Lido Alliance BORG’s legal documents, the multisigs for holding the Lido Alliance BORG’s operational budget will use <a>EasyTrack</a>, which gives Lido DAO an onchain veto over spending of these assets. The assets contributed by Lido Allies will be subject to legal checks-and-balances with the DAO and held in a transparent 4/7 multisigs staffed by the BORG Personnel. The BORG personnel hope to eventually transition these multisigs to MetaLeX’s forthcoming technology stack to provide a more full-featured set of onchain checks-and-balances mirroring the prescribed legal arrangements.</p>\n</li>\n<li>\n<p>This proposal seeks to inform Lido DAO and the broader Lido community of the details of the Lido Alliance BORG and to obtain a signal of the Lido DAO’s support for the structure through an approval of the proposal. If the proposal is approved, the Lido Alliance BORG will be incorporated as described herein.</p>\n</li>\n</ul>\n<h2><a name=\"p-17171-motivation-3\" class=\"anchor\" href=\"https://research.lido.fi#p-17171-motivation-3\"></a>Motivation</h2>\n<p>The Cybernetic Organization (CybOrg or ‘BORG’) is a new type of web3 legal structure–a traditional legal entity that uses autonomous technologies (such as smart contracts) to augment the entity’s governance and activities. Just as sci-fi cyborgs (‘cybernetic organisms’) augment humans (natural persons) with robotic organs and limbs or microchip or optics implants, BORGs augment state-chartered entities (legal persons) with autonomous software such as smart contracts. Crucially, legal entities that are BORGs do not merely use autonomous technologies as an incidental part of their business–instead, much like a human might have a robotic prosthesis surgically attached to his shoulder, BORGs are legally governed by autonomous technologies through tech-specific rules implanted in their charter documents. DAO-adjacent BORGs, like the proposed Lido Alliance BORG, require that all or most of the BORG’s assets be held in multisig smart contracts empowering the relevant DAO to directly provide feedback to, and exert certain checks and balances against potential misconduct by, the BORG’s human managers.</p>\n<p>The general reasons for using a DAO-adjacent BORG to ‘wrap’ DAO-related multisigs, committees, working groups and similar structures are summarized in Delphi Labs’ seminal article <a href=\"https://delphilabs.medium.com/assimilating-the-borg-a-new-cryptolegal-framework-for-dao-adjacent-entities-569e54a43f83\" rel=\"noopener nofollow ugc\">Assimilating the BORG</a>.</p>\n<p>More specifically, in the case of the Alliance working group:</p>\n<ul>\n<li>\n<p>There may be a need or desire to enter into legal agreements with Lido Allies (or related entities or individuals) in order to express and legally enforce each Lido Ally’s commitments to the Lido community and expectations of support from the Lido community. A legal entity is needed to serve as counterparty to such agreements as Lido DAO cannot enter in agreements itself as it lacks legal personality.</p>\n</li>\n<li>\n<p>The Alliance working group may need to receive or hold tokens or certain rights in future tokens from pre-token Lido Allies—a legal entity may be needed to own/hold such rights.</p>\n</li>\n<li>\n<p>For regulatory reasons, Lido DAO should avoid looking like an on chain ‘venture fund’ or ‘commodities pool’ that holds diversified assets, and thus such assets should be owned by a separate legal entity. (See e.g. <a href=\"https://www.sec.gov/files/litigation/investreport/34-81207.pdf\" rel=\"noopener nofollow ugc\">The SEC DAO Report</a>).</p>\n</li>\n<li>\n<p>If unincorporated, the Alliance working group runs a risk of receiving involuntary legal classifications, which may carry personal liability for the working group members.</p>\n</li>\n<li>\n<p>If unincorporated, the Alliance working group may lack continuity as a result of personnel turnover. A legal entity enables the working group to remain a single cohesive legal person despite personnel changes over time.</p>\n</li>\n<li>\n<p>A legal entity can express all the rules and values that Alliance working group members should exert, and can make these rules and values transparent to Lido DAO.</p>\n</li>\n<li>\n<p>A legal entity can give the Lido community explicit legally facilitated powers to influence the Alliance working group and program in various ways, such as by requiring Lido DAO approval for new Lido Allies and enabling Lido DAO to initiate removal of directors and co-approve new directors.</p>\n</li>\n</ul>\n<p>The formation of the Lido Alliance BORG also serves the approved GOOSE proposals <a href=\"https://research.lido.fi/t/the-guided-open-objective-setting-exercise-goose-proposal-a-genesis-step-to-jump-start-a-dao-wide-goal-setting-exercise-and-cadence/5355\">here</a> and <a href=\"https://research.lido.fi/t/hasus-goose-submission-proposed-goals-for-lido-dao-to-consider/5590\">here</a> as updated with the approved <a href=\"https://research.lido.fi/t/regoose-updated-goals-for-lido-in-the-light-of-mvi-and-restaking/7462\">ReGOOSE proposal</a> goals as follows:</p>\n<ul>\n<li>\n<p>By defining the “Community” served by the BORG broadly, to include not only Lido DAO but also stETH holders and node operators.</p>\n</li>\n<li>\n<p>By emphasizing pro-decentralization/autonomy values in the “Principles” BORG personnel must use for decision-making.</p>\n</li>\n<li>\n<p>By fostering the creation of alliances with other key players in the ETH ecosystem for a broader use of Lido staking systems.</p>\n</li>\n<li>\n<p>By including a “Guardian” role on the BORG multisig that is focused on security.</p>\n</li>\n</ul>\n<h2><a name=\"p-17171-implementation-4\" class=\"anchor\" href=\"https://research.lido.fi#p-17171-implementation-4\"></a>Implementation</h2>\n<ul>\n<li>\n<p>The Lido Alliance BORG is an exempted limited guarantee foundation company incorporated in the Cayman Islands. The BORG does not have any members or beneficiaries, but rather is governed by a relatively change-resistant ruleset embodied in its legal documents (see <a>here</a>) and the associated multisig smart contracts.</p>\n</li>\n<li>\n<p>Cayman foundation companies are a popular choice for DAO wrappers, protocol ‘foundations,’ and other crypto-/DeFi-/web3-related entities. The same features that make such entities useful in those contexts also render them suitable for a DAO-adjacent BORG such as the Lido Alliance Program, i.e.:</p>\n<ul>\n<li>\n<p>Tax-free status within the Cayman Islands;</p>\n</li>\n<li>\n<p>“Memberless” structure so that the entity need not be ‘owned’ by any person(s) and can therefore be operated for non-profit, community-aligned purposes;</p>\n</li>\n<li>\n<p>Limited liability for managers and service providers of the entity (except in the event of fraud, crime, or the knowing and intentional breach of the entity’s rules or applicable laws);</p>\n</li>\n<li>\n<p>Governance customizability capable of accommodating novel smart-contract-based rules and mechanisms; and</p>\n</li>\n<li>\n<p>A jurisdiction with a longstanding commitment to fostering digital asset endeavors and an ecosystem of law firms and other service providers deeply embedded in the crypto ecosystem.</p>\n</li>\n</ul>\n</li>\n<li>\n<p>The Lido Alliance BORG is requesting an initial budget of $125,000 for 2024, as part of the <a href=\"https://research.lido.fi/t/egg-st2024-v2-continuity-grant-funding-to-achieve-goose-goals/\">st2024 v2 EGG </a>request approved in July and is expected to require a yearly budget of $250,000 from 2025 to operate, which will be requested through subsequent EGG requests. The budget includes director fees, local law firm fees, contributor compensation and any other operational expenses, following the <a href=\"https://research.lido.fi/t/ecosystem-grants-grequest-egg-a-budget-request-framework-in-the-service-of-goose/\">EGG budget requests framework</a>.</p>\n</li>\n<li>\n<p>The Board of Directors of the BORG is responsible for running all aspects of the Lido Alliance program and is in charge of the BORG overall. The Directors must sit on all multisigs of the BORG. The initial Directors of the BORG would initially be <a class=\"mention\" href=\"https://research.lido.fi/u/adcv\">@adcv</a> and dsm of <a class=\"mention\" href=\"https://research.lido.fi/u/steakhouse\">@steakhouse</a>. Any future Directors would be approved by Lido DAO and the Board. An individual Director can be removed either by the Board itself or by Lido DAO. An individual Director may also unilaterally resign.</p>\n</li>\n<li>\n<p>The Guardians of the BORG are additional members of the BORG’s multisigs appointed by the Board. They generally should follow the Board’s instructions but may refuse to sign a multisig transaction based on security or compliance considerations. The initial Guardians of the BORG would be shik_happens, mac3w, jenya_k, olga_k, alex_l</p>\n</li>\n<li>\n<p>All Lido Allies must be approved by the Board and Lido DAO, and the BORG would hold all tokens contributed by Lido Allies in the Alliance Multisigs, which will (at minimum) be 4/7 multisigs consisting of the Directors and the Guardians. Lido DAO’s co-approval is required for all usages of the Lido-Ally-contributed tokens as a security measure–this requirement is initially imposed by virtue of the BORG’s Bylaws, and Lido contributors and MetaLeX hope to create additional onchain enforcement of these rules as well, though the technical ability to do so may vary from chain to chain. The addresses and other details of all Alliance Multisigs must be published by the BORG for the Lido community. Operational funds would be held separately at the discretion of the Board and are currently expected to be held in 3/5 multisigs (also using EasyTrack on a quarterly schedule). Mentioned EasyTrack set is requested to be added with a following configuration for the operational multisig:</p>\n</li>\n</ul>\n<ul>\n<li>AllowedTokensRegistry:<a href=\"https://etherscan.io/address/0x4AC40c34f8992bb1e5E856A448792158022551ca\" rel=\"noopener nofollow ugc\"> 0x4AC40c34f8992bb1e5E856A448792158022551ca</a></li>\n<li>TopUpAllowedRecipients: (address TBD)</li>\n<li>AllowedRecipientsRegistry: (address TBD):\n<ul>\n<li>allowedRecipients: 0x606f77BF3dd6Ed9790D9771C7003f269a385D942 (ops MS address);</li>\n<li>limit: 250,000 * 10^18 (i.e. $250K);</li>\n<li>periodDurationMonths: 3</li>\n</ul>\n</li>\n</ul>\n<ul>\n<li>\n<p>The permitted purposes of the BORG are to further the Lido Alliance Program as it was approved by Lido DAO.</p>\n</li>\n<li>\n<p>The BORG Personnel (including the Directors and Guardians) do not owe any direct duties to Lido DAO or Lido community members, but owe duties to the BORG entity, and the BORG entity’s purposes are restricted to fulfilling the Lido Alliance Program, which benefits the Lido DAO and broader Lido community.</p>\n</li>\n<li>\n<p>Alliance Multisig Members have obligations to identify material conflicts of interest and, in certain circumstances, disclose them to the Lido community.</p>\n</li>\n<li>\n<p>Lido DAO approval would be required for any liquidation of the entity or any amendment of the entity’s documents that adversely affect the Lido community or any sub-constituency thereof.</p>\n</li>\n<li>\n<p>The BORG has a ‘supervisor’, which is a statutory role in the Caymans intended to monitor a foundation company’s compliance with the entity’s own rules. The initial supervisor, intended to be temporary, is MetaLeX Pro LLC, the same law firm that led the creation of the BORG in consultation with various Lido contributors. This role is currently un-compensated and MetaLeX has committed to perform the role without additional compensation for up to three months. The final supervisor is expected to be a “Lido OpsBORG” or similar entity, which is currently in ideation phase and will be separately proposed to Lido DAO once various details are finalized.</p>\n</li>\n<li>\n<p>If an “Adverse Event” occurs, Lido DAO may directly appoint an “Emergency Supervisor” for the BORG. “Adverse Event” is defined to include egregious violations of law or the BORG’s own rules by the BORG or BORG Personnel in connection with the BORG’s activities, certain crimes independently committed by BORG Personnel (whether or not related to the BORG’s activities), and sustained deadlocks within the BORG’s governance/decision-making. The Emergency Supervisor would have broad powers under the BORG’s Bylaws and Caymans law, including the power to investigate the Adverse Event, bring lawsuits against BORG personnel in the name of the BORG and to remove and appoint Directors. The Emergency Supervisor role is intended to be temporary and the Emergency Supervisor must resign once the Adverse Event is handled or, in any event, the Emergency Supervisor’s tenure is automatically terminated after 12 months if not renewed by Lido DAO. Lido DAO also has the power to directly set the compensation of Emergency Supervisors.</p>\n</li>\n<li>\n<p>The BORG Personnel are indemnified by the BORG entity, within certain customary limits. This indemnification would be paid solely out of operating funds and not any of the Lido-Ally-contributed assets, unless Lido DAO approves to use additional funds of the BORG to indemnify the BORG personnel who acted on behalf of the BORG.</p>\n</li>\n<li>\n<p>The BORG Personnel would not have personal liability to the BORG for their BORG-related activities except to the extent they engage in gross negligence, willful misconduct, or fraud.</p>\n</li>\n<li>\n<p>The BORG Personnel must satisfy various eligibility criteria including not being subject to sanctions, not having previous egregious criminal convictions, and being reasonably sophisticated regarding blockchain technologies.</p>\n</li>\n</ul>\n<h2><a name=\"p-17171-additional-reading-references-5\" class=\"anchor\" href=\"https://research.lido.fi#p-17171-additional-reading-references-5\"></a>Additional Reading / References</h2>\n<ul>\n<li>\n<p><a href=\"https://github.com/MetaLex-Tech/publicDocs/tree/main/Lido-Alliance-BORG/coreDocs/coreDocs-08-20-24/pdfs\" rel=\"noopener nofollow ugc\">Lido Alliance BORG Bylaws, Memorandum of Association and Articles of Association</a></p>\n</li>\n<li>\n<p><a href=\"https://research.lido.fi/t/lido-alliance-an-ethereum-aligned-ecosystem/7475\">Proposal for Lido Alliance: An Ethereum-Aligned Ecosystem</a></p>\n</li>\n<li>\n<p>Delphi Labs, <a href=\"https://delphilabs.medium.com/assimilating-the-borg-a-new-cryptolegal-framework-for-dao-adjacent-entities-569e54a43f83\" rel=\"noopener nofollow ugc\">Assimilating the BORG</a></p>\n</li>\n<li>\n<p><a href=\"https://metalex.substack.com/p/the-metalex-whitepaper\" rel=\"noopener nofollow ugc\">MetaleX Whitepaper</a></p>\n</li>\n<li>\n<p><a href=\"https://lawcom.gov.uk/project/decentralised-autonomous-organisations-daos\" rel=\"noopener nofollow ugc\">UK Law Commission Scoping Paper on DAOs</a> (covering DAO-adjacent BORGs in substantial detail)</p>\n</li>\n</ul>\n<h2><a name=\"p-17171-voting-discussion-6\" class=\"anchor\" href=\"https://research.lido.fi#p-17171-voting-discussion-6\"></a>Voting &amp; Discussion</h2>\n<p>Note: The Lido Alliance program has already been approved by the Lido DAO. This proposal solely concerns the manner in which the Lido Alliance program is to be carried out.</p>\n<p>The Lido community is invited to weigh in on the proposal. This proposal will be followed by a Snapshot vote with the link published here, when ready.</p>\n<p>By voting YES in the Snapshot vote, you indicate support for funding and operating the Lido Alliance BORG as described herein.</p>\n<p>By voting AGAINST in the Snapshot vote, you indicate you do not support funding and operating the Lido Alliance BORG as described herein.</p>\n            <p><small>2 posts - 2 participants</small></p>\n            <p><a href=\"https://research.lido.fi/t/organize-the-lido-alliance-program-as-a-lido-dao-adjacent-borg/8173\">Read full topic</a></p>","link":"https://research.lido.fi/t/organize-the-lido-alliance-program-as-a-lido-dao-adjacent-borg/8173","pubDate":"Thu, 22 Aug 2024 14:32:12 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"research.lido.fi-topic-8173"},"source":{"@url":"https://research.lido.fi/t/organize-the-lido-alliance-program-as-a-lido-dao-adjacent-borg/8173.rss","#text":"Organize the Lido Alliance Program as a Lido-DAO-Adjacent BORG"}},{"title":"ReservoirDAO (AlphaGrowth) Delegate Platform","dc:creator":"sharp","category":"Delegate Platform","description":"<h1><a name=\"p-17164-reservoirdao-alphagrowth-delegate-thread-1\" class=\"anchor\" href=\"https://research.lido.fi#p-17164-reservoirdao-alphagrowth-delegate-thread-1\"></a>ReservoirDAO (AlphaGrowth) Delegate Thread</h1>\n<h2><a name=\"p-17164-name-2\" class=\"anchor\" href=\"https://research.lido.fi#p-17164-name-2\"></a>Name</h2>\n<p>ReservoirDAO (AlphaGrowth)</p>\n<p>Address: <a href=\"https://www.tally.xyz/profile/0x4f894Bfc9481110278C356adE1473eBe2127Fd3C\" rel=\"noopener nofollow ugc\">Tally Profile</a></p>\n<h2><a name=\"p-17164-contact-information-3\" class=\"anchor\" href=\"https://research.lido.fi#p-17164-contact-information-3\"></a>Contact Information</h2>\n<p>Website: <a href=\"https://reservoirdao.org/\" rel=\"noopener nofollow ugc\">https://reservoirdao.org/</a></p>\n<p>Twitter: <a href=\"https://x.com/alphagrowth1\" class=\"inline-onebox\" rel=\"noopener nofollow ugc\">x.com</a></p>\n<p>Contact telegram: <a href=\"https://t.me/sharpweb3\" rel=\"noopener nofollow ugc\">Telegram</a></p>\n<h1><a name=\"p-17164-introduction-4\" class=\"anchor\" href=\"https://research.lido.fi#p-17164-introduction-4\"></a>Introduction</h1>\n<p>GM Lido Community,</p>\n<p>The ReservoirDAO team is excited for our contribution to the Lido DAO. Over the past few months, we have been collaborating closely with many of the core contributors of the Lido community, we now seek broadening our collaboration with the Lido DAO.</p>\n<p>ReservoirDAO is the non-profit arm of AlphaGrowth, engaging in governance processes and helping shape decisions of decentralized organizations. Our team’s core competencies include growth, business development, Grants, Defi growth and marketing. We have served as Growth advisors for multiple Blockchain ecosystems and Defi Protocols. These include Ecosystems like Near, Aurora, Kava and more. For Defi Protocols, we have been the Growth teams for Sommelier and Compound.</p>\n<h2><a name=\"p-17164-motivation-5\" class=\"anchor\" href=\"https://research.lido.fi#p-17164-motivation-5\"></a>Motivation</h2>\n<p>In our current role we serve as the Growth stewards of Compoud Finance, the oldest and one of the largest Defi lending protocols. Lido is the natural ally of Compound with wstETH being the top collateral for most of the Compound Markets. Our collaboration increased with Lido in the past months with our drive to list wstETH as collateral on most of the existing Compound Markets. The close collaboration with Lido members sparked the interest within the team to contribute deeper to the Lido ecosystem.</p>\n<p>ReservoirDAO team plays an active role in the governance of top DAOs like Optimism, Arbitrum, Compound. In our attempt to contribute to the greater governance processes, we are aiming to expand our governance contribution to Lido DAO (Uniswap being the other DAO of interest)</p>\n<p>Working closely with the Lido DAO service providers, we are confident in the continued success of the Lido ecosystem and look forward to contributing on our part for the community’s success.</p>\n<h2><a name=\"p-17164-values-and-decision-making-approach-6\" class=\"anchor\" href=\"https://research.lido.fi#p-17164-values-and-decision-making-approach-6\"></a>Values and Decision Making Approach</h2>\n<p>We support decisions and initiatives that bring more activity and market share to Lido. To this end, we support any proactive ideas that help Lido maintain dominance.</p>\n<p>Oftentimes, DAOs get lost in rigid ideas which do not always allow for growth. We believe in optimizing for experimentation and learning, while of course minimizing risk.</p>\n<p>We also believe in keeping our decisions transparent and public.</p>\n<h2><a name=\"p-17164-public-acceptance-7\" class=\"anchor\" href=\"https://research.lido.fi#p-17164-public-acceptance-7\"></a>Public Acceptance</h2>\n<p>We accept Lido’s <a href=\"https://ipfs.io/ipfs/QmPwqjn5NiNVFKjxxBnYHivgempeyNNpMNotGYMCXitRd3\" rel=\"noopener nofollow ugc\">Public Delegate Code of Conduct</a> and our Public Delegate Platform signals our alignment with the <a href=\"https://research.lido.fi/t/lido-dao-vibe-alignment-purpose-mission-vision/4380\">mission, vision, and purpose of Lido DAO</a>.</p>\n            <p><small>1 post - 1 participant</small></p>\n            <p><a href=\"https://research.lido.fi/t/reservoirdao-alphagrowth-delegate-platform/8169\">Read full topic</a></p>","link":"https://research.lido.fi/t/reservoirdao-alphagrowth-delegate-platform/8169","pubDate":"Wed, 21 Aug 2024 16:09:44 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"research.lido.fi-topic-8169"},"source":{"@url":"https://research.lido.fi/t/reservoirdao-alphagrowth-delegate-platform/8169.rss","#text":"ReservoirDAO (AlphaGrowth) Delegate Platform"}},{"title":"Franklin DAO - Delegate Platform","dc:creator":"FranklinDAO","category":"Delegate Platform","description":"<h2><a name=\"p-17158-introduction-1\" class=\"anchor\" href=\"https://research.lido.fi#p-17158-introduction-1\"></a>Introduction</h2>\n<p><strong>Name:</strong> Franklin DAO</p>\n<p><strong>Background:</strong> We’re FranklinDAO a leading blockchain organization with students from The University of Pennsylvania’s undergraduate, graduate, and alumni bodies. Our committees cover Governance, Research, Education, Investments, and Development.</p>\n<p>Our governance team leads initiatives for different protocols we are delegates for. Current Franklin DAO delegations include Compound, Uniswap, Arbitrum, Optimism, etc. Each week, we share updates internally and publicly.</p>\n<p>It’s our goal to be a consistent source of knowledge for expanding the capabilities of the DAO and a helping hand to upholding the integrity of the DAO.</p>\n<p><strong>Expertise:</strong> Treasury Management, DeFi integrations, Service Provider Management, Incentives alignment</p>\n<p><strong>Address:</strong> 0x070341aA5Ed571f0FB2c4a5641409B1A46b4961b</p>\n<p><strong>Contact Information:</strong> Telegram: <span class=\"mention\">@alexduckworth</span> | Twitter: <span class=\"mention\">@franklin_dao</span></p>\n<h2><a name=\"p-17158-motivation-2\" class=\"anchor\" href=\"https://research.lido.fi#p-17158-motivation-2\"></a>Motivation</h2>\n<p>Protocols decentralizing through DAO governance need reliable participants with specialized knowledge in order to scale sustainably. Franklin DAO has an extensive network and access to top resources throughout the crypto industry. We value the position this puts us in to lead and support innovation in DAO governance.</p>\n<p>We have followed Lido since its inception. In Compound we have previously supported <a href=\"https://www.comp.xyz/t/temp-check-add-wsteth-as-a-collateral-on-base-eth-market-usdc-market-on-arbitrum-and-ethereum-mainnet/4867/21\" rel=\"noopener nofollow ugc\">wstETH as collateral</a> and posted the proposals for listing on Base, Arbirtrum, and Mainnet. In additon we have partnered with Chainlink to develop a <a href=\"https://www.comp.xyz/t/franklin-dao-request-for-comment-on-market-pricing-vs-exchange-rate-pricing-for-lsts-and-potential-oracle-implementations/5130/6\" rel=\"noopener nofollow ugc\">hybrid exchange rate oracle</a> to help support wstETH in a more capital efficient manner as well as other LRTs and LSTs.</p>\n<p>This is to say, we value Lido’s contribution to liquid staking and DeFi with their products. We are willing to go the extra mile to see their future success. We want to continue these efforts as a delegate, directly contributing to the DAO.</p>\n<h2><a name=\"p-17158-values-and-decision-making-approach-3\" class=\"anchor\" href=\"https://research.lido.fi#p-17158-values-and-decision-making-approach-3\"></a>Values and Decision-Making Approach</h2>\n<p><strong>Decision-Making Process</strong></p>\n<p>We take a transparent and communicative approach to collaborating with other delegates, service providers, and proposers to the DAOs we contribute to. By searching deeper than surface level we seek to fundamentally understand proposals, particularly those that stand to have a higher long term impact on a DAO.</p>\n<p>Generally:</p>\n<ol>\n<li>Read proposal and any replies already present.</li>\n<li>Due-diligence period</li>\n<li>Write a response summarizing our due-diligence findings and where we stand</li>\n<li>Vote accordingly</li>\n</ol>\n<p><strong>Core Values</strong></p>\n<ul>\n<li>\n<p><em>Transparency:</em> Committed to ensuring transparency of the protocol, and transparency about our decision-making process. We are committed to acting independently without external influence from third parties. We’re always open to answering questions related to our votes on proposals, so please don’t hesitate to reach out directly.</p>\n</li>\n<li>\n<p><em>Sustainability:</em> We are committed to ensuring the long-term sustainability and health of the DAOs we participate in and aim to help them steward their native protocols in perpetuity.</p>\n</li>\n<li>\n<p><em>Inclusivity:</em> Forging the best ideas requires diversity, fairness, and education, and we will strive to encourage these internally and externally.</p>\n</li>\n</ul>\n<p><strong>Public Acceptance</strong>:  We at Franklin DAO accept Lido DAO delegate Сode of Сonduct (<a href=\"https://ipfs.io/ipfs/QmPwqjn5NiNVFKjxxBnYHivgempeyNNpMNotGYMCXitRd3\" rel=\"noopener nofollow ugc\">link</a>) and Aligned with <a href=\"https://snapshot.org/#/lido-snapshot.eth/proposal/0x739fbe56425d355b5e41c22bb346b7a8217afd9e84aa49863648b1c641a482e3\" rel=\"noopener nofollow ugc\">Lido’s Vibe (Purpose, Mission, Vision)</a></p>\n<p><strong>Disclosures</strong>: We are delegates to many DAOs as outlined below in our Tally profiles</p>\n<ol>\n<li><a href=\"https://www.tally.xyz/profile/upennblockchain.eth\" class=\"inline-onebox\" rel=\"noopener nofollow ugc\">Tally | Franklin DAO</a></li>\n<li><a href=\"https://www.tally.xyz/profile/0xcc878369b26127bd4bc1b0b465bc8be9b92a4c62\" class=\"inline-onebox\" rel=\"noopener nofollow ugc\">Tally | 0xCc87...4c62</a></li>\n</ol>\n            <p><small>1 post - 1 participant</small></p>\n            <p><a href=\"https://research.lido.fi/t/franklin-dao-delegate-platform/8167\">Read full topic</a></p>","link":"https://research.lido.fi/t/franklin-dao-delegate-platform/8167","pubDate":"Wed, 21 Aug 2024 01:51:34 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"research.lido.fi-topic-8167"},"source":{"@url":"https://research.lido.fi/t/franklin-dao-delegate-platform/8167.rss","#text":"Franklin DAO - Delegate Platform"}},{"title":"Mog -Delegate Thread","dc:creator":"mogglet","category":"Delegate Platform","description":"<p>• Name: Mog<br>\n• X profile: <a href=\"https://x.com/tungtdinh\" rel=\"noopener nofollow ugc\">@tungtdinh</a><br>\n• Delegate Address: 0x61Cc8f06F3B6e1a3Fba28CbEbc4c89304b1187D1</p>\n<p><strong>Introduction:</strong><br>\nI am a crypto native and former VP of BD and Partnerships at Multichain. Since early 2023, I have been a Lido token holder and a self-proclaimed Lido Ambassador on X and actively participated in several voting proposals within the Lido DAO.<br>\n<strong>Experience:</strong><br>\nI helped over 400 Dapps and EVM/non-EVM chains launch their token/cross-chain bridges during the peak of 2022. Additionally, an effort secured over $200 million in TVL for the protocol, despite the challenging market conditions of 2023.<br>\nInitiated the creation of a user-friendly support portal with an intuitive guide and ticket-based system on Zendesk, serving 3,000 daily users.<br>\nLastly, experience working on several DAO grant proposals in many crypto ecosystems.</p>\n<p><strong>Motivation &amp; Approach:</strong></p>\n<p>Lido is one of the most critical, irreplaceable component of Ethereum and DeFi, I understand the importance of reGoose 2024, especially in decentralized governance and the robustness of the protocol &amp; Ethereum-aligned. As a DAO participant, I’ve observed that past proposals are often voted on by a small group of familiar voters, which can create a perception of centralization and potential legal risks.<br>\nAs a token holder, I recognize the need for the Lido protocol to maintain stability for long-term success. I aim to represent the voices of token holders in the Lido DAO forum to promote an inclusive atmosphere.</p>\n<p>My approach involves engaging with token holders whenever possible to understand their motivations and represent their interests in Lido DAO discussions and future proposals that align with Lido’s Vibe. I will leverage my expertise in the cross-chain/interoperability field and ecosystem building to provide insights on implementing stETH across Layer 2 solutions and other chains. I aspire to serve as a point of contact and provide insightful feedback on future proposals.</p>\n<p>Bottom line, With my background in building interoperable protocols and experience in risk management through several past incidents, I believe I can significantly contribute to Lido DAO’s decentralization efforts.<br>\nTogether, we can keep Ethereum decentralized, accessible to all and resistant to censorship.</p>\n<p><strong>Proof of Participation in Lido DAO Voting Since 2023</strong>:<br>\nMy participation in 12 proposals can be viewed on my voting profile: Snapshot Voting Profile.<br>\n<a href=\"https://snapshot.org/#/profile/0x61Cc8f06F3B6e1a3Fba28CbEbc4c89304b1187D1\" rel=\"noopener nofollow ugc\">Snapshot</a></p>\n<p><strong>Public Acceptance:</strong> I accept Lido DAO delegate Сode of Сonduct (<a href=\"https://ipfs.io/ipfs/QmPwqjn5NiNVFKjxxBnYHivgempeyNNpMNotGYMCXitRd3\" rel=\"noopener nofollow ugc\">link 4</a>) and Aligned with `<a href=\"https://snapshot.org/#/lido-snapshot.eth/proposal/0x739fbe56425d355b5e41c22bb346b7a8217afd9e84aa49863648b1c641a482e3\" rel=\"noopener nofollow ugc\">Lido’s Vibe (Purpose, Mission, Vision) 2</a></p>\n<p><strong>Disclosures:</strong> I own LDO</p>\n<p><strong>Waiver of Liability</strong> By delegating to me, you acknowledge and agree that I participate on a best-efforts basis and will not be held liable for any potential damages arising from participation in the Lido Protocol or this DAO.</p>\n            <p><small>1 post - 1 participant</small></p>\n            <p><a href=\"https://research.lido.fi/t/mog-delegate-thread/8164\">Read full topic</a></p>","link":"https://research.lido.fi/t/mog-delegate-thread/8164","pubDate":"Tue, 20 Aug 2024 13:18:09 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"research.lido.fi-topic-8164"},"source":{"@url":"https://research.lido.fi/t/mog-delegate-thread/8164.rss","#text":"Mog -Delegate Thread"}},{"title":"Galaxy Infra - Aug 2024","dc:creator":"yorickdowne","category":"Node Operators","description":"<p>Our semi-regular updates on what we are up to with our infra</p>\n<p><strong>Changes</strong></p>\n<p>One of the Netherminds has been replaced with Reth. This makes it:</p>\n<p>Nimbus/Nethermind, Teku/Besu, Lodestar/Reth</p>\n<p>The VC remains Vouch with a 3/5 threshold Dirk</p>\n<p><strong>Future</strong></p>\n<p>We are looking forward to Vouch 1.9, which will reduce downtime: It will start if one of the CLs happens to be down.</p>\n<p>Nethermind will eventually be resynced on Path or Paprika, when that is ready.</p>\n<p>Besu may get a resync for receipt compaction.</p>\n<p>EIP-4444 <a href=\"https://blog.ethportal.net/posts/2024-portal-prague#4444s-and-execution-clients\" rel=\"noopener nofollow ugc\">might land this year</a>. Nethermind is working on their own Portal implementation.</p>\n<p>Vouch 1.10 - possibly in 2025, unless it slips to 2026 - may enable active/active, which reduces risk further.</p>\n<p>We intend to consolidate validators after Pectra, up to the new MaxEB, in consultation with the Lido DAO</p>\n            <p><small>1 post - 1 participant</small></p>\n            <p><a href=\"https://research.lido.fi/t/galaxy-infra-aug-2024/8159\">Read full topic</a></p>","link":"https://research.lido.fi/t/galaxy-infra-aug-2024/8159","pubDate":"Mon, 19 Aug 2024 17:21:04 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"research.lido.fi-topic-8159"},"source":{"@url":"https://research.lido.fi/t/galaxy-infra-aug-2024/8159.rss","#text":"Galaxy Infra - Aug 2024"}},{"title":"Pol Lanski Delegate Thread","dc:creator":"Lanski","category":"Delegate Platform","description":"<h2><a name=\"p-17133-delegate-information-1\" class=\"anchor\" href=\"https://research.lido.fi#p-17133-delegate-information-1\"></a>Delegate information:</h2>\n<p>Name: Pol Lanski<br>\nAddress: lanski.eth<br>\nForum: <a class=\"mention\" href=\"https://research.lido.fi/u/lanski\">@Lanski</a><br>\nTwitter: <a href=\"https://x.com/Pol_Lanski\">Pol_Lanski</a></p>\n<p><strong>Introduction</strong><br>\nI’m the Project Lead at <a href=\"https://dappnode.com\">Dappnode</a> and member of the builder collective <a href=\"https://dorg.tech\">dOrg</a>.<br>\nI’ve been in blockchain since I mined dogecoin in 2014 and full time since 2019, working for the past 5 years on creating a decentralized infrastructure network of node runners via Dappnode. My expertise is in staking, home node operations / solo staking, mechanism design, infrastructure and decentralization.</p>\n<p><strong>Motivation</strong></p>\n<ol>\n<li>Lido is an extremely important project for Ethereum. Lido’s focus, vision and execution has turned it into the single biggest controller of staked ETH. It’s easy to see how there are many decisions, by action or inaction, that are possible for Lido to take, that will shape both projects and protocol.</li>\n<li>Decentralized Governance is powerful, and can dangerous: governance attacks are happening due to plain token voting, unchecked processes and community apathy. Lido’s delegation approach is an important step to ensure that such an important project for Ethereum is governed properly while still following DAO principles.</li>\n<li>Considering my mission to protect and shape Ethereum to the best of my abilities, and the possibility of helping Lido take the right paths, and that the path of Lido is deeply entrenched with Ethereum’s future, I feel deeply compelled to give my best to steer Lido according to what I believe are the right values (see next section).</li>\n</ol>\n<p><strong>Values and Decision-Making Approach</strong> (Core Values, Decision-Making Process)<br>\nLido’s Vibe (Purpose, Mission, and Vision) asserts that Lido pursues the decentralization of Ethereum (understood as the coordination and value layer of the internet) by making staking simple, secure, and decentralized. This Vibe perfectly aligns with my values and the work I’ve been dedicated to for the past five years.</p>\n<ul>\n<li>\n<p><strong>Decentralization focus</strong> Decentralization is a key component of what I value about Ethereum. But, what do I mean with Decentralization?<br>\nDecentralization is a spectrum where different desirable properties emerge. Such properties are resilience to government capture, boycott, censorship, zero-day exploits, power grid failures and other geographically bounded events… It is these properties which turn Ethereum into a desirable platform for running unstoppable applications (or becoming the co-ordination and value layer of the internet, as written in the Vibe)</p>\n</li>\n<li>\n<p><strong>Balancing Stakeholder Interests:</strong> When the interests of different stakeholders conflict, I will always anchor my decisions in Lido’s Vibe, which aligns with the broader mission of Ethereum’s decentralization. I believe that decisions should benefit both Lido and the Ethereum ecosystem as a whole. For example, if a proposal offers short-term gains for one group but could harm the long-term decentralization of Ethereum, I would lean towards a decision that prioritizes long-term, sustainable decentralization, ensuring that Lido remains aligned with its core mission. Should the mission change, I would consider my mandate as changed too and I would have to reevaluate whether I am the most appropriate person to pursue it and defend it.</p>\n</li>\n<li>\n<p><strong>Leveraging Expertise in Staking and Infrastructure:</strong> Given my expertise in staking and decentralized infrastructure, I am well-positioned to contribute to Lido’s roadmap. I consult and draw from teams, facilitate strategic partnerships, and provide in-depth analysis of proposals related to staking and infrastructure. My experience with Dappnode in building a decentralized network of node runners will be invaluable in helping Lido become a stronger decentralizing force for Ethereum. I am committed to using this expertise to ensure that Lido’s infrastructure and governance practices contribute to a more robust and decentralized Ethereum ecosystem.</p>\n</li>\n</ul>\n<p><strong>Public Acceptance</strong>:  I, Pol Lanski, accept the Lido DAO delegate Сode of Сonduct (<a href=\"https://ipfs.io/ipfs/QmPwqjn5NiNVFKjxxBnYHivgempeyNNpMNotGYMCXitRd3\">link</a>) and Aligned with <a href=\"https://snapshot.org/#/lido-snapshot.eth/proposal/0x739fbe56425d355b5e41c22bb346b7a8217afd9e84aa49863648b1c641a482e3\">Lido’s Vibe (Purpose, Mission, Vision)</a></p>\n<p><strong>Disclosures</strong>:<br>\nI am the project lead at Dappnode, who has received funding from LEGO grants. I hold a very small amount of Diva and BSN tokens. I am also a delegate for ShutterDAO, where I am known for voting against and being very vocal with decisions that I don’t believe have the best outcome for Shutter while being open to discussion and to research independently.</p>\n<p><strong>Disclaimer</strong>:<br>\nBy delegating to me, Lanski, you acknowledge and agree to the following:</p>\n<ul>\n<li>I do not control or represent the DAO or the LIDO project and do not assume any responsibility or liability for the DAO’s or LIDO’s actions or decisions.</li>\n<li>I do not take over any responsibilities of the DAO or the LIDO project, and my participation is limited to the role of a delegate.</li>\n<li>I am not bound by any particular opinion when voting. Instead, I will vote in a manner that I believe is in the best interest of the LIDO project.</li>\n<li>By delegating your vote to me, you grant me the freedom to vote at my discretion with your delegation, which means you have no right to restrict me in forming my opinions or in how I cast my votes.</li>\n<li>I disclaim any liability for any loss, damages, or claims arising from your delegation of votes to me, including but not limited to, unfavorable decisions of the DAO, lack of development of the LIDO project, or other unfavorable or unforeseen circumstances. By delegating votes to me, you fully understand and accept the risks associated with interacting with decentralized smart contracts.</li>\n</ul>\n            <p><small>1 post - 1 participant</small></p>\n            <p><a href=\"https://research.lido.fi/t/pol-lanski-delegate-thread/8155\">Read full topic</a></p>","link":"https://research.lido.fi/t/pol-lanski-delegate-thread/8155","pubDate":"Mon, 19 Aug 2024 14:20:55 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"research.lido.fi-topic-8155"},"source":{"@url":"https://research.lido.fi/t/pol-lanski-delegate-thread/8155.rss","#text":"Pol Lanski Delegate Thread"}},{"title":"LEGO Q2 2024 Report","dc:creator":"Alex_L","category":"Community Grants / Initiatives","description":"<h3><a name=\"p-17128-lego-q2-2024-report-1\" class=\"anchor\" href=\"https://research.lido.fi#p-17128-lego-q2-2024-report-1\"></a>LEGO Q2 2024 Report</h3>\n<p></p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://europe1.discourse-cdn.com/business20/uploads/lido/original/2X/d/dd1553abeaa5b9a930c79f6bbac35eaade67173d.jpeg\" data-download-href=\"/uploads/short-url/vxNdeLbSN7xz6tQaMtJwHHMCvU1.jpeg?dl=1\" title=\"\"><img src=\"https://europe1.discourse-cdn.com/business20/uploads/lido/optimized/2X/d/dd1553abeaa5b9a930c79f6bbac35eaade67173d_2_602x339.jpeg\" alt=\"\" data-base62-sha1=\"vxNdeLbSN7xz6tQaMtJwHHMCvU1\" width=\"602\" height=\"339\" role=\"presentation\" srcset=\"https://europe1.discourse-cdn.com/business20/uploads/lido/optimized/2X/d/dd1553abeaa5b9a930c79f6bbac35eaade67173d_2_602x339.jpeg, https://europe1.discourse-cdn.com/business20/uploads/lido/optimized/2X/d/dd1553abeaa5b9a930c79f6bbac35eaade67173d_2_903x508.jpeg 1.5x, https://europe1.discourse-cdn.com/business20/uploads/lido/optimized/2X/d/dd1553abeaa5b9a930c79f6bbac35eaade67173d_2_1204x678.jpeg 2x\" data-dominant-color=\"9EA6DD\"></a></div><p></p>\n<p>As the second quarter of 2024 concludes, contributors are excited to share LEGO’s achievements during this period.</p>\n<p>Dive into the comprehensive LEGO Q2’24 report available <a href=\"https://lego.lido.fi/lego-quarterly-reporting/lego-q2-2024-report\">here</a>.</p>\n<h3><a name=\"p-17128-what-is-lego-2\" class=\"anchor\" href=\"https://research.lido.fi#p-17128-what-is-lego-2\"></a>What Is LEGO?</h3>\n<p>For those needing a quick refresher, LEGO, short for Lido Ecosystem Grants Organization, is an innovative initiative from Lido DAO. Its core mission is to bolster projects that contribute positively to the Ethereum liquid staking environment. Designed with efficiency in mind, LEGO empowers a range of innovators - from builders to researchers - by providing them with the essential funding and resources needed to bring their creative ideas to fruition.</p>\n<p>LEGO is more than a funding source; it’s a catalyst for growth and innovation, playing a crucial role in maintaining Lido’s position as a top-tier liquid staking protocol.</p>\n<p>To delve deeper into LEGO or to explore funding possibilities, visit the <a href=\"https://lido.fi/lego\">Lido Ecosystem Grants Organisation - LEGO</a>.</p>\n<h3><a name=\"p-17128-highlights-q2-2024-3\" class=\"anchor\" href=\"https://research.lido.fi#p-17128-highlights-q2-2024-3\"></a>Highlights: Q2 2024</h3>\n<p>The past quarter, Q2 2024, featured a range of notable grants, including:</p>\n<ul>\n<li><a href=\"https://research.lido.fi/t/dappnode-proposal-for-csm-and-sdvtm-integration/6739\">Dappnode Proposal for CSM integration</a>;</li>\n<li><a href=\"https://research.lido.fi/t/stereum-csm-simpledvt-integration-grant-proposal/6502\">Stereum CSM Integration Grant Proposal</a>;</li>\n<li><a href=\"https://research.lido.fi/t/grant-proposal-integrating-nethermind-sedge-with-lido-csm/6629\">Integrating Nethermind Sedge with Lido CSM</a>;</li>\n<li><a href=\"https://research.lido.fi/t/d-u-c-k-distributed-utilization-of-configurations-and-knowledge-proposal/5848\">D.U.C.K. (Distributed Utilization of Configurations and Knowledge)</a>;</li>\n<li><a href=\"https://research.lido.fi/t/proposal-create-a-centralized-exchange-liquidity-dashboard-for-eth-and-steth-develop-a-strategy-to-improve-steth-liquidity/5162\">stETH liquidity dashboard proposal by Glassmarkets</a>;</li>\n<li><a href=\"https://research.lido.fi/t/holesky-safe-q1-2024-budget-provision-support-maintenance/6451\">Holesky Safe deployed by Protofire</a> (maintenance);</li>\n<li>And many more!</li>\n</ul>\n<p>As the quarter ends, a total of $156.8K was allocated to LEGO grants, amounting to 31% of the allotted quarterly budget.</p>\n<p>For an in-depth look at LEGOs Q2 journey, check out the <a href=\"https://lego.lido.fi/lego-quarterly-reporting/lego-q2-2024-report\">full report</a>. For a deeper look into previous quarters, the archive is<a href=\"https://lego.lido.fi/lego-quarterly-reporting\"> here</a>.</p>\n<h3><a name=\"p-17128-whats-next-q3-2024-4\" class=\"anchor\" href=\"https://research.lido.fi#p-17128-whats-next-q3-2024-4\"></a>What’s Next: Q3 2024</h3>\n<ul>\n<li>The LEGO budget will remain at $500,000, with a 20% LDO and 80% DAI (or another USD stable) token split.</li>\n<li>Individual allowances will be recalculated each quarter: USD equivalents using a 30-day TWAP will be calculated for 15k and 10k LDO (council and nominees, respectively). If a LEGO member’s wallet holds a balance equal to or higher than the calculated allowance, it will not be refilled.</li>\n</ul>\n<p>The refill amount and individual allowances for Q3 2024 are as follows (using a 30-day TWAP for LDO as of July 1st, 2024 = 2.1492):</p>\n<p></p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://europe1.discourse-cdn.com/business20/uploads/lido/original/2X/3/3d35d1d5f9e354f28b2461e3e2ef58173682fee8.png\" data-download-href=\"/uploads/short-url/8JuqTznjxQL1B2GAgCXxqMZa1uw.png?dl=1\" title=\"image\"><img src=\"https://europe1.discourse-cdn.com/business20/uploads/lido/original/2X/3/3d35d1d5f9e354f28b2461e3e2ef58173682fee8.png\" alt=\"image\" data-base62-sha1=\"8JuqTznjxQL1B2GAgCXxqMZa1uw\" width=\"690\" height=\"196\" data-dominant-color=\"ECECEC\"></a></div><p></p>\n<p>The requested DAI amount includes the swap of extra LDO in the LEGO multisig (due to LDO token appreciation) with Lido DAO treasury, with LDOs to be sent back to the treasury.</p>\n<p>For more information on proposals submitted to LEGO, please visit <a href=\"http://research.lido.fi\">research.lido.fi</a>.</p>\n            <p><small>1 post - 1 participant</small></p>\n            <p><a href=\"https://research.lido.fi/t/lego-q2-2024-report/8154\">Read full topic</a></p>","link":"https://research.lido.fi/t/lego-q2-2024-report/8154","pubDate":"Mon, 19 Aug 2024 12:29:44 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"research.lido.fi-topic-8154"},"source":{"@url":"https://research.lido.fi/t/lego-q2-2024-report/8154.rss","#text":"LEGO Q2 2024 Report"}},{"title":"DegentradingLSD - Delegate Thread","dc:creator":"degentradingLSD","category":"Delegate Platform","description":"<p><strong>Name:</strong> DegentradingLSD<br>\n<strong>Address:</strong> degentradinglsd3.eth<br>\n<strong>Twitter:</strong>  -x.com/degentradingLSD</p>\n<p><strong>Introduction:</strong> I am degentradingLSD on twitter/X. I have a deep understanding of markets mechanics, incentives and commercial knowledge.</p>\n<p><strong>Why am i doing this:</strong> Lido is a critical infrastructure piece in the crypto ecosystem. I believe that this is an unique opportunity to contribute meaningfully to the decentralized ecosystem via governance. Especially with the issues of voter apathy and the inability to meet quorum on important votes. I will do my best to advocate for AND generate interest within the broader community towards participation.</p>\n<p><strong>Decision-Making Approach:</strong> I will make decisions that aligns towards decentralization, resiliency and Numba Go Up (NGU).</p>\n<p><strong>Public Acceptance:</strong> I accept Lido DAO delegate Сode of Сonduct and Aligned with [Lido’s Vibe (Purpose, Mission, Vision)</p>\n<p><strong>Disclosures:</strong> I own LDO</p>\n<p><strong>Waiver of Liability</strong></p>\n<p>By delegating to Degentrading, you understand and accept that my involvement in the Lido Protocol, as well as other DAO-related activities, will be conducted with my best effort and commitment. I cannot be held responsible for any potential losses or damages that may result from my participation especially for circumstances out of my control.</p>\n            <p><small>1 post - 1 participant</small></p>\n            <p><a href=\"https://research.lido.fi/t/degentradinglsd-delegate-thread/8149\">Read full topic</a></p>","link":"https://research.lido.fi/t/degentradinglsd-delegate-thread/8149","pubDate":"Mon, 19 Aug 2024 07:02:14 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"research.lido.fi-topic-8149"},"source":{"@url":"https://research.lido.fi/t/degentradinglsd-delegate-thread/8149.rss","#text":"DegentradingLSD - Delegate Thread"}},{"title":"Matt Stam - Delegate Thread","dc:creator":"mattstam","category":"Delegate Platform","description":"<p><strong>Name</strong>: Matt Stam (aka <a class=\"mention\" href=\"https://research.lido.fi/u/mattstam\">@mattstam</a>)</p>\n<p><strong>Address</strong>: <a href=\"https://etherscan.io/address/0x33379367200Ac200182ccD4abD71683F2D24e373\">0x33379367200Ac200182ccD4abD71683F2D24e373</a></p>\n<p><strong>Links</strong>: <a href=\"https://explorer.ssv.network/operators/566\">Lido Operator</a> | <a href=\"https://research.lido.fi/u/mattstam/summary\">Lido Forum</a> | <a href=\"https://github.com/mattstam\">Github</a> | <a href=\"https://x.com/mattstam_eth\">Twitter</a> | <a href=\"https://www.linkedin.com/in/mattstam/\">LinkedIn</a> | <a href=\"https://ethresear.ch/u/mattstam/summary\">Ethresear.ch</a> | <a href=\"https://ethereum-magicians.org/u/mattstam/summary\">Ethereum Magicians</a></p>\n<h2><a name=\"p-17106-introduction-1\" class=\"anchor\" href=\"https://research.lido.fi#p-17106-introduction-1\"></a>Introduction</h2>\n<p>I’m a developer with a background in traditional software engineering and infrastructure, and I transitioned to crypto in 2022. My journey into staking began as a solo staker, driven by a deep interest in Ethereum and helping improve its decentralization. Over time, I recognized the limitations of solo staking—such as the lack of liquidity and flexibility—and switched to staking via stETH. This gave me a firsthand appreciation of the value that Lido brings to the ecosystem.</p>\n<p>Driven by a desire to contribute more directly to Lido’s mission, I became a Lido Operator for the DVT router with <a href=\"https://ssv.network\">SSV</a>, where I’ve focused on increasing client diversity by adopting minority clients like <a href=\"https://github.com/paradigmxyz/reth\">Reth</a> and <a href=\"https://github.com/status-im/nimbus-eth2\">Nimbus</a> while maintaining exceptional performance.</p>\n<p>My goal is to push the limits of innovation in the staking ecosystem, not only by enhancing the security and resilience of Lido’s infrastructure but also by ensuring that Lido continues to set the standard as the premier, user-focused staking experience.</p>\n<h2><a name=\"p-17106-motivation-2\" class=\"anchor\" href=\"https://research.lido.fi#p-17106-motivation-2\"></a>Motivation</h2>\n<p>Ethereum is constantly evolving—there are ongoing proposals that would radically shift the staking landscape and greatly affect Lido: <a href=\"https://ethresear.ch/t/sticking-to-8192-signatures-per-slot-post-ssf-how-and-why/17989\">SSF</a>, <a href=\"https://ethresear.ch/t/increase-the-max-effective-balance-a-modest-proposal/15801/46\">Max EB</a>, <a href=\"https://ethereum-magicians.org/t/electra-issuance-curve-adjustment-proposal/18825\">MVI Adjustments</a>, <a href=\"https://ethresear.ch/t/based-preconfirmations/17353\">Preconfs</a>, <a href=\"https://www.youtube.com/watch?v=mJLERWmQ2uw\">MCP</a>—just to name a few. This is a critical juncture in Lido’s timeline, and navigating these changes effectively will be pivotal to ensuring the protocol’s long-term success. Understanding these technical shifts is essential for making informed decisions that secure Lido’s future.</p>\n<p>As a Lido DAO delegate, I aim to leverage my experience as a developer and staker to navigate these challenges effectively. My goal is to ensure Lido remains a leader in staking, balancing innovation with stability, and making decisions that benefit both the protocol and the broader Ethereum ecosystem.</p>\n<h2><a name=\"p-17106-values-and-decision-making-approach-3\" class=\"anchor\" href=\"https://research.lido.fi#p-17106-values-and-decision-making-approach-3\"></a>Values and Decision-Making Approach</h2>\n<p>My approach to governance is guided by the following core values:</p>\n<ul>\n<li>\n<p><strong>Technical Excellence:</strong> I prioritize decisions that advance Lido’s technical infrastructure to <em>enhance security, scalability, and user experience</em>. My focus is on ensuring that Lido continues to lead in client diversity and protocol security while maintaining a robust and resilient staking environment, ultimately supporting the long-term success of the protocol.</p>\n</li>\n<li>\n<p><strong>Holistic Perspective:</strong> My combined experience as a staker, operator, and developer provides a unique viewpoint on the ecosystem. This allows me to consider the needs and impacts on all participants, ensuring balanced and informed decision-making.</p>\n</li>\n<li>\n<p><strong>Pragmatism and Integrity:</strong> I aim to balance forward-thinking innovation with practical, long-term solutions. My decisions will always prioritize the best interests of the protocol and its stakeholders, guided by a commitment to transparency and rationality.</p>\n</li>\n</ul>\n<h2><a name=\"p-17106-public-acceptance-4\" class=\"anchor\" href=\"https://research.lido.fi#p-17106-public-acceptance-4\"></a>Public Acceptance</h2>\n<p>I accept Lido DAO delegate <a href=\"https://ipfs.io/ipfs/QmPwqjn5NiNVFKjxxBnYHivgempeyNNpMNotGYMCXitRd3\">Сode of Сonduct</a> and am fully aligned with Lido’s <a href=\"https://snapshot.org/#/lido-snapshot.eth/proposal/0x739fbe56425d355b5e41c22bb346b7a8217afd9e84aa49863648b1c641a482e3\">Purpose, Mission, and Vision</a>.</p>\n<h2><a name=\"p-17106-disclosures-5\" class=\"anchor\" href=\"https://research.lido.fi#p-17106-disclosures-5\"></a>Disclosures</h2>\n<p>I work for <a href=\"https://x.com/succinctlabs\">Succinct</a>, a company specializing in zero-knowledge. I do not foresee any conflicts of interest between my work at Succinct and my participation in Lido DAO governance, but I am committed to full transparency and will disclose any potential conflicts if they arise.</p>\n            <p><small>1 post - 1 participant</small></p>\n            <p><a href=\"https://research.lido.fi/t/matt-stam-delegate-thread/8145\">Read full topic</a></p>","link":"https://research.lido.fi/t/matt-stam-delegate-thread/8145","pubDate":"Sun, 18 Aug 2024 01:31:28 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"research.lido.fi-topic-8145"},"source":{"@url":"https://research.lido.fi/t/matt-stam-delegate-thread/8145.rss","#text":"Matt Stam - Delegate Thread"}},{"title":"Ignas Delegate Thread","dc:creator":"Ignas","category":"Delegate Platform","description":"<h2><a name=\"p-17092-contact-information-1\" class=\"anchor\" href=\"https://research.lido.fi#p-17092-contact-information-1\"></a>Contact Information</h2>\n<p><strong>Name</strong>: Ignas<br>\n<strong>Address</strong>: ignasdefi.eth / 0x3DDC7d25c7a1dc381443e491Bbf1Caa8928A05B0<br>\n<strong>Twitter</strong>: <a class=\"mention\" href=\"https://research.lido.fi/u/defiignas\">@DefiIgnas</a></p>\n<h2><a name=\"p-17092-introduction-2\" class=\"anchor\" href=\"https://research.lido.fi#p-17092-introduction-2\"></a>Introduction</h2>\n<p>First and foremost, I’m an active DeFi user and independent researcher. I share my findings and thoughts on X and my personal blog.</p>\n<p>I’m also the co-founder of Pink Brains DeFi Creator Studio, which focuses on elevating quality projects through authentic representation.</p>\n<h2><a name=\"p-17092-motivation-3\" class=\"anchor\" href=\"https://research.lido.fi#p-17092-motivation-3\"></a>Motivation</h2>\n<p>Currently, DeFi DAOs face several internal issues, such as voter apathy leading to governance attacks, insider voting, and voting concentration among a few active voting addresses. Additionally, they face external challenges like regulatory uncertainty.</p>\n<p>I believe in a decentralized future, even if it seems naive. However, the current state of crypto is plagued by misaligned incentives that prioritize short-term speculative gains over the core DeFi values of self-sovereignty and custody.</p>\n<p>Equally concerning is the trend of McKinsification in DAOs, where decisions are increasingly made by one or two professional consultant delegates. This discourages individual participation, as their opinions and votes have less impact.</p>\n<p>To make DeFi DAOs viable, we must align incentives to encourage active participation in governance from the broader crypto community.</p>\n<p>I see potential in Lido DAO’s incentivized delegation approach. It creates career opportunities for individual delegates while strengthening and decentralizing DAOs, making them less prone to corruption.</p>\n<h2><a name=\"p-17092-values-and-decision-making-approach-4\" class=\"anchor\" href=\"https://research.lido.fi#p-17092-values-and-decision-making-approach-4\"></a>Values and Decision-Making Approach</h2>\n<p>Community must be at the core of every DAO.</p>\n<p>Without giving the community a say in protocol governance, we’re no better than the Web2 companies we aim to replace—companies that view their “community” merely as users to extract value from.</p>\n<p>I will support initiatives that align token holders with the protocol, such as revenue sharing or other methods to bring value to the token.</p>\n<p>Token holders are frustrated with exploitative tokenomics that only benefit early insiders who acquired tokens at much lower prices, leaving no upside for new investors. Without incentives to buy and hold tokens, the attractiveness and health of DAOs decline.</p>\n<p>Finally, I will highlight key votes and decisions of the DAO on X and my blog, as I believe the general public is often unaware of important actions being taken.</p>\n<h2><a name=\"p-17092-public-acceptance-5\" class=\"anchor\" href=\"https://research.lido.fi#p-17092-public-acceptance-5\"></a>Public Acceptance</h2>\n<p>I accept Lido’s Public Delegate Code of Conduct and our Public Delegate Platform signals my alignment with the mission, vision, and purpose of Lido DAO.</p>\n<h2><a name=\"p-17092-disclosures-6\" class=\"anchor\" href=\"https://research.lido.fi#p-17092-disclosures-6\"></a>Disclosures</h2>\n<p>I am the co-founder of Pink Brains at https:// pinkbrains. io, a DeFi creator studio dedicated to promoting DeFi projects through educational content. You can find the full list of projects we have worked on at our landing page.</p>\n<p>I plan to apply as a delegate to other DAOs too, with the same mission of strengthening them and aligning token holders with the protocol.</p>\n<p>I always make appropriate disclosures and recuse myself from voting when necessary.</p>\n<p>Note: I could not add links as my account is new and will update this post when sharing links is allowed.</p>\n            <p><small>1 post - 1 participant</small></p>\n            <p><a href=\"https://research.lido.fi/t/ignas-delegate-thread/8135\">Read full topic</a></p>","link":"https://research.lido.fi/t/ignas-delegate-thread/8135","pubDate":"Fri, 16 Aug 2024 11:59:03 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"research.lido.fi-topic-8135"},"source":{"@url":"https://research.lido.fi/t/ignas-delegate-thread/8135.rss","#text":"Ignas Delegate Thread"}},{"title":"Wintermute Governance Delegate Thread","dc:creator":"Wintermute","category":"Delegate Platform","description":"<h2><a name=\"p-17086-name-1\" class=\"anchor\" href=\"https://research.lido.fi#p-17086-name-1\"></a>Name</h2>\n<p>Wintermute Governance</p>\n<h2><a name=\"p-17086-address-2\" class=\"anchor\" href=\"https://research.lido.fi#p-17086-address-2\"></a>Address</h2>\n<p>Wintermutegovernance.eth / 0xB933AEe47C438f22DE0747D57fc239FE37878Dd1</p>\n<h2><a name=\"p-17086-contact-information-3\" class=\"anchor\" href=\"https://research.lido.fi#p-17086-contact-information-3\"></a>Contact Information</h2>\n<p>X (Twitter): <a href=\"https://x.com/wintermute_t\" class=\"inline-onebox\" rel=\"noopener nofollow ugc\">x.com</a> &amp; <a href=\"https://x.com/cvant_\" class=\"inline-onebox\" rel=\"noopener nofollow ugc\">x.com</a></p>\n<p>Web: <a href=\"https://wintermute.com\" rel=\"noopener nofollow ugc\">https://wintermute.com</a></p>\n<p>Discord: callen_wintermute</p>\n<p>Telegram: <span class=\"mention\">@callenvde</span></p>\n<h2><a name=\"p-17086-introduction-4\" class=\"anchor\" href=\"https://research.lido.fi#p-17086-introduction-4\"></a>Introduction</h2>\n<p>Hi Lido Community,</p>\n<p>We are excited to join Lido DAO as a Public Delegate and begin supporting the Lido ecosystem in our fullest capacity!</p>\n<p>Wintermute is a leading crypto-native algorithmic trading firm, specialising in creating efficient markets across centralised and decentralised exchanges. Wintermute was founded in July 2017 by three Optiver veterans. Evgeny Gaevoy, founder and CEO, was previously head of ETFs (screen and OTC) at Optiver Europe, one of the largest ETF market-making desks. Since our inception, we have traded over $4.9T USD in volume and expanded our presence across 80+ (de)centralised exchanges and various (non)EVM chains, continuously supporting the ecosystem for our partners and their communities.</p>\n<p>Alongside our trading arm, Wintermute Ventures and Wintermute Governance support and work with leading crypto projects &amp; DAOs with the goal of truly adding value, enabling partnerships, and helping shape a positive outcome for the ecosystem. We’re eager to bring our DeFi, Institutional, and Governance expertise to the Lido DAO.</p>\n<h2><a name=\"p-17086-motivation-5\" class=\"anchor\" href=\"https://research.lido.fi#p-17086-motivation-5\"></a>Motivation</h2>\n<p>At Wintermute, we believe that a decentralized world needs robust and progressive governance systems. Our goal is to support DAOs along their journey towards such a state through objective, long-term value-add decision-making.</p>\n<p>We’ve been an active voter in Lido for some time now and have witnessed first hand the DAO struggle with voter apathy and in a few cases failure to meet quorum on important votes. Our Public Delegate Platform serves as our commitment to maintaining high voting participation and providing valuable feedback where necessary based on our expertise, ensuring we have a direct impact on improving governance efficiency.</p>\n<p>The DAO has a clear vision and talented service providers/contributors and our goal as a delegate is to ensure the former and empower the latter.</p>\n<h2><a name=\"p-17086-values-and-decision-making-approach-6\" class=\"anchor\" href=\"https://research.lido.fi#p-17086-values-and-decision-making-approach-6\"></a>Values and Decision-Making Approach</h2>\n<h3><a name=\"p-17086-long-term-value-creation-over-short-term-opportunism-7\" class=\"anchor\" href=\"https://research.lido.fi#p-17086-long-term-value-creation-over-short-term-opportunism-7\"></a>Long-term value creation over short-term opportunism.</h3>\n<p>For example, we do not support short-term rent-seeking token distribution programs; or the redistribution of tokens that carry no positive second-order effects.</p>\n<p>In contrast, we do support and encourage purpose-driven mechanisms that incentivize positive behaviour and are value-maximizing; or that improve alignment between token holders and the protocol.</p>\n<h3><a name=\"p-17086-transparency-alignment-and-proactivity-8\" class=\"anchor\" href=\"https://research.lido.fi#p-17086-transparency-alignment-and-proactivity-8\"></a>Transparency, alignment, and proactivity.</h3>\n<p>We are proactive in providing clear and consistent reasoning behind our decision-making and proposals, ensuring the protocol’s sustainability is at the heart of all governance discussions.</p>\n<h3><a name=\"p-17086-objective-data-driven-decision-making-9\" class=\"anchor\" href=\"https://research.lido.fi#p-17086-objective-data-driven-decision-making-9\"></a>Objective data-driven decision-making.</h3>\n<p>We use data and research to ensure our final decision is objectively value-accretive for the protocol.</p>\n<h2><a name=\"p-17086-public-acceptance-10\" class=\"anchor\" href=\"https://research.lido.fi#p-17086-public-acceptance-10\"></a>Public Acceptance</h2>\n<p>We accept Lido’s <a href=\"https://ipfs.io/ipfs/QmPwqjn5NiNVFKjxxBnYHivgempeyNNpMNotGYMCXitRd3\" rel=\"noopener nofollow ugc\">Public Delegate Code of Conduct</a> and our Public Delegate Platform signals our alignment with the <a href=\"https://research.lido.fi/t/lido-dao-vibe-alignment-purpose-mission-vision/4380\">mission, vision, and purpose of Lido DAO</a>.</p>\n<h2><a name=\"p-17086-disclosures-11\" class=\"anchor\" href=\"https://research.lido.fi#p-17086-disclosures-11\"></a>Disclosures</h2>\n<p>Wintermute participates in various DAOs across the DeFi ecosystem including dYdX, Optimism, Arbitrum, Aave, Compound, Uniswap, and other smaller DAOs. Furthermore, Wintermute Ventures is an active investor across the ecosystem. We will always make appropriate disclosures and remove ourselves from voting when necessary.</p>\n<p>You can follow the majority of Wintermute’s voting activity across various DAOs <a href=\"https://boardroom.io/voter/0xB933AEe47C438f22DE0747D57fc239FE37878Dd1\" rel=\"noopener nofollow ugc\">here</a>.</p>\n            <p><small>1 post - 1 participant</small></p>\n            <p><a href=\"https://research.lido.fi/t/wintermute-governance-delegate-thread/8131\">Read full topic</a></p>","link":"https://research.lido.fi/t/wintermute-governance-delegate-thread/8131","pubDate":"Fri, 16 Aug 2024 07:06:19 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"research.lido.fi-topic-8131"},"source":{"@url":"https://research.lido.fi/t/wintermute-governance-delegate-thread/8131.rss","#text":"Wintermute Governance Delegate Thread"}},{"title":"Staked lido from ledger, money is there, but when I went to withdraw, I was never issued STETH so how do I get my money out?","dc:creator":"Lipmister1","category":"Start Here","description":"<p>I would just like to talk to somebody from Lido on how I’m supposed to get my money out. I understand I I’ve read multiple times but I need STEH I have 32 Ethereum in my account, but I can’t take it out. How do I do this, if I was never issued sTETH what do I do?</p>\n            <p><small>1 post - 1 participant</small></p>\n            <p><a href=\"https://research.lido.fi/t/staked-lido-from-ledger-money-is-there-but-when-i-went-to-withdraw-i-was-never-issued-steth-so-how-do-i-get-my-money-out/8107\">Read full topic</a></p>","link":"https://research.lido.fi/t/staked-lido-from-ledger-money-is-there-but-when-i-went-to-withdraw-i-was-never-issued-steth-so-how-do-i-get-my-money-out/8107","pubDate":"Thu, 15 Aug 2024 15:48:16 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"research.lido.fi-topic-8107"},"source":{"@url":"https://research.lido.fi/t/staked-lido-from-ledger-money-is-there-but-when-i-went-to-withdraw-i-was-never-issued-steth-so-how-do-i-get-my-money-out/8107.rss","#text":"Staked lido from ledger, money is there, but when I went to withdraw, I was never issued STETH so how do I get my money out?"}},{"title":"Latest Updates and Plans Regarding Lido Restaking","dc:creator":"Alexandra","category":"General","description":"<p>In recent months, the topic of restaking has generated significant interest within the crypto space, and I would like to inquire about any news or plans related to the implementation of this feature within the Lido ecosystem. Are there any updates being discussed within the community regarding restaking?</p>\n<p>I am particularly interested in the following questions:</p>\n<ol>\n<li>\n<p><strong>Plans</strong>: Does the team or community have any plans to implement restaking on the existing protocols? If so, how does it fit into Lido ecosystem?</p>\n</li>\n<li>\n<p><strong>Technical Implementation</strong>: Have the technical aspects of restaking been discussed, and are there any prototypes or ideas on how this could be realized within Lido?</p>\n</li>\n<li>\n<p><strong>Benefits and Risks</strong>: How does the community assess the potential benefits of restaking for users and stETH holders?</p>\n</li>\n</ol>\n<p>I would greatly appreciate any information, links to resources, or participation in the discussion.</p>\n<p>Thank you in advance for your responses and contributions to this discussion!</p>\n            <p><small>1 post - 1 participant</small></p>\n            <p><a href=\"https://research.lido.fi/t/latest-updates-and-plans-regarding-lido-restaking/8106\">Read full topic</a></p>","link":"https://research.lido.fi/t/latest-updates-and-plans-regarding-lido-restaking/8106","pubDate":"Thu, 15 Aug 2024 15:31:36 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"research.lido.fi-topic-8106"},"source":{"@url":"https://research.lido.fi/t/latest-updates-and-plans-regarding-lido-restaking/8106.rss","#text":"Latest Updates and Plans Regarding Lido Restaking"}},{"title":"WhitePaper Reading Club Delegate Thread","dc:creator":"katashesolutions","category":"Delegate Platform","description":"<h3><a name=\"p-17040-wprc-lido-dao-delegate-proposal-submission-1\" class=\"anchor\" href=\"https://research.lido.fi#p-17040-wprc-lido-dao-delegate-proposal-submission-1\"></a>WPRC LIDO DAO Delegate Proposal Submission</h3>\n<h3><a name=\"p-17040-contact-information-2\" class=\"anchor\" href=\"https://research.lido.fi#p-17040-contact-information-2\"></a>Contact Information:</h3>\n<ul>\n<li>Ethereum Address: 0x8Ab6612BbcF7E133A6BB03b3264718d30f25e0BA, stakesaurus.eth</li>\n<li>Website: <a href=\"https://www.thewhitepaperreading.club/\" rel=\"noopener nofollow ugc\">https://www.thewhitepaperreading.club/</a></li>\n<li>Twitter: <a href=\"https://x.com/wpreadingclub\" rel=\"noopener nofollow ugc\">@WPReadingClub</a></li>\n<li>Discord: <a href=\"https://discord.gg/gBeZFfwX\" class=\"inline-onebox\" rel=\"noopener nofollow ugc\">Whitepaper Reading Club</a></li>\n<li><a href=\"https://t.me/+zgBmB9fIrMIxMDM9\" class=\"inline-onebox\" rel=\"noopener nofollow ugc\">Telegram: Join Group Chat</a></li>\n</ul>\n<h3><a name=\"p-17040-introduction-to-wprc-3\" class=\"anchor\" href=\"https://research.lido.fi#p-17040-introduction-to-wprc-3\"></a>Introduction to WPRC</h3>\n<p>The <a href=\"https://www.thewhitepaperreading.club/\" rel=\"noopener nofollow ugc\">Whitepaper Reading Club (WPRC)</a> is a collective of Web3 veterans, enthusiasts, engineers, and thinkers united by a shared curiosity to explore the mechanics driving the Web3 revolution. We aim to create a space that fosters deep, technical discussions on whitepapers without the distractions of promotional content. Our mission is to build a community where healthy debate and rigorous analysis of Web3 technologies thrive.</p>\n<p><strong>Key Working Group Members For This Proposal:</strong></p>\n<ul>\n<li>Katherine Ng: Founder and Managing Partner of <a href=\"https://katashe.co\" rel=\"noopener nofollow ugc\">Katashe Solutions</a>, Secretary General of <a href=\"https://www.access.org.sg/\" rel=\"noopener nofollow ugc\">ACCESS</a>. Essay on crypto governance here: <a href=\"https://www.katherineng.com/p/the-road-to-crypto-governance\" class=\"inline-onebox\" rel=\"noopener nofollow ugc\">The road to crypto governance - Katherine Ng</a></li>\n<li>Samuel Chong aka <a href=\"https://www.stakesaurus.com/\" rel=\"noopener nofollow ugc\">Stakesaurus</a>: ETH Home Staker maker &amp; Lido Community Lifeguard</li>\n<li>Joseph Low, Metagov/DAOStar Researcher</li>\n<li><em>Additional members to be added on a rolling basis based on active contributions.</em></li>\n</ul>\n<h3><a name=\"p-17040-motivation-4\" class=\"anchor\" href=\"https://research.lido.fi#p-17040-motivation-4\"></a>Motivation</h3>\n<p>The Whitepaper Reading Club (WPRC) is positioned to make meaningful contributions to Lido DAO, aligned with its mission to establish Ethereum as a critical layer for coordination and value creation on the internet.</p>\n<p>Our values and coordination mechanisms are aligned with the Ethereum Foundation’s Infinite Garden philosophy, which advocates for nurturing a decentralized ecosystem through collective community effort. We embrace and align with the Infinite Garden philosophy as a community through:</p>\n<ol>\n<li><strong>Enhancing the Quality of Discussions and Feedback:</strong> Our practice in producing detailed analyses on whitepaper and DAO proposals for each of our WPRC sessions aligns with Lido DAO’s objective of improving the quality of discussions and feedback. WPRC’s rigorous approach ensures that proposals are thoroughly evaluated, leading to more informed and effective decision-making.</li>\n<li><strong>Nurturing Knowledge:</strong> We focus on fostering knowledge and healthy debate, emphasising the importance of cultivating rather than controlling the ecosystem. This approach supports the long-term health of the network, promoting resilience and ongoing learning within the community.</li>\n<li><strong>Ecosystem-Agnostic, Independent Perspectives:</strong> WPRC is composed of Web3 veterans, engineers, and thinkers—ranging from experienced contributors to newcomers in the Ethereum ecosystem—who engage in structured, thoughtful discussions on whitepapers across the entire Web3 landscape. Our approach is ecosystem-agnostic and maintains a neutral lens, fostering open dialogue that encourages the generation of new ideas and innovations. We believe that these discussions play a critical role in enhancing both the sustainability and the evolution of the broader Ethereum ecosystem.</li>\n<li><strong>Continuous Improvement:</strong> Our discussions are designed to contribute to an ecosystem’s continuous improvement, with a focus on long-term outcomes rather than immediate gains.</li>\n<li><strong>Organic Community Growth:</strong> WPRC’s growth from a small group to a robust community of over 250 people has been entirely organic, driven by the quality and relevance of our discussions. This growth reflects our ability to engage members without resorting to promotion, maintaining a focus on substantive contributions.</li>\n<li><strong>Increasing Active Voting Participation:</strong> WPRC encourages active engagement among its members, with a selection of core working group members nominated in this paper who are prepared to participate in Lido DAO’s governance. By facilitating informed discussions, we help ensure a higher rate of active and meaningful voting participation, directly supporting Lido DAO’s governance goals.</li>\n<li><strong>Attracting and Activating New Token Holders:</strong> WPRC’s open and inclusive culture demystifies complex governance issues, attracting new participants to Lido DAO. By fostering understanding and promoting insightful discussions, we help promote more active DAO governance, encouraging broader participation and informed decision-making.</li>\n<li><strong>Providing Web3 Expertise and Advisory:</strong> With members skilled in governance, blockchain tech, community growth, and more, WPRC offers valuable insights that can guide Lido DAO’s strategic direction and governance practices, aligning with the DAO’s aspirations for expert feedback and advisory.</li>\n<li><strong>Supporting Innovation in Commons and Public Goods Funding:</strong> Our exploration of new models for funding public goods can help Lido DAO lead in promoting sustainable, community-driven solutions, contributing to the broader Ethereum ecosystem’s health and sustainability.</li>\n<li><strong>Strengthen Community and Wider Ecosystem Ties:</strong> WPRC’s commitment to open, neutral, and inclusive dialogue strengthens ties not only within the Ethereum ecosystem but also with projects beyond it that are active in governance. By fostering collaboration and cross-pollination of ideas across various blockchain ecosystems, we help build a more cohesive, resilient and censorship resistant network through Proof of Stake, Proof of Governance, and beyond with the Lido DAO.</li>\n</ol>\n<p>In conclusion, WPRC seeks to become a delegate within Lido DAO to bring informed insights and align with the core values that define Ethereum and its community. Our goal is to enhance the quality of governance proposals, increase active voting participation, and foster more diverse community engagement. We are motivated by the belief that inclusive, informed discussions are crucial for the health and growth of all Web3 ecosystems. By providing a structured platform for holistic analysis of blockchain technologies and governance mechanisms across various disciplines, WPRC is poised to contribute meaningfully to Lido DAO’s governance efforts.</p>\n<h3><a name=\"p-17040-values-and-decision-making-approach-5\" class=\"anchor\" href=\"https://research.lido.fi#p-17040-values-and-decision-making-approach-5\"></a>Values and Decision-Making Approach</h3>\n<p>WPRC’s Core Values are established as below:</p>\n<ul>\n<li><strong>Integrity:</strong> We are committed to maintaining the highest standards of honesty and ethical behavior in all our discussions.</li>\n<li><strong>Focus:</strong> Our discussions are strictly centered around the content of the whitepapers, ensuring that the dialogue remains on-topic and productive.</li>\n<li><strong>No Promotion:</strong> We maintain a strict policy against the promotion of projects or events within our discussions.</li>\n<li><strong>Permissionless Participation:</strong> We believe in the inclusivity of our community, allowing anyone with a genuine interest to participate.</li>\n<li><strong>Healthy Debate:</strong> We encourage open dialogue and the challenging of assumptions, ensuring a dynamic and engaging environment.</li>\n</ul>\n<p><strong>Decision-Making Process:</strong> WPRC operates on a democratic basis where all members have the opportunity to contribute to discussions and decisions. Paper selections are made through community voting, and decisions are taken with the collective input of all active members. The reading process is as follows:</p>\n<ul>\n<li>Paper Selection: Members propose whitepapers, and the community votes to select two for each session.</li>\n<li>Meetings: We meet every 2-3 weeks, beginning with a 10-minute reading period, followed by a roundtable discussion.</li>\n<li>Discussion Focus: Our sessions are centered solely on the whitepapers, strictly avoiding any promotional content.</li>\n</ul>\n<p>Based on our existing decision-making process which has proven to create productive discussions around whitepapers and DAO proposals, we propose to extend this discussion format to deliberating on important decisions to be made in Lido DAO. We believe that our collective approach and healthy debate will lead to both sustained and well-considered contributions to decision-making in the DAO.</p>\n<h3><a name=\"p-17040-public-acceptance-6\" class=\"anchor\" href=\"https://research.lido.fi#p-17040-public-acceptance-6\"></a>Public Acceptance</h3>\n<p>WPRC accepts and aligns <a href=\"https://github.com/lidofinance/core/blob/master/CODE_OF_CONDUCT.md\" rel=\"noopener nofollow ugc\">the Lido Public Delegate Code of Conduct</a> and commits to being aligned with <a href=\"https://research.lido.fi/t/lido-dao-vibe-alignment-purpose-mission-vision/4380\">Purpose/Mission/Values of Lido DAO</a>. Our commitment is to contribute to the DAO with integrity, transparency, and a focus on fostering a deep understanding of the technologies that underpin the Web3 ecosystem.</p>\n<h3><a name=\"p-17040-disclosures-7\" class=\"anchor\" href=\"https://research.lido.fi#p-17040-disclosures-7\"></a>Disclosures</h3>\n<p>Our contributors come from diverse backgrounds from industry, to government and to academia. As a collective where decisions made are based on healthy debate and discussions, WPRC members are already encouraged to disclose any potential conflicts of interest during our discussions. As of now, no significant conflicts of interest have been identified that would affect our contributions to the DAO.</p>\n            <p><small>1 post - 1 participant</small></p>\n            <p><a href=\"https://research.lido.fi/t/whitepaper-reading-club-delegate-thread/8100\">Read full topic</a></p>","link":"https://research.lido.fi/t/whitepaper-reading-club-delegate-thread/8100","pubDate":"Thu, 15 Aug 2024 07:53:04 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"research.lido.fi-topic-8100"},"source":{"@url":"https://research.lido.fi/t/whitepaper-reading-club-delegate-thread/8100.rss","#text":"WhitePaper Reading Club Delegate Thread"}},{"title":"Eboadom Delegate Thread","dc:creator":"eboadom","category":"Delegate Platform","description":"<h2><a name=\"p-17009-delegate-information-1\" class=\"anchor\" href=\"https://research.lido.fi#p-17009-delegate-information-1\"></a>Delegate information</h2>\n<p><strong>Name</strong>: eboadom (Ernesto)</p>\n<p><strong>Forum handle</strong>: <a href=\"https://research.lido.fi/u/eboadom\">eboadom</a></p>\n<p><strong>Twitter</strong>: <a href=\"https://twitter.com/eboadom\">eboadom</a></p>\n<br>\n<h2><a name=\"p-17009-introduction-2\" class=\"anchor\" href=\"https://research.lido.fi#p-17009-introduction-2\"></a>Introduction</h2>\n<p>I’m Ernesto, co-founder of <a href=\"https://x.com/bgdlabs\">BGD Labs</a>, the main contributor/service provider on protocol development of the Aave DAO.<br>\nBefore that, I was CTO at Aave Companies (currently Avara Labs), where I participated in the creation and maintenance of the early Aave ecosystem.</p>\n<br>\n<h2><a name=\"p-17009-motivation-values-and-decision-making-3\" class=\"anchor\" href=\"https://research.lido.fi#p-17009-motivation-values-and-decision-making-3\"></a>Motivation, values and decision making</h2>\n<p>Why I think my participation in this Lido’s delegate program makes sense:</p>\n<ul>\n<li>\n<p>For any new delegate program, involving parties with deep hands-on experience on successful existing DAOs is in my opinion a huge benefit. I have been participating on all stages of the Aave DAO, from inception to a relatively good maturity at the current moment. Also, I contributed to the majority of the DAO verticals: from high-level discussions regarding DAO strategy and decentralisation, to low level implementation, passing through all types of operational aspects.<br>\nMy profile on the Aave governance forum is <a href=\"https://governance.aave.com/u/eboado\">THIS</a>.</p>\n</li>\n<li>\n<p>I have important technical expertise in DeFi, governance systems and, in general, everything blockchain related. That means that 1) my opinions and decisions will have a rational base and 2) probably I can give meaningful operation feedback regarding both procedures and technology surrounding Lido.<br>\nAmongst others, on BGD Labs we created the Aave Governance v3 system, currently powering on-chain the Aave DAO. Also, we developed a.DI, bridging infrastructure <a href=\"https://research.lido.fi/t/network-expansion-workgroup-initiative-governance-decision-forwarding-to-non-l2-networks-lip-24/7446\">currently used by Lido</a> to forward governance decisions to non-Ethereum networks.<br>\nFinally, we have an active role reviewing the majority of all proposals created on the Aave governance, and designed all tooling and procedures surrounding them.</p>\n</li>\n<li>\n<p>My main interest for participating in the program is because I’m aware of the good values of the Lido contributors I interacted with: aside from high technical competence, I perceive a clear focus within Lido on evolving its ecosystem in a way that benefits not only Lido as expected, but the industry itself.</p>\n</li>\n<li>\n<p>I believe I am a very neutral party: I like the ethos and approach of Lido and even if I see no reason for that to happen, if I perceive clear derailing from them in the future, will stop being a delegate. Same time, I will not compromise my neutrality by participating in anything going clearly against Lido DAO’s interests.</p>\n</li>\n<li>\n<p>Lastly, I compromise to seriously participate on the governance processes of Lido, including voting itself, but also discussions in this forum and providing rationales about my voting.</p>\n</li>\n</ul>\n<br>\n<h2><a name=\"p-17009-public-acceptance-4\" class=\"anchor\" href=\"https://research.lido.fi#p-17009-public-acceptance-4\"></a>Public acceptance</h2>\n<p>I accept Lido DAO delegate Сode of Сonduct (<a href=\"https://ipfs.io/ipfs/QmPwqjn5NiNVFKjxxBnYHivgempeyNNpMNotGYMCXitRd3\">link</a>) and Aligned with <a href=\"https://snapshot.org/#/lido-snapshot.eth/proposal/0x739fbe56425d355b5e41c22bb346b7a8217afd9e84aa49863648b1c641a482e3\">Lido’s Vibe (Purpose, Mission, Vision)</a>.</p>\n<br>\n<h2><a name=\"p-17009-disclosures-5\" class=\"anchor\" href=\"https://research.lido.fi#p-17009-disclosures-5\"></a>Disclosures</h2>\n<p>Through BGD Labs, I’m currently an active contractual contributor to the Aave ecosystem, which should not create any type of conflict, as Aave and Lido have been pretty close partners since the very beginning.<br>\nAdditionally, I own $AAVE and other assets, but that should not have any type of influence in my Lido participation.<br>\nI expect that specific technical Lido contributors review the contents of governance proposals, and I assume no liability if those contents create damage I was not aware of.</p>\n            <p><small>1 post - 1 participant</small></p>\n            <p><a href=\"https://research.lido.fi/t/eboadom-delegate-thread/8079\">Read full topic</a></p>","link":"https://research.lido.fi/t/eboadom-delegate-thread/8079","pubDate":"Wed, 14 Aug 2024 11:11:34 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"research.lido.fi-topic-8079"},"source":{"@url":"https://research.lido.fi/t/eboadom-delegate-thread/8079.rss","#text":"Eboadom Delegate Thread"}},{"title":"Idea of Solo Staking Loyalty Points (SSLP)","dc:creator":"nana","category":"General","description":"<h2><a name=\"p-17002-abstract-1\" class=\"anchor\" href=\"https://research.lido.fi#p-17002-abstract-1\"></a>Abstract</h2>\n<p>This post focuses on the issue of solo stakers quitting staking and joining Staking Service Providers (SSPs) as liquidity and cost structures improve through SSPs. As one of the solutions to a future where the staking market becomes centralized and imposes an inflation tax on users, we propose a community-based approach for solo stakers called Solo Staking Loyalty Points (SSLP) firming. Combining SSLP with the CSM module improves solo staker liquidity and reduces capital efficiency, adding an incentive for solo stakers to contribute honestly in the long term.</p>\n<h2><a name=\"p-17002-problem-2\" class=\"anchor\" href=\"https://research.lido.fi#p-17002-problem-2\"></a>Problem</h2>\n<ul>\n<li>Solo stakers are under selection pressure</li>\n</ul>\n<p>Delegated stakers may flatten the supply curve, inducing an upward trend in staking volume and forcing users to pay more costs than necessary. If the supply curve flattens, delegated stakers will be induced to take all by winners, and it may be more rational for solo stakers to transition to delegated stakers.</p>\n<p>There are two reasons for this situation:</p>\n<ol>\n<li>Benefit: Liquidity is improved by Liquid Staking Tokens (LST)</li>\n</ol>\n<ul>\n<li>Endogenous yield y: The endogenous return obtained only by staking in consensus is the sum of issuance reward y_i and execution reward y_v (y_i + y_v).</li>\n<li>Exogenous yield y_c: The exogenous return from DeFi and restaking generated by LST has a total yield of y_c.</li>\n<li>Total yield Y: The sum of the staker’s total return introspective yield and exogenous return (y + y_c). Staking will not occur unless the total return Y (= y + y_c) is higher than a certain threshold Y_c at which there is a desire to lock.</li>\n</ul>\n<p>For example, assume that an ETH holder is willing to lock ETH when the total return Y exceeds 0.04. The situation in which a staker will lock the ETH they hold is:</p>\n<p>Y &gt; Y_c</p>\n<p>If we substitute 0.04 for Y_c:</p>\n<p>y + y_c &gt; 0.04</p>\n<p>This shows that the higher the value of y_c, the lower the introspective yield y_i required for staking can be, and vice versa.</p>\n<ol start=\"2\">\n<li>Cost: The cost structure is simplified, including the reduction in capital efficiency (staking is possible even with less than 32 ETH) and long-term commitment.</li>\n</ol>\n<ul>\n<li>Initial cost: The cost required at the start of staking. Generally, it includes technical skills, hardware, and collateral capital.</li>\n<li>Long-term cost: The long-term cost of protecting the locked ETH, the reduction in liquidity due to locking, taxes, and increased risk premium. This can also be seen as the time cost of updates, the high-speed line and data capacity for additional Internet connections, and the ongoing commitment of accurately exercising the protocol’s work.</li>\n</ul>\n<p>Long-term costs are likely to influence stakers’ ongoing decisions more than initial costs. Solo stakers bear all costs themselves. In the case of SSPs, the cost structure differs depending on the node operator and the participant (ETH holder).</p>\n<ul>\n<li>SSP node operators have a fixed cost for staking and receive a portion of the revenue earned by participants as a fee. In situations where costs are high and revenues are low, they can increase efficiency by reducing the number of nodes and increasing the number of validators on each node.</li>\n<li>Participants only delegate the amount of stake to the node operator, so there are no costs, but instead they pay a portion of the revenue as a fee. Since the issuance of LST does not affect the decrease in liquidity, the fees paid may not feel like a cost.</li>\n</ul>\n<p>In this way, costs are equally borne by solo stakers and node operators, but the cost for users participating in SSPs is low. Since the barriers to solo staking are replaced by the SSP operator, users who use SSPs do not have a large increase in the costs required to make additional staking. In addition, if they can receive LST, liquidity increases, they can access additional yields, and there is no need for long-term commitments.</p>\n<p>As staking service providers simplify the staking experience (cost structure) and improve staking liquidity, the inequality Y &gt; Y_c’ becomes more likely to hold even if the introspective yield y becomes smaller.</p>\n<p>As a result, the amount of staked is induced to tend to increase, and more ETH than necessary is staked. The effect is that the protocol issues more rewards than necessary for security, forcing users to pay inflation taxes. Also, in a world where a lot of ETH is staked, solo stakers who do not have access to the exogenous yield y_c are at an even greater disadvantage.</p>\n<p>It is important for Ethereum to consider maintaining solo stakers, as they contribute greatly to the censorship resistance of the network.</p>\n<p>The community is discussing <a href=\"https://ethresear.ch/t/properties-of-issuance-level-consensus-incentives-and-variability-across-potential-reward-curves/18448\" rel=\"noopener nofollow ugc\">Cut Issuance</a>, <a href=\"https://ethresear.ch/t/dr-changestuff-or-how-i-learned-to-stop-worrying-and-love-mev-burn/17384\" rel=\"noopener nofollow ugc\">MEV-burn</a>, <a href=\"https://ethresear.ch/t/unbundling-staking-towards-rainbow-staking/18683\" rel=\"noopener nofollow ugc\">Rainbow Staking</a>, and other ideas that target MVI. I am optimistic about these ideas, but there are complex tradeoffs, so in the short term I would like to look at simple solutions such as Lido’s CSM and Smoothing Pool as well.</p>\n<p>Lido’s CSM module is designed to significantly lower the node operation profitability and entry barrier for individual stakers by depositing about 2 ETH as collateral to Lido on Ethereum after creating the deposit data, and 32 ETH is assigned to the deposit key.</p>\n<p>At this time, the profits from node operation are distributed equally among validators who participated in attestations a certain threshold number of times according to the number of validators who operate each person’s rewards. In other words, it is likely that rewards earned by Curated Modules (36 professional node operators commissioned by Lido, such as Kiln) through MEV maximization, etc., are often returned to CSM participants. Thanks to this mechanism, even individual stakers can earn greater profits than with an individual 32 ETH stake.</p>\n<p>As a result, the CSM module opens the path to validators to more potential individual stakers, bringing decentralization and diversity to LoE validators. Solo Staking Loyalty Points (SSLP) firming is an additional idea based on CSM, and its purpose is to further contribute to the maintenance of solo stakers. In the short term, increasing the number of solo stakers through mechanisms such as the CSM module is important for improving the censorship resistance of the network.</p>\n<p>So, in addition to the MEV Smoothing pool mechanism such as the CSM module, I would like to consider ideas to incentivize solo stakers to behave honestly for a long time.</p>\n<h2><a name=\"p-17002-so-what-to-do-3\" class=\"anchor\" href=\"https://research.lido.fi#p-17002-so-what-to-do-3\"></a>So what to do?</h2>\n<ul>\n<li>Pointize access to variable rewards (MEV + Fee)</li>\n</ul>\n<p>Solo stakers earn Loyalty Points. Points should measure the period a solo staker has been active and the validity of their attestations.</p>\n<p>Points accumulate over specific periods and are transferable. Points can be exchanged for variable rewards. However, the number of SSLPs earned increases in proportion to the length of time active. 1 month → 10 points, 2 months → 12.5 points, 3 months → 15 points…, n.</p>\n<p>The exchange of pooled variable rewards for points is designed with a base exchange rate called the pool base reward, and a weighting that increases proportionally to the number of points held. This provides an additional incentive for solo stakers to contribute to the network for a long time and continue earning SSLPs. Example: 10 points → pool base reward * 1, 20 points → pool base reward * 1.1, 30 points → pool base reward * 1.2,…n.</p>\n<p>These two simple mechanisms - awarding points for long-term honest behavior and increasing the access rate to variable rewards based on the number of points held - create a system where solo stakers can earn higher profits/year by contributing honestly to the network for a long time, accumulating points, and exchanging a large number of points for variable rewards at once, rather than accumulating points in a short period to access variable rewards.</p>\n<p>A simple prediction is that demand for trading points themselves may emerge. Solo stakers who want to earn variable rewards in the short term might be able to earn higher rewards than the pool base reward by exchanging points for tokens in the market, rather than exchanging points for variable rewards. Point buyers have an incentive to collect points, as the weighting of the exchange rate increases as they accumulate points.</p>\n<p>Increasing the incentive to earn points may lead to a tendency to become solo stakers and collect points.</p>\n<p>Overall, the point mechanism offers the following benefits:</p>\n<ul>\n<li>Improved liquidity: While solo staking cannot improve liquidity like LSTs, points may have a similar effect.</li>\n<li>Cost improvement: By integrating with the CSM module, solo staking becomes possible with 2ETH, lowering the capital requirements for short-term costs.</li>\n<li>Compatibility with the roadmap: As an additional idea, receiving SBTs along with SSLPs from the protocol to identify solo stakers could be beneficial, as it may allow for preferential treatment for solo stakers from consensus in the medium to long term.</li>\n</ul>\n<p>By incorporating a point mechanism into the CSM module in this way, liquidity can be improved and the cost structure can be enhanced, which may lead to an increase in solo stakers. The only barrier to becoming a solo staker will be the long-term cost.</p>\n<h2><a name=\"p-17002-concerns-4\" class=\"anchor\" href=\"https://research.lido.fi#p-17002-concerns-4\"></a>Concerns</h2>\n<ul>\n<li>At what rate will points be awarded?</li>\n<li>How will the pool base reward be calculated when exchanging for variable rewards?</li>\n<li>How will the pool base reward be weighted by points?</li>\n<li>Can it really increase the execution reward y_v of solo stakers?</li>\n<li>Will it really be exchanged in the market at a higher price than the pool base reward?</li>\n<li>Can solo stakers using CSM truly fulfill their role as solo stakers? Are CSM stakers solo stakers?</li>\n</ul>\n<p>I would love to discuss what the community thinks about the simple idea.</p>\n<ul>\n<li><a href=\"https://ethresear.ch/t/faq-ethereum-issuance-reduction/\" class=\"inline-onebox\" rel=\"noopener nofollow ugc\">FAQ: Ethereum issuance reduction - Economics - Ethereum Research</a></li>\n<li><a href=\"https://ethresear.ch/t/endgame-staking-economics-a-case-for-targeting/\" class=\"inline-onebox\" rel=\"noopener nofollow ugc\">Endgame Staking Economics: A Case for Targeting - Economics - Ethereum Research</a></li>\n<li><a href=\"https://ethresear.ch/t/properties-of-issuance-level-consensus-incentives-and-variability-across-potential-reward-curves/18448\" class=\"inline-onebox\" rel=\"noopener nofollow ugc\">Properties of issuance level: consensus incentives and variability across potential reward curves - Economics - Ethereum Research</a></li>\n<li><a href=\"https://ethresear.ch/t/unbundling-staking-towards-rainbow-staking/18683\" class=\"inline-onebox\" rel=\"noopener nofollow ugc\">Unbundling staking: Towards rainbow staking - Economics - Ethereum Research</a></li>\n<li><a href=\"https://ethresear.ch/t/dr-changestuff-or-how-i-learned-to-stop-worrying-and-love-mev-burn/17384\" class=\"inline-onebox\" rel=\"noopener nofollow ugc\">Dr. changestuff or: how i learned to stop worrying and love mev-burn - Proof-of-Stake - Ethereum Research</a></li>\n</ul>\n            <p><small>4 posts - 2 participants</small></p>\n            <p><a href=\"https://research.lido.fi/t/idea-of-solo-staking-loyalty-points-sslp/8077\">Read full topic</a></p>","link":"https://research.lido.fi/t/idea-of-solo-staking-loyalty-points-sslp/8077","pubDate":"Wed, 14 Aug 2024 06:47:36 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"research.lido.fi-topic-8077"},"source":{"@url":"https://research.lido.fi/t/idea-of-solo-staking-loyalty-points-sslp/8077.rss","#text":"Idea of Solo Staking Loyalty Points (SSLP)"}},{"title":"Proposal: Inclusion of SecureRPC.com MEV Relay as a Mandatory Relay in Lido's MEV Relay List","dc:creator":"sambacha","category":"Proposals","description":"<h1><a name=\"p-16991-proposal-inclusion-of-securerpccom-mev-relay-as-a-mandatory-relay-in-lidos-mev-relay-list-1\" class=\"anchor\" href=\"https://research.lido.fi#p-16991-proposal-inclusion-of-securerpccom-mev-relay-as-a-mandatory-relay-in-lidos-mev-relay-list-1\"></a>Proposal: Inclusion of <a href=\"http://SecureRPC.com\" rel=\"noopener nofollow ugc\">SecureRPC.com</a> MEV Relay as a Mandatory Relay in Lido’s MEV Relay List</h1>\n<h2><a name=\"p-16991-overview-2\" class=\"anchor\" href=\"https://research.lido.fi#p-16991-overview-2\"></a>Overview</h2>\n<p>This proposal suggests the inclusion of the <a href=\"http://SecureRPC.com\" rel=\"noopener nofollow ugc\">SecureRPC.com</a> MEV Relay operated by Manifold Finance as a mandatory relay in Lido’s MEV Relay list, according to the guidelines set forth in LIP-17. Currently the SecureRPC relay is considered an optional relay. This is because of a security incident it was ‘downgraded’ even after repayment was made back to the Lido DAO. Currently, no other relay offers any sort of indemnity against losses, however SecureRPC has a new ‘Captive Insurance’ pool to provide renumeration for service outages. By integrating <a href=\"http://SecureRPC.com\" rel=\"noopener nofollow ugc\">SecureRPC.com</a> into Lido’s infrastructure, Lido DAO can enhance the security and efficiency of the network’s MEV processes, as the relay is both non-filtering and non-optimistic, unlike any of the current relays that are in mandatory usage. The relay’s non-filtering nature aligns with Lido’s commitment to maintaining a decentralized and permissionless ecosystem.</p>\n<h3><a name=\"p-16991-context-and-rationale-3\" class=\"anchor\" href=\"https://research.lido.fi#p-16991-context-and-rationale-3\"></a>Context and Rationale</h3>\n<p>LIP-17 establishes the allowed list of MEV Boost relays that are considered safe and reliable for inclusion in Lido’s infrastructure. This proposal advocates for the <a href=\"http://SecureRPC.com\" rel=\"noopener nofollow ugc\">SecureRPC.com</a> relay to be added to this list and marked as “mandatory.” The following reasons justify this addition:</p>\n<ol>\n<li>\n<p><strong>Security and Integrity</strong>: The <a href=\"http://SecureRPC.com\" rel=\"noopener nofollow ugc\">SecureRPC.com</a> relay is operated by Manifold Finance, a trusted entity within the Ethereum community. Their relay ensures the integrity of MEV transactions by offering a secure, non-filtering relay, which aligns with Lido’s principles of transparency and security.</p>\n</li>\n<li>\n<p><strong>Operational Efficiency</strong>: The <a href=\"http://SecureRPC.com\" rel=\"noopener nofollow ugc\">SecureRPC.com</a> relay has demonstrated robust performance on both mainnet and holesky testnet, ensuring that it meets the rigorous standards required for integration into Lido’s MEV infrastructure.</p>\n</li>\n<li>\n<p><strong>Alignment with LIP-17</strong>: Adding <a href=\"http://SecureRPC.com\" rel=\"noopener nofollow ugc\">SecureRPC.com</a> as a mandatory relay is consistent with the principles outlined in LIP-17, which emphasizes the importance of selecting relays that contribute to a decentralized and efficient MEV ecosystem.</p>\n</li>\n</ol>\n<h4><a name=\"p-16991-mev-relay-parameters-4\" class=\"anchor\" href=\"https://research.lido.fi#p-16991-mev-relay-parameters-4\"></a>MEV Relay Parameters</h4>\n<p>For mainnet the following parameters are proposed for the <a href=\"http://SecureRPC.com\" rel=\"noopener nofollow ugc\">SecureRPC.com</a> MEV Relay:</p>\n<ul>\n<li><strong>URI</strong>: <code>https://0xad2c0074aa2bb6149340187906196f719bbac701a20d0cc88baefd2bbcc9fc970fb060d5eeb5fedf22024db6e69582da@mainnet-auction.securerpc.com</code></li>\n<li><strong>Operator</strong>: Manifold Finance</li>\n<li><strong>Is Mandatory</strong>: <code>true</code></li>\n<li><strong>Description</strong>: non-filtering</li>\n</ul>\n<h4><a name=\"p-16991-implementation-5\" class=\"anchor\" href=\"https://research.lido.fi#p-16991-implementation-5\"></a>Implementation</h4>\n<p>The implementation of this proposal requires the following steps:</p>\n<ol>\n<li>\n<p><strong>Authorization</strong>: An authorized address from the Lido DAO will execute the addition of the <a href=\"http://SecureRPC.com\" rel=\"noopener nofollow ugc\">SecureRPC.com</a> relay using the command <code>add_relay(0x2e21ecef)</code>.</p>\n</li>\n<li>\n<p><strong>Monitoring</strong>: After the relay is added, continuous monitoring will be conducted to ensure its performance aligns with Lido’s standards.</p>\n</li>\n<li>\n<p><strong>Reporting</strong>: Regular reports on the relay’s performance will be shared with the Lido community to maintain transparency.</p>\n</li>\n</ol>\n<h4><a name=\"p-16991-conclusion-6\" class=\"anchor\" href=\"https://research.lido.fi#p-16991-conclusion-6\"></a>Conclusion</h4>\n<p>Incorporating the <a href=\"http://SecureRPC.com\" rel=\"noopener nofollow ugc\">SecureRPC.com</a> MEV Relay as a mandatory relay in Lido’s infrastructure is a strategic move that enhances the security, reliability, and decentralization of Lido’s MEV operations. This proposal calls on the Lido DAO to approve the addition of the <a href=\"http://SecureRPC.com\" rel=\"noopener nofollow ugc\">SecureRPC.com</a> relay in accordance with LIP-17, thereby reinforcing Lido’s position as a leader in Ethereum staking and decentralized finance.</p>\n            <p><small>3 posts - 3 participants</small></p>\n            <p><a href=\"https://research.lido.fi/t/proposal-inclusion-of-securerpc-com-mev-relay-as-a-mandatory-relay-in-lidos-mev-relay-list/8073\">Read full topic</a></p>","link":"https://research.lido.fi/t/proposal-inclusion-of-securerpc-com-mev-relay-as-a-mandatory-relay-in-lidos-mev-relay-list/8073","pubDate":"Tue, 13 Aug 2024 21:37:46 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"research.lido.fi-topic-8073"},"source":{"@url":"https://research.lido.fi/t/proposal-inclusion-of-securerpc-com-mev-relay-as-a-mandatory-relay-in-lidos-mev-relay-list/8073.rss","#text":"Proposal: Inclusion of SecureRPC.com MEV Relay as a Mandatory Relay in Lido's MEV Relay List"}},{"title":"Sov - Delegate Thread","dc:creator":"Sov","category":"Delegate Platform","description":"<h2><a name=\"p-16983-contact-information-1\" class=\"anchor\" href=\"https://research.lido.fi#p-16983-contact-information-1\"></a>Contact Information</h2>\n<ul>\n<li>Name: Sov</li>\n<li>Delegate Address: sovereignsignal.eth</li>\n<li>Forum: <span class=\"mention\">@sovereignsignal</span></li>\n<li>Twitter: <span class=\"mention\">@sovereignsignal</span></li>\n<li>Discord: SovereignSignal</li>\n<li>Verification: <a href=\"https://www.tally.xyz/profile/sovereignsignal.eth\">Tally Profile</a></li>\n</ul>\n<h2><a name=\"p-16983-introduction-2\" class=\"anchor\" href=\"https://research.lido.fi#p-16983-introduction-2\"></a>Introduction</h2>\n<p>I am the Head of Grants at Gitcoin, leading BD, Partnerships, and Grant Operations across multiple ecosystems. My expertise lies in grant program management, ecosystem development, and strategic partnerships in the Web3 space. I bring an external perspective with deep cross-ecosystem experience in grants, incentives, and DAOs, which can provide valuable insights into Lido’s governance.</p>\n<h2><a name=\"p-16983-experience-3\" class=\"anchor\" href=\"https://research.lido.fi#p-16983-experience-3\"></a>Experience</h2>\n<ul>\n<li>Head of Grants at Gitcoin</li>\n<li>Optimism Grants Council Member</li>\n<li>Program Manager of the Cartographers Syndicate, the most high-context community of individuals in Web3 grants</li>\n<li>Over a decade of senior management experience running a profitable systems integrator before transitioning to Web3</li>\n<li>Former Board President of an innovative 501c3 Food Bank</li>\n<li>Successful grantee from Polygon, Aave, Ethereum Foundation, and Uniswap</li>\n<li>Active delegate for Gitcoin, Optimism, ENS, and Radicle</li>\n<li>Experience in governance across multiple DAOs</li>\n</ul>\n<h2><a name=\"p-16983-motivation-and-commitment-to-lido-dao-4\" class=\"anchor\" href=\"https://research.lido.fi#p-16983-motivation-and-commitment-to-lido-dao-4\"></a>Motivation and Commitment to Lido DAO</h2>\n<p>As an external expert with a comprehensive view of the grants and DAO landscape, I am committed to fulfilling the key expectations of a Lido DAO Incentivized Delegate:</p>\n<ol>\n<li><strong>Representing Token Holders:</strong></li>\n</ol>\n<ul>\n<li>I will read, analyze, and provide public feedback on Lido DAO proposals, ensuring that my actions and decisions align with the interests of token holders and the broader community.</li>\n<li>My decisions will be guided by Lido’s Purpose, Mission, and Vision, leveraging my cross-ecosystem experience to provide valuable insights.</li>\n</ul>\n<ol start=\"2\">\n<li><strong>Community Engagement and Transparency:</strong></li>\n</ol>\n<ul>\n<li>I commit to active participation in discussions on forums and other platforms, engaging the community on important decisions.</li>\n<li>I will conduct independent analyses of proposals and, when necessary, highlight the need for third-party analysis, drawing on my extensive network in the Web3 space.</li>\n</ul>\n<ol start=\"3\">\n<li><strong>Voting and Participation:</strong></li>\n</ol>\n<ul>\n<li>I pledge to vote in at least 70% of votes per quarter and actively participate in community update calls.</li>\n</ul>\n<ol start=\"4\">\n<li><strong>Expertise and Advisory:</strong></li>\n</ol>\n<ul>\n<li>I will provide expert advice in my areas of expertise, particularly in governance, grant programs, and ecosystem development, contributing to the strategic direction of the DAO.</li>\n</ul>\n<h2><a name=\"p-16983-objectives-and-values-5\" class=\"anchor\" href=\"https://research.lido.fi#p-16983-objectives-and-values-5\"></a>Objectives and Values</h2>\n<p>As a Lido DAO delegate, I commit to:</p>\n<ol>\n<li>Contribute to strategic resource allocation and development, aligning with Lido’s long-term goals.</li>\n<li>Promote best governance practices, drawing from my experience across other DAOs.</li>\n<li>Drive ecosystem growth through strategic collaborations and programs.</li>\n<li>Enhance Lido’s position in the staking market by leveraging my understanding of other ecosystems.</li>\n<li>Drive alignment with Ethereum’s principles, bridging Lido’s objectives with the broader Ethereum ecosystem.</li>\n</ol>\n<p>My approach is guided by:</p>\n<ul>\n<li>Balancing short-term objectives with long-term strategic vision</li>\n<li>Making informed decisions that benefit the entire Lido ecosystem</li>\n<li>Emphasizing sustainable growth, innovation, and decentralization</li>\n<li>Promoting active community engagement and cross-ecosystem collaboration</li>\n</ul>\n<h2><a name=\"p-16983-expertise-6\" class=\"anchor\" href=\"https://research.lido.fi#p-16983-expertise-6\"></a>Expertise</h2>\n<ul>\n<li>Governance: Extensive experience in DAOs and their governance models</li>\n<li>Business/Strategy: Proven skills in business development, strategic planning, and execution</li>\n<li>Program Management and Incentive Design</li>\n<li>Ecosystem Development and Partnership Building</li>\n<li>Cross-ecosystem collaboration</li>\n</ul>\n<h2><a name=\"p-16983-disclosures-7\" class=\"anchor\" href=\"https://research.lido.fi#p-16983-disclosures-7\"></a>Disclosures</h2>\n<ul>\n<li>Head of Grants at Gitcoin, overseeing partnerships and program development with various DAOs</li>\n<li>Delegate for Gitcoin, Optimism, ENS, and Radicle</li>\n<li>Member of the Optimism Grants Council</li>\n</ul>\n<p>I commit to maintaining objectivity in my role as a Lido delegate and will disclose any potential conflicts as they arise.</p>\n<h2><a name=\"p-16983-public-acceptance-8\" class=\"anchor\" href=\"https://research.lido.fi#p-16983-public-acceptance-8\"></a>Public Acceptance</h2>\n<p>I hereby accept and commit to following the Lido DAO Delegate Code of Conduct and align with Lido’s Purpose, Mission, and Vision.</p>\n<h2><a name=\"p-16983-waiver-of-liability-9\" class=\"anchor\" href=\"https://research.lido.fi#p-16983-waiver-of-liability-9\"></a>Waiver of Liability</h2>\n<p>By delegating to me, you acknowledge and agree that I will participate on a best-efforts basis and will not be liable for any damages related to participation in the Lido Protocol or this DAO.</p>\n            <p><small>1 post - 1 participant</small></p>\n            <p><a href=\"https://research.lido.fi/t/sov-delegate-thread/8069\">Read full topic</a></p>","link":"https://research.lido.fi/t/sov-delegate-thread/8069","pubDate":"Tue, 13 Aug 2024 18:35:08 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"research.lido.fi-topic-8069"},"source":{"@url":"https://research.lido.fi/t/sov-delegate-thread/8069.rss","#text":"Sov - Delegate Thread"}},{"title":"TokenLogic Delegate Thread","dc:creator":"TokenLogic","category":"Delegate Platform","description":"<h3><a name=\"p-16963-delegate-information-1\" class=\"anchor\" href=\"https://research.lido.fi#p-16963-delegate-information-1\"></a>Delegate Information</h3>\n<p><strong>Name:</strong> <a href=\"https://www.tokenlogic.xyz/\" rel=\"noopener nofollow ugc\">TokenLogic</a><br>\n<strong>Delegate Address:</strong> 0x2cc1ADE245020FC5AAE66Ad443e1F66e01c54Df1<br>\n<strong>Forum:</strong> <a class=\"mention\" href=\"https://research.lido.fi/u/tokenlogic\">@TokenLogic</a><br>\n<strong>Twitter:</strong> <a href=\"https://twitter.com/Token_Logic\" rel=\"noopener nofollow ugc\">Token_Logic</a></p>\n<h2><a name=\"p-16963-introduction-and-experience-2\" class=\"anchor\" href=\"https://research.lido.fi#p-16963-introduction-and-experience-2\"></a>Introduction and Experience</h2>\n<p>At TokenLogic, we’re a tight-knit team of DeFi enthusiasts dedicated to helping communities manage their finances. We’ve been working closely with <a href=\"https://www.tokenlogic.xyz/partners/aave\" rel=\"noopener nofollow ugc\">Aave</a> to develop <a href=\"https://governance.aave.com/t/arfc-aave-swap-upgrade/15311\" rel=\"noopener nofollow ugc\">tools</a> for treasury management, providing detailed <a href=\"https://aave.tokenlogic.xyz/revenue\" rel=\"noopener nofollow ugc\">insights</a> into protocol performance, and supporting various <a href=\"https://cointelegraph.com/news/aave-trident-launch-100m-onchain-fixed-yield-loan\" rel=\"noopener nofollow ugc\">growth efforts</a> such as the new Lido-focused Aave v3 deployment. We’ve been active contributors to DeFi governance since 2021, making a significant impact on the Aave ecosystem.</p>\n<h2><a name=\"p-16963-why-tokenlogic-3\" class=\"anchor\" href=\"https://research.lido.fi#p-16963-why-tokenlogic-3\"></a>Why TokenLogic</h2>\n<p>We at TokenLogic believe in nurturing communities and fostering progressive governance ecosystems. Our delegate platform aims to be an independent voting voice within the vibrant Lido ecosystem. We stand out by offering a blend of technical expertise, data-driven insights, and a strong commitment to decentralisation.</p>\n<h3><a name=\"p-16963-proactive-governance-role-4\" class=\"anchor\" href=\"https://research.lido.fi#p-16963-proactive-governance-role-4\"></a>Proactive Governance Role</h3>\n<p>At TokenLogic, we are committed to engaging with DAOs where we can make a significant impact and play an active role in DeFi governance. This focused approach allows us to dedicate substantial time and resources to understanding the intricacies of proposals and their implications, contributing meaningfully to governance. We participate actively in discussions, offer in-depth analysis, and help shape the direction of the protocols we engage with. This commitment has positioned us as one of the leading delegates in the <a href=\"https://apps.aavechan.com/orbit-tracker\" rel=\"noopener nofollow ugc\">Aave</a> ecosystem.</p>\n<h3><a name=\"p-16963-data-driven-decision-making-5\" class=\"anchor\" href=\"https://research.lido.fi#p-16963-data-driven-decision-making-5\"></a>Data-Driven Decision Making</h3>\n<p>Our role goes beyond just voting. Our diverse team of engineers and financial analysts uses on-chain data and their deep DeFi expertise to offer comprehensive insights that support DAO governance decisions. With skills in smart contract development, security, financial analysis, and risk management, we evaluate proposals and initiatives from multiple perspectives, ensuring our contributions consider both technical and economic aspects.</p>\n<h3><a name=\"p-16963-commitment-to-decentralisation-6\" class=\"anchor\" href=\"https://research.lido.fi#p-16963-commitment-to-decentralisation-6\"></a>Commitment to Decentralisation</h3>\n<p>We strongly believe in the importance of decentralisation in DeFi. As a delegate, we aim to support Lido’s ongoing efforts to increase decentralisation, ensuring the protocol remains robust, secure, and true to the principles of decentralised finance. We are committed to transparency and open dialogue, fostering an environment where ideas can thrive and diverse perspectives are actively encouraged and welcomed.</p>\n<p>By becoming a Lido DAO delegate, we aim to leverage our experience, expertise, and proven commitment to governance to help guide Lido’s continued growth and success in the dynamic world of liquid staking and DeFi.</p>\n<h2><a name=\"p-16963-values-7\" class=\"anchor\" href=\"https://research.lido.fi#p-16963-values-7\"></a>Values</h2>\n<p>At TokenLogic, we believe that openness and collaboration are key to achieving the transformative vision of DeFi. Our values drive every action we take:</p>\n<ul>\n<li><strong>Transparency/Openness:</strong> We value open communication and transparency, sharing our knowledge and embracing diverse perspectives.</li>\n<li><strong>Trust:</strong> We build constructive partnerships and close working relationships. We listen actively to the community’s feedback and support compromise to foster solutions that help the community reach its full potential.</li>\n<li><strong>Integrity:</strong> We act honestly and ethically in all dealings, reinforcing a culture of doing what is right.</li>\n<li><strong>Collaboration:</strong> We believe in achieving together, building trust as we strive to deliver the best in all our endeavors.</li>\n<li><strong>Entrepreneurial Spirit:</strong> We adopt an ‘owner mindset,’ identifying opportunities and taking the initiative to pursue new and innovative ways of delivering value.</li>\n</ul>\n<h2><a name=\"p-16963-delegate-communication-intent-8\" class=\"anchor\" href=\"https://research.lido.fi#p-16963-delegate-communication-intent-8\"></a>Delegate Communication Intent</h2>\n<p>We’ll keep this thread updated regularly to ensure transparency and fully communicate our rationale as delegates. These updates will include explanations for our votes and may contain other announcements related to our activity as a Lido delegate.</p>\n<h2><a name=\"p-16963-public-acceptance-9\" class=\"anchor\" href=\"https://research.lido.fi#p-16963-public-acceptance-9\"></a>Public Acceptance</h2>\n<p>We commit to adhering to the <a href=\"https://ipfs.io/ipfs/QmPwqjn5NiNVFKjxxBnYHivgempeyNNpMNotGYMCXitRd3\" rel=\"noopener nofollow ugc\">Lido DAO Delegate Code of Conduct</a> and aligning our actions with <a href=\"https://research.lido.fi/t/lido-dao-vibe-alignment-purpose-mission-vision/4380\">Lido’s Mission, Vision, and Purpose</a>. We pledge to act in the best interests of Lido DAO and its token holders.</p>\n<h2><a name=\"p-16963-disclosure-10\" class=\"anchor\" href=\"https://research.lido.fi#p-16963-disclosure-10\"></a>Disclosure</h2>\n<p>We are active contributors to the governance of <a href=\"https://www.tokenlogic.xyz/partners/aave\" rel=\"noopener nofollow ugc\">Aave Protocol</a> and are actively engaged in supporting the growth of the Lido-focused Aave v3 deployment.<br>\nWe also provide <a href=\"https://www.tokenlogic.xyz/partners/gearbox\" rel=\"noopener nofollow ugc\">analytical services</a> to Gearbox, assist Kelp and Stader Labs with treasury management, and are members of the <a href=\"https://forum.stakewise.io/t/stakewise-v3-liquidity-slc-members/1235\" rel=\"noopener nofollow ugc\">Stakewise</a> and <a href=\"https://governance.aave.com/t/arfc-treasury-manage-gho-liquidity-committee/14914\" rel=\"noopener nofollow ugc\">Aave</a> Liquidity Committees.</p>\n<h2><a name=\"p-16963-waiver-of-liability-11\" class=\"anchor\" href=\"https://research.lido.fi#p-16963-waiver-of-liability-11\"></a>Waiver of Liability</h2>\n<p>By delegating to TokenLogic, you acknowledge and agree that TokenLogic will participate on a best-efforts basis and will not be liable for any damages related to participation in the Lido Protocol or this DAO.</p>\n            <p><small>1 post - 1 participant</small></p>\n            <p><a href=\"https://research.lido.fi/t/tokenlogic-delegate-thread/8066\">Read full topic</a></p>","link":"https://research.lido.fi/t/tokenlogic-delegate-thread/8066","pubDate":"Tue, 13 Aug 2024 13:08:57 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"research.lido.fi-topic-8066"},"source":{"@url":"https://research.lido.fi/t/tokenlogic-delegate-thread/8066.rss","#text":"TokenLogic Delegate Thread"}},{"title":"Polar - Delegate Thread","dc:creator":"polar","category":"Delegate Platform","description":"<p><strong>Introduction:</strong> Hi there, most of you probably know me as <a href=\"https://x.com/post_polar_\" rel=\"noopener nofollow ugc\">polar</a>, though my real name is Paul Dylan-Ennis. I am an <a href=\"https://people.ucd.ie/paul.dylan-ennis\" rel=\"noopener nofollow ugc\">academic</a> with a research specialism in Ethereum protocol governance. I have written a book, <a href=\"https://www.amazon.co.uk/Absolute-Essentials-Ethereum-Business-Economics/dp/1032334185\" rel=\"noopener nofollow ugc\">The Absolute Essentials of Ethereum</a> and a number of <a href=\"https://scholar.google.com/citations?hl=en&amp;user=rbkT1JgAAAAJ&amp;view_op=list_works&amp;sortby=pubdate\" rel=\"noopener nofollow ugc\">academic articles</a> on Ethereum and Bitcoin culture. I teach the first Ethereum-only module at University level, called <a href=\"https://hub.ucd.ie/usis/!W_HU_MENU.P_PUBLISH?p_tag=MODULE&amp;MODULE=MIS41220\" rel=\"noopener nofollow ugc\">The Ethereum Ecosystem</a>. However, most of you probably know me as the author of a number of <a href=\"https://www.coindesk.com/author/dr-paul-j-dylan-ennis/\" rel=\"noopener nofollow ugc\">CoinDesk Opinion</a> columns on Ethereum culture and values.</p>\n<p>Ethereum address/ENS: 0x1f76a6Bf03429480472B3695E08689219cE15ED6</p>\n<p><strong>Motivation:</strong> Of all the DAOs in the Ethereum ecosystem, my sense is that Lido DAO is the one that needs the most careful consideration of its proposals given the large amount of ETH staked with the protocol. In recent years, we have seen a certain professionalism of the DAO delegate role that I think has likely helped in terms of efficiency and participation. However, in this particular case, I believe it is important to be a delegate with few obligations elsewhere (I am a delegate for zkSync, but nowhere else). While I can’t promise you the polished documentation provided by professional DAO delegate operations, I can promise you my careful, cautious and well-researched assessment of proposals. I will bring to bear my academic mindset to consider proposals not just in terms of immediate concerns, but with Lido’s philosophy and Ethereum’s culture and history in mind. I also hope to use my experiences to teach Lido as an exemplary DAO in the classroom.</p>\n<p><strong>Values and Decision-Making Approach:</strong> My view is that Ethereum culture is ultimately undergirded by a commitment to cypherpunk values, which I consider to be decentralisation, permissionlessness, censorship resistance and credible neutrality. I consider these to be the lines that demarcate what is acceptable or not when it comes to Ethereum’s long term vision and that I have through my work a long history of defending their centrality. I will use these principles as a conceptual map in analysing any proposals and making decisions. I will always ensure my reasoning is clearly explained and contextualised and ensure that they are made in light of the ideas and not personalised or subjective. I believe this will be possible because as an academic I am afforded a certain freedom in terms of time to consider and think about these proposals.</p>\n<p><strong>Public Acceptance:</strong> I accept Lido DAO delegate Сode of Сonduct (<a href=\"https://ipfs.io/ipfs/QmPwqjn5NiNVFKjxxBnYHivgempeyNNpMNotGYMCXitRd3\" rel=\"noopener nofollow ugc\">link</a>) and Aligned with <a href=\"https://snapshot.org/#/lido-snapshot.eth/proposal/0x739fbe56425d355b5e41c22bb346b7a8217afd9e84aa49863648b1c641a482e3\" rel=\"noopener nofollow ugc\">Lido’s Vibe (Purpose, Mission, Vision)</a></p>\n<p><strong>Disclosures:</strong> None. I am an academic and do not work for any companies, protocols or projects.</p>\n<p><strong>Waiver of Liability:</strong></p>\n<p><em>By delegating to me, Paul Dylan-Ennis, you acknowledge and agree</em> <em>to the following:</em></p>\n<ol>\n<li><em>I do not control</em> <em>or represent</em> <em>the DAO</em> <em>or the LIDO project</em> <em>and do not assume any responsibility</em> <em>or liability</em> <em>for</em> <em>the DAO’s or LIDO’s</em> <em>actions or decisions.</em></li>\n<li><em>I do not take over any responsibilities of the DAO</em> <em>or the LIDO project</em> <em>, and my participation is limited to the role of a delegate.</em></li>\n<li><em>I am not bound by any particular opinion when voting. Instead, I will vote in a manner that I believe is in the best interest of the</em> <em>LIDO</em> <em>project.</em></li>\n<li><em>By delegating your vote to me, you grant me the freedom to vote at my discretion with your delegation</em> <em>, which means</em> <em>you have no right to restrict me in forming my opinions or in how I cast my votes</em> <em>.</em></li>\n<li><em>I disclaim any liability for any loss, damages, or claims arising from your delegation of votes to me, including but not limited to, unfavorable decisions of the DAO, lack of development of the LIDO project, or other unfavorable or unforeseen circumstances. By delegating votes to me, you fully understand and accept the risks associated with interacting with decentralized smart contracts.</em></li>\n<li><em>All my activities and the relationship with you are exclusively subject to Irish laws and Irish courts.</em></li>\n</ol>\n            <p><small>4 posts - 3 participants</small></p>\n            <p><a href=\"https://research.lido.fi/t/polar-delegate-thread/8048\">Read full topic</a></p>","link":"https://research.lido.fi/t/polar-delegate-thread/8048","pubDate":"Tue, 13 Aug 2024 08:17:39 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"research.lido.fi-topic-8048"},"source":{"@url":"https://research.lido.fi/t/polar-delegate-thread/8048.rss","#text":"Polar - Delegate Thread"}},{"title":"Research Grant Proposal: DAOs & Disputes Chapter and Book Editing","dc:creator":"bianca","category":"Community Grants / Initiatives","description":"<p>Proposal Overview</p>\n<p>As co-editor and contributing author of the forthcoming Oxford University Press book titled “Foundations of Decentralized Organizations: Blockchain and the Future of Corporate Law,” I am seeking support to advance my editorial and author contributions, specifically in developing a crucial chapter on DAOs and dispute resolution.</p>\n<p>This pioneering book project explores the transformative impact of DAOs on corporate law and governance, offering cross-jurisdictional insights from leading scholars. This book is critical for academics, policymakers, industry leaders, and the public in general to understand and navigate the evolving landscape of DAOs.</p>\n<p>The chapter on DAOs and dispute resolution will explore how DAOs navigate internal and external conflicts, with a focus on practical mechanisms such as blockchain-based arbitration and hybrid models. As a leader in the DeFi space and a pivotal player in the industry, Lido’s experience - particularly in the context of current legal challenges - provides a valuable case study that will significantly enhance the chapter’s relevance and impact.</p>\n<p>Through this research grant, Lido will support the development of a key resource that deepens the understanding and effective implementation of DAOs, highlighting its commitment to advancing research and innovation in decentralized governance.</p>\n<p>Proposed Research Plan:</p>\n<p>Objective:<br>\nTo develop and refine a comprehensive chapter on DAO dispute resolution that integrates real-world case studies and contributes to the broader discourse on decentralized governance.</p>\n<p>Key Questions:</p>\n<ul>\n<li>What types of disputes do DAOs encounter, both internally and externally, and how are these disputes effectively resolved?</li>\n<li>What are the strengths and weaknesses of current dispute resolution methods in the context of DAOs?</li>\n<li>What lessons can be learned from case studies, and how can these insights inform and improve dispute resolution strategies for DAOs?</li>\n</ul>\n<p>Project Phases &amp; Methods:</p>\n<ol>\n<li>Research and Writing: Conduct research on internal and external DAO disputes, existing dispute resolution mechanisms applicable to and used by DAOs (e.g., blockchain-based arbitration, traditional arbitration, litigation, hybrid models), including interviews, the collection of case studies and analysis of relevant legal frameworks. Development of the chapter.</li>\n<li>Review: Refine the chapter and ensure thematic coherence across the book.</li>\n<li>Finalization: Completion of the chapter for inclusion in the final manuscript, followed by ongoing editorial responsibilities.</li>\n</ol>\n<p>Deliverables:</p>\n<ul>\n<li>A detailed chapter on DAO dispute resolution, incorporating case studies and legal analysis.</li>\n<li>Contributions to the overall review and editing of the book, ensuring consistency and quality across all chapters.</li>\n</ul>\n<p>Timeline:<br>\n3 months of focused work on the chapter estimated, with ongoing editorial duties extending into the book’s publication process in 2025, and the official book launch date to be announced.</p>\n<p>Grant Amount Requested from LEGO:<br>\n20,000 USD in USDC</p>\n<p>ETH Address: 0xA39d5129d528125e9dCBD8b6075d88a2d04984fb</p>\n            <p><small>3 posts - 2 participants</small></p>\n            <p><a href=\"https://research.lido.fi/t/research-grant-proposal-daos-disputes-chapter-and-book-editing/8044\">Read full topic</a></p>","link":"https://research.lido.fi/t/research-grant-proposal-daos-disputes-chapter-and-book-editing/8044","pubDate":"Tue, 13 Aug 2024 00:03:19 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"research.lido.fi-topic-8044"},"source":{"@url":"https://research.lido.fi/t/research-grant-proposal-daos-disputes-chapter-and-book-editing/8044.rss","#text":"Research Grant Proposal: DAOs & Disputes Chapter and Book Editing"}},{"title":"NodeSoda.com Delegate Thread","dc:creator":"fible1","category":"Delegate Platform","description":"<h2><a name=\"p-16915-delegate-information-1\" class=\"anchor\" href=\"https://research.lido.fi#p-16915-delegate-information-1\"></a>Delegate information:</h2>\n<p><strong>Introduction</strong><br>\nMy name is Pablo, representing <a href=\"http://NodeSoda.com\" rel=\"noopener nofollow ugc\">NodeSoda.com</a>. NodeSoda stands for reliability and innovation. As a full-service Testnet Operator, we’ve made it our mission to support blockchain projects from their nascent stages through to post-launch success. Our expertise lies in deploying and maintaining the critical infrastructure that forms the backbone of blockchain networks - full nodes, validators, indexers, and more.</p>\n<p>Founded on the principle that great ideas deserve robust foundations, NodeSoda has positioned itself at the forefront of blockchain infrastructure development. We understand that in this dynamic field, the difference between a good project and a great one often lies in the quality of its underlying infrastructure. That’s where we excel.</p>\n<p>Our journey, which began with early involvement in virtual currencies such Bitcoin, has evolved into a comprehensive suite of services designed to meet the complex needs of modern blockchain projects. We don’t just provide technical solutions; we offer peace of mind, allowing development teams to focus on what they do best - innovating and pushing the boundaries of what’s possible in the decentralised world.</p>\n<p>At NodeSoda, we’re more than service providers; we’re partners in your blockchain journey, committed to turning your vision into reality.</p>\n<p>Why Choose NodeSoda?</p>\n<ol>\n<li>\n<p>Comprehensive Experience: With roots in virtual currency stretching back 18 years (E-Gold, Linden Dollars), and involvement in Bitcoin since 2011, our team understands the evolution and intricacies of blockchain technology. Since 2020-2021, we’ve been actively engaged in testnet operations, accumulating valuable insights and expertise.</p>\n</li>\n<li>\n<p>Technical Proficiency: Our team is well-versed in essential tools and technologies, including Bash shell scripting, Docker, and the latest in blockchain development. We continuously update our skills to stay ahead in this rapidly evolving field.</p>\n</li>\n<li>\n<p>Proven Track Record: NodeSoda has contributed to over 18 blockchain projects, demonstrating our ability to adapt to diverse network requirements and protocols. Our experience spans various blockchain ecosystems, as detailed below.</p>\n</li>\n<li>\n<p>Reliability and Security: We prioritise network stability and security in all our operations. Our involvement in projects like Forta showcases our commitment to safeguarding blockchain networks against potential threats.</p>\n</li>\n<li>\n<p>Community Engagement: Beyond technical operations, we actively participate in blockchain communities. Our contributions include developing one-line installation tools and creating comprehensive testnet explorers, and other tools; as we demonstrated in projects such Namada’s “Shielded Expedition”.</p>\n</li>\n<li>\n<p>Customised Solutions: We understand that each blockchain project has unique needs. NodeSoda tailors its services to meet the specific requirements of each client, ensuring optimal performance and support.</p>\n</li>\n<li>\n<p>From Testnet to Mainnet: Our expertise spans the entire lifecycle of a blockchain project. We’ve successfully transitioned numerous projects from testnet to mainnet, as detailed in our project portfolio.</p>\n</li>\n<li>\n<p>Continuous Innovation: At NodeSoda, we’re always exploring new technologies and methodologies to improve our services. Our proficiency with cutting-edge tools allows us to tackle emerging challenges in blockchain infrastructure efficiently.</p>\n</li>\n</ol>\n<p><strong>Address</strong> (Your Ethereum address or ENS name)<br>\n0x000b4369B71B6634F27F5De9Cbaaabb0D21B8be5</p>\n<p><strong>Contact Information</strong> (Twitter, Discord)<br>\nEmail is preferred: <a href=\"mailto:contact@nodesoda.com\">contact@nodesoda.com</a><br>\nDiscord: fible1<br>\nTwitter: <span class=\"mention\">@PabloLema85</span></p>\n<p><strong>Motivation</strong> (Reason for wanting to be a delegate, Objectives, and aspirations within the DAO)<br>\nWe are deeply meshed in the Ethereum ecosystem, having watched it grow from the ICO itself to participating in several projects built on top of it. Our journey started with the belief that an open, inclusive ecosystem of digital money could change the world, little did we know that <em>programmable</em> money would be the leading candidate to doing this 13 years later.</p>\n<p>We are altcoin maximalists and we don’t believe there will be one coin to rule them all. But if there an ecosystem and the right philosophy to take over most daily use it Ether. Lido, is uniquely positioned, with stEth to <em>change the world</em> by allowing people to increase there returns and keep them liquid at the same time. This is just one aspect of Lido, but it is world changing and the economic tsunami of change that it will bring about over time. We want in.</p>\n<p><strong>Values and Decision-Making Approach</strong> (Core Values, Decision-Making Process)<br>\nWe have a team of 3 people an about half a dozen contractors that we use on an as-needed basis. We have an organized process which lays out our values, which can be summed up as: “The Network and its users come first”. We will always put network stability and milestones above our own month to month cost considerations, and we have established a reputation as reliable, long term minded partners and testnet operators. This is core to our culture.</p>\n<p>Our day to day operations are organized around this operating principle an core belief. Other long term goals are set by myself (Pablo) and the on-staff team is small and scrappy enought that daily communication and management of issues on a 1-1 basis is not just possible, but encouraged.</p>\n<p>FInally, our operating processes are well organized and testnets we are participating in are monotored 24/7 with response time under 30 minutes for major networ or operating incidents. We operate 24/7, 365 days a year.</p>\n<p><strong>Public Acceptance</strong>:  I Pablo Lema (Represnting <a href=\"http://NodeSoda.com\" rel=\"noopener nofollow ugc\">NodeSoda.com</a>) accept Lido DAO delegate Сode of Сonduct (<a href=\"https://ipfs.io/ipfs/QmPwqjn5NiNVFKjxxBnYHivgempeyNNpMNotGYMCXitRd3\" rel=\"noopener nofollow ugc\">link</a>) and Aligned with <a href=\"https://snapshot.org/#/lido-snapshot.eth/proposal/0x739fbe56425d355b5e41c22bb346b7a8217afd9e84aa49863648b1c641a482e3\" rel=\"noopener nofollow ugc\">Lido’s Vibe (Purpose, Mission, Vision)</a></p>\n<p><strong>Disclosures</strong>: We regularly work on other Ethereum network testnets and projects, mainly as infrastructure providers.</p>\n<p><strong>Bonus: Past Projects</strong><br>\nNodeSoda’s experience extends beyond mainnets to a wide array of testnet environments, showcasing our adaptability and technical prowess:</p>\n<ol>\n<li>\n<p>Autonomys (Subspace) - Gemini 1-3:<br>\nValidator Address: st9JWnuSwUZRqqRo3eZ5fVvvHRnFhMBRy3bgCqsHW1exrTUec<br>\nParticipation: NodeSoda is actively engaged in the Autonomys Testnet, dedicating our expertise to ensure the network’s optimal performance and development.</p>\n</li>\n<li>\n<p>Quai Network (Paxos-2):<br>\nValidator Address: 0x7e3e40a4e3c9903e44794b32d9618994f855200f<br>\nParticipation: From our role as a validator in both Bronze Age and Iron Age testnets, NodeSoda has ascended to the elite “Node Wranglers” group. In this capacity, we work closely with the founding team, testing new releases before they reach the public testnet.</p>\n</li>\n<li>\n<p>Namada SE:<br>\nValidator Address: tnam1qr495c9zr52lfc8vedu2lwutffhk6a8p5qkvvrq9<br>\nParticipation: As a validator (Pilot) in the “Shielded Expedition” testnet/hackathon, NodeSoda has not only contributed to the network’s development and security but has also been recognised as a “Community Builder”. This accolade stems from our initiatives in developing one-line installation tools and creating a comprehensive testnet explorer from scratch.</p>\n</li>\n<li>\n<p>Nubit:<br>\nValidator Address: nubit1tcnl6s576lkyx8w3drvv3cgmnfzy5w8dxpd7ut<br>\nParticipation: In this ongoing testnet, NodeSoda is actively providing validator services and infrastructure while engaging in crucial testnet discussions, shaping the future of the Nubit network.</p>\n</li>\n<li>\n<p>Warden Protocol:<br>\nValidator Address: warden1tcnl6s576lkyx8w3drvv3cgmnfzy5w8d236l3m<br>\nParticipation: NodeSoda’s involvement in the Warden Protocol’s mixed testnet has been exemplary. Currently ranked in the top ~145 out of 54,000 participants, we continue to demonstrate our technical prowess and commitment to the project’s success.</p>\n</li>\n<li>\n<p>AXELAR: Cross-chain protocol enabling secure asset transfers and decentralised application interoperability.</p>\n</li>\n</ol>\n<ul>\n<li>Validator Address: axelarvaloper1surztzrsc4sp0h0259xsp6z0469c85sajauamk</li>\n</ul>\n<ol start=\"7\">\n<li>CELESTIA: Modular blockchain focusing on data availability and scalability for improved network performance.</li>\n</ol>\n<ul>\n<li>Validator Address: celestia1e6xga4zuvpujf0vqfhwqjsq22qax4pjawc7df2</li>\n</ul>\n<ol start=\"8\">\n<li>IRONFISH: Privacy-centred cryptocurrency utilising zero-knowledge proofs for confidential, secure financial transactions.</li>\n</ol>\n<ul>\n<li>Validator Address: 9370a302a84d6af5f9c8d0f7c3995daf041b27ec280a04ff43a0b17ade911390</li>\n</ul>\n<ol start=\"9\">\n<li>SUBSPACE: Decentralised storage network incentivising users to provide disk space for data.</li>\n</ol>\n<ul>\n<li>Validator Address: st9JWnuSwUZRqqRo3eZ5fVvvHRnFhMBRy3bgCqsHW1exrTUec</li>\n</ul>\n<ol start=\"10\">\n<li>QUAI: High-throughput, low-latency layer-1 blockchain designed for efficient transaction processing.</li>\n</ol>\n<ul>\n<li>Validator Address: 0x7e3e40a4e3c9903e44794b32d9618994f855200f</li>\n</ul>\n<ol start=\"11\">\n<li>ALEO: Privacy-focused platform leveraging zero-knowledge proofs for confidential smart contract computations.</li>\n</ol>\n<ul>\n<li>Validator Address: aleo1lxtwus3hsd9qt0apdmtquze06ls485m3xc0g9skggtqwad7rvyfqv2du79</li>\n</ul>\n<ol start=\"12\">\n<li>NEUTRON: Interoperable smart contract platform built on Cosmos SDK for cross-chain functionality.</li>\n</ol>\n<ul>\n<li>Validator Address: neutron1f00shft66fzsqnwrphwxghpnkljlhgeecyg6jc</li>\n</ul>\n<ol start=\"13\">\n<li>NOLUS: Decentralised finance protocol offering lending and borrowing services without intermediaries.</li>\n</ol>\n<ul>\n<li>Validator Address: nolus1gmc4jw6vs9ep2gy3yt4neen83vyd4gnkvnqqq0</li>\n</ul>\n<ol start=\"14\">\n<li>NAMADA: Privacy-preserving blockchain emphasising interoperability and asset-agnostic value transfers across networks.</li>\n</ol>\n<ul>\n<li>Validator Address: tnam1qr495c9zr52lfc8vedu2lwutffhk6a8p5qkvvrq9</li>\n</ul>\n<ol start=\"15\">\n<li>NIBIRU: Multi-asset decentralised exchange facilitating derivatives trading and liquidity provision.</li>\n</ol>\n<ul>\n<li>Validator Address: nibi135xgql9hyuuftz029mv83wumymdhmy8m8cyvv3</li>\n</ul>\n<ol start=\"16\">\n<li>EVMOS: Ethereum-compatible blockchain on Cosmos SDK, enabling cross-chain smart contract applications.</li>\n</ol>\n<ul>\n<li>Validator Address: Evmosvaloper1qq95x6dhrdnrfunlth5uh24tkrfphzl9crd3xr</li>\n</ul>\n<ol start=\"17\">\n<li>MINA: Compact blockchain leveraging zero-knowledge proofs for enhanced privacy and network scalability.</li>\n</ol>\n<ul>\n<li>Validator Address: B62qmo7V7vxx2UdVgnmznQDCkqAnxNQ2kkxfuRgqvRrCEMBgJT1jB1G</li>\n</ul>\n<ol start=\"18\">\n<li>FORTA: Real-time threat detection network ensuring blockchain security through continuous monitoring.</li>\n</ol>\n<ul>\n<li>Validator Address: 0x099F505A8e9108426a7Ffe58b67aE01E9cFA46b8</li>\n</ul>\n            <p><small>1 post - 1 participant</small></p>\n            <p><a href=\"https://research.lido.fi/t/nodesoda-com-delegate-thread/8031\">Read full topic</a></p>","link":"https://research.lido.fi/t/nodesoda-com-delegate-thread/8031","pubDate":"Sat, 10 Aug 2024 18:39:37 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"research.lido.fi-topic-8031"},"source":{"@url":"https://research.lido.fi/t/nodesoda-com-delegate-thread/8031.rss","#text":"NodeSoda.com Delegate Thread"}},{"title":"Please Allow us to Post","dc:creator":"fible1","category":"Start Here","description":"<p>This is Pablo from NodeSoda, could we please be granted the ability to post links? We would like to apply to the Public Delegate Platform.</p>\n<p>Apologies if this is not the medium, but I could not message a mod directly.</p>\n<p><img src=\"https://emoji.discourse-cdn.com/apple/slight_smile.png?v=12\" title=\":slight_smile:\" class=\"emoji only-emoji\" alt=\":slight_smile:\" loading=\"lazy\" width=\"20\" height=\"20\"></p>\n            <p><small>14 posts - 6 participants</small></p>\n            <p><a href=\"https://research.lido.fi/t/please-allow-us-to-post/8026\">Read full topic</a></p>","link":"https://research.lido.fi/t/please-allow-us-to-post/8026","pubDate":"Fri, 09 Aug 2024 17:50:08 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"research.lido.fi-topic-8026"},"source":{"@url":"https://research.lido.fi/t/please-allow-us-to-post/8026.rss","#text":"Please Allow us to Post"}},{"title":"Blockworks Research Delegate Thread","dc:creator":"BlockworksResearch","category":"Delegate Platform","description":"<p><img src=\"https://europe1.discourse-cdn.com/business20/uploads/lido/original/2X/e/eb38115f63cd4faf2565e776b3aa110564d76132.jpeg\" alt=\"bwrs\" data-base62-sha1=\"xyQku2thqb8XDVYe142IzyS0V5U\" width=\"400\" height=\"400\"></p>\n<h1><a name=\"p-16899-delegate-information-1\" class=\"anchor\" href=\"https://research.lido.fi#p-16899-delegate-information-1\"></a>Delegate Information</h1>\n<p><strong>Name:</strong> Blockworks Research<br>\n<strong>Address:</strong> 0xfF4139e99Bd7c23F4611dc660c33c97A825EA67b<br>\n<strong>Forum:</strong> <a href=\"https://research.lido.fi/u/blockworksresearch/summary\">@blockworksresearch</a><br>\n<strong>Twitter:</strong> <a href=\"https://twitter.com/blockworksres\" rel=\"noopener nofollow ugc\">@blockworksres</a><br>\n<strong>Telegram:</strong> <span class=\"mention\">@magicdhz</span>, <span class=\"mention\">@effortcapital</span>, <span class=\"mention\">@mims0x</span><br>\n<strong>Discord:</strong> <span class=\"mention\">@magicdhz</span>, <a class=\"mention\" href=\"https://research.lido.fi/u/0xmims\">@0xmims</a></p>\n<h2><a name=\"p-16899-introduction-2\" class=\"anchor\" href=\"https://research.lido.fi#p-16899-introduction-2\"></a>Introduction</h2>\n<p>Blockworks Research is a <a href=\"https://x.com/i/lists/1754245487874461960\" rel=\"noopener nofollow ugc\">team</a> of expert analysts that delivers institutional-grade, data-driven research and analysis. Our coverage is widespread and includes L1s, rollups, DeFi, MEV, DePin, infrastructure, and more.</p>\n<h2><a name=\"p-16899-governance-work-3\" class=\"anchor\" href=\"https://research.lido.fi#p-16899-governance-work-3\"></a>Governance Work</h2>\n<p>Additionally, we are active delegates in Arbitrum, Uniswap, Wormhole, Jito, and more. Our mission is to provide research services for DAOs, which includes performing economic analysis, identifying profitable business models, installing effective governance structures, and encouraging participation. Ultimately, we sit between DAOs and token holders, and thus we are suited to both drive conversation and surface research directions that achieve goals, create value for the DAO and its underlying protocol, and help those in governance stay ahead of the curve.</p>\n<h2><a name=\"p-16899-why-blockworks-research-4\" class=\"anchor\" href=\"https://research.lido.fi#p-16899-why-blockworks-research-4\"></a>Why Blockworks Research</h2>\n<p>Because of our wide distribution platform and subject matter expertise, we are among the largest delegates across a number of high profile protocols mentioned above, and our research team covers a broad spectrum of topics across the space.</p>\n<p>Some of our work includes publishing a <a href=\"https://forum.arbitrum.foundation/t/stip-analysis-ardc-research-deliverables/23438/5\" rel=\"noopener nofollow ugc\">retroactive statistical analysis</a> on the impact of the Arbitrum DAO’s Short Term Incentive Program (STIP) for spot and perp DEXes (revealing a misuse of funds highlighted in this <a href=\"https://forum.arbitrum.foundation/t/potential-misuse-of-funds-furucombo/25496\" rel=\"noopener nofollow ugc\">discussion</a> from the Foundation), <a href=\"https://forum.arbitrum.foundation/t/concerns-regarding-possible-misconduct-by-synapse-with-respect-to-the-usage-of-arb-incentives-allocated-through-the-stip/23775\" rel=\"noopener nofollow ugc\">recovering</a> 750K ARB for the DAO, being elected to the preliminary <a href=\"https://gov.jito.network/dao/Jito/proposal/EPW3GgVHaXQXCc8qx6dGvCwuAbYHXbjchuUjWmxAQFNj\" rel=\"noopener nofollow ugc\">blacklist</a> committee for Jito DAO regarding their decision to eliminate sandwiching validators from jitoSOL delegation, and most recently being <a href=\"https://x.com/ethena_labs/status/1815857750515278070\" rel=\"noopener nofollow ugc\">appointed</a> to Ethena’s Risk Committee.</p>\n<p>Members on the research team have diverse backgrounds, ranging from experience in HFT, investment management (including TradFi and liquid token management), statistical modeling and quantitative analysis, and actively participating in governance.</p>\n<h2><a name=\"p-16899-motivation-5\" class=\"anchor\" href=\"https://research.lido.fi#p-16899-motivation-5\"></a>Motivation</h2>\n<p>Lido DAO is deeply intertwined with Ethereum’s security, economics, and governance. We view this as an opportunity to work closely with industry leaders and make meaningful contributions to the broader Ethereum community.</p>\n<p>DAOs still face a lot of unanswered problems with respect to coordination structures, effective spending, communicating between delegates, and ultimately driving value back to the underlying protocol. We recognize the opportunity to leverage our platform and team of analysts to address these governance issues.</p>\n<h3><a name=\"p-16899-objectives-6\" class=\"anchor\" href=\"https://research.lido.fi#p-16899-objectives-6\"></a>Objectives</h3>\n<p>Our objectives are to work closely with organizations that we believe are operating at the forefront of DAO governance, to provide a platform for meaningful dialogue, insights, participation, and progress for broader audiences, and to identify research that achieve sustainable business models or other relevant KPIs.</p>\n<p>We are also keenly interested in research areas related to MEV, staking/restaking, and L1 protocol governance, as we believe these are essential pieces for PoS networks and the staking industry, more broadly.</p>\n<p>Please see our <a href=\"https://app.blockworksresearch.com/research/st-eth-ethereum-s-preeminent-institutional-grade-product\" rel=\"noopener nofollow ugc\">report</a> on stETH (sponsored by Steakhouse Financial).</p>\n<h3><a name=\"p-16899-aspirations-within-lido-dao-7\" class=\"anchor\" href=\"https://research.lido.fi#p-16899-aspirations-within-lido-dao-7\"></a>Aspirations within Lido DAO</h3>\n<p>Within the DAO, we aspire to be a neutral platform where investors and community members can learn, stay updated, and gain meaningful insights about Lido. We want to bridge the information gap between DeFi and TradFi. Our aspirations for the DAO is to become a preeminent organization for Ethereum research and governance. This means the DAO will be a major participant in maintaining a sufficiently decentralized network.</p>\n<h2><a name=\"p-16899-values-and-decision-making-approach-8\" class=\"anchor\" href=\"https://research.lido.fi#p-16899-values-and-decision-making-approach-8\"></a>Values and Decision-Making Approach</h2>\n<p>We take pride in having a chain-agnostic approach and being critical of various designs. We know DAOs and protocols have different values and philosophies.</p>\n<p>As Professional Delegate Representatives, we want to identify and understand the needs and goals of the protocols we serve. Then, we closely collaborate with relevant parties toward achieving those goals, and also provide our feedback along the way. Throughout our engagement, our north star will be identifying important KPIs and operational processes and surfacing research modeling that achieves them. And we’ll work closely with relevant delegates on a per project basis.</p>\n<h2><a name=\"p-16899-public-acceptance-9\" class=\"anchor\" href=\"https://research.lido.fi#p-16899-public-acceptance-9\"></a>Public Acceptance</h2>\n<p>We are committed to adhering to the delegate Сode of Сonduct below:</p>\n<ul>\n<li>Public Delegate Code of Conduct:</li>\n<li>Act honestly, transparently, and with integrity.</li>\n<li>Vote in the Lido DAO’s best interest.</li>\n<li>Review each proposal professionally and unbiasedly before voting.</li>\n<li>Draw the community’s attention if a proposal is unclear, requires additional research, or is not ready to proceed to vote.</li>\n<li>Provide constructive, well-researched feedback without personal attacks.</li>\n<li>Respect differing opinions.</li>\n<li>Clearly explain vote rationales to the community.</li>\n<li>Be available to discuss proposals and respond to inquiries.</li>\n<li>Inform the community when ceasing active delegation.</li>\n<li>Avoid and disclose any conflicts of interest.</li>\n<li>Disclose potential conflicts related to delegate activities.</li>\n</ul>\n<h2><a name=\"p-16899-disclosures-10\" class=\"anchor\" href=\"https://research.lido.fi#p-16899-disclosures-10\"></a>Disclosures</h2>\n<h3><a name=\"p-16899-potential-conflict-of-interests-11\" class=\"anchor\" href=\"https://research.lido.fi#p-16899-potential-conflict-of-interests-11\"></a>Potential Conflict of Interests</h3>\n<ul>\n<li>We service many DAOs who may or may not be competitors to Lido DAO.</li>\n<li>Members on the research team may or may not hold LDO tokens or other related private investments.</li>\n</ul>\n<h3><a name=\"p-16899-references-of-past-governance-activity-12\" class=\"anchor\" href=\"https://research.lido.fi#p-16899-references-of-past-governance-activity-12\"></a>References of past governance activity</h3>\n<ul>\n<li>Please visit our <a href=\"https://forum.arbitrum.foundation/u/BlockworksResearch/summary\" rel=\"noopener nofollow ugc\">profile</a> on Arbitrum DAO’s forum to learn more about some of our participation and work.</li>\n<li><a href=\"https://forum.arbitrum.foundation/t/stip-analysis-ardc-research-deliverables/23438\" rel=\"noopener nofollow ugc\">Here</a> is our work for the ARDC regarding Arbitrum DAO’s short-term incentives program (STIP). The work includes using the Synthetic Control (SC) causal inference method to analyze incentives programs and their impact on various KPIs, depending on the application category, which includes spot DEXes, perp DEXes, and yield aggregators.</li>\n<li>In our most recent work for the ARDC, we retroactively analyzed <a href=\"https://forum.arbitrum.foundation/t/stip-analysis-ardc-research-deliverables/23438/9\" rel=\"noopener nofollow ugc\">STIP’s impact on sequencer revenues</a>.</li>\n</ul>\n            <p><small>1 post - 1 participant</small></p>\n            <p><a href=\"https://research.lido.fi/t/blockworks-research-delegate-thread/8024\">Read full topic</a></p>","link":"https://research.lido.fi/t/blockworks-research-delegate-thread/8024","pubDate":"Fri, 09 Aug 2024 16:07:11 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"research.lido.fi-topic-8024"},"source":{"@url":"https://research.lido.fi/t/blockworks-research-delegate-thread/8024.rss","#text":"Blockworks Research Delegate Thread"}},{"title":"Anthony Leuts - Delegate Thread","dc:creator":"Leuts","category":"Delegate Platform","description":"<p><strong>Name:</strong> Anthony L<br>\n<strong>Address:</strong> leuts.eth<br>\n<strong>Forum:</strong> <a href=\"https://research.lido.fi/u/leuts/summary\">@leuts</a><br>\n<strong>Twitter:</strong> <a href=\"https://x.com/A_Leutenegger\">Leuts</a></p>\n<p><strong>Introduction:</strong> I am the CEO of Aragon. Previously a contributor at Vocdoni. I am an LDO holder and Lido DVT Simple Home Staker. My expertise is in onchain governance technology. I am a University of Waterloo alumni.</p>\n<p><strong>Motivation:</strong> Lido is the most important project in web3, with the most at stake ;). As a long term partner, supporter, token holder, and user I am happy to put myself forward as a delegate to the Lido DAO to help support and secure the Ethereum network.</p>\n<p><strong>Values and Decision-Making Approach:</strong> The future of humanity will be decided at the frontier of technological innovation and human coordination. We will either see deeper levels of censorship and oppression, or new and greater amounts of freedom. Lido has the power, capability, and responsibility to change the world by securing Ethereum and supporting the latter and as a delegate at Lido my goal will be to ensure Lido stays true to its mission, vision, and to uphold its values.</p>\n<p>Thus my approach is to ensure the Lido DAO: Keeps Ethereum decentralized, accessible to all, and resistant to censorship and do this by supporting making staking simple, secure, and decentralized.</p>\n<p>I’ll do this by communicating openly and focusing on being pragmatic in my decision making.</p>\n<p><strong>Public Acceptance:</strong> I accept Lido DAO delegate Сode of Сonduct (<a href=\"https://ipfs.io/ipfs/QmPwqjn5NiNVFKjxxBnYHivgempeyNNpMNotGYMCXitRd3\">link</a>) and Aligned with <a href=\"https://snapshot.org/#/lido-snapshot.eth/proposal/0x739fbe56425d355b5e41c22bb346b7a8217afd9e84aa49863648b1c641a482e3\">Lido’s Vibe (Purpose, Mission, Vision)</a></p>\n<p><strong>Disclosures:</strong> I am the CEO of Aragon. I own LDO. I own an extremely small amount of shares in Diva now known as Nektar. I work in the onchain governance tooling space, our largest users include Lido, Curve, Polygon, and Taiko.</p>\n<p><strong>Waiver of Liability:</strong><br>\n<em>By delegating to me, Anthony Leuts, you acknowledge and agree</em> <em>to the following:</em></p>\n<ol>\n<li><em>I do not control</em> <em>or represent</em> <em>the DAO</em> <em>or the LIDO project</em> <em>and do not assume any responsibility</em> <em>or liability</em> <em>for</em> <em>the DAO’s or LIDO’s</em> <em>actions or decisions.</em></li>\n<li><em>I do not take over any responsibilities of the DAO</em> <em>or the LIDO project</em> <em>, and my participation is limited to the role of a delegate.</em></li>\n<li><em>I am not bound by any particular opinion when voting. Instead, I will vote in a manner that I believe is in the best interest of the</em> <em>LIDO</em> <em>project.</em></li>\n<li><em>By delegating your vote to me, you grant me the freedom to vote at my discretion with your delegation</em> <em>, which means</em> <em>you have no right to restrict me in forming my opinions or in how I cast my votes</em> <em>.</em></li>\n<li><em>I disclaim any liability for any loss, damages, or claims arising from your delegation of votes to me, including but not limited to, unfavorable decisions of the DAO, lack of development of the LIDO project, or other unfavorable or unforeseen circumstances. By delegating votes to me, you fully understand and accept the risks associated with interacting with decentralized smart contracts.</em></li>\n<li><em>All my activities and the relationship with you are exclusively subject to Swiss laws and Swiss courts.</em></li>\n</ol>\n            <p><small>3 posts - 2 participants</small></p>\n            <p><a href=\"https://research.lido.fi/t/anthony-leuts-delegate-thread/8019\">Read full topic</a></p>","link":"https://research.lido.fi/t/anthony-leuts-delegate-thread/8019","pubDate":"Fri, 09 Aug 2024 14:45:15 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"research.lido.fi-topic-8019"},"source":{"@url":"https://research.lido.fi/t/anthony-leuts-delegate-thread/8019.rss","#text":"Anthony Leuts - Delegate Thread"}},{"title":"Daniela Zschaber representing Blockful Delegate Thread","dc:creator":"danimim","category":"Delegate Platform","description":"<p>Daniela Zschaber representing Blockful Delegate Thread</p>\n<p><strong>Name:</strong> Daniela Zschaber (representing Blockful)<br>\n<strong>Delegate Address:</strong> 0x3b9F47629cD4D5903cF3eB897aaC4F6b41Dd2589<br>\n<strong>Forum:</strong> <a href=\"https://research.lido.fi/u/danimim/summary\">@danimim</a><br>\n<strong>Twitter:</strong> <a href=\"https://twitter.com/danimimm\">x.com</a><br>\n<strong>Languages:</strong> English, Portuguese, Spanish, French and Russian</p>\n<h2><a name=\"p-16888-introduction-and-experience-1\" class=\"anchor\" href=\"https://research.lido.fi#p-16888-introduction-and-experience-1\"></a>Introduction and Experience</h2>\n<p><em>Focusing on DAOs/onchain reputation • Building in public (goods) <a href=\"https://x.com/blockful_io\">@blockful_io</a> · ARB delegate • Baller <a href=\"https://x.com/Balancer\">@Balancer</a> · KB8 <a href=\"https://x.com/Kernel0x\">@Kernel0x</a></em></p>\n<p>As a product manager at <a href=\"https://blockful.notion.site/meet-blockful-485f6957ddb14a7c833d9240d393119c?pvs=25\"><strong>blockful</strong></a>, I’m currently focused on on-chain reputation, and building Trustful <a href=\"https://forum.arbitrum.foundation/t/thank-arb-x-cartographer-syndicate-program-overview/25036/7\"><strong>(RFP1 of the Cartographers Syndicate x ThankARB)</strong></a>.<br>\nMy team at blockful played a key role in ENS DAO, being a top 10 delegate, <a href=\"https://questbook.app/dashboard/?proposalId=65b97f0ec78801149f5d1455&amp;chainId=10&amp;grantId=0x706bc8efecb6002f00a052fe5688d0eb89ea45f4\"><strong>scaling ENS on Arbitrum</strong></a> and on <a href=\"https://app.charmverse.io/op-grants/scale-ens-to-op-blockful-official-ens-service-provider-6112748728814419\"><strong>Optimism</strong></a>, and has contributed to significant works like the <a href=\"https://snapshot.org/#/ens.eth/proposal/0xf3a4673fe04a3ecfed4a2f066f6ced1539a5466d61630428333360b843653c54\"><strong>ENS Security Council</strong></a>.<br>\nAdditionally, we are <a href=\"https://shutternetwork.discourse.group/t/blockful-tech-service-provider/448\"><strong>Service Providers for Shutter DAO 0x36</strong></a> and have recently released a <a href=\"https://mirror.xyz/research.blockful.eth/v0GEP49oXP1gzMDlyP91-S4XIa8PIOd0vKq-6R8f54I\"><strong>research on Compound’s governance</strong></a>. We are always involved in DAOs, keeping an active eye on their security, governance, and handling code and development.<br>\nWith a deep understanding of the DAO ecosystem, valuable insights, and a dedicated team by my side, <strong>I am committed to being an active delegate in the Lido ecosystem.</strong> I have participated in most events and discussions, and I look forward to continuing to contribute long-term value to Lido’s governance as a delegate.</p>\n<h2><a name=\"p-16888-why-daniela-representing-blockful-2\" class=\"anchor\" href=\"https://research.lido.fi#p-16888-why-daniela-representing-blockful-2\"></a>Why Daniela (representing Blockful)</h2>\n<p>At Blockful, our mission is to strengthen DAO governance and security while driving open-source contributions. We work closely with DAOs to enhance their longevity by participating, conducting research, and continuously improving governance and protocol development. With a strong track record of active participation in DAOs, we have made significant contributions to projects like the <a href=\"https://snapshot.org/#/ens.eth/proposal/0xf3a4673fe04a3ecfed4a2f066f6ced1539a5466d61630428333360b843653c54\"><strong>ENS Security Council</strong></a>, where we played a pivotal role in shaping its success. We combine our expertise in governance, protocol development, and on-chain reputation with a hands-on approach to DAO participation.</p>\n<p>As passionate advocates of the Ethereum ethos, we believe in the transformative power of decentralized technology and its potential to unlock new possibilities for society. We contribute to this vision through <strong>focus on Governance</strong>: we are deeply committed to enhancing governance structures, ensuring that protocols are both technically sound and aligned with the broader community’s values.</p>\n<p>With this experience and dedication, <strong>I, Daniela Zschaber, along with Blockful</strong>, am ready to contribute meaningfully to the Lido ecosystem, ensuring strong governance and long-term sustainability.</p>\n<h2><a name=\"p-16888-motivation-3\" class=\"anchor\" href=\"https://research.lido.fi#p-16888-motivation-3\"></a>Motivation</h2>\n<p>My/our commitment to governance can make a significant impact on the Lido DAO. By integrating our security-focused approach and innovative solutions, we aim to ensure Lido’s DAO long-term success.</p>\n<h2><a name=\"p-16888-delegate-communication-intent-4\" class=\"anchor\" href=\"https://research.lido.fi#p-16888-delegate-communication-intent-4\"></a>Delegate Communication Intent</h2>\n<p>This thread is dedicated to providing regular updates to the community, ensuring full transparency in my/our actions as Lido delegates. Our updates will include detailed explanations of our voting decisions, as well as any other relevant announcements related to our activities within the Lido ecosystem. Our goal is to keep the community informed and engaged, fostering a clear understanding of the rationale behind our contributions.</p>\n<h2><a name=\"p-16888-values-and-decision-making-approach-5\" class=\"anchor\" href=\"https://research.lido.fi#p-16888-values-and-decision-making-approach-5\"></a>Values and Decision-Making Approach</h2>\n<h3><a name=\"p-16888-core-values-6\" class=\"anchor\" href=\"https://research.lido.fi#p-16888-core-values-6\"></a>Core Values</h3>\n<p>My/Our core values revolve around security, strong governance, and integrity. I am/We are dedicated to creating a robust and resilient environment where protocols can thrive with the assurance of sound governance practices. Our work is driven by the principles of open-source contribution, continuous innovation, and unwavering commitment to the Ethereum ethos.</p>\n<h3><a name=\"p-16888-decision-making-process-7\" class=\"anchor\" href=\"https://research.lido.fi#p-16888-decision-making-process-7\"></a>Decision-Making Process</h3>\n<p>Our decision-making process is grounded in careful analysis and a commitment to strong governance. We prioritize thorough research and data-driven insights. We aim to ensure that every choice we make supports the security and long-term sustainability of the protocols we engage with. We are committed to transparency, making sure our decisions are clear, well-considered, and aligned with our mission to uphold and enhance the governance of the projects we contribute to.</p>\n<h2><a name=\"p-16888-public-acceptance-8\" class=\"anchor\" href=\"https://research.lido.fi#p-16888-public-acceptance-8\"></a>Public Acceptance</h2>\n<p>I am/We are fully aligned with <a href=\"https://research.lido.fi/t/lido-dao-vibe-alignment-purpose-mission-vision/4380\">Purpose/Mission/Values of Lido DAO</a>.</p>\n<h2><a name=\"p-16888-disclosure-9\" class=\"anchor\" href=\"https://research.lido.fi#p-16888-disclosure-9\"></a>Disclosure</h2>\n<p>Blockful is actively engaged in the governance of various DAOs, including ENS DAO,  Shutter DAO 0x36 and many others. And I am personally engaged in Arbitrum and Balancer.<br>\nWe also contribute to the development and security of these protocols, playing a significant role in their governance frameworks.</p>\n<h2><a name=\"p-16888-waiver-of-liability-10\" class=\"anchor\" href=\"https://research.lido.fi#p-16888-waiver-of-liability-10\"></a>Waiver of Liability</h2>\n<p>By delegating to Daniela (representing Blockful), you understand and accept that our involvement in the Lido Protocol, as well as other DAO-related activities, will be conducted with the utmost effort and commitment. However, you also acknowledge that Blockful cannot be held responsible for any potential losses or damages that may result from our participation. Our role is to contribute to the best of our abilities, but we do not assume liability for outcomes beyond our control.</p>\n            <p><small>1 post - 1 participant</small></p>\n            <p><a href=\"https://research.lido.fi/t/daniela-zschaber-representing-blockful-delegate-thread/8018\">Read full topic</a></p>","link":"https://research.lido.fi/t/daniela-zschaber-representing-blockful-delegate-thread/8018","pubDate":"Fri, 09 Aug 2024 13:34:45 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"research.lido.fi-topic-8018"},"source":{"@url":"https://research.lido.fi/t/daniela-zschaber-representing-blockful-delegate-thread/8018.rss","#text":"Daniela Zschaber representing Blockful Delegate Thread"}},{"title":"Karpatkey Delegate Thread","dc:creator":"karpatkey","category":"Delegate Platform","description":"<h2><a name=\"p-16878-delegate-information-1\" class=\"anchor\" href=\"https://research.lido.fi#p-16878-delegate-information-1\"></a>Delegate Information</h2>\n<p><strong>Name:</strong> karpatkey<br>\n<strong>Delegate Address:</strong> 0x8787FC2De4De95c53e5E3a4e5459247D9773ea52<br>\n<strong>Forum:</strong> <a href=\"https://research.lido.fi/u/karpatkey/summary\">@karpatkey</a><br>\n<strong>Twitter:</strong> <a href=\"https://twitter.com/karpatkey\">x.com </a><br>\n<strong>Languages:</strong> English, Portuguese and Spanish</p>\n<h2><a name=\"p-16878-introduction-and-experience-2\" class=\"anchor\" href=\"https://research.lido.fi#p-16878-introduction-and-experience-2\"></a>Introduction and Experience</h2>\n<p>karpatkey is a DeFi-native organisation specialising in professional DAO finance through industry-leading research and tooling since 2020. We’ve been working with <a href=\"https://forum.gnosis.io/t/karpatkeys-weekly-report-on-gnosisdao-farms/6219\">GnosisDAO</a>, <a href=\"https://forum.balancer.fi/t/karpatkey-s-weekly-report-on-balancerdao-farms/4386\">Balancer</a>, <a href=\"https://discuss.ens.domains/t/endowment-weekly-reports/16665\">ENS</a>, <a href=\"https://forum.cow.fi/t/cow-treasury-report-for-march-2023/1624https://forum.cow.fi/t/cow-treasury-report-for-march-2023/1624\">CoW Protocol</a>, and <a href=\"https://snapshot.org/#/lido-snapshot.eth/proposal/0xac31f800288c68e32d1eb3cea7a525022faae3eb3bf805d1b3d248cda5375a13\">Lido</a> on financial planning, operations, and strategy, diversifying their treasuries into sustainable portfolios of DeFi investments designed to support DAOs in executing their missions.</p>\n<h2><a name=\"p-16878-why-karpatkey-3\" class=\"anchor\" href=\"https://research.lido.fi#p-16878-why-karpatkey-3\"></a>Why karpatkey</h2>\n<p>The Lido DAO is well-positioned to lead by taking community-driven governance initiatives and turning them into highly impactful programs that strengthen the protocol’s future.</p>\n<p>At karpatkey, our governance team taps our network of engineers, DeFi strategists, data/financial/quant analysts, and accountants for subject matter expertise. As DAO treasury developers and contributors to some of our industry’s most reputable DeFi protocols, our team has the knowledge, trust, and alignment to contribute to Lido’s growth moving forward meaningfully.</p>\n<p>We pride ourselves on being hands-on delegates in our areas of expertise and upholding our <a href=\"https://www.karpatkey.com/contents/karpatkey-values\">core values </a> in every area of our participation.</p>\n<p>In addition to our well-known DeFi and Treasury-related skills, we are interested in making an impact in broader DAO governance discussions. Our governance team will bring our expertise of working with other DAOs to create positive contributions to Lido DAO.</p>\n<h2><a name=\"p-16878-delegate-communication-intent-4\" class=\"anchor\" href=\"https://research.lido.fi#p-16878-delegate-communication-intent-4\"></a>Delegate Communication Intent</h2>\n<p>This thread will provide regular updates to the community to ensure transparency and fully communicate our rationale as delegates. These updates will include our explanation for voting and may consist of other announcements related to our activity as an Lido delegate.</p>\n<h2><a name=\"p-16878-public-acceptance-5\" class=\"anchor\" href=\"https://research.lido.fi#p-16878-public-acceptance-5\"></a>Public Acceptance</h2>\n<p>We are fully aligned with <a href=\"https://research.lido.fi/t/lido-dao-vibe-alignment-purpose-mission-vision/4380\">Purpose/Mission/Values of Lido DAO</a>.</p>\n<h2><a name=\"p-16878-disclosure-6\" class=\"anchor\" href=\"https://research.lido.fi#p-16878-disclosure-6\"></a>Disclosure</h2>\n<p>We are active contributors to the governance of other protocols, such as AAVE, Uniswap, and Safe. We also manage treasuries or serve on treasury committees for protocols such as Balancer, GnosisDAO, and ENS, and we hold multiple crypto assets in our own treasury. More information is freely available on our <a href=\"https://reports.karpatkey.com/\">treasury reports</a>.</p>\n<h2><a name=\"p-16878-waiver-of-liability-7\" class=\"anchor\" href=\"https://research.lido.fi#p-16878-waiver-of-liability-7\"></a>Waiver of Liability</h2>\n<p>By delegating to karpatkey, you acknowledge and agree that karpatkey will participate on a best-efforts basis and will not be liable for any damages related to participation in the Lido Protocol or this DAO.</p>\n            <p><small>1 post - 1 participant</small></p>\n            <p><a href=\"https://research.lido.fi/t/karpatkey-delegate-thread/8011\">Read full topic</a></p>","link":"https://research.lido.fi/t/karpatkey-delegate-thread/8011","pubDate":"Fri, 09 Aug 2024 10:33:07 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"research.lido.fi-topic-8011"},"source":{"@url":"https://research.lido.fi/t/karpatkey-delegate-thread/8011.rss","#text":"Karpatkey Delegate Thread"}},{"title":"About the Delegate Platform","dc:creator":"Jenya_K","category":"Delegate Platform","description":"<p>Welcome to the Delegate Platform, a central hub for all things related to Lido DAO’s public delegates. This category is designed to help you:</p>\n<ul>\n<li>Get to know Lido’s public delegates</li>\n<li>Understand their voting rationale and decision-making processes</li>\n<li>Stay informed about current delegate programs within Lido DAO</li>\n</ul>\n<p><strong>Useful links:</strong></p>\n<p><strong>Ongoing Delegate Incentivisation Program:</strong> <a href=\"https://snapshot.org/#/lido-snapshot.eth/proposal/0xa502cf80451192672313911ce558e74799626da3b3b66130e21c6cd19707e584\">Snapshot</a> Establish a Public Delegate Platform and Delegate Incentivization Program</p>\n<p><strong>Delegate Thread setup Template:</strong> <a href=\"https://research.lido.fi/t/name-delegate-thread/7993\">https://research.lido.fi/t/name-delegate-thread/7993</a><br>\nWhen creating a thread, select “Insert Template” in the settings and fill it out.</p>\n<p><strong>Delegate Code of Conduct:</strong> <a href=\"https://ipfs.io/ipfs/QmPwqjn5NiNVFKjxxBnYHivgempeyNNpMNotGYMCXitRd3\">https://ipfs.io/ipfs/QmPwqjn5NiNVFKjxxBnYHivgempeyNNpMNotGYMCXitRd3</a><br>\nCID:QmPwqjn5NiNVFKjxxBnYHivgempeyNNpMNotGYMCXitRd3</p>\n            <p><small>5 posts - 4 participants</small></p>\n            <p><a href=\"https://research.lido.fi/t/about-the-delegate-platform/8010\">Read full topic</a></p>","link":"https://research.lido.fi/t/about-the-delegate-platform/8010","pubDate":"Fri, 09 Aug 2024 10:13:05 +0000","discourse:topicPinned":"Yes","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"research.lido.fi-topic-8010"},"source":{"@url":"https://research.lido.fi/t/about-the-delegate-platform/8010.rss","#text":"About the Delegate Platform"}},{"title":"Numic is joining Pier Two","dc:creator":"Pier_Two","category":"Node Operators","description":"<p>Dear Lido community,</p>\n<p>We are excited to inform you that Pier Two has acquired Numic’s validator business, including its team and resources.</p>\n<p>Numic and Pier Two believe this is in the best interests of Lido on Ethereum for a variety of reasons, including:</p>\n<ol>\n<li>The current Numic team will continue working with Pier Two to ensure high quality infrastructure.</li>\n<li>Pier Two is already participating in the Lido on Ethereum protocol through the Simple DVT Module (both on testnet and mainnet), using DV infrastructure such as SSV, Obol, and SafeStake.</li>\n<li>Numic is based in Queensland, Australia with Pier Two also being headquartered in Queensland, Australia. Pier Two has a global team with 24/7 monitoring, alerting, and on-call engineers. Accordingly, the geographical diversity of node operators using Lido on Ethereum will not be impacted.</li>\n<li>Pier Two brings further security standardisation, being ISO 27001:2022 certified while also currently working toward SOC-2 certification. Pier Two’s security posture bolsters Lido’s security position.</li>\n<li>Pier Two aligns closely with Lido’s <a href=\"https://research.lido.fi/t/lido-dao-vibe-alignment-purpose-mission-vision/4380\">purpose statement</a> by building an Ethereum light client called <a href=\"https://github.com/Pier-Two/Lantern.Beacon\" rel=\"noopener nofollow ugc\">Lantern</a> which has a vision to keep Ethereum free to access and globally available.</li>\n</ol>\n<p>The Numic team is currently <a href=\"https://research.lido.fi/t/lido-on-ethereum-node-operator-numic-security-incident-disclosure-may-21-2024/7536/8\">unstaked</a> with zero keys and is awaiting reinstatement, so the path forward can be discussed openly.</p>\n<p>We would be delighted to answer any questions the community may have in the below thread.</p>\n<p>For more information on this transaction, read our <a href=\"https://piertwo.com/blog/numic-is-joining-pier-two/\" rel=\"noopener nofollow ugc\">blog post</a>.</p>\n<p>Pier Two team</p>\n            <p><small>4 posts - 3 participants</small></p>\n            <p><a href=\"https://research.lido.fi/t/numic-is-joining-pier-two/7998\">Read full topic</a></p>","link":"https://research.lido.fi/t/numic-is-joining-pier-two/7998","pubDate":"Thu, 08 Aug 2024 07:00:47 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"research.lido.fi-topic-7998"},"source":{"@url":"https://research.lido.fi/t/numic-is-joining-pier-two/7998.rss","#text":"Numic is joining Pier Two"}},{"title":"Discontinuation of Aragon UI use","dc:creator":"zuzu_eeka","category":"Proposals","description":"<h1><a name=\"p-16833-tldr-1\" class=\"anchor\" href=\"https://research.lido.fi#p-16833-tldr-1\"></a>TL;DR</h1>\n<p>Lido contributors suggest discontinuing the use of Aragon UI (<a href=\"http://mainnet.lido.fi\">mainnet.lido.fi</a>). The user interface will enter a ‘no support period’ untill the end of the year. If no significant and reasoned objection arises during the period, the UI is proposed to be shut down.</p>\n<p>This is a call to encourage all users to switch to new platforms: <a href=\"http://vote.lido.fi/\">vote.lido.fi</a> and <a href=\"http://operators.lido.fi/\">operators.lido.fi</a> for a seamless experience, as well as a call to invite suggestions for any features that could enhance interaction with the Lido protocol, if needed.</p>\n<h1><a name=\"p-16833-motivation-2\" class=\"anchor\" href=\"https://research.lido.fi#p-16833-motivation-2\"></a>Motivation</h1>\n<p>The DAO continues to evolve and enhance its governance processes, and the tools should reflect a commitment to transparency and accessibility. The Aragon UI has served well, but as the DAO moves forward, Lido contributors recognize the need for more efficient platforms.</p>\n<p>After careful consideration within Lido contributors from several workstreams and workgroups, it was decided to advise the DAO and community to discontinue the use of Aragon UI and suggest using alternatives, such as</p>\n<ul>\n<li><a href=\"https://vote.lido.fi/\">vote.lido.fi</a> for governance voting</li>\n</ul>\n<p></p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://europe1.discourse-cdn.com/business20/uploads/lido/original/2X/9/94e955e3f1f0a8dfa106d468a09588d0d79ca36b.png\" data-download-href=\"/uploads/short-url/lfkAfopC57eie1EN0N9MZFslk7N.png?dl=1\" title=\"\"><img src=\"https://europe1.discourse-cdn.com/business20/uploads/lido/optimized/2X/9/94e955e3f1f0a8dfa106d468a09588d0d79ca36b_2_690x335.png\" alt=\"\" data-base62-sha1=\"lfkAfopC57eie1EN0N9MZFslk7N\" role=\"presentation\" width=\"690\" height=\"335\" srcset=\"https://europe1.discourse-cdn.com/business20/uploads/lido/optimized/2X/9/94e955e3f1f0a8dfa106d468a09588d0d79ca36b_2_690x335.png, https://europe1.discourse-cdn.com/business20/uploads/lido/optimized/2X/9/94e955e3f1f0a8dfa106d468a09588d0d79ca36b_2_1035x502.png 1.5x, https://europe1.discourse-cdn.com/business20/uploads/lido/optimized/2X/9/94e955e3f1f0a8dfa106d468a09588d0d79ca36b_2_1380x670.png 2x\" data-dominant-color=\"F2F5F6\"></a></div><p></p>\n<ul>\n<li><a href=\"http://operators.lido.fi\">operators.lido.fi</a> for node operators management.</li>\n</ul>\n<p></p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://europe1.discourse-cdn.com/business20/uploads/lido/original/2X/8/81045b60477402786bed58f394322d4002903970.png\" data-download-href=\"/uploads/short-url/ipkVyHXgc9wG9gwCkXwTHwc8UbC.png?dl=1\" title=\"\"><img src=\"https://europe1.discourse-cdn.com/business20/uploads/lido/optimized/2X/8/81045b60477402786bed58f394322d4002903970_2_690x335.png\" alt=\"\" data-base62-sha1=\"ipkVyHXgc9wG9gwCkXwTHwc8UbC\" role=\"presentation\" width=\"690\" height=\"335\" srcset=\"https://europe1.discourse-cdn.com/business20/uploads/lido/optimized/2X/8/81045b60477402786bed58f394322d4002903970_2_690x335.png, https://europe1.discourse-cdn.com/business20/uploads/lido/optimized/2X/8/81045b60477402786bed58f394322d4002903970_2_1035x502.png 1.5x, https://europe1.discourse-cdn.com/business20/uploads/lido/optimized/2X/8/81045b60477402786bed58f394322d4002903970_2_1380x670.png 2x\" data-dominant-color=\"F3F5F7\"></a></div><p></p>\n<p>These platforms are designed to enhance user experience and be an efficient way for interaction with the protocol.</p>\n<p>—</p>\n<p>If you have any questions or feedback regarding this transition, or you have any needs that are not covered by this two UIs, feel free to share your thoughts in the comments!</p>\n            <p><small>11 posts - 6 participants</small></p>\n            <p><a href=\"https://research.lido.fi/t/discontinuation-of-aragon-ui-use/7992\">Read full topic</a></p>","link":"https://research.lido.fi/t/discontinuation-of-aragon-ui-use/7992","pubDate":"Wed, 07 Aug 2024 10:24:20 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"research.lido.fi-topic-7992"},"source":{"@url":"https://research.lido.fi/t/discontinuation-of-aragon-ui-use/7992.rss","#text":"Discontinuation of Aragon UI use"}}]}}}