{"rss":{"@version":"2.0","@xmlns:discourse":"http://www.discourse.org/","@xmlns:atom":"http://www.w3.org/2005/Atom","@xmlns:dc":"http://purl.org/dc/elements/1.1/","channel":{"title":"Lido Governance - Latest topics","link":"https://research.lido.fi/latest","description":"Latest topics","lastBuildDate":"Fri, 06 Sep 2024 12:25:26 +0000","atom:link":{"@href":"https://research.lido.fi/latest.rss","@rel":"self","@type":"application/rss+xml"},"item":[{"title":"[Proposal] PERCH: Protocol Evaluation and Request Coordination Hub","dc:creator":"Perrier","category":"General","description":"<h4><a name=\"p-17439-overview-1\" class=\"anchor\" href=\"https://research.lido.fi#p-17439-overview-1\"></a>Overview</h4>\n<p>The proposal is addressed at projects/protocols that provide functions, i.e relays, credible commitments…, and who are seeking operators <strong>running validators on Lido on Ethereum</strong> to test/utilize these functions.</p>\n<p>It’s also addressed at Node Operators (NOs), <strong>running validators on Lido on Ethereum</strong>, who wish to express their interest in participating in collaborative testing on test networks. The objective is to conduct tests that could potentially enhance the resilience and performance of Ethereum, provided these tests do not disrupt the proper functioning of the Lido protocol.</p>\n<p>In sum, the <strong>Protocol Evaluation and Request Coordination Hub (PERCH)</strong> framework proposes a collaborative structure for protocols and projects seeking participation from node operators (NOs) <strong>running validators on Lido on Ethereum</strong>. This framework facilitates the evaluation and testing of various research technologies—such as relays, credible commitments, blob propagation, and more—by coordinating participation between protocol developers and node operators. The goal is to conduct thorough tests that enhance the resilience and performance of Ethereum, ensuring that these tests do not disrupt the proper functioning of any ongoing ecosystem protocols, such as those within the Lido context.</p>\n<h4><a name=\"p-17439-expectations-2\" class=\"anchor\" href=\"https://research.lido.fi#p-17439-expectations-2\"></a>Expectations</h4>\n<p><strong>For Applicants (projects and protocols):</strong></p>\n<ol>\n<li><strong>Number of Participants</strong>: Specify the ideal number of operators/validators required.</li>\n<li><strong>Application Form</strong>: Attach a form for NOs to express interest (if relevant) and provide the necessary details. Additional instructions attached below in the <em>How to Participate</em> section</li>\n<li><strong>Testing Outline</strong>:</li>\n</ol>\n<ul>\n<li>Software and/or protocols to be used.</li>\n<li>Networks on which the tests will be conducted (e.g., Holesky or others).</li>\n<li>Duration of the testing period.</li>\n<li>Expected impact on the network as a result of these tests.</li>\n</ul>\n<ol start=\"4\">\n<li><strong>Requirements</strong>:<br>\nAny project or protocol undergoing a testnet with Node Operators (NOs) should, at a minimum, meet the following requirements:</li>\n</ol>\n<ul>\n<li><strong>Alignment with Ethereum Roadmap</strong>: The proposed technology should complement and advance Ethereum’s long-term goals, particularly in areas such as scaling, censorship resistance, or decentralization. Solutions should have a clear path to potentially becoming native to the protocol, aligning with Ethereum’s future upgrades and developments</li>\n<li><strong>Neutrality and Inclusivity</strong>: The technology should enhance the user experience and robustness of the Ethereum network without introducing favoritism or reliance on specific service providers. For instance, it should not require the Lido protocol to favor a specific set of relayers or builders</li>\n<li><strong>Adherence to Community Standards</strong>: The technology should be in line with broader Ethereum community efforts, aiming for interoperability and alignment with other proposals. For example, credible commitments and relays should respect ongoing discussions on standardization and security best practices.</li>\n<li><strong>Security Best Practices</strong>: All technologies and protocols must adhere to the highest standards of smart contract security. This includes regular code reviews, third-party audits, and formal verification where applicable. Developers should ensure that all known vulnerabilities are addressed prior to deployment in any testnet environment.</li>\n<li><strong>Complementary Use Cases</strong>: Proposed technologies should add value to existing use cases and not inhibit the growth or adoption of other innovations. For instance, the pre-confirmation use case does not crowd out the inclusion list use case</li>\n</ul>\n<h4><a name=\"p-17439-for-node-operators-3\" class=\"anchor\" href=\"https://research.lido.fi#p-17439-for-node-operators-3\"></a>For Node Operators</h4>\n<ol>\n<li><strong>Network Information</strong>:</li>\n</ol>\n<ul>\n<li>Specify the network (e.g., Holesky or others) where the tests will be conducted.</li>\n<li>Detail the subset of your validators participating in the tests.</li>\n<li>Duration of the testing period.</li>\n</ul>\n<ol start=\"2\">\n<li><strong>Post-Testing Assessment</strong>:</li>\n</ol>\n<ul>\n<li>Provide a brief report on the results of the tests.</li>\n<li>Engage the community in follow-up discussions based on the outcomes.</li>\n</ul>\n<h3><a name=\"p-17439-motivation-4\" class=\"anchor\" href=\"https://research.lido.fi#p-17439-motivation-4\"></a>Motivation</h3>\n<p>The <strong>PERCH</strong> framework emerges from the recognition of the need for a structured process to coordinate testnet participation between protocol developers and node operators. For example, Titan has developed infrastructure to optimize blob propagation by decoupling payloads from headers, reducing latency for rollups. As they prepare to test asynchronous blob propagation on the Holesky test network, this proposal establishes a minimally viable process for similar future requests, streamlining testing, and fostering continuous improvement within the community.</p>\n<p>Rather than making isolated proposals for each testing initiative, we propose establishing a minimally viable process for handling similar requests in the future. This approach aims to streamline testing and foster ongoing improvements within the community.</p>\n<p>We invite all interested parties to participate in this collaborative effort. Your involvement will contribute significantly to the robustness and advancement of the Ethereum ecosystem.</p>\n<h3><a name=\"p-17439-how-to-participate-5\" class=\"anchor\" href=\"https://research.lido.fi#p-17439-how-to-participate-5\"></a>How to Participate</h3>\n<p><strong>For Applicants (Projects and Protocols):</strong></p>\n<p>If you are interested in participating, please create a new thread in the research forum under the <em>Department of Decentralisation</em> tag. Your post should follow the format outlined above, including details such as the number of participants, testing outline, and expected network impact. This will provide visibility for node operators and allow them to review and express interest in collaborating on your proposal.</p>\n<p><strong>For Node Operators (NOs):</strong></p>\n<p>After reviewing an applicant’s post, please respond directly in the relevant thread, indicating your interest and any details about the subset of your validators participating in the testing. Once the testnet phase is complete, please share a post-testnet assessment in the same thread, including outcomes, insights, and any follow-up actions as outlined in the expectations above.</p>\n<p>Thank you for your interest and collaboration. For any questions or further clarification, feel free to reach out to us on this forum.</p>\n            <p><small>4 posts - 2 participants</small></p>\n            <p><a href=\"https://research.lido.fi/t/proposal-perch-protocol-evaluation-and-request-coordination-hub/8306\">Read full topic</a></p>","link":"https://research.lido.fi/t/proposal-perch-protocol-evaluation-and-request-coordination-hub/8306","pubDate":"Fri, 06 Sep 2024 12:25:26 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"research.lido.fi-topic-8306"},"source":{"@url":"https://research.lido.fi/t/proposal-perch-protocol-evaluation-and-request-coordination-hub/8306.rss","#text":"[Proposal] PERCH: Protocol Evaluation and Request Coordination Hub"}},{"title":"Nansen Delegate Thread","dc:creator":"Nansen","category":"Delegate Platform","description":"<p></p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://europe1.discourse-cdn.com/business20/uploads/lido/original/2X/f/f0697fbc1e841c76b0556340acf614c5ae0ab2db.png\" data-download-href=\"/uploads/short-url/yiMCEkLlvHhdmPx0EQlHXdMZrQv.png?dl=1\" title=\"Nansen_Logo_Primary_Horizontal_GreenBlack_RGB\" rel=\"noopener nofollow ugc\"><img src=\"https://europe1.discourse-cdn.com/business20/uploads/lido/original/2X/f/f0697fbc1e841c76b0556340acf614c5ae0ab2db.png\" alt=\"Nansen_Logo_Primary_Horizontal_GreenBlack_RGB\" data-base62-sha1=\"yiMCEkLlvHhdmPx0EQlHXdMZrQv\" width=\"517\" height=\"209\" data-dominant-color=\"07432E\"></a></div><p></p>\n<h3><a name=\"p-17434-introduction-to-nansen-1\" class=\"anchor\" href=\"https://research.lido.fi#p-17434-introduction-to-nansen-1\"></a><strong>Introduction to Nansen</strong></h3>\n<p>Nansen’s mission is to surface the signal and create winners. Nansen is a leading blockchain analytics platform that delivers actionable insights to investors and companies in the crypto space. Founded in 2020, Nansen has become one of the most trusted names in on-chain data analysis, serving a wide range of clients from individual traders to large institutions. Nansen has labeled over 300 million wallets, covering more than 95% of on-chain TVL across 20+ blockchain networks and counting.</p>\n<h3><a name=\"p-17434-address-2\" class=\"anchor\" href=\"https://research.lido.fi#p-17434-address-2\"></a><strong>Address</strong></h3>\n<ul>\n<li>nansengov.eth / 0xa4181C75495f60106AE539B7C55c0D263f2fb737</li>\n</ul>\n<h3><a name=\"p-17434-contact-information-3\" class=\"anchor\" href=\"https://research.lido.fi#p-17434-contact-information-3\"></a><strong>Contact Information</strong></h3>\n<ul>\n<li>X (Twitter): <span class=\"mention\">@nansen_ai</span> / <a href=\"https://x.com/nansen_ai\" rel=\"noopener nofollow ugc\">https://x.com/nansen_ai</a></li>\n<li>Web: <a href=\"https://www.nansen.ai/\" rel=\"noopener nofollow ugc\">https://www.nansen.ai/</a></li>\n<li>Discord: <a href=\"http://discord.gg/nansen\" rel=\"noopener nofollow ugc\">discord.gg/nansen</a></li>\n<li>Youtube: <a href=\"https://www.youtube.com/c/Nansen-ai\" rel=\"noopener nofollow ugc\">https://www.youtube.com/c/Nansen-ai</a></li>\n</ul>\n<h3><a name=\"p-17434-motivation-4\" class=\"anchor\" href=\"https://research.lido.fi#p-17434-motivation-4\"></a><strong>Motivation</strong></h3>\n<p>As a company deeply embedded in the crypto ecosystem, we are motivated to contribute to the governance of Lido DAO for several reasons:</p>\n<ol>\n<li>Unique Vantage Point: Our team consists of data scientists, engineers, researchers and crypto degens who have been at the forefront of web3 and DeFi since its inception. Nansen sits in the middle between investors, operators and builders and we believe our governance participation brings a unique data-driven point of view to the table.</li>\n<li>Community Engagement: Our network and clients spans across both crypto native funds and investors as well as banks and institutions that are just entering our industry. Our voice and social reach is impactful with more than 270,000 followers on X (Twitter) and close to a million registered users on our platform. We can leverage this to help make Lido DAO and this forum aware of community concerns and create attention around important topics.</li>\n<li>Expertise: We believe in work that promotes transparency and fairness and we want to help the Lido DAO governance community with our expertise around this. Together with our on-chain analytics, Nansen’s capabilities also include running validators, portfolio management and in-house research. We carry over 20 years of combined experience in financial markets and risk modelling and bring this to chains and projects. Recently our work with LayerZero Labs for their sybil detection [<a href=\"https://x.com/LayerZero_Labs/status/1787608904177746004\" rel=\"noopener nofollow ugc\">link</a>] and Offchain Labs for their airdrop [<a href=\"https://www.nansen.ai/research/an-on-chain-distribution-model-for-the-arbitrum-community\" rel=\"noopener nofollow ugc\">link</a>] shows our strong analytics and modelling capabilities. We were also one of the few that raised our hand to help Sky Mavis after their hack in 2022 and later became a Governing Validator for the Ronin Network [<a href=\"https://blog.roninchain.com/p/securing-ronin\" rel=\"noopener nofollow ugc\">link</a>].</li>\n</ol>\n<p>Again, as Nansen’s mission we want to help build the future of finance and with our expertise and reach we can help Lido grow as the leader in institutional-grade liquid staking solutions.</p>\n<h3><a name=\"p-17434-values-and-decision-making-approach-5\" class=\"anchor\" href=\"https://research.lido.fi#p-17434-values-and-decision-making-approach-5\"></a><strong>Values and Decision-Making Approach</strong></h3>\n<p><strong>Our D.A.T.A. approach</strong></p>\n<ol>\n<li><strong>Data-Driven</strong>: We leverage our large datasets and analytics capabilities to simplify complex issues and making onchain data accessible and actionable for the community.</li>\n<li><strong>Active</strong>: We commit to participating fully in governance, feedback in forums, proposal reviews and consistently voting. We act with ownership and treat governance decisions with care and considerations.</li>\n<li><strong>Transparent</strong>: Transparency fosters trust and speed in decision making. We always maintain clear communication about our methodologies and findings to ensure accountability to the community.</li>\n<li><strong>Analytical</strong>: We approach governance with the same mindset as curious explorers, armed with data as our compass. Our analytical process is a blend of rigorous methodology and creative problem-solving, simplifying complexity to uncover actionable insights. We’re not afraid to challenge assumptions or explore unconventional solutions, embodying the courage to push boundaries in our quest for optimal outcomes.</li>\n</ol>\n<h3><a name=\"p-17434-public-acceptance-6\" class=\"anchor\" href=\"https://research.lido.fi#p-17434-public-acceptance-6\"></a><strong>Public Acceptance</strong></h3>\n<p>Nansen fully accept and commit to upholding Lido’s Public Delegate Code of Conduct [<a href=\"https://ipfs.io/ipfs/QmPwqjn5NiNVFKjxxBnYHivgempeyNNpMNotGYMCXitRd3\" rel=\"noopener nofollow ugc\">link</a>]. Our values and objectives align closely with Lido DAO’s mission of making staking accessible, secure, and decentralised <a href=\"https://snapshot.org/#/lido-snapshot.eth/proposal/0x739fbe56425d355b5e41c22bb346b7a8217afd9e84aa49863648b1c641a482e3\" rel=\"noopener nofollow ugc\">Lido’s Vibe (Purpose, Mission, Vision)</a>.</p>\n<h3><a name=\"p-17434-disclosures-7\" class=\"anchor\" href=\"https://research.lido.fi#p-17434-disclosures-7\"></a><strong>Disclosures</strong></h3>\n<ul>\n<li>As a blockchain analytics company, we analyze and provide data on numerous crypto projects, including Lido and potential competitors. We commit to maintaining objectivity and disclosing any potential conflicts of interest that may arise. At the time of application there are no current conflicts of interest.</li>\n<li>We will always disclose relevant holdings when participating in governance decisions or abstain if there are clear conflict of interest.</li>\n</ul>\n            <p><small>2 posts - 2 participants</small></p>\n            <p><a href=\"https://research.lido.fi/t/nansen-delegate-thread/8303\">Read full topic</a></p>","link":"https://research.lido.fi/t/nansen-delegate-thread/8303","pubDate":"Fri, 06 Sep 2024 05:59:09 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"research.lido.fi-topic-8303"},"source":{"@url":"https://research.lido.fi/t/nansen-delegate-thread/8303.rss","#text":"Nansen Delegate Thread"}},{"title":"Unstaking Eth from Lido","dc:creator":"PWhizzle","category":"General","description":"<p>Hi, I unstaked my Eth and noticed an NFT in my Ethereum account. I don’t know if the NFT is legit or a scam. Assistance please.</p>\n            <p><small>2 posts - 2 participants</small></p>\n            <p><a href=\"https://research.lido.fi/t/unstaking-eth-from-lido/8287\">Read full topic</a></p>","link":"https://research.lido.fi/t/unstaking-eth-from-lido/8287","pubDate":"Thu, 05 Sep 2024 18:39:18 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"research.lido.fi-topic-8287"},"source":{"@url":"https://research.lido.fi/t/unstaking-eth-from-lido/8287.rss","#text":"Unstaking Eth from Lido"}},{"title":"Commit-Boost Grant Proposal for Lido Community","dc:creator":"DrewVanderWerff","category":"Community Grants / Initiatives","description":"<p><em>We previously introduced Commit-Boost to the Lido Community, details can be found <a href=\"https://research.lido.fi/t/introducing-commit-boost-to-the-lido-community/7913\">here</a>.</em></p>\n<p><strong>Summary</strong></p>\n<p><a href=\"https://github.com/Commit-Boost/commit-boost-client\" rel=\"noopener nofollow ugc\">Commit-Boost</a> is an effort to help reduce risks for Lido Operators and broadly the Ethereum Community while unlocking multiple use cases for new validator services. A community of teams / individuals across Ethereum is developing Commit-Boost as a not-for-profit public good supported via grant funding. <strong>As part of this, we are excited to propose a Boulder grant in the amount of $95,000 to the Lido Community / Council Members for their consideration.</strong> To help give a holistic view of expected costs, we provided a full budget, but understand the amount requested in this grant does not cover the full amount. To help with these additional costs, we have received / applied for grants from other organizations across Ethereum. We also acknowledge that there will be ongoing costs associated with the team in Commit-Boost that this grant will not cover. We plan to apply for another grant from the Lido Community to help cover these costs but want to show strong execution and stewarding of an initial grant. We appreciate the opportunity to be considered for this and believe it aligns with the ethos and mission of the Lido Ecosystem Grants Organization mission.</p>\n<p></p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://europe1.discourse-cdn.com/business20/uploads/lido/original/2X/b/bfe2f38ea6b870ce30076f821070af9f765f1e6b.png\" data-download-href=\"/uploads/short-url/rnvr9ApDqJIhKh0WwPpoGGktnD5.png?dl=1\" title=\"Estimated Summary of Budget and Milestones\" rel=\"noopener nofollow ugc\"><img src=\"https://europe1.discourse-cdn.com/business20/uploads/lido/optimized/2X/b/bfe2f38ea6b870ce30076f821070af9f765f1e6b_2_690x290.png\" alt=\"Estimated Summary of Budget and Milestones\" data-base62-sha1=\"rnvr9ApDqJIhKh0WwPpoGGktnD5\" width=\"690\" height=\"290\" srcset=\"https://europe1.discourse-cdn.com/business20/uploads/lido/optimized/2X/b/bfe2f38ea6b870ce30076f821070af9f765f1e6b_2_690x290.png, https://europe1.discourse-cdn.com/business20/uploads/lido/original/2X/b/bfe2f38ea6b870ce30076f821070af9f765f1e6b.png 1.5x, https://europe1.discourse-cdn.com/business20/uploads/lido/original/2X/b/bfe2f38ea6b870ce30076f821070af9f765f1e6b.png 2x\" data-dominant-color=\"E3E3E4\"></a></div><p></p>\n<p><strong>Introduction</strong></p>\n<p>As outlined in ReGoose around validator services, most are starting to agree on a common denominator: in the future, beacon proposers will be presented with a broader set of options of what they may “commit\" to–be it inclusions lists or preconfs or other types of commitments such as long-dated blockspace futures–compared to just an external or local payload they see today. While this is an exciting area of innovation and opportunity for Lido’s Community, many teams building commitments are creating new sidecars driving fragmentation and risks for Ethereum and the Lido operator set. With this in mind, and to reduce these risks, a group across the Ethereum / Lido Community is working on a new sidecar called Commit-Boost focused on standardizing the last mile of communication between validators and validator services. We expect the first use cases of Commit-Boost to be for PBS (i.e., MEV-boost), Inclusion Lists, and Preconfirmations.</p>\n<p><strong>Commit-Boost Design Principles</strong></p>\n<p>Commit-Boost is a community-driven, open-source project developing an unopinionated validator platform to enable safe interactions with commitments. We believe many of the core design features align with the core principles of the Lido community and a project that directly aligns with the mission of LEGO. Some of its features include:</p>\n<ul>\n<li>Unification: Core devs will be able to interact and work with one standard during Ethereum forks / upgrades / when and if things go wrong</li>\n<li>Backward compatibility + more: Commit-Boost is not only backward compatible with MEV-Boost, but will improve the life of Lido operators who only run MEV-Boost through increased reporting, telemetry / other off-the-shelf tools validators can employ</li>\n<li>Opt-in without running more sidecars: Commit-Boost will allow proposers who want to opt into other commitments to do so without having to run multiple sidecars</li>\n<li>Tools and features to help reduce risks for Lido’s operator set: In the spirit of ReGOOSE, Commit-Boost is specifically designed with off-the-shelf monitoring and proactive tools to identify risks, limit the impact of bugs, and proactively alert teams of issues that may develop from validator services</li>\n<li>Robust support: Commit-Boost software is supported by a not-for-profit entity. This team will be focused on security and robustness through policies and procedures with follow-the-sun type models where there is support 24/7 if / when things go wrong. This team will also be focused on testing and adjustments needed during hard forks and have a team to interact with to help during adoption, improvements, and sustainment</li>\n<li>Additional revenue: As part of the open innovation that Commit-Boost enables, potential validator services will continue to come online, to capture new revenue opportunities when making commitments</li>\n<li>For the Community: This team and effort will not be VC-backed. There is no monetization plan. The entity will not sell itself and will not start any monetizable side businesses. As an example, the team is actively working on a grant application to the Lido Community, among other organizations across Ethereum</li>\n</ul>\n<p><strong>What Does Success Look Like and How Does this Benefit the Lido Community</strong></p>\n<ul>\n<li>Commit-Boost is used to increase the decentralization and safety / security of Ethereum’s validator set and provide some autonomy back to proposers to express the ethos of Ethereum in their block</li>\n<li>Develop a product that reduces current and emerging risks for Ethereum and Lido Operators by running one sidecar, but allows teams to opt into many commitments / validator services creating new revenue opportunities</li>\n<li>Robust support and sustainment of Commit-Boost software that improves the lives of validators during upgrades, when things go wrong, and as new features are proposed</li>\n</ul>\n<p><strong>Details Around Deliverables</strong></p>\n<p>There are three main activities we will undertake with this initial grant; development, adoption, and sustainment. The grant will specifically help cover development and adoption as well as lay the foundation for sustainment. Below are some key deliverables, but details can also be found in the Commit-Boost <a href=\"https://github.com/Commit-Boost/commit-boost-client/issues\" rel=\"noopener nofollow ugc\">repo</a>.</p>\n<p><strong>Development:</strong> This is focused on various key deliverables around Commit-Boost sidecar + PBS module ready for audit features including:</p>\n<ul>\n<li>CBC1 (Q4): Core Commit-Boost functionality for backward compatibility ready for audit</li>\n<li>CBC2 (Q4): PBS module extensions (i.e., miss slot / get_header) ready for audit</li>\n<li>CBC3 (Q4): Transparency and metrics implemented for PBS module (i.e., Grafana dashboards), and extendable to other modules and ready for audit</li>\n<li>CBC4 (Q4): Research, design and develop as well as get code audit ready to enable containerization of modules</li>\n<li>CBC5 (Q4): Work with module creators / the broader ecosystem to finalize module APIs and get code audit ready</li>\n<li>CBC6 (Q4): Support more flexibility as part of Commit-Boost core functionality such as binaries with code ready for audit</li>\n<li>CBE1 (Q4): Research and potential development around the best path forward for providing signatures not related to PBS. We already support BLS, but need to gather feedback and work towards whether we should support domains or proxy BLS signatures as well as ECDSA. While it is a bit unknown at this time, the grant can also get this part of the code base to audit</li>\n<li>CBE2 (Q4-Q1): We have a simple implementation of our proxy signer, but we need to evaluate and spec proxy signature for multiple validator set-ups / work with client / remote signer teams (this will be impacted by CBE1). While it is a bit unknown at this time, the grant can also get this part of the code base to audit</li>\n</ul>\n<p>Budget estimates for Development is $135,000 broken out across Development and Research for $50,000 and Audits estimated at $85,000.</p>\n<p><strong>Adoption</strong></p>\n<ul>\n<li>CBA1 (Q4 – Q1): There are a few key events such as Edge City, Devcon, ETHconomics, and ETH Denver that could really benefit the team to have budget to attend</li>\n<li>CBA2 (2025): There are a few key subscriptions that the team needs to increase broader support for the community / outreach. One example includes a professional Zoom account to record community calls</li>\n<li>CBA3 (throughout development): Enhance documentation with changes / updated code</li>\n<li>CBA4 (Q4 - Q1): One headcount focused on driving BD / coordination / adoption and helping push the overall commitment space forward</li>\n</ul>\n<p>Budget estimates for Adoption is estimated at $65k.</p>\n<p><strong>Sustainment</strong></p>\n<ul>\n<li>CBS1 (Q4): We need to have some legal analysis performed to help decide on the best entity set-up given the structure of Commit-Boost. The output of this analysis is the decision on how best to move forward</li>\n<li>CBS2 (Q4): Set-up entity based on the above analysis</li>\n<li>CBS3 (Q4 – Q1): While we can’t list all items out, get the entity to be functioning with proper disclosures, contract templates for employees, bank accounts, multi-sigs, and many other functions required to run the entity</li>\n</ul>\n<p>Budget estimates to lay the foundation for Sustainment is $15k.</p>\n<p><strong>What is the Plan for Commit-Boost the Entity</strong></p>\n<p>We have written about this before, but please see below for the current plan / path we are headed down:</p>\n<ul>\n<li>Set-up similar to a client team, but not-for-profit US-based entity with no VC backing or plans to sell / start side businesses for monetization, and no token</li>\n<li>There will be a global team of a few devs + some business development-type personnel that focus on education and transparency, sustainment / development, and research:\n<ul>\n<li>Education and Transparency: This effort will keep the broader ethereum community educated on the latest through open-source repo and governance calls / governance process</li>\n<li>Sustainment / Development: 24/7 follow-the-sun coverage and highly engaged with client teams around upgrades / early in getting testnet support</li>\n<li>Research Focus: Still a tbd and this is mainly for retention of devs / making sure they are staying plugged into the latest, but helping with open-source research across Ethereum</li>\n</ul>\n</li>\n</ul>\n<p><strong>More Details on Education and Governance Around Commit-Boost</strong></p>\n<ul>\n<li>Initially, will run a Commit-Boost, ACDC-like call frequently to engage with stakeholders and drive consensus on upgrades / help coordinate around hard forks (more details on call <span class=\"hashtag-raw\">#0</span> <a href=\"https://github.com/Commit-Boost/pm/blob/main/Community_Calls/Call0.md\" rel=\"noopener nofollow ugc\">here</a>)</li>\n<li>We have also been speaking with others across the ecosystem to figure out the best way to do governance given calls can attract certain types of people (i.e., tougher for non-english speaking etc), but the point is to be open and driven by the community</li>\n<li>While still a work in progress, if a board is required to oversee the Commit-Boost entity their focus will be on entity corporate governance and not on Commit-Boost software or direction and these members will be experts from across the Ethereum community</li>\n<li>We welcome Lido’s ideas around what they have learned over the years</li>\n</ul>\n<p><strong>Conclusion</strong></p>\n<p>We appreciate Lido Community’s consideration of this proposal. Please let us know if anything is unclear or more details are needed.</p>\n<p><strong>Other Resources to Learn More:</strong></p>\n<ul>\n<li>Non-Technical <a href=\"https://twisty-wednesday-4be.notion.site/Commit-Boost-Reducing-Risks-and-Returning-Autonomy-Over-the-Block-Back-to-Ethereum-s-Validators-0f309f76058e447388381c60550ce67b\" rel=\"noopener nofollow ugc\">Document</a> on Commit-Boost</li>\n<li><a href=\"https://commit-boost.github.io/commit-boost-client/\" rel=\"noopener nofollow ugc\">Commit-Boost Docs</a></li>\n<li><a href=\"https://github.com/Commit-Boost\" rel=\"noopener nofollow ugc\">Commit-Boost Repo</a></li>\n<li><a href=\"https://chatgpt.com/g/g-4nFbVTiRT-commit-boost\" rel=\"noopener nofollow ugc\">Commit-Boost ChatGPT</a></li>\n<li>First <a href=\"https://ethresear.ch/t/based-proposer-commitments-ethereum-s-marketplace-for-proposer-commitments/19517\" rel=\"noopener nofollow ugc\">post</a> on ETHResearch</li>\n<li>Second <a href=\"https://ethresear.ch/t/commit-boost-proposer-platform-to-safely-make-commitments/20107\" rel=\"noopener nofollow ugc\">post</a> on ETHResearch</li>\n<li>First community <a href=\"https://www.youtube.com/watch?v=jM3uL00UoKk&amp;list=PLX8-iUuiFSHcr8hy2Bmcq6Wkeez_3KXQH\" rel=\"noopener nofollow ugc\">call</a> <a href=\"https://docs.google.com/document/d/1-UpILcKmwXWiBz7E3MO9H8raK9Cq0KWddkMjT8RltJo/edit#heading=h.2whbk0my4lq5\" rel=\"noopener nofollow ugc\"></a>and <a href=\"https://docs.google.com/document/d/1-UpILcKmwXWiBz7E3MO9H8raK9Cq0KWddkMjT8RltJo/edit#heading=h.2whbk0my4lq5\" rel=\"noopener nofollow ugc\">notes</a></li>\n<li><a href=\"https://streameth.org/zuberlin/watch?session=66681afef9b8e98b1ec95fdd\" rel=\"noopener nofollow ugc\">Talk at zuBerlin</a></li>\n<li><a href=\"https://github.com/eserilev/il-boost\" rel=\"noopener nofollow ugc\">Inclusion List Shape</a></li>\n<li>zuBerlin <a href=\"https://x.com/Commit_Boost/status/1802442015877070921\" rel=\"noopener nofollow ugc\">Devnet</a></li>\n<li>Helder <a href=\"https://x.com/Commit_Boost/status/1812834025993613370\" rel=\"noopener nofollow ugc\">Testnet</a></li>\n</ul>\n            <p><small>2 posts - 2 participants</small></p>\n            <p><a href=\"https://research.lido.fi/t/commit-boost-grant-proposal-for-lido-community/8285\">Read full topic</a></p>","link":"https://research.lido.fi/t/commit-boost-grant-proposal-for-lido-community/8285","pubDate":"Thu, 05 Sep 2024 17:30:26 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"research.lido.fi-topic-8285"},"source":{"@url":"https://research.lido.fi/t/commit-boost-grant-proposal-for-lido-community/8285.rss","#text":"Commit-Boost Grant Proposal for Lido Community"}},{"title":"Innovation grant request : NGO Doctors Without Borders / Medecins Sans Frontieres (MSF)","dc:creator":"MSF","category":"Community Grants / Initiatives","description":"<h2><a name=\"p-17372-h-789x444httpslh7-rtgoogleusercontentcomdocszad_4nxeru9ozrfftxpfn-8qjkwt_m6ziew0wv_mdjdv3nkgakxpiiuqfrtje7gwwafp3tl3joeqixc6ke94samslhz5w1-51csopzv2ujtc3k0h4knwasecztzst2ugtsvlfeteb4a-bz3sztz6z8j5iirxz4gylkeyxmtdzx1wiklerfa_gp5xoa-1\" class=\"anchor\" href=\"https://research.lido.fi#p-17372-h-789x444httpslh7-rtgoogleusercontentcomdocszad_4nxeru9ozrfftxpfn-8qjkwt_m6ziew0wv_mdjdv3nkgakxpiiuqfrtje7gwwafp3tl3joeqixc6ke94samslhz5w1-51csopzv2ujtc3k0h4knwasecztzst2ugtsvlfeteb4a-bz3sztz6z8j5iirxz4gylkeyxmtdzx1wiklerfa_gp5xoa-1\"></a><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://europe1.discourse-cdn.com/business20/uploads/lido/original/2X/e/e607926aa301b42933fd7cd4b30ee754c429a6c6.png\" data-download-href=\"/uploads/short-url/wOW2xDD6nrrD9whODUVID5GtHOC.png?dl=1\" title=\"\" rel=\"noopener nofollow ugc\"><img src=\"https://europe1.discourse-cdn.com/business20/uploads/lido/optimized/2X/e/e607926aa301b42933fd7cd4b30ee754c429a6c6_2_690x388.png\" alt=\"\" width=\"690\" height=\"388\" role=\"presentation\" data-dominant-color=\"B9A5A5\" srcset=\"https://europe1.discourse-cdn.com/business20/uploads/lido/optimized/2X/e/e607926aa301b42933fd7cd4b30ee754c429a6c6_2_690x388.png, https://europe1.discourse-cdn.com/business20/uploads/lido/original/2X/e/e607926aa301b42933fd7cd4b30ee754c429a6c6.png 1.5x, https://europe1.discourse-cdn.com/business20/uploads/lido/original/2X/e/e607926aa301b42933fd7cd4b30ee754c429a6c6.png 2x\"></a></div></h2>\n<h1><a name=\"p-17372-summary-2\" class=\"anchor\" href=\"https://research.lido.fi#p-17372-summary-2\"></a>Summary</h1>\n<h2><a name=\"p-17372-nobel-peace-prize-holder-doctors-without-borders-mdecins-sans-frontires-msfhttpswwwmsforg-is-requesting-an-innovation-grant-of-100k-in-eth-to-support-the-development-of-a-pioneering-liquid-staking-donation-initiative-stake2carehttpsstake2caremsfch-3\" class=\"anchor\" href=\"https://research.lido.fi#p-17372-nobel-peace-prize-holder-doctors-without-borders-mdecins-sans-frontires-msfhttpswwwmsforg-is-requesting-an-innovation-grant-of-100k-in-eth-to-support-the-development-of-a-pioneering-liquid-staking-donation-initiative-stake2carehttpsstake2caremsfch-3\"></a>Nobel Peace Prize holder <a href=\"https://www.msf.org/\" rel=\"noopener nofollow ugc\">Doctors Without Borders / Médecins Sans Frontières (MSF)</a> is requesting an innovation grant of $100k in ETH to support the development of a pioneering liquid staking donation initiative <a href=\"https://stake2care.msf.ch/\" rel=\"noopener nofollow ugc\">Stake2Care</a>.</h2>\n<p>Raising philanthropic money to support urgent medical support is very costly, sharing a fraction of a future revenue from staking rewards is painless.</p>\n<p>With <a href=\"https://stake2care.msf.ch/\" rel=\"noopener nofollow ugc\">Stake2Care</a>, ETH owners can participate in liquid staking via the Lido protocol and can effortlessly commit their rewards to MSF via a dedicated Impact staking pool.</p>\n<p>It’s an invitation for the Lido community to pave the way and write history with us, being the first community to generously support philanthropy commitments via liquid staking rewards.</p>\n<p>The presentation of Stake2Care is <a href=\"https://docs.google.com/presentation/d/1wxAxK_eVWEqdMZATQWudrFVwY6QUn-YBh89YE2gB_0g/edit?usp=sharing\" rel=\"noopener nofollow ugc\">attached here</a></p>\n<p>Source code publicly available <a href=\"https://github.com/Cadmos-finance/Stake2Care-sc\" rel=\"noopener nofollow ugc\">on GitHub </a></p>\n<p>Security audits from <a href=\"https://github.com/Cadmos-finance/Stake2Care-sc/blob/master/audits/25-06-2024_BlackPaper.pdf\" rel=\"noopener nofollow ugc\">BlackPaper</a> and <a href=\"https://github.com/Cadmos-finance/Stake2Care-sc/blob/master/audits/17-06-2024_HHK.pdf\" rel=\"noopener nofollow ugc\">HHK</a></p>\n<p>Contract Address : <a href=\"https://etherscan.io/address/0x34f4e4b964a3e648723ae71af5550fbc85e2e534\" rel=\"noopener nofollow ugc\">0x34f4e4b964a3e648723aE71AF5550FbC85E2e534</a></p>\n<p>Multisig Address : <a href=\"https://etherscan.io/address/stake2care.eth\" rel=\"noopener nofollow ugc\">stake2care.eth</a></p>\n<p>Dune Analytics : <a href=\"https://dune.com/nbfinancetech/msfeth/a22ca029-1cc2-49a8-8201-af43266d19b6\" rel=\"noopener nofollow ugc\">Stake2Care Dashboard v1</a></p>\n<p>Stake2Care initiative is Smart Contract based and has been designed to keep three principle in mind:</p>\n<ul>\n<li>Simplicity</li>\n<li>Modularity</li>\n<li>Transparency</li>\n</ul>\n<p>Phase One (done) :</p>\n<ul>\n<li>Design <img src=\"https://emoji.discourse-cdn.com/apple/white_check_mark.png?v=12\" title=\":white_check_mark:\" class=\"emoji\" alt=\":white_check_mark:\" loading=\"lazy\" width=\"20\" height=\"20\"></li>\n<li>Development <img src=\"https://emoji.discourse-cdn.com/apple/white_check_mark.png?v=12\" title=\":white_check_mark:\" class=\"emoji\" alt=\":white_check_mark:\" loading=\"lazy\" width=\"20\" height=\"20\"></li>\n<li>Security audits <img src=\"https://emoji.discourse-cdn.com/apple/white_check_mark.png?v=12\" title=\":white_check_mark:\" class=\"emoji\" alt=\":white_check_mark:\" loading=\"lazy\" width=\"20\" height=\"20\"></li>\n<li>Stake2Care Mainnet is LIVE ! <img src=\"https://emoji.discourse-cdn.com/apple/white_check_mark.png?v=12\" title=\":white_check_mark:\" class=\"emoji\" alt=\":white_check_mark:\" loading=\"lazy\" width=\"20\" height=\"20\"></li>\n</ul>\n<p>Phase Two (ongoing) : Broadcasting &amp; Engaging</p>\n<ul>\n<li>Advertising : ongoing 12 weeks (no paid ads - internal ) <div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://europe1.discourse-cdn.com/business20/uploads/lido/original/2X/2/2cbf19867439ae1a5e1f1f37e0d3229a00b3f27c.png\" data-download-href=\"/uploads/short-url/6nQr9qj8Q4gZwdw9lXTHt6hxcSM.png?dl=1\" title=\"\" rel=\"noopener nofollow ugc\"><img src=\"https://europe1.discourse-cdn.com/business20/uploads/lido/optimized/2X/2/2cbf19867439ae1a5e1f1f37e0d3229a00b3f27c_2_20x20.png\" alt=\"\" width=\"20\" height=\"20\" role=\"presentation\" data-dominant-color=\"61CDBA\" srcset=\"https://europe1.discourse-cdn.com/business20/uploads/lido/optimized/2X/2/2cbf19867439ae1a5e1f1f37e0d3229a00b3f27c_2_20x20.png, https://europe1.discourse-cdn.com/business20/uploads/lido/optimized/2X/2/2cbf19867439ae1a5e1f1f37e0d3229a00b3f27c_2_30x30.png 1.5x, https://europe1.discourse-cdn.com/business20/uploads/lido/optimized/2X/2/2cbf19867439ae1a5e1f1f37e0d3229a00b3f27c_2_40x40.png 2x\"></a></div></li>\n<li>Media diffusion strategy ( specialised and traditional media - paid support ) <div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://europe1.discourse-cdn.com/business20/uploads/lido/original/2X/2/2cbf19867439ae1a5e1f1f37e0d3229a00b3f27c.png\" data-download-href=\"/uploads/short-url/6nQr9qj8Q4gZwdw9lXTHt6hxcSM.png?dl=1\" title=\"\" rel=\"noopener nofollow ugc\"><img src=\"https://europe1.discourse-cdn.com/business20/uploads/lido/optimized/2X/2/2cbf19867439ae1a5e1f1f37e0d3229a00b3f27c_2_20x20.png\" alt=\"\" width=\"20\" height=\"20\" role=\"presentation\" data-dominant-color=\"61CDBA\" srcset=\"https://europe1.discourse-cdn.com/business20/uploads/lido/optimized/2X/2/2cbf19867439ae1a5e1f1f37e0d3229a00b3f27c_2_20x20.png, https://europe1.discourse-cdn.com/business20/uploads/lido/optimized/2X/2/2cbf19867439ae1a5e1f1f37e0d3229a00b3f27c_2_30x30.png 1.5x, https://europe1.discourse-cdn.com/business20/uploads/lido/optimized/2X/2/2cbf19867439ae1a5e1f1f37e0d3229a00b3f27c_2_40x40.png 2x\"></a></div></li>\n</ul>\n<p><img src=\"https://emoji.discourse-cdn.com/apple/rotating_light.png?v=12\" title=\":rotating_light:\" class=\"emoji\" alt=\":rotating_light:\" loading=\"lazy\" width=\"20\" height=\"20\">Grant request for module development and maintenance​:rotating_light:</p>\n<ol>\n<li><a href=\"https://docs.google.com/document/d/1ulU7d6tNJu8E0p1OdoCVQRojdL19NKvTghuQ61R1qNs/edit#heading=h.exukuwu7zyb\" rel=\"noopener nofollow ugc\">TimeLock contract </a></li>\n<li><a href=\"https://docs.google.com/document/d/1ulU7d6tNJu8E0p1OdoCVQRojdL19NKvTghuQ61R1qNs/edit#heading=h.frfufv8800nd\" rel=\"noopener nofollow ugc\">Point system </a></li>\n<li><a href=\"https://docs.google.com/document/d/1ulU7d6tNJu8E0p1OdoCVQRojdL19NKvTghuQ61R1qNs/edit#heading=h.3ffkdwvefxrj\" rel=\"noopener nofollow ugc\">Donation snippet / Partners integration</a></li>\n<li><a href=\"https://docs.google.com/document/d/1ulU7d6tNJu8E0p1OdoCVQRojdL19NKvTghuQ61R1qNs/edit#heading=h.hcf1w8k7vfod\" rel=\"noopener nofollow ugc\">Donation Dashboard </a></li>\n<li><a href=\"https://docs.google.com/document/d/1ulU7d6tNJu8E0p1OdoCVQRojdL19NKvTghuQ61R1qNs/edit#heading=h.75n7sjbq1l2a\" rel=\"noopener nofollow ugc\">Tax certificate generator (for tax exemption in some countries)</a></li>\n<li><a href=\"https://docs.google.com/document/d/1ulU7d6tNJu8E0p1OdoCVQRojdL19NKvTghuQ61R1qNs/edit#heading=h.rn1diccc0utf\" rel=\"noopener nofollow ugc\">Video content (illustration) for promotion</a></li>\n<li><a href=\"https://docs.google.com/document/d/1ulU7d6tNJu8E0p1OdoCVQRojdL19NKvTghuQ61R1qNs/edit#heading=h.nznmshrb7u2g\" rel=\"noopener nofollow ugc\">Impact Vault Bootstrap</a></li>\n</ol>\n<p>Phase Three (following grant linked developments) : Innovative Incentives Program</p>\n<ul>\n<li>Point system granting rewards based on donations (enabling you to acquire the following badges: Supporter, Admirable, Pivotal, Influential, Transformative, Grand Donors)</li>\n<li>Point system will generate soul bound tokens that act as badges to recognize the commitment and status of a donor, that could lead to exclusive MSF philanthropy events in the future.</li>\n</ul>\n<h1><a name=\"p-17372-expenses-4\" class=\"anchor\" href=\"https://research.lido.fi#p-17372-expenses-4\"></a>Expenses</h1>\n<p>At MSF, we champion transparency and accountability as you can see in our <a href=\"https://www.msf.org/international-activity-report-2023\" rel=\"noopener nofollow ugc\">latest international activities report.</a></p>\n<p>Whenever possible, expenses are paid in USDC or ETH to ensure full transparency of the funds spent.</p>\n<p>Operational costs for phase one &amp; two have been covered by private donations for a total amount of $33140.</p>\n<p>Expenses to date (including ones paid in USD and EUR) are available <a href=\"https://ipfs.io/ipfs/QmaTy5Rhtz6XcrpnXgjsuyDm2kNdfSH5FP2UYmgvjpDx3Q/\" rel=\"noopener nofollow ugc\">via IPFS</a> and listed hereafter:</p>\n<p>CID: QmaTy5Rhtz6XcrpnXgjsuyDm2kNdfSH5FP2UYmgvjpDx3Q</p>\n<ul>\n<li>Development</li>\n<li>UI/UX</li>\n<li>Audit 1</li>\n<li>Audit 2</li>\n<li>Media Diffusion</li>\n</ul>\n<h1><a name=\"p-17372-purpose-5\" class=\"anchor\" href=\"https://research.lido.fi#p-17372-purpose-5\"></a>Purpose</h1>\n<p>MSF is looking to sustain its financial independence from government funding, and remain driven by medical needs alone with no interference from political agendas. It is actively seeking to leverage blockchain as means to shorten intermediaries between donors and patients, and sees in cryptocurrencies a new way for philanthropic giving.</p>\n<p>MSF wants Stake2Care to support its Emergency fund, allowing for immediate deployment to any emergency unfolding, and as such to save as many lives as possible, not waiting for financial support to trickle in or support for a particular situation to materialise. This is all the more crucial when crises we intervene in do not make it to the public eye and don’t benefit from Media attention.</p>\n<p>MSF is a direct implementer, guaranteeing support costs are optimal at all times, and not diluted by paying intermediaries to deliver aid. Transparency in disbursement and accountability to our donors and the public are weaved into our ways of working, as we report back on how every amount received is used.</p>\n<p>A donation of 50 CHF can go to fund 3 Surgical kits, one of 100 CHF can fund 25 Cholera vaccines, while one of 200 CHF can provide 28 malnourished children with therapeutic food for 2 weeks, and so on: MSF believes in individual donations put together allow for a unique &amp; direct impact.</p>\n<p>We are a non-profit organisation and 80% of our financial resources are allocated to fulfilling our social mission. Our fundraising costs are among the lowest in the sector, but still account for</p>\n<p>15%: Help us drive this number down, while helping us fund our activities!</p>\n<p>MSF is also highly attuned to the current workload and priorities of the Lido development team, and has successfully endeavoured to remain self-sufficient through the development process of this project - relying on existing learning materials, documentation and code as far as is possible. We believe that there will very few lulls in development for Ethereum and Lido as the Surge, Verge, Purge and Splurge advance - so are keen to begin this work as soon as is possible in Q4 2024 - and liaise closely with the Lido team to schedule future reviews, in-depth testing and go-live as busy schedules allow in the following months.</p>\n<p>—------</p>\n<p>Who is Doctors Without Borders?</p>\n<p>A worldwide movement since 1971:</p>\n<p>Doctors Without Borders (Médecins Sans Frontières, MSF) is an international, independent medical humanitarian organisation that provides medical assistance to people affected by conflict, epidemics, disasters, or exclusion from healthcare. MSF was founded in 1971 in Paris by a group of doctors and journalists with the aim of delivering rapid, effective, and impartial emergency medical aid. Over 52 years old, MSF has become a global movement of nearly 52,000 employees active in more than 70 countries around the world (2023 numbers). MSF is a non-profit, self-governed, member-based organisation.</p>\n<p>Patients first:</p>\n<p>MSF was created in the belief that all people should have access to healthcare regardless of gender, race, religion, creed or political affiliation, and that people’s medical needs outweigh respect for national boundaries. MSF’s principles of action are described in our <a href=\"https://www.msf.org/msf-charter\" rel=\"noopener nofollow ugc\">charter</a>, which establishes a framework for our activities. MSF seeks to provide high-quality care to patients and advocate for affordable, high-quality medicines. Our actions are guided by medical ethics and by our working principles: impartiality, independence, neutrality, bearing witness, transparency, and accountability.</p>\n<p>MSF in figures:</p>\n<p>In 2023, MSF provided more than 16 million outpatient consultations, more than 3,2 million vaccinations against measles and performed over 125,000 surgical interventions. All these achievements are made possible thanks to more than 7,3 million individual donors and private institutions (private companies and foundations) that provide 98 per cent of the annual funds raised by the MSF movement. Individual private donors are the very condition of MSF independence and allow us to offer assistance based on our evaluation of medical needs, independent of political, economic or religious interests.</p>\n<p>—------</p>\n<h2><a name=\"p-17372-h-6\" class=\"anchor\" href=\"https://research.lido.fi#p-17372-h-6\"></a></h2>\n<p>How does it work ?</p>\n<p>A donor stakes its ETH via Stake2Care, ETH are sent to the Lido protocol, converted in stETH and sent to Stake2Care pool, donor receives in exchange an amount of msfETH tokens equivalent of the stETH staked via the pool.</p>\n<p>So the Stake2Care pool begins to receive daily rewards starting from the first day of staking. Stake2Care uses Lido protocol and captures only the rewards.</p>\n<p>donors only see their msfETH balance while an automatic change in the MSF wallet balance will be visible without an accompanying transaction.</p>\n<p>When the user wants to exchange msfETH tokens, he can use the GUI interface to unstake its msfETH, receive stETH in exchange and he will start capturing again the rewards linked to its stETH received.</p>\n<p>In short:</p>\n<ul>\n<li>A donor decides the maximum amount of ETH to stake.</li>\n<li>Donor chooses the generosity factor.</li>\n<li>As long as stETH are in the Stake2Care Impact Vault, rewards are sent automatically to MSF.</li>\n<li>As long as the donor owns msfETH, he can withdraw from the Stake2Care Impact Vault and receive stETH in exchange.</li>\n<li>If a donor has staked ETH, he will receive msfETH. When he wants to withdraw from the vault, he will receive stETH in exchange (not ETH).</li>\n<li>The collected donations are to be held within an account opened in a Bank custody for MSF in order to convert some of the proceeds to buy material for emergency support.</li>\n<li>The privileges of MSF over the staking pool should be minimised to follow security best practices and ensure that MSF cannot be requalified as having the custody of the staked funds.</li>\n<li>The smart contract is optimised to minimise transaction fees (gas costs) and have the widest possible reach.</li>\n<li>To further increase the MSF revenues flow, we will apply to Lido’s revenue-sharing program.</li>\n<li>The project will be delivered with comprehensive security checks and “ready to be audited”.</li>\n</ul>\n<p>Leveraging LIDO technologies to build multi yield strategies with a philanthropic component</p>\n<p>msfETH token could work across various DeFi platforms (Lending, Yield Farming, Liquidity Pools) which implies msfETH could potentially be used as a collateral to exploit the full potential of DeFi similar to ETH tokens.</p>\n<p>We are reflecting now on future multi yield strategies with a philanthropic yield component.</p>\n<h1><a name=\"p-17372-h-709x594httpslh7-rtgoogleusercontentcomdocszad_4nxc7hd8bp0w8fsxceist8qaxrg65xy69hjtjfp1rkvxnj88k9qmesoh_whdf4bbpzt-pueed5ef5hwx_7jvrzv9phntkzbvcnley8qjk0puwzsdkzgddrrt3jo2wncxco9havreghnv05qithhhvwrnbeftrkeyxmtdzx1wiklerfa_gp5xoa-7\" class=\"anchor\" href=\"https://research.lido.fi#p-17372-h-709x594httpslh7-rtgoogleusercontentcomdocszad_4nxc7hd8bp0w8fsxceist8qaxrg65xy69hjtjfp1rkvxnj88k9qmesoh_whdf4bbpzt-pueed5ef5hwx_7jvrzv9phntkzbvcnley8qjk0puwzsdkzgddrrt3jo2wncxco9havreghnv05qithhhvwrnbeftrkeyxmtdzx1wiklerfa_gp5xoa-7\"></a><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://europe1.discourse-cdn.com/business20/uploads/lido/original/2X/1/1c8723043e27baa246523226c48ee34aa383f038.jpeg\" data-download-href=\"/uploads/short-url/44mTHqTLJVMIOzA2zNnr9iQWmJa.jpeg?dl=1\" title=\"\" rel=\"noopener nofollow ugc\"><img src=\"https://europe1.discourse-cdn.com/business20/uploads/lido/optimized/2X/1/1c8723043e27baa246523226c48ee34aa383f038_2_596x500.jpeg\" alt=\"\" width=\"596\" height=\"500\" role=\"presentation\" data-dominant-color=\"EFEFEF\" srcset=\"https://europe1.discourse-cdn.com/business20/uploads/lido/optimized/2X/1/1c8723043e27baa246523226c48ee34aa383f038_2_596x500.jpeg, https://europe1.discourse-cdn.com/business20/uploads/lido/optimized/2X/1/1c8723043e27baa246523226c48ee34aa383f038_2_894x750.jpeg 1.5x, https://europe1.discourse-cdn.com/business20/uploads/lido/original/2X/1/1c8723043e27baa246523226c48ee34aa383f038.jpeg 2x\"></a></div></h1>\n<p>MSF has created a set of smart contracts which are split in two main features :</p>\n<h2><a name=\"p-17372-h-1-lidomsfvault-8\" class=\"anchor\" href=\"https://research.lido.fi#p-17372-h-1-lidomsfvault-8\"></a>1- LidoMSFVault</h2>\n<ul>\n<li>The LidoMSFVault is the core smart contract in charge of revenue donation. It is an ERC 4626 Vault, a standard to optimise and unify the technical parameters of yield-bearing vaults. ERC 4626 Vault are smart contracts designed to optimise the returns on cryptocurrency assets by pooling and strategically allocating them across various DeFi protocols.</li>\n<li>LidoMSFVault is used to donate the revenues of a value-accruing stETH to MSF wallet.</li>\n<li>On Deposit of stETH, the user receives msfETH. Withdrawals are instantaneous and handled in stETH only.</li>\n<li>At each deposit or withdrawal, the LidoMSFVault automatically distributes the Vault’s surplus (contract balance of stETH – issued msfETH) to MSF address.</li>\n<li>Deposits and withdrawals are exclusively done in stETH.</li>\n<li>Provisions have been implemented in order to protect the depositor against a potential slashing risk. Namely as follows:\n<ul>\n<li>ERC-4626 mechanics are used to mint/burn redeem token depending on the vault underlying net value in stETH. Due to revenues donation to MSF, the value of one vault token is superiorly bounded by 1 stETH.</li>\n<li>In case of slashing, we wait for the asset to rebase above 1 before resuming distributions.</li>\n<li>To alleviate the remote risk of the asset rebasing up then down due to an oracle malfunction, we have put in place a 24-hour time-lock before surplus distribution takes place.</li>\n</ul>\n</li>\n</ul>\n<h2><a name=\"p-17372-h-2-lidomsfvaultdepositor-9\" class=\"anchor\" href=\"https://research.lido.fi#p-17372-h-2-lidomsfvaultdepositor-9\"></a>2 - LidoMSFVaultDepositor</h2>\n<p>This smart contract mediates deposits into the LidoMSFVault, allowing users to easily deposit stETH or ETH through an unified entrypoint.</p>\n<p>When depositing stETH, the smart contract must be appropriately approved.</p>\n<p>For ETH</p>\n<p>The User chooses how many ETH he wishes to convert to stETH and which proportion thereof he wishes to stake into the LidoMSFVault. She receives a mix of stETH and msfETH depending on her chosen deposit proportion.</p>\n<p>For stETH</p>\n<p>This function directly routes the chosen stake amount to the LidoMSFVault.</p>\n<p>Note: Although the user can directly ‘deposit’ ETH into the Vault from an UX standpoint, withdrawals from the vault are exclusively handled in stETH.</p>\n<h2><a name=\"p-17372-assessing-and-countering-risks-10\" class=\"anchor\" href=\"https://research.lido.fi#p-17372-assessing-and-countering-risks-10\"></a>Assessing and countering risks</h2>\n<h3><a name=\"p-17372-slashing-penalties-11\" class=\"anchor\" href=\"https://research.lido.fi#p-17372-slashing-penalties-11\"></a>Slashing penalties</h3>\n<ul>\n<li>A validator incurs a slashing penalty when committing a slashable offence, pushing them into a slashed state on Ethereum. This can happen in t</li>\n<li>If there is a slashing and the surplus is negative, no distribution occurs. As a consequence one msfETH is always worth equal or less than one stETH.</li>\n</ul>\n<h3><a name=\"p-17372-oracle-issue-12\" class=\"anchor\" href=\"https://research.lido.fi#p-17372-oracle-issue-12\"></a>Oracle issue</h3>\n<ul>\n<li>To further protect the depositor against a remote, thought possible, devaluation of stETH due to a faulty reporting of the accounting Oracle where Oracle overestimates rebasing and then needs to issue a correction to reach the correct amount, we implemented a 24-hour timelock so that we only distribute the minimum of the current surplus and the surplus 24 hours ago.</li>\n</ul>\n<h2><a name=\"p-17372-scope-of-work-13\" class=\"anchor\" href=\"https://research.lido.fi#p-17372-scope-of-work-13\"></a>Scope of Work</h2>\n<p>Initial Phase: Design, Development &amp; Deployment <img src=\"https://emoji.discourse-cdn.com/apple/white_check_mark.png?v=12\" title=\":white_check_mark:\" class=\"emoji\" alt=\":white_check_mark:\" loading=\"lazy\" width=\"20\" height=\"20\"></p>\n<ul>\n<li>Building the MSF liquidity Pool via a set of smart contracts</li>\n<li>Dedicated webpage with Web3 wallet integration and stake2Care donation module, under the umbrella of <a href=\"https://www.msf.ch/\" rel=\"noopener nofollow ugc\">MSF Switzerland</a>,</li>\n<li>Webpage including MSF background, Web3 Initiative, technical explanation including Smart contract details, links to audits, Q&amp;A</li>\n</ul>\n<p>Smart Contracts and connectors <img src=\"https://emoji.discourse-cdn.com/apple/white_check_mark.png?v=12\" title=\":white_check_mark:\" class=\"emoji\" alt=\":white_check_mark:\" loading=\"lazy\" width=\"20\" height=\"20\"></p>\n<p>Product design : 4 weeks</p>\n<p>Code : 8 weeks</p>\n<p>Unit test : 2 weeks</p>\n<p>Security tests : 4 weeks</p>\n<p>Webpage : <img src=\"https://emoji.discourse-cdn.com/apple/white_check_mark.png?v=12\" title=\":white_check_mark:\" class=\"emoji\" alt=\":white_check_mark:\" loading=\"lazy\" width=\"20\" height=\"20\"></p>\n<p>Design : 2 week</p>\n<p>Content : 2 weeks</p>\n<p>Deployment : 1 week <img src=\"https://emoji.discourse-cdn.com/apple/white_check_mark.png?v=12\" title=\":white_check_mark:\" class=\"emoji\" alt=\":white_check_mark:\" loading=\"lazy\" width=\"20\" height=\"20\"></p>\n<p>Impact Vault Smart Contracts <img src=\"https://emoji.discourse-cdn.com/apple/white_check_mark.png?v=12\" title=\":white_check_mark:\" class=\"emoji\" alt=\":white_check_mark:\" loading=\"lazy\" width=\"20\" height=\"20\"></p>\n<p>These are the two contracts described above: LidoMSFVault and LidoMSFVaultDepositor, which respectively handle the core logic and accounting of the Impact Staking drive as well as the integration with the Lido Core protocol in order to drive vanilla ETH deposits into the system, thus driving new inflows into the Lido ecosystem.</p>\n<p>The LidoMSFVault respects the ERC4626 standard, allowing seamless deposits and withdrawals of stETH, this fits with our ambition to drive msfETH usage throughout DeFi and have msfETH being on boarded as a valid collateral in DeFi lending protocols.</p>\n<p>—-------</p>\n<h2><a name=\"p-17372-scope-of-engineering-work-timeline-still-pending-14\" class=\"anchor\" href=\"https://research.lido.fi#p-17372-scope-of-engineering-work-timeline-still-pending-14\"></a>Scope of Engineering Work &amp; Timeline (still pending)</h2>\n<h4><a name=\"p-17372-h-1-ancillary-timelocked-staking-smart-contract-15\" class=\"anchor\" href=\"https://research.lido.fi#p-17372-h-1-ancillary-timelocked-staking-smart-contract-15\"></a>1 - Ancillary TimeLocked Staking Smart Contract</h4>\n<p>The stability of the donation income is important to MSF, this can be achieved by giving donors the option - but not the obligation - to lock their msfETH for a chosen time length. Donators choosing to do so will benefit from an increased influx of “MSF-points’’ on the platform.</p>\n<p>Technically, this is achieved by an ancillary time-lock, or vote-escrow, smart contract into which msfETH holders will be able to lock their holdings for a period of their choice.</p>\n<p>Solidity Development: 2 weeks</p>\n<p>Uni Tests and pre-audit: 1 weeks</p>\n<h4><a name=\"p-17372-h-2-points-system-soulbound-token-issuance-infrastructure-16\" class=\"anchor\" href=\"https://research.lido.fi#p-17372-h-2-points-system-soulbound-token-issuance-infrastructure-16\"></a>2 - Points system &amp; SoulBound Token Issuance Infrastructure</h4>\n<p>The implementation of the points system ​have recently emerged as a popular innovation for protocols to incentivize usage and activity. For Stake2Care, it’s a great opportunity to highlight donors activities and commitment in order to prepare special events and rewards that might occur in the future.</p>\n<p>As part of the third “Engagement” phase, a real-time accounting of user donations is held so as to grant donors status rewards as soulbound tokens.</p>\n<p>The accounting and soulbound token issuance is handled from the initiative back-end so as to reduce gas costs for the end-user as much as possible.</p>\n<p>Solidity Development: 4 weeks</p>\n<p>Uni Tests and pre-audit: 2 weeks</p>\n<h4><a name=\"p-17372-h-3-front-end-and-uiux-17\" class=\"anchor\" href=\"https://research.lido.fi#p-17372-h-3-front-end-and-uiux-17\"></a>3- Front-end and UI/UX</h4>\n<p>All the components described above require the design and development of dedicated front-ends with the aim of building a seamless UX and bolster conversion into msfETH.</p>\n<p>Some components, such as the staking tool, should be delivered in widget format and can be easily integrated by partners looking forward to encouraging staking into msfETH.</p>\n<p>Front-end Development: 6 weeks</p>\n<p>Uni Tests and pre-audit: 1 week</p>\n<p>Solidity Development: 4 weeks</p>\n<p>Uni Tests and pre-audit: 2 weeks</p>\n<h4><a name=\"p-17372-h-4-donation-dashboard-18\" class=\"anchor\" href=\"https://research.lido.fi#p-17372-h-4-donation-dashboard-18\"></a>4 - Donation Dashboard</h4>\n<p>A donation dashboard is set to be built and integrated within the msf website to assess the performance and transparency of Stake2Care project.<br>\nWe use Dune Analytics but we face limitations.</p>\n<p>Front-end / Backend Development: 6 weeks</p>\n<p>Uni Tests and pre-audit: 1 week</p>\n<h4><a name=\"p-17372-h-5-tax-exemption-certificate-19\" class=\"anchor\" href=\"https://research.lido.fi#p-17372-h-5-tax-exemption-certificate-19\"></a>5 - Tax-exemption certificate</h4>\n<p>The tax-exemption certificate generator requires an orchestration between back-end blockchain accounting tools and MSF so as to precisely evaluate a user’s donations, in his home-currency, during a given fiscal year and have the certificate generated and signed by MSF.</p>\n<p>Solidity Development: 2 weeks</p>\n<p>Uni Tests and pre-audit: 1 weeks</p>\n<h4><a name=\"p-17372-h-6-video-content-for-promotion-20\" class=\"anchor\" href=\"https://research.lido.fi#p-17372-h-6-video-content-for-promotion-20\"></a>6 - Video content for promotion</h4>\n<p>We would like to mandate a company to create a 2min video so as to explain the stake2care initiative workflow in simple terms and engage new donors.</p>\n<h4><a name=\"p-17372-h-7-impact-vault-bootstrap-21\" class=\"anchor\" href=\"https://research.lido.fi#p-17372-h-7-impact-vault-bootstrap-21\"></a>7 - Impact Vault Bootstrap</h4>\n<p>Until further payment, the grant will remain in the Stake2Care impact vault to generate interests for MSF.</p>\n<h2><a name=\"p-17372-payment-22\" class=\"anchor\" href=\"https://research.lido.fi#p-17372-payment-22\"></a>Payment</h2>\n<p>The NGO has setup a multisig wallet managed by MSF members with control access and sign procedures to secure the multisig</p>\n<p>MSF is requesting the grant payment of $100k in DAI at the address below</p>\n<p><a href=\"https://etherscan.io/address/stake2care.eth\" rel=\"noopener nofollow ugc\">stake2Care.eth</a> wallet 0x462F351EE8b10Cc21B161ad698eF3CEba957FE65</p>\n<p>Payment can be made in 2 instalments of $50k each.</p>\n<p>Schedule 1 : September, Thursday, 12th</p>\n<p>First payment would be made to recognize the innovation done</p>\n<p>KPI</p>\n<ul>\n<li>Design <img src=\"https://emoji.discourse-cdn.com/apple/white_check_mark.png?v=12\" title=\":white_check_mark:\" class=\"emoji\" alt=\":white_check_mark:\" loading=\"lazy\" width=\"20\" height=\"20\"></li>\n<li>Development <img src=\"https://emoji.discourse-cdn.com/apple/white_check_mark.png?v=12\" title=\":white_check_mark:\" class=\"emoji\" alt=\":white_check_mark:\" loading=\"lazy\" width=\"20\" height=\"20\"></li>\n<li>Stake2Care Mainnet is LIVE ! <img src=\"https://emoji.discourse-cdn.com/apple/white_check_mark.png?v=12\" title=\":white_check_mark:\" class=\"emoji\" alt=\":white_check_mark:\" loading=\"lazy\" width=\"20\" height=\"20\"></li>\n</ul>\n<p>Schedule 2 : November Monday, 11th</p>\n<p>KPI</p>\n<ul>\n<li>Tax exemption certificate</li>\n<li>Fundraising Dashboard</li>\n<li>Interface / documentation for exchanges and protocol integration</li>\n<li>Ancillary TimeLocked Staking Smart Contract</li>\n<li>Point System for future incentives</li>\n</ul>\n            <p><small>3 posts - 3 participants</small></p>\n            <p><a href=\"https://research.lido.fi/t/innovation-grant-request-ngo-doctors-without-borders-medecins-sans-frontieres-msf/8268\">Read full topic</a></p>","link":"https://research.lido.fi/t/innovation-grant-request-ngo-doctors-without-borders-medecins-sans-frontieres-msf/8268","pubDate":"Wed, 04 Sep 2024 13:53:20 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"research.lido.fi-topic-8268"},"source":{"@url":"https://research.lido.fi/t/innovation-grant-request-ngo-doctors-without-borders-medecins-sans-frontieres-msf/8268.rss","#text":"Innovation grant request : NGO Doctors Without Borders / Medecins Sans Frontieres (MSF)"}},{"title":"Optimizing Lido On-chain Voting Timelines for Inclusive Governance","dc:creator":"Tane","category":"Proposals","description":"<h2><a name=\"p-17359-overview-1\" class=\"anchor\" href=\"https://research.lido.fi#p-17359-overview-1\"></a>Overview</h2>\n<p>We suggest optimizing Lido’s on-chain voting durations to encourage broader governance participation. The existing 72-hour voting period—split into a 48-hour main phase for Yes and No votes and a 24-hour objection phase for No only—strains contributors. The current process can be found here. <a href=\"https://lido.fi/governance\" class=\"inline-onebox\">Lido DAO Governance</a></p>\n<p>We propose to change it as below.</p>\n<ul>\n<li><strong>Main Phase (120 hours)</strong>: Tuesday to Saturday</li>\n<li><strong>Objection Phase (72 hours)</strong>: Sunday to Wednesday</li>\n</ul>\n<h2><a name=\"p-17359-motivation-2\" class=\"anchor\" href=\"https://research.lido.fi#p-17359-motivation-2\"></a>Motivation</h2>\n<ul>\n<li>Removing participation hurdles is key to maximizing governance inclusion.</li>\n<li>As # of delegates increases and their various situations from each delegate exist, the DAO should foster an accommodating environment that will bolster overall governance engagement.</li>\n</ul>\n<h2><a name=\"p-17359-challenges-3\" class=\"anchor\" href=\"https://research.lido.fi#p-17359-challenges-3\"></a>Challenges</h2>\n<ul>\n<li>\n<p>Lido’s condensed 2-day voting risks unintended non-participation, while recognizing each on-chain vote is set to start on Thursday and can be found in the <a href=\"https://calendar.google.com/calendar/u/0/r?cid=Y181MjgzNDBhYzc4M2UxNWEzNDk0NTIxZDVjOGM5MDAwMTE2OGM5MWIyNDA5MGZkZTk2MDRmYzM2N2VmYTZhMWY1QGdyb3VwLmNhbGVuZGFyLmdvb2dsZS5jb20\">calendar</a>. For instance, one can miss an opportunity to vote just because he/she was in a conference and could not check the forum nor voting for 2 days.</p>\n</li>\n<li>\n<p>Quorum is often unattained, with 5 of the last 12 on-chain votes failing to pass due to insufficient turnout, which could have resulted from the shorter voting time. This is slowing down the improvement of Lido DAO in an unnecessary way.</p>\n</li>\n<li>\n<p>Comparable DAOs like Optimism, Arbitrum and Uniswap allocate more time for proposals, discussions, and voting. Lido DAO doesn’t have to follow what other DAOs do, but it could be indicated that 2 days for on-chain voting is too short especially for delegates who are familiarized with processes in those DAOs.</p>\n<ul>\n<li>Optimism (<a href=\"https://github.com/ethereum-optimism/OPerating-manual/blob/main/manual.md\">detail</a>)\n<ul>\n<li>(Feedback and Review : 14 days)</li>\n<li>On-chain vote: 7 days</li>\n</ul>\n</li>\n<li>Arbitrum (<a href=\"https://docs.arbitrum.foundation/concepts/lifecycle-anatomy-aip-proposal\">detail</a>)\n<ul>\n<li>Snapshot: 7 days</li>\n<li>On-chain vote: 14 days</li>\n</ul>\n</li>\n<li>Uniswap (<a href=\"https://gov.uniswap.org/t/rfc-community-governance-process-changes/18060\">detail</a>)\n<ul>\n<li>Snapshot: 5 days</li>\n<li>On-chain vote: 7 days</li>\n</ul>\n</li>\n</ul>\n</li>\n</ul>\n<h2><a name=\"p-17359-proposal-4\" class=\"anchor\" href=\"https://research.lido.fi#p-17359-proposal-4\"></a>Proposal</h2>\n<ul>\n<li><strong>Updated voting timeline</strong>\n<ul>\n<li><strong>Main Phase (120 hours)</strong>: Tuesday to Saturday</li>\n<li><strong>Objection Phase (72 hours)</strong>: Sunday to Wednesday</li>\n</ul>\n</li>\n<li>Though extended voting might decelerate governance and delay execution, expanding from 3 to 8 days appears workable. It is essential to avoid governance processes becoming redundant. On the other hand, having processes that are too short, which leads to revotes, is unacceptable as it causes severe slowdowns. Moreover, even if it doesn’t result in revotes, we have determined that if a delay of a few days increases governance participation, that is sufficiently meaningful.</li>\n<li>As this requires a certain amount of work including redeploying related components (e.g. GateSeal), we suggest merging this change with the dual governance upgrade, planned to be in the next half-year, to minimize the effort involved.</li>\n</ul>\n<h2><a name=\"p-17359-changelog-5\" class=\"anchor\" href=\"https://research.lido.fi#p-17359-changelog-5\"></a>Changelog</h2>\n<ul>\n<li>Sep 5, 2024: Changed the Objection phase to 72 hours based on the community’s feedback. Also added a potential timing of this change to be applied.</li>\n</ul>\n<p>Let us know if you have any feedback or comments. Alongside other active delegates and contributors, we are looking forward to improving the Lido governance further and providing more inclusive structures where delegates can engage with the governance.</p>\n            <p><small>12 posts - 11 participants</small></p>\n            <p><a href=\"https://research.lido.fi/t/optimizing-lido-on-chain-voting-timelines-for-inclusive-governance/8265\">Read full topic</a></p>","link":"https://research.lido.fi/t/optimizing-lido-on-chain-voting-timelines-for-inclusive-governance/8265","pubDate":"Wed, 04 Sep 2024 05:10:49 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"research.lido.fi-topic-8265"},"source":{"@url":"https://research.lido.fi/t/optimizing-lido-on-chain-voting-timelines-for-inclusive-governance/8265.rss","#text":"Optimizing Lido On-chain Voting Timelines for Inclusive Governance"}},{"title":"Fate of stETH and unbonded ETH after slashing","dc:creator":"orfeas","category":"General","description":"<p>I was discussing Lido and a question came up. What exactly happens with the non-lost ETH of a slashed validator? What happens to the corresponding stETH? I’ve looked at the docs (docs (dot) lido (dot) fi/guides/lido-tokens-integration-guide/<span class=\"hashtag-raw\">#steth</span> - I can’t post links yet) but this exact detail is not clarified.</p>\n<p>In practice, does it play out as follows: (i) every stETH holder loses the same proportion of their stETH, (ii) the total lost stETH equal the total unbonded ETH, (iii) the slashed validator gets the non-lost ETH? (Terminology note: non-lost ETH + lost ETH = unbonded ETH)</p>\n<p>More concretely, say Lido validator Victor stakes 32 ETH. At a later point in time there exist 128 stETH in total. Then Victor misbehave is slashed. In this case, the Ethereum protocol punishes 1 ETH and unbonds the remaining 31 ETH.</p>\n<p>Assuming these, this is my understanding of what happens next, please correct me wherever I’m wrong: Lido burns 32 stETH (i.e., all accounts &amp; smart contracts that own any amount of stETH lose 1/4th of it) and the Ethereum protocol gives 31 ETH to Victor.</p>\n<p>Please consider this example in a vacuum: don’t consider any new staking, unstaking, rewards, orother slashings in parallel.</p>\n            <p><small>2 posts - 2 participants</small></p>\n            <p><a href=\"https://research.lido.fi/t/fate-of-steth-and-unbonded-eth-after-slashing/8264\">Read full topic</a></p>","link":"https://research.lido.fi/t/fate-of-steth-and-unbonded-eth-after-slashing/8264","pubDate":"Tue, 03 Sep 2024 15:00:33 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"research.lido.fi-topic-8264"},"source":{"@url":"https://research.lido.fi/t/fate-of-steth-and-unbonded-eth-after-slashing/8264.rss","#text":"Fate of stETH and unbonded ETH after slashing"}},{"title":"stETH-based Swaps using ERC-6123","dc:creator":"anaiso","category":"Projects","description":"<p><em>We are submitting the below proposal asking for LEGO to support.</em></p>\n<h2><a name=\"p-17347-proposal-summary-1\" class=\"anchor\" href=\"https://research.lido.fi#p-17347-proposal-summary-1\"></a>Proposal Summary</h2>\n<p>We propose a research project providing a comprehensive paper analyzing the risks and opportunities of stETH-based Ethereum Staking Rate Swaps for the Lido ecosystem. The Lido Staked Ether (stETH) APR represents the annualized rewards rate on ETH staked through Lido, offering a measure of staking performance that can be used as a daily floating rate benchmark. This research aims to provide valuable and actionable insights into the potential impact of ERC-6123 based stETH swaps on its ecosystem, including effects to validator strategies. Laying groundwork for a potential future ERC-6123 based infrastructure within the Lido ecosystem, and understanding the advantages and/or disadvantages of ERC-6123 in managing smart derivatives in the Ethereum staking market. For more information about ERC-6123, please see our paper “ERC-6123: Rethinking Financial Derivatives” (August 2024).</p>\n<h2><a name=\"p-17347-how-will-it-aid-the-lido-ecosystem-2\" class=\"anchor\" href=\"https://research.lido.fi#p-17347-how-will-it-aid-the-lido-ecosystem-2\"></a>How will it aid the Lido ecosystem?</h2>\n<p>The project will aim to validate or invalidate the working hypothesis that stETH-based Ethereum Staking Rate Swaps can provide significant value to the Lido ecosystem, benefiting stakeholders staking with Lido.</p>\n<p>For validators, the hypothesis is that it can provide crucial risk management tools, allowing them to hedge against yield volatility and secure predictable and reliable rewards. This stability could help make Lido staking more attractive to a broader range of participants.</p>\n<p>Benefits to the Lido ecosystem include:</p>\n<ul>\n<li>Enhanced Stability: Such swaps can attract more risk-averse participants to the Lido ecosystem.</li>\n<li>Increased Liquidity: The ability to hedge can encourage larger stakes, improving overall liquidity.</li>\n<li>Market Efficiency: Swaps help in price discovery for Lido staking rewards, potentially leading to more efficient markets.</li>\n</ul>\n<p>Simplified illustrative example:</p>\n<p>Scenario: Alice operates a validator business with significant ETH staked through Lido. She receives stETH in return for her staked ETH. While Alice appreciates the potential rewards, she also needs to manage her cash flow to cover operational costs and make business plans.</p>\n<p>Problem: The Lido Staking User APR is volatile due to various factors such as network activity, validator participation rates, and overall market conditions. This volatility makes it difficult for Alice to predict her income and plan her business expenses.</p>\n<p>Need: Alice wants to stabilize a portion of her rewards for the next 3 months to ensure she can cover her operational costs regardless of Lido APR fluctuations.</p>\n<p>Solution: Alice enters into a 3-month stETH-based swap with a counterparty Bob.</p>\n<p>Benefits for Alice:</p>\n<ul>\n<li>Predictable Rewards: Alice now knows she will effectively earn a fixed (annualized) rewards rate on the notional amount, regardless of Lido APR fluctuations.</li>\n<li>Risk Management: She is protected against downside risk if Lido APR falls below the fixed rate.</li>\n<li>Operational Stability: With a known rewards stream, Alice can confidently plan her business expenses and investments.</li>\n<li>Retained Upside on Unswapped Portion: Alice can still benefit from rewards increases on any stETH not involved in the swap.</li>\n<li>Flexibility: Alice remains liquid in stETH and can participate in other DeFi activities.</li>\n</ul>\n<h2><a name=\"p-17347-why-is-it-important-3\" class=\"anchor\" href=\"https://research.lido.fi#p-17347-why-is-it-important-3\"></a>Why is it important?</h2>\n<p>The successful execution of at least three publicized CESR-based Ethereum Staking Rate Swaps suggests precedent and growing demand for using those new financial instruments. In March 2024, FalconX, a digital asset prime brokerage and derivatives service provider completed the first fixed-floating swap using CESR. The two participating firms in the swap are Multicoin Capital, a thesis-driven investment firm, and Parataxis Capital, a multi-strategy investment firm. In May 2024, Nonco, a digital assets trading firm specializing in institutional and professional investors, has completed its first fixed-floating swap. Bastion Trading, a systematic trading firm, structured and priced the transaction. Twinstake announced another industry milestone with the “first swap transaction by a staking provider on the CESR\".</p>\n<p>However, as the native rate within the Lido ecosystem, the Lido Staked Ether (stETH) APR should be the de-facto rate for structuring financial products like swaps and would offer clarity and consistency for ecosystem participants. The Lido APR directly reflects the specific annualized rewards rate from ETH staked through Lido, providing a more accurate and relevant measure of rewards for Lido users compared to the broader and less tailored rate such as CESR.</p>\n<p>In addition, the development of new derivative markets, such as dated futures, is paving the way for the creation of comprehensive reward curves in the digital asset space. These emerging markets provide critical benchmarks for pricing and risk management. Participants leveraging ERC-6123 for executing and settling stETH swaps on-chain will be well-positioned to engage with an expanded suite of financial products and to capitalize on these advancements - including outright futures, outright swaps, and swaps vs. futures spreads.</p>\n<h2><a name=\"p-17347-timeline-4\" class=\"anchor\" href=\"https://research.lido.fi#p-17347-timeline-4\"></a>Timeline</h2>\n<div class=\"md-table\">\n<table>\n<thead>\n<tr>\n<th>Deliverable</th>\n<th>Brief Description</th>\n<th>How to measure completion</th>\n<th>Estimate date of completion</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>Research paper: stETH Swaps for the Lido Ecosystem</td>\n<td>A comprehensive evaluation of the hypothesis that stETH-based Ethereum Staking Rate Swaps can offer significant value to users. The research will assess the potential benefits and risks associated with integrating stETH-based swaps.</td>\n<td>1) Paper provide evidence to validate or invalidate the working hypothesis that stETH-based Ethereum Staking Rate Swaps can provide significant value to users. 2)PDF version of the paper delivered 3)Paper reviewed by two appropriate reviewers.</td>\n<td>2 months from project start date</td>\n</tr>\n</tbody>\n</table>\n</div><div class=\"md-table\">\n<table>\n<thead>\n<tr>\n<th>First Draft</th>\n<th>2 weeks</th>\n<th>25%</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>Second Draft - including contribution and contributor review</td>\n<td>3 weeks</td>\n<td>37.5%</td>\n</tr>\n<tr>\n<td>Final Draft Review - official reviewers only</td>\n<td>2 weeks</td>\n<td>25%</td>\n</tr>\n<tr>\n<td>Production, Publication and presentation of the findings</td>\n<td>1 week</td>\n<td>12.5%</td>\n</tr>\n</tbody>\n</table>\n</div><h2><a name=\"p-17347-team-5\" class=\"anchor\" href=\"https://research.lido.fi#p-17347-team-5\"></a>Team</h2>\n<p>Anaïs Ofranc, Samuel Edoumou, Stefan Haupt on behalf of QualitaX.<br>\nQualitaX, a technology company focused on DLT-based digital transformation in the financial sector.</p>\n<p>Anaïs Ofranc brings over 15 years of experience in technology and fintech having previously founded and led Consianimis Consulting for almost 10 years. Consianimis was focused on post merger and acquisition IT integrations and its clients included Yahoo, the New Scientist, Informa, UBM, Dopay, Ascential and others. Her work in the blockchain space, started in 2020 with the Baseline Protocol and included collaborations with startups and major firms like EY, Microsoft, and Consensys. Anaïs holds MSc in Computer Science and a MSc in International Strategic Management from Oxford Brookes University. She is fluent in English and French.</p>\n<p>Samuel Edoumou is a blockchain researcher and developer with a three-year background in smart contract design and development. He previously made significant contributions at Debond Protocol, where he was instrumental in building a decentralized derivative standard and market. Samuel authored two Ethereum Request for Comments (ERC) standards: ERC-7092, which facilitates the tokenization and management of financial bonds on EVM-based blockchains, and ERC-7586, which enables the tokenization of interest rate swaps. He pursued a PhD in Atomic Physics at Sorbonne University, and although he did not defend his dissertation, he holds a Master of Science in Physics, specializing in Magnetic Confined Fusion, from Pierre et Marie Curie University. He is fluent in English and French.</p>\n<p>Stefan Haupt is a  finance professional with over 15 years of extensive experience in the banking sector, specializing in interest rate structuring and hybrid structuring. He served as Director and Interest Rate Structuring Lead for IR Option Trading at Commerzbank AG. Stefan has also held the position of Global Head of Financial Institutions Cross Asset Structuring, where he leveraged his expertise to lead cross-asset structuring initiatives and drive open banking solutions. His previous role include Director at Dresdner Kleinwort Wasserstein, an investment bank and others.</p>\n<h2><a name=\"p-17347-total-costs-6\" class=\"anchor\" href=\"https://research.lido.fi#p-17347-total-costs-6\"></a>Total costs</h2>\n<p>36,000 USD. Payable as USDC.</p>\n<div class=\"md-table\">\n<table>\n<thead>\n<tr>\n<th>Deliverable</th>\n<th>Budget (in USD)</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>Research Paper + recorded and/or live meeting to discuss the findings.</td>\n<td>36,000  USD</td>\n</tr>\n</tbody>\n</table>\n</div><h2><a name=\"p-17347-payment-schedule-7\" class=\"anchor\" href=\"https://research.lido.fi#p-17347-payment-schedule-7\"></a>Payment schedule</h2>\n<ul>\n<li>30% in advance: USD 10,800</li>\n<li>70% upon publication of the research report : USD 25,200.</li>\n</ul>\n<p>Multisig Address for payment: 0x9959252E93915A713eF3570f2C973E74b95eA095</p>\n            <p><small>1 post - 1 participant</small></p>\n            <p><a href=\"https://research.lido.fi/t/steth-based-swaps-using-erc-6123/8260\">Read full topic</a></p>","link":"https://research.lido.fi/t/steth-based-swaps-using-erc-6123/8260","pubDate":"Tue, 03 Sep 2024 10:21:39 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"research.lido.fi-topic-8260"},"source":{"@url":"https://research.lido.fi/t/steth-based-swaps-using-erc-6123/8260.rss","#text":"stETH-based Swaps using ERC-6123"}},{"title":"Bware Labs has been acquired by Alchemy","dc:creator":"Kristian_Georgiev","category":"Node Operators","description":"<p>Dear Lido Community,</p>\n<p>We are excited to announce that Alchemy has completed its acquisition of Bware Labs and will be bringing over our team of 40+ people, with the ultimate goal of expanding the team to +100.</p>\n<p>Joining forces allows us to continue building awesome products while extending Bware’s technical innovations to even more developers through Alchemy’s vast distribution. Alchemy runs a very similar business to ours but at a much larger scale. We consider this acquisition a huge milestone for Bware and for Web3 developers around the world!</p>\n<p>Bware’s Blockchain Validator services and staking resources will remain fully operational and will be integrated into Alchemy’s product suite in the coming months.</p>\n<p>Alchemy has received a SOC 2 Type 2 certification for its security practices, and we’re looking forward to working with them to continue to build highly secure technology and infrastructure.</p>\n<p>Bware will maintain its role as a Polygon node operator and expects to continue participating in Lido on Ethereum, and providing the ecosystem with world-class products, services, and support.</p>\n<p>For more information on the acquisition, visit our <a href=\"https://bwarelabs.com/blog/bware-labs-is-getting-acquired-by-alchemy\" rel=\"noopener nofollow ugc\">blog</a>.</p>\n<p>If you have any questions, we will be more than happy to address them!</p>\n<p>The Bware Labs Team</p>\n            <p><small>1 post - 1 participant</small></p>\n            <p><a href=\"https://research.lido.fi/t/bware-labs-has-been-acquired-by-alchemy/8257\">Read full topic</a></p>","link":"https://research.lido.fi/t/bware-labs-has-been-acquired-by-alchemy/8257","pubDate":"Tue, 03 Sep 2024 06:27:00 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"research.lido.fi-topic-8257"},"source":{"@url":"https://research.lido.fi/t/bware-labs-has-been-acquired-by-alchemy/8257.rss","#text":"Bware Labs has been acquired by Alchemy"}},{"title":"DAOplomats Delegate Thread","dc:creator":"DAOplomats.eth","category":"Delegate Platform","description":"<p><strong>Name :</strong> DAOplomats<br>\n<strong>Address:</strong> 0x057928bc52bD08e4D7cE24bF47E01cE99E074048</p>\n<h2><a name=\"p-17307-introduction-1\" class=\"anchor\" href=\"https://research.lido.fi#p-17307-introduction-1\"></a>Introduction</h2>\n<p>DAOplomats is a governance-as-a-service organisation that empowers DAOs through effective governance, by suggesting efficient governance structures, acting as professional delegates and spearheading community-building initiatives. We leverage our expertise to help DAOs achieve their full potential by fostering collaboration and maximising positive outcomes.</p>\n<p>DAOplomats has extensive experience in DAO governance, including</p>\n<ul>\n<li>Designing and implementing effective governance frameworks,</li>\n<li>Analysing proposals objectively</li>\n<li>Fostering consensus</li>\n</ul>\n<p>While our experience primarily lies with other DAOs, our transferable skills and deep understanding of DeFi make us well-suited to contribute to Lido DAO’s governance processes.</p>\n<h2><a name=\"p-17307-motivation-2\" class=\"anchor\" href=\"https://research.lido.fi#p-17307-motivation-2\"></a><strong>Motivation</strong></h2>\n<p>We admire Lido DAO for its dedication to making staking easier and more secure for everyone. Lido’s focus on decentralisation and enhancing the security of blockchain networks resonates with our values. We believe that our experience in governance and community building can help Lido DAO grow and achieve its goals, bringing more users into the world of liquid staking and DeFi.</p>\n<h2><a name=\"p-17307-values-and-decision-making-approach-3\" class=\"anchor\" href=\"https://research.lido.fi#p-17307-values-and-decision-making-approach-3\"></a><strong>Values and Decision-Making Approach</strong></h2>\n<p><strong>Positive Sum Collaboration:</strong><br>\nWe strive to make our interactions positive whenever possible to allow the maximum number of stakeholders to benefit via collaboration.</p>\n<p><strong>Support the Public Good:</strong><br>\nWe prioritise initiatives that deliver positive social, environmental and economic outcomes contributing to the greater good of society.</p>\n<p><strong>Facilitating applications of distributed technology:</strong><br>\nWe help organisations implement decentralised technologies to enhance transparency, efficiency, and equity.</p>\n<p><strong>Accelerating Human Coordination</strong><br>\nWe accelerate collaboration across decentralized networks, enabling diverse teams to work together seamlessly and achieve common goals.</p>\n<h2><a name=\"p-17307-operative-objectives-4\" class=\"anchor\" href=\"https://research.lido.fi#p-17307-operative-objectives-4\"></a>Operative Objectives</h2>\n<p><strong>1. Seamless Governance</strong></p>\n<p>Our approach to governance focuses on creating smooth, uninterrupted workflows that facilitate effective management and oversight.</p>\n<p><strong>2. Empowering Core Teams/Empowering Strategic Vision</strong></p>\n<p>We actively aid in the strategic development of protocols by providing expert guidance and collaborative support to core teams. Through our facilitation of key initiatives, we ensure that their vision is refined and executed in alignment with community goals, ultimately enhancing the overall effectiveness of the project.</p>\n<h2><a name=\"p-17307-aspirations-within-the-dao-5\" class=\"anchor\" href=\"https://research.lido.fi#p-17307-aspirations-within-the-dao-5\"></a><strong>Aspirations within the DAO</strong></h2>\n<p><strong>Protocol Security and Decentralization</strong></p>\n<p>Security and decentralisation are paramount in the Lido DAO ecosystem. DAOplomats will assist Lido with making its staking solutions maintain robustness. By facilitating transparent governance and supporting distributed validator networks, we aim to uphold the integrity and reliability of the Lido protocol.</p>\n<p><strong>Global Adoption and Community Engagement</strong></p>\n<p>Lido’s success depends on widespread adoption and active community participation. DAOplomats will foster global collaboration, engaging with diverse stakeholders to amplify Lido’s reach. By nurturing community-driven development and education, we support Lido’s mission to democratise staking and create value for users worldwide.</p>\n<p><strong>Sustainable Growth and Governance</strong></p>\n<p>Sustainability is key to Lido’s long-term success. DAOplomats will support effective treasury management, ensuring that resources are allocated wisely to support sustainable growth. Our expertise in governance will help create a balanced and inclusive decision-making process, promoting the longevity and prosperity of the Lido ecosystem.</p>\n<h2><a name=\"p-17307-public-acceptance-6\" class=\"anchor\" href=\"https://research.lido.fi#p-17307-public-acceptance-6\"></a>Public Acceptance</h2>\n<p>As a potential Public Delegate, we fully comprehend and embrace the role’s responsibilities, pledging to uphold the Code of Conduct and consistently act in the best interests of the Lido protocol, should I be selected for this position.</p>\n<p>We share Lido DAO’s fundamental values and am well-acquainted with its 2024 strategic objectives, ensuring my potential role as a Public Delegate would be both aligned and impactful.</p>\n<h2><a name=\"p-17307-disclosures-7\" class=\"anchor\" href=\"https://research.lido.fi#p-17307-disclosures-7\"></a>Disclosures</h2>\n<p>DAOplomats is an independently led governance services business. We currently do not have any external investors, however we serve many value aligned DAOs in the Ethereum network including AAVE, Uniswap, ENS, Optimism, Arbitrum, SAFE, 1inch, everclear and shutter.<br>\nWhen applicable, we will disclose potential conflicts of interest in our rationale.</p>\n            <p><small>3 posts - 2 participants</small></p>\n            <p><a href=\"https://research.lido.fi/t/daoplomats-delegate-thread/8242\">Read full topic</a></p>","link":"https://research.lido.fi/t/daoplomats-delegate-thread/8242","pubDate":"Sat, 31 Aug 2024 17:11:58 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"research.lido.fi-topic-8242"},"source":{"@url":"https://research.lido.fi/t/daoplomats-delegate-thread/8242.rss","#text":"DAOplomats Delegate Thread"}},{"title":"DefiPlaza exploit -- request for comment","dc:creator":"Jazzer9F","category":"Proposals","description":"<p>Dear Lido community,</p>\n<p>After 3 years of being deployed and used successfully our DEX protocol (DefiPlaza) suffered an <a href=\"https://etherscan.io/tx/0xa245deda8553c6e4c575baff9b50ef35abf4c8f990f8f36897696f896f240e3a\" data-bbcode=\"true\" rel=\"noopener nofollow ugc\">exploit</a>, which resulted in all funds getting drained from the contract. The attacker was front-run, leading to the sum of <a href=\"https://etherscan.io/tx/0x454219fb25d36590279fd9c17fccb5b5a29acbbb3f90f318a3e4d9d2ad104e7c\" data-bbcode=\"true\" rel=\"noopener nofollow ugc\">62.5 ETH</a> ending up with the Lido Execution Rewards Vault. We have contacted the front runner and they promptly returned their profits from the transaction to the DefiPlaza team. However, the bulk of the missing funds now sit with the Lido stakers. Please refer to our <a href=\"https://defiplaza.net/blog/post-mortem-of-defiplaza-ethereum-exploit/\" data-bbcode=\"true\" rel=\"noopener nofollow ugc\">post mortem</a> for more details.</p>\n<p>Obviously we understand that none of this is Lido’s fault, yet as it is a side effect of the Lido implemententation we appeal to the Lido community to help us recover some or all of the funds that were taken from our community. Given that Lido is a permissionless protocol, our only available recourse is to ask the DAO to facilitate a return of as much of the lost funds as possible. From a technical perspective, we are not entirely sure what the options available for that are as we are not intimately familiar with the details of how Lido is implemented. We’re open to suggestions on what to put into the final proposal on this front.</p>\n<p>We’re aware of the previous discussions <a href=\"https://research.lido.fi/t/sushi-routeprocessor2-post-exploit-request-for-comment/4383\" data-bbcode=\"true\">here</a> and <a href=\"https://research.lido.fi/t/a-decision-on-an-outflow-of-40-eth-from-the-lido-dao-treasury-to-aid-in-the-sushi-recovery/4492\" data-bbcode=\"true\">here</a> around a similar situation with Sushi. That proposal nearly passed but ultimately failed to meet quorum. Thus, we believe this new situation warrants another look at how the DAO wants to deal with incoming funds originating from smart contract exploits.</p>\n<p>Thanks for your consideration and feedback.<br>\nTeam DefiPlaza</p>\n            <p><small>4 posts - 3 participants</small></p>\n            <p><a href=\"https://research.lido.fi/t/defiplaza-exploit-request-for-comment/8241\">Read full topic</a></p>","link":"https://research.lido.fi/t/defiplaza-exploit-request-for-comment/8241","pubDate":"Sat, 31 Aug 2024 11:18:46 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"research.lido.fi-topic-8241"},"source":{"@url":"https://research.lido.fi/t/defiplaza-exploit-request-for-comment/8241.rss","#text":"DefiPlaza exploit -- request for comment"}},{"title":"Grant Proposal - Boris Boarman: AI-assistant helping navigate crypto grants","dc:creator":"imboogieman","category":"Community Grants / Initiatives","description":"<p><em>This post is for initial discussion and feedback collection on an AI-assistant designed to help navigate crypto grants, bounties, and other funding options. The full treasury proposal is in progress and will be published and shared as soon as we collect positive feedback.</em></p>\n<p><strong>Boris Boarman landing page:</strong> <a href=\"https://whatdahack.is/boris-boarman/\" class=\"inline-onebox\" rel=\"noopener nofollow ugc\">Boris Boarman | Whatdahack?!</a></p>\n<p></p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://europe1.discourse-cdn.com/business20/uploads/lido/original/2X/8/822ebf0e310133b5b401ebf0bb9494a6eda05858.jpeg\" data-download-href=\"/uploads/short-url/izEdVCgq6XD5yjnvvxCrsqObIDK.jpeg?dl=1\" title=\"Boris Boarman Portrait 1MB\" rel=\"noopener nofollow ugc\"><img src=\"https://europe1.discourse-cdn.com/business20/uploads/lido/original/2X/8/822ebf0e310133b5b401ebf0bb9494a6eda05858.jpeg\" alt=\"Boris Boarman Portrait 1MB\" data-base62-sha1=\"izEdVCgq6XD5yjnvvxCrsqObIDK\" width=\"500\" height=\"500\" data-dominant-color=\"969191\"></a></div><p></p>\n<p><strong>Context &amp; Objective</strong></p>\n<p>Web3 space is well-known for fostering innovation, and existing crypto grant programs and funding options have given birth to many promising startups and initiatives.</p>\n<p>However,</p>\n<ul>\n<li>the process of searching for, finding, and applying for the right crypto funding option is cumbersome and time-consuming for both applicants and reviewers.</li>\n<li>Applicants struggle with identifying suitable grants and preparing high-quality applications,</li>\n<li>while reviewers face the challenge of managing numerous submissions. T</li>\n<li>This inefficiency leads to missed funding opportunities for promising projects and teams</li>\n<li>and increased workloads for grant reviewers.</li>\n</ul>\n<p><strong>Solution: Boris Boarman - AI-agentic application streamlining the grant application and review process</strong></p>\n<p>Our research identified three initial scenarios where such an AI assistant can be helpful:</p>\n<p><strong>Epic 1: Idea Review and Evaluation</strong></p>\n<ul>\n<li>An idea is checked against the knowledge base of all previous applications and tested by a trained LLM or real AI intellegence capable of evaluating an idea based on a numeric impact analysis approach. Feedback for improvement is provided.</li>\n</ul>\n<p><strong>Epic 2: Relevant Grant Programs Search</strong></p>\n<ul>\n<li>The AI assistant searches for and finds the best and currently active funding options to finance the development of the project or initiative, reducing the efforts from days to minutes.</li>\n</ul>\n<p><strong>Epic 3: Application Document Generation</strong></p>\n<ul>\n<li>The AI assistant guides the user through a sequence of questions to collect enough information about the project and generates application documents (including the application form and project development calculation) following a foundation’s application structure.</li>\n</ul>\n<p><strong>Project Objectives:</strong></p>\n<ul>\n<li>Develop a gateway tool to various crypto foundations grant programs to<br>\nimprove program discoverability.</li>\n<li>Develop an AI-driven tool to validate project ideas and match them with suitable<br>\ngrant opportunities.</li>\n<li>Automate the creation of relevant paperworks (application form, calculations,<br>\ntimelines, team skills compliance, etc) to streamline the application process.</li>\n<li>Improve the quality and quantity of grant applications submitted, thereby<br>\nincreasing the number of funded projects.</li>\n<li>Reduce the time and effort required for reviewing applications.</li>\n</ul>\n<p><strong>Target Audience</strong></p>\n<ul>\n<li>Grant Seekers: Individuals and organizations looking for funding opportunities to<br>\nsupport their projects.</li>\n<li>Crypto Grant Foundations: Organizations offering grants and seeking to promote<br>\ntheir funding programs and streamline the application review process.</li>\n</ul>\n<p><strong>Timeline</strong></p>\n<p><strong>Phase 1: Research and Planning (1 month)</strong> - Done</p>\n<ul>\n<li>Identify specific needs of grant seekers and foundations.</li>\n<li>Define project scope and requirements.</li>\n<li>Develop a detailed project plan and timeline.</li>\n</ul>\n<p><strong>Phase 2: Development (3 months)</strong> - In progress</p>\n<ul>\n<li>Set up the development environment.</li>\n<li>Build core AI functionalities for the idea validation and grant matching.</li>\n<li>Integrate APIs for automated document generation.</li>\n<li>Integrate the functionality into web based interface</li>\n</ul>\n<p><strong>Phase 3: Testing and Feedback (1 months)</strong></p>\n<ul>\n<li>Conduct extensive testing of all functionalities.</li>\n<li>Collect feedback from a select group of users (beta testing).</li>\n<li>Implement necessary changes and improvements based on feedback.</li>\n</ul>\n<p><strong>Phase 4: Deployment and Launch (1 month)</strong></p>\n<ul>\n<li>Finalize all features and functionalities.</li>\n<li>Deploy the tool.</li>\n<li>Launch marketing and outreach campaigns to attract users.</li>\n</ul>\n<p><strong>Phase 5: Post-Launch Support and Enhancement (Ongoing)</strong></p>\n<ul>\n<li>Provide ongoing support and maintenance.</li>\n<li>Continuously improve the tool based on user feedback and research.</li>\n</ul>\n<p><strong>Advantages of Boris Boarman</strong><br>\nOur research identified 4 very similar projects, however we consider Boris Boarman most advantageous compared to other alternatives as it guides the user through the whole idea validation and application process by asking sequenced questions based on one of the three scenarios, instead of waiting for the user to come up with the right prompt. Utilizing custom fine-tuned LLM models for each scenario, we minimize the risk of hallucination and maximize the positive outcome from each interaction with the bot.</p>\n<p>As we have advanced knowledge in investment evaluation and software development cost estimation we are able to integrate this knowlegde into Boris Boarman intellegence makig this unique IP another advantage allowing to delivery the smoothest user experience and the sharpest results.</p>\n<p>We also have a solid vision for future functionality to streamline project progress reporting to minize the risk of wasting approved funds. It will secure foundation funds from unaccountable teams, increase transparancy and reduce the transaction overhead even more.</p>\n<p><strong>Innovation:</strong><br>\nBoris Boarman is the first tool to integrate conversational AI with grant<br>\napplication automation, significantly reducing the workload for both applicants<br>\nand reviewers.</p>\n<p><strong>Company Background &amp; Team Expertise:</strong><br>\n<strong>Roman Gorbunov, Developer and Founder</strong><br>\n14 years of industry total experience, in web3 since 2016 developing various projects from cross-platform wallets with multi-asset support, nft-marketplaces, defi/defund infrastructure, proprietary blockchain projects and cloud-based fintech projects for Fortune 500 corporations and crypto native companies. Certified Software Product and Investment Manager.</p>\n<p><a href=\"https://www.linkedin.com/in/rgorbunov/\" class=\"onebox\" target=\"_blank\" rel=\"noopener nofollow ugc\">https://www.linkedin.com/in/rgorbunov/</a><br>\n<a href=\"https://twitter.com/roma_gorbunov\" class=\"onebox\" target=\"_blank\" rel=\"noopener nofollow ugc\">https://twitter.com/roma_gorbunov</a></p><aside class=\"onebox allowlistedgeneric\" data-onebox-src=\"https://github.com/imboogieman\">\n  <header class=\"source\">\n      <img src=\"https://github.githubassets.com/favicons/favicon.svg\" class=\"site-icon\" width=\"32\" height=\"32\">\n\n      <a href=\"https://github.com/imboogieman\" target=\"_blank\" rel=\"noopener nofollow ugc\">GitHub</a>\n  </header>\n\n  <article class=\"onebox-body\">\n    <img width=\"460\" height=\"460\" src=\"https://europe1.discourse-cdn.com/business20/uploads/lido/original/2X/5/56ec2a3d70ff1474d035a9b79e3dade787869764.jpeg\" class=\"thumbnail onebox-avatar\" data-dominant-color=\"675A46\">\n\n<h3><a href=\"https://github.com/imboogieman\" target=\"_blank\" rel=\"noopener nofollow ugc\">imboogieman - Overview</a></h3>\n\n  <p>Boo! imboogieman has 11 repositories available. Follow their code on GitHub.</p>\n\n\n  </article>\n\n  <div class=\"onebox-metadata\">\n    \n    \n  </div>\n\n  <div style=\"clear: both\"></div>\n</aside>\n\n<p><strong>Asim Abbas, Solutions Architect</strong></p>\n<p>Experienced Software Engineer, adept in bringing forth expertise in design, development, testing and maintenance of web and mobile apps. Proficient in various platforms and languages.</p>\n<p><a href=\"https://www.linkedin.com/in/asim0028/\" class=\"onebox\" target=\"_blank\" rel=\"noopener nofollow ugc\">https://www.linkedin.com/in/asim0028/</a><br>\n<a href=\"https://x.com/_asim_abbas\" class=\"onebox\" target=\"_blank\" rel=\"noopener nofollow ugc\">https://x.com/_asim_abbas</a></p><aside class=\"onebox allowlistedgeneric\" data-onebox-src=\"https://github.com/asim0028/\">\n  <header class=\"source\">\n      <img src=\"https://github.githubassets.com/favicons/favicon.svg\" class=\"site-icon\" width=\"32\" height=\"32\">\n\n      <a href=\"https://github.com/asim0028/\" target=\"_blank\" rel=\"noopener nofollow ugc\">GitHub</a>\n  </header>\n\n  <article class=\"onebox-body\">\n    <img width=\"460\" height=\"460\" src=\"https://europe1.discourse-cdn.com/business20/uploads/lido/original/2X/2/294717a65d3a7a1c305ac499f49c352fd3eb8813.jpeg\" class=\"thumbnail onebox-avatar\" data-dominant-color=\"897B72\">\n\n<h3><a href=\"https://github.com/asim0028/\" target=\"_blank\" rel=\"noopener nofollow ugc\">asim0028 - Overview</a></h3>\n\n  <p>asim0028 has 2 repositories available. Follow their code on GitHub.</p>\n\n\n  </article>\n\n  <div class=\"onebox-metadata\">\n    \n    \n  </div>\n\n  <div style=\"clear: both\"></div>\n</aside>\n\n<p><strong>Development Costs:</strong><br>\nInitial estimation for the fully fledge product is around $250 000<br>\nWe see it is possible to develop the MVP under $50 000</p>\n<p>The detailed estimation will be updated on the current developing and researcch finding and provided on a positive feedback for the proposal.</p>\n<p><strong>Impact (What innovation or value will your project bring to Lido Foundation)?</strong></p>\n<ul>\n<li><strong>Increase Grants Program Discoverability:</strong> The tool will reduce weekly efforts for<br>\nsearching, finding and getting ready for the right programs down to a couple of<br>\nhours.</li>\n<li><strong>Increase Quality of Applications:</strong> The platform will enhance the completeness<br>\nand quality of grant applications.</li>\n<li><strong>Increase Amount of Projects Funded:</strong> By accurately matching projects with<br>\nsuitable grants, more projects will receive funding.</li>\n<li><strong>Reduce Efforts for Applications Review:</strong> Automating the document creation<br>\nprocess will streamline the review process for grant foundations.</li>\n</ul>\n<p><strong>What is the current stage of your project?</strong></p>\n<ul>\n<li>OpenAI infrastructure prototype developed and published for private testing.</li>\n<li>Model trained on some sampled data from our findings, from various foundations and source data from various APIs in real time.</li>\n<li>Custom code MVP is being developed and scheduled to be publsihed by mid September.</li>\n</ul>\n<p><strong>The major deliverables we are seeking to obtain during the current phase:</strong></p>\n<ol>\n<li>Published prototype for beta-testers - done</li>\n<li>Custom developed model trained with foundations data - in progress, to be released soon (End of August)</li>\n<li>Custom developed AI-assistant to execute Epic1 feature scenario: Idea<br>\nvalidation in progress, to be released soon (End of August)</li>\n<li>Standalone web application with free credit balance and token-gated access to<br>\nfull functionality ($40 per user)</li>\n<li>Collected and documented feedback from private beta-testers</li>\n<li>Outlined backlog and requirements based on users feedback and research for further development.</li>\n</ol>\n<p><strong>How idea/project aligns with the ecosystem and why it  will serve as a growth force?</strong></p>\n<p>In the Lido ecosystem, where innovative and efficient solutions are critical, this<br>\naligns perfectly by promoting high-quality projects that can drive technological<br>\nadvancements and network efficiency.</p>\n<p>Boris Boarman is designed to provided detailed impact potential projection for each idea submitted, so grant managers will be able to allocate funds more effeciently and reduce reviewing overhead.</p>\n<p>Boris identifies and recommends the most relevant grant programs based on the<br>\nspecifics of each project. This is vital for the ecosystem, which thrives on<br>\ntargeted funding to fuel innovation. By aligning projects with appropriate grants,<br>\nBoris ensures efficient resource utilization, helping projects progress smoothly<br>\nfrom ideation to implementation.</p>\n<p><strong>How should the community measure the success of this grant?</strong></p>\n<ol>\n<li>We will share the updates via the forum and/or email, whichever is easier<br>\nfor the team to keep a track of. Once shipped, we will also be announcing<br>\nthis via our socials (Twitter, Telegram, Youtube, LinkedIn).</li>\n<li>Tentative date of completion &amp; report submission - 2,5 months since<br>\nproposal approval, the team leaves the right to provide updates on<br>\ndelivery timelines in the case of force majeure or other reasonable<br>\nmatters.</li>\n<li>Published app</li>\n<li>1000 user sessions from different users with the maximum 5 sessions per<br>\nuser to count</li>\n</ol>\n<p><a href=\"https://research.lido.fi/t/grant-proposal-boris-boarman-ai-assistant-helping-navigate-crypto-grants/8238/1\">Click to view the poll.</a></p>\n            <p><small>1 post - 1 participant</small></p>\n            <p><a href=\"https://research.lido.fi/t/grant-proposal-boris-boarman-ai-assistant-helping-navigate-crypto-grants/8238\">Read full topic</a></p>","link":"https://research.lido.fi/t/grant-proposal-boris-boarman-ai-assistant-helping-navigate-crypto-grants/8238","pubDate":"Thu, 29 Aug 2024 11:30:12 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"research.lido.fi-topic-8238"},"source":{"@url":"https://research.lido.fi/t/grant-proposal-boris-boarman-ai-assistant-helping-navigate-crypto-grants/8238.rss","#text":"Grant Proposal - Boris Boarman: AI-assistant helping navigate crypto grants"}},{"title":"Question: Is it worthwhile to start operating a new relay at this point?","dc:creator":"nana","category":"General","description":"<p>I’m considering operating a neutral relay, but is it actually worth the effort, or how does the community view this? Flashbots has announced <a href=\"https://collective.flashbots.net/t/tee-boost/3741/5\" rel=\"noopener nofollow ugc\">TEE-Boost</a>. There are also discussions about Preconfirmation and <a href=\"https://initc3org.medium.com/prof-fair-transaction-ordering-in-a-profit-seeking-world-b6dadd71f086\" rel=\"noopener nofollow ugc\">PROF</a>.</p>\n<p>Regarding the direction of the PBS market and relays, I’d like to discuss with the community whether they would welcome new relay operations at this point, or if there are specific items they want to test through relays.</p>\n            <p><small>2 posts - 2 participants</small></p>\n            <p><a href=\"https://research.lido.fi/t/question-is-it-worthwhile-to-start-operating-a-new-relay-at-this-point/8235\">Read full topic</a></p>","link":"https://research.lido.fi/t/question-is-it-worthwhile-to-start-operating-a-new-relay-at-this-point/8235","pubDate":"Thu, 29 Aug 2024 08:39:11 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"research.lido.fi-topic-8235"},"source":{"@url":"https://research.lido.fi/t/question-is-it-worthwhile-to-start-operating-a-new-relay-at-this-point/8235.rss","#text":"Question: Is it worthwhile to start operating a new relay at this point?"}},{"title":"PGov Delegate Thread","dc:creator":"PGov","category":"Delegate Platform","description":"<h3><a name=\"p-17280-pgov-delegate-platform-1\" class=\"anchor\" href=\"https://research.lido.fi#p-17280-pgov-delegate-platform-1\"></a>PGov Delegate Platform</h3>\n<p>Address: PGov.eth<br>\nContact Information: <span class=\"mention\">@PGovTeam</span> on Twitter</p>\n<p><strong>Introduction:</strong><br>\nHello Everyone! We are a team of dedicated governance enthusiasts who have been in the crypto governance space for over three years. Our team were some of the first members involved in defi governance and we want to apply what we have learned over here to Lido. We believe this community has some of the strongest and most intelligent community members and we’re grateful to be along for the journey!</p>\n<p><strong>Core Values:</strong></p>\n<ul>\n<li>\n<p>Growth: Our decisions are primarily focused on the growth of the protocol. This often results in how to spend money efficiently, but even more importantly and objecting for unreasonable spends and knowing when to vote no.</p>\n</li>\n<li>\n<p>Transparency: Clear communication with votes and explanations of reasoning, and an equivalent demand for proposals to do the same. Too often we see thousands, if not millions, being rolled up together and glossed over during proposals.</p>\n</li>\n<li>\n<p>Accountability: Too often once a decision is done, having proper accountability becomes an afterthought. Whether it’s a DAO promise or a grant or a new program, once a DAO votes something in, we forget about it. Our goal with PGov is to both continue to check in on these decisions as well as ensure that there are proper channels set up to ensure accountability.</p>\n</li>\n</ul>\n<p><strong>Public Acceptance:</strong> We are committed to the code of conduct, mission, and respective values<br>\n<strong>Disclosures:</strong> We are delegates across other Defi protocols. Team members hold a combined ~$50k work of LDO.</p>\n            <p><small>2 posts - 2 participants</small></p>\n            <p><a href=\"https://research.lido.fi/t/pgov-delegate-thread/8232\">Read full topic</a></p>","link":"https://research.lido.fi/t/pgov-delegate-thread/8232","pubDate":"Wed, 28 Aug 2024 19:05:56 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"research.lido.fi-topic-8232"},"source":{"@url":"https://research.lido.fi/t/pgov-delegate-thread/8232.rss","#text":"PGov Delegate Thread"}},{"title":"Irina Delegate Thread","dc:creator":"irina_everstake","category":"Delegate Platform","description":"<h3><a name=\"p-17237-name-1\" class=\"anchor\" href=\"https://research.lido.fi#p-17237-name-1\"></a>Name</h3>\n<p>Irina</p>\n<h3><a name=\"p-17237-address-2\" class=\"anchor\" href=\"https://research.lido.fi#p-17237-address-2\"></a>Address</h3>\n<p>0x06A90756e57bC7A016Eed0aB23fC36d11C42bBa0</p>\n<h3><a name=\"p-17237-introduction-3\" class=\"anchor\" href=\"https://research.lido.fi#p-17237-introduction-3\"></a>Introduction</h3>\n<p>Hello, Lido community! My name is Irina. I am the Segment Lead within the <a href=\"https://everstake.one/\" rel=\"noopener nofollow ugc\">Everstake</a> team. Before setting the anchor at Everstake, I was part of marketing teams in Web2, working for tech corporations such as Microsoft and Google, and contributing to the growth of the artificial intelligence (AI) ecosystem in Ukraine.</p>\n<p>Many of you may know me from my regular <a href=\"https://x.com/search?q=Node%20Operator%20Community%20Call%20(from%3Aeth_everstake)&amp;src=typed_query&amp;f=top\" rel=\"noopener nofollow ugc\">Node Operators Community Call recaps</a>, but besides these, I do tons of <a href=\"https://x.com/eth_everstake\" rel=\"noopener nofollow ugc\">educational content around Ethereum</a> for the community, as I believe that fighting informational asymmetry and biases will help make this space better. I cover covers not only the latest things around Ethereum and explain novel, complicated concepts in simple words but also touch on the broader landscape that shapes the Ethereum we know today and will face tomorrow. More solid materials from my side include Ethereum ecosystem reports within <a href=\"https://everstake.one/crypto-reports\" rel=\"noopener nofollow ugc\">our reports hub</a>, articles, and talks on the crypto conferences (the last one was on Ethereum governance).</p>\n<p>Thanks for considering my application! Below, you can find out more about my motivation, values, and decision-making approach. If any questions, I will be happy to answer them.</p>\n<h3><a name=\"p-17237-contact-information-4\" class=\"anchor\" href=\"https://research.lido.fi#p-17237-contact-information-4\"></a>Contact Information</h3>\n<ul>\n<li>X / Twitter: <a href=\"https://x.com/eth_everstake\" rel=\"noopener nofollow ugc\">@eth_everstake</a></li>\n<li>Discord: irina_everstake</li>\n<li>Telegram: <a href=\"https://t.me/irina_everstake\" rel=\"noopener nofollow ugc\">irina_everstake</a></li>\n</ul>\n<h3><a name=\"p-17237-motivation-5\" class=\"anchor\" href=\"https://research.lido.fi#p-17237-motivation-5\"></a>Motivation</h3>\n<p>The recent <a href=\"https://x.com/DefiIgnas/status/1817928935490867309\" rel=\"noopener nofollow ugc\">Compound governance attack</a> proved once more the importance of true voters’ dedication and accountability to the governance process, thus, in my opinion, the introduction of a Public Delegate Platform is just in time to enforce a sustainable governance process within Lido DAO itself.</p>\n<p>I have been within the Lido ecosystem for a long time, so I see this initiative as a great opportunity to contribute my expertise and usefulness to the protocol evolution, community, and LDO token holders. For the latter, keeping track of all proposals and voting deadlines may be a burden, which may create a perception of centralization, underrepresentation, and the worst—FOMO, as it’s pretty challenging to be on top of everything given the speed of projects within Web3 space.</p>\n<p>As soon as within my Everstake role I also take care of Everstake representation in the Lido governance process, thus if I become a Public Delegate, it won’t be an extra effort for me, as it is something I used to do on a daily basis.</p>\n<p>Besides, I find the governance process itself interesting, as this concept matures across the Web3 industry (maybe that’s one of the reasons I write so much about it and my recent conference talk was dedicated to it).</p>\n<p>Below are some examples of my participation in the Lido governance across past few years:</p>\n<ul>\n<li>Posts (<a href=\"https://x.com/eth_everstake/status/1719766040282845540\" rel=\"noopener nofollow ugc\">example 1</a>, <a href=\"https://x.com/eth_everstake/status/1689588674348957696\" rel=\"noopener nofollow ugc\">example 2</a>, <a href=\"https://x.com/eth_everstake/status/1636726740004249600\" rel=\"noopener nofollow ugc\">example 3</a>) explaining the proposal/s on the voting to the community</li>\n<li><a href=\"https://x.com/search?q=%22%F0%9F%97%B3%EF%B8%8F%20%22%20(from%3Airina_everstake)&amp;src=typed_query&amp;f=top\" rel=\"noopener nofollow ugc\">Weekly governance highlights</a></li>\n<li>Monthly voting reports (<a href=\"https://x.com/eth_everstake/status/1665016791393763329\" rel=\"noopener nofollow ugc\">example 1</a>, <a href=\"https://x.com/eth_everstake/status/1679597852316561414\" rel=\"noopener nofollow ugc\">example 2</a>): what, when and why</li>\n<li><a href=\"https://x.com/eth_everstake/status/1616031474083299328\" rel=\"noopener nofollow ugc\">Overview of all governance across the year</a></li>\n<li><a href=\"https://research.lido.fi/t/increasing-number-of-active-easy-track-motions-run-simultaneously/4075\">Proposal</a> suggested by me (one and only now)</li>\n<li><a href=\"https://snapshot.org/#/profile/0x06A90756e57bC7A016Eed0aB23fC36d11C42bBa0\" rel=\"noopener nofollow ugc\">My Snapshot voting profile</a> (active since I received the LDO grant in March of this year)</li>\n</ul>\n<p><strong>Objectives as a Public Delegate</strong><br>\nThese are focused on three main pillars of the Lido ecosystem:</p>\n<ol>\n<li><em>Serve to protocol</em>. Ensure Lido safe and sound sustainable growth as a leading liquid staking solution, with best-in-class security, deepest liquidity and competitive rewards in accordance with <a href=\"https://snapshot.org/#/lido-snapshot.eth/proposal/0x739fbe56425d355b5e41c22bb346b7a8217afd9e84aa49863648b1c641a482e3\" rel=\"noopener nofollow ugc\">Lido Vibe</a> trinity (purpose, mission, and vision) that benefit both the protocol and the broader Ethereum ecosystem.</li>\n<li><em>Serve to DAO</em>. Provide in-depth analysis, qualitative discussions, and feedback on the numerous proposals on the forum, as well as active voting participation to minimize not-reached-quorum on-chain voting.</li>\n<li><em>Serve to LDO, stETH and stMATIC tokenholders</em>. While under the current governance design, only the first are eligible to participate, I aim to represent the voices of various interested parties, as all their interests are crucial to the protocol’s long-term success. For LDO tokenholders specifically, I want to be a reliable and helpful mediator in expressing their will and power of Lido future.</li>\n</ol>\n<p>With a good understanding of the Lido governance process and a set process of allocating time for it, I will be a great delegate for your voting power. With your support, my commitment and track record of taking part in Lido governance will continue to make a significant impact within this ecosystem.</p>\n<h3><a name=\"p-17237-values-and-decision-making-approach-6\" class=\"anchor\" href=\"https://research.lido.fi#p-17237-values-and-decision-making-approach-6\"></a>Values and Decision-Making Approach</h3>\n<p><strong>My values</strong><br>\nCore values that will define my decision-making approach:</p>\n<ul>\n<li><em>Stay true to the Lido Vibe</em>:\n<ul>\n<li>Purpose: Keep Ethereum decentralized, accessible to all, and resistant to censorship.</li>\n<li>Vision: A world in which Ethereum is the co-ordination and value layer of the internet.</li>\n<li>Mission: Make staking simple, secure, and decentralized.</li>\n</ul>\n</li>\n<li><em>Holistic and sustainable growth</em>: all decisions will be made with the focus on protocol, tokenholders and stakers security and long-term success.</li>\n<li><em>Integrity, transparency and accountability</em>: I will provide clear reasoning for the decisions I will make with the delegated voting power and the live publicly accessed database of all ongoing and completed votings in the form of a table (see the example below—it is the one I currently use for internal purposes that has all Lido governance votings since 2022):<br>\n<div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://europe1.discourse-cdn.com/business20/uploads/lido/original/2X/c/c541bde4266b6271670715cc73ab5c0e59aa3c20.png\" data-download-href=\"/uploads/short-url/s90UAD6gSvZsGnmByoN0F0vUDte.png?dl=1\" title=\"\" rel=\"noopener nofollow ugc\"><img src=\"https://europe1.discourse-cdn.com/business20/uploads/lido/optimized/2X/c/c541bde4266b6271670715cc73ab5c0e59aa3c20_2_602x421.png\" alt=\"\" data-base62-sha1=\"s90UAD6gSvZsGnmByoN0F0vUDte\" width=\"602\" height=\"421\" role=\"presentation\" srcset=\"https://europe1.discourse-cdn.com/business20/uploads/lido/optimized/2X/c/c541bde4266b6271670715cc73ab5c0e59aa3c20_2_602x421.png, https://europe1.discourse-cdn.com/business20/uploads/lido/optimized/2X/c/c541bde4266b6271670715cc73ab5c0e59aa3c20_2_903x631.png 1.5x, https://europe1.discourse-cdn.com/business20/uploads/lido/optimized/2X/c/c541bde4266b6271670715cc73ab5c0e59aa3c20_2_1204x842.png 2x\" data-dominant-color=\"DDDADA\"></a></div></li>\n<li><em>Active participation and voting</em>: I commit to voting in at least 70% of the votes per quarter and providing feedback on the proposals on the forum while continuing active community engagement and informing on the governance process through my X / Twitter.</li>\n</ul>\n<p><strong>What will define my decision-making process?</strong><br>\nI am attentive to details and have an analytical mindset. Thus, if you select me as a delegate, you can be sure of a thorough analysis of the proposals. While analyzing the proposal, I always consider the decision’s impact on protocol security and sustainability, as well as its effects on the broader Lido ecosystem.</p>\n<p>It’s worth adding that I have an economic degree, which allows me to consider potential implications for Lido’s growth. Unfortunately, I have 0 code expertise, thus, my choices will be based on the audits’ provided results and the reputability of the teams that delivered them.</p>\n<h3><a name=\"p-17237-public-acceptance-7\" class=\"anchor\" href=\"https://research.lido.fi#p-17237-public-acceptance-7\"></a>Public Acceptance</h3>\n<p>I am fully aware of the requirements and expectations of a Public Delegate. If I am selected as a Public Delegate, I will act in accordance with the Public Delegate Code of Conduct, which includes the below, as well as ensure the best for Lido protocol:</p>\n<aside class=\"quote group-DAO_Ops\" data-username=\"Jenya_K\" data-post=\"1\" data-topic=\"7858\">\n<div class=\"title\">\n<div class=\"quote-controls\"></div>\n<img loading=\"lazy\" alt=\"\" width=\"24\" height=\"24\" src=\"https://dub1.discourse-cdn.com/business20/user_avatar/research.lido.fi/jenya_k/48/2672_2.png\" class=\"avatar\"><a href=\"https://research.lido.fi/t/establish-a-public-delegate-platform-and-delegate-incentivization-program/7858/1\">Establish a Public Delegate Platform and Delegate Incentivization Program</a></div>\n<blockquote>\n<p><strong>Public Delegate Code of Conduct:</strong><br>\n• Act honestly, transparently, and with integrity.<br>\n• Vote in the Lido DAO’s best interest.<br>\n• Review each proposal professionally and unbiasedly before voting.<br>\n• Draw the community’s attention if a proposal is unclear, requires additional research, or is not ready to proceed to vote.<br>\n• Provide constructive, well-researched feedback without personal attacks.<br>\n• Respect differing opinions.<br>\n• Clearly explain vote rationales to the community.<br>\n• Be available to discuss proposals and respond to inquiries.<br>\n• Inform the community when ceasing active delegation.<br>\n• Avoid and disclose any conflicts of interest.<br>\n• Disclose potential conflicts related to delegate activities.</p>\n</blockquote>\n</aside>\n<p>Also there is absolute alignment with the <a href=\"https://snapshot.org/#/lido-snapshot.eth/proposal/0x739fbe56425d355b5e41c22bb346b7a8217afd9e84aa49863648b1c641a482e3\" rel=\"noopener nofollow ugc\">mission, vision, and purpose of Lido DAO</a>, as well as I am aware of updated 2024 goals for Lido, <a href=\"https://snapshot.org/#/lido-snapshot.eth/proposal/0x300523518b08f20c585751c0a720ef3ec53698d4e5062154d285b15cb062f96c\" rel=\"noopener nofollow ugc\">ReGOOSE</a>.</p>\n<h3><a name=\"p-17237-disclosures-8\" class=\"anchor\" href=\"https://research.lido.fi#p-17237-disclosures-8\"></a>Disclosures</h3>\n<ul>\n<li>As mentioned straightforwardly in the intro, I am part of <a href=\"https://everstake.one/\" rel=\"noopener nofollow ugc\">Everstake</a>, a staking service provider and a node operator within the Lido on <a href=\"https://blog.lido.fi/eth2-node-operator-recommendations/#:~:text=Everstake%3A%20Everstake,to%20Lido%20soon.\" rel=\"noopener nofollow ugc\">Ethereum</a> and <a href=\"https://blog.lido.fi/lido-polygon-wave2-onboarding/\" rel=\"noopener nofollow ugc\">Polygon</a> Curated set. As part of my role in Everstake, I am in charge of Everstake operations with Lido.</li>\n<li>Earlier this year, specifically in March 2024, I received a LEGO (Lido Ecosystem Grants Organization) <a href=\"https://lego.lido.fi/lego-quarterly-reporting/lego-q1-2024-report/thank-you-to-irina-everstake-for-awesome-lido-related-workposts\" rel=\"noopener nofollow ugc\">grant</a> for my social media posts on Lido, which allowed me to participate in the Lido governance process as a voter.</li>\n<li>I am staking ETH with Lido (one more reason why I do care about Lido protocol and ecosystem sustainable development).</li>\n</ul>\n<p>You can find examples of my past Lido governance activity in <a href=\"https://snapshot.org/#/profile/0x06A90756e57bC7A016Eed0aB23fC36d11C42bBa0\" rel=\"noopener nofollow ugc\">my Snapshot voting profile</a> (0 missed proposals brought to Snapshot voting since I got the privilege to join the governance process following the recipience of the LDO grant), or check all the screenshots <a href=\"https://drive.google.com/drive/folders/1Mk-NzXzRDuKuTz7xbCxTIStXy78epkfU\" rel=\"noopener nofollow ugc\">here</a>.</p>\n            <p><small>3 posts - 1 participant</small></p>\n            <p><a href=\"https://research.lido.fi/t/irina-delegate-thread/8217\">Read full topic</a></p>","link":"https://research.lido.fi/t/irina-delegate-thread/8217","pubDate":"Mon, 26 Aug 2024 00:00:08 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"research.lido.fi-topic-8217"},"source":{"@url":"https://research.lido.fi/t/irina-delegate-thread/8217.rss","#text":"Irina Delegate Thread"}},{"title":"Lemma - Delegate Thread","dc:creator":"Lemma","category":"Delegate Platform","description":"<p></p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://europe1.discourse-cdn.com/business20/uploads/lido/original/2X/f/f2afab23c1c4a1a430f0213940b9fe25cf6e204d.jpeg\" data-download-href=\"/uploads/short-url/yCTUMJMoJMGHl45UDCuoL1DeWfz.jpeg?dl=1\" title=\"642a9b4c17fdf60ae244f245_og-image\" rel=\"noopener nofollow ugc\"><img src=\"https://europe1.discourse-cdn.com/business20/uploads/lido/optimized/2X/f/f2afab23c1c4a1a430f0213940b9fe25cf6e204d_2_690x388.jpeg\" alt=\"642a9b4c17fdf60ae244f245_og-image\" data-base62-sha1=\"yCTUMJMoJMGHl45UDCuoL1DeWfz\" width=\"690\" height=\"388\" srcset=\"https://europe1.discourse-cdn.com/business20/uploads/lido/optimized/2X/f/f2afab23c1c4a1a430f0213940b9fe25cf6e204d_2_690x388.jpeg, https://europe1.discourse-cdn.com/business20/uploads/lido/optimized/2X/f/f2afab23c1c4a1a430f0213940b9fe25cf6e204d_2_1035x582.jpeg 1.5x, https://europe1.discourse-cdn.com/business20/uploads/lido/original/2X/f/f2afab23c1c4a1a430f0213940b9fe25cf6e204d.jpeg 2x\" data-dominant-color=\"261A66\"></a></div><p></p>\n<p><strong>Name</strong>: Lemma Solutions<br>\n<strong>Address</strong>: <a href=\"https://etherscan.io/address/0x58B1b454Dbe5156ACc8FC2139E7238451b59f432\" rel=\"noopener nofollow ugc\">0x58B1b454Dbe5156ACc8FC2139E7238451b59f432</a><br>\n<strong>Website</strong>: <a href=\"https://www.lemma.solutions/\" rel=\"noopener nofollow ugc\">https://www.lemma.solutions/</a><br>\n<strong>Twitter</strong>: <a href=\"https://x.com/Lemma_Solutions\" rel=\"noopener nofollow ugc\">Lemma Solutions</a><br>\n<strong>Telegram</strong>: <a href=\"https://t.me/HM_Analyst\" rel=\"noopener nofollow ugc\">@hm_analyst</a></p>\n<p><strong>Introduction</strong></p>\n<p>Lemma is a Cayman based service provider which assists DAO and Foundations in their operational set up and provide ongoing support. Lemma’s services cover governance design, implementation, initial setup of the foundation from an operations perspective (accounting, bank and exchange accounts, policies, and procedures) and running of grants programs and governance for DAOs.</p>\n<p>The Lemma is presented by a forward think team of professionals that consist of traditional finance professionals and crypto native researchers.</p>\n<p>In our short history we came to recognize the importance of governance and the role delegates play. This role is critical to effective governance of the DAO and being able to move forward with informed decision making.</p>\n<p>We are active contributors to other DAO’s. Assisting with the transparency reports of <a href=\"https://forum.balancer.fi/t/foundation-opco-transparency-report/5875\" rel=\"noopener nofollow ugc\">Balancer</a> DAO, payments with <a href=\"https://forum.osmosis.zone/t/osmosis-grants-program-v3-renewal/1003\" rel=\"noopener nofollow ugc\">Osmosis DAO</a> and <a href=\"https://www.dydxgrants.com/post/v1-5-extension-launch\" rel=\"noopener nofollow ugc\">dYdX</a> grants program.</p>\n<p><strong>Cryptoeconomic Design Expertise</strong></p>\n<p>Lemma’s in-house governance research efforts ensure our industry leading services and will be critically involved with Lido’s Governance. Research is led by <a href=\"https://x.com/blockbanzai\" rel=\"noopener nofollow ugc\">Hugo May</a>, who is an experienced cryptoeconomics researcher and founding member and core contributor of <a href=\"https://justcryptoeconomics.com/\" rel=\"noopener nofollow ugc\">Just Cryptoeconomics</a>, an open-access and non-profit research group that was founded to advance the field of cryptoeconomics., an open-access and non-profit research group that was founded to advance the field of cryptoeconomics.</p>\n<p>Through this initiative, Hugo explores new theories, models, and frameworks, and the insights we gain often inform the projects Lemma takes on.</p>\n<p><strong>Traditional Expertise</strong></p>\n<p>The Founders of Lemma combines expertise from the traditional auditing world and big data. Karel Olivier worked as an auditor at Deloitte in South Africa, the USA and Cayman Islands bringing together a unique set of experiences where he learned from listed and private companies about controls, diversification and the importance of maintain accurate financial information in the making of informed decision making. Lize Page, has a Masters degree in Data Science. With the volume that is produced on the blockchain, the ability to make sense of this is of invaluable experience. Lemma has advisors who we rely on for council when needed. Petri Basson, from Hash Directors, a Web3 specialized directorship firm is an example. They bring an informed lens to decision making when it comes to operations of the DAO.</p>\n<p><strong>Motivation</strong></p>\n<p>We believe that effective governance design is of critical importance to the survival of online public goods. We are well aware of voting fatigue and the implications of the current DAO governance landscape. Having delegates who are informed, willing, active and responsive ensures that the DAO can continue with its mission without the added burden of having to work on “getting out the vote”.</p>\n<p>We bring a different set of skills to the Lido DAO. Being involved with DAOs in their formation stages allows us to see the thinking behind decision making. This experience will provide additional context and feedback to the DAO. We evaluate proposals not only on their merit and cost, but also on what it would mean operationally.</p>\n<p>Our promise to you, the delegates</p>\n<p><strong>Involvement</strong></p>\n<p>We will be involved in proposals. Not only in voting, but in articulating our reasoning and decision-making approach. We intend to offer the same level of diligence in our participation as we do in our operational enablement.</p>\n<p><strong>Pro-activity</strong></p>\n<p>We will be pro-active in our communication. Assessing proposals early-on to allow for changes to be made withing reasonable timelines.</p>\n<p><strong>Compliant and future Focused</strong></p>\n<p>Our primary focus will be on the future of Lido DAO. Each decision will be based on whether this is in line with the growth of the Lido DAO, adds value to the DAO and will allow the DAO to continue with its primary mission.</p>\n<p><strong>Public Acceptance</strong></p>\n<p>We accept the purpose/mission/values of Lido DAO</p>\n<p><strong>Disclosure</strong></p>\n<p>We work with other DAOs. Where a proposal is raised in which we have a conflict of interest we will disclose this and abstain from voting or commentary unless it is specifically requested.</p>\n            <p><small>5 posts - 2 participants</small></p>\n            <p><a href=\"https://research.lido.fi/t/lemma-delegate-thread/8214\">Read full topic</a></p>","link":"https://research.lido.fi/t/lemma-delegate-thread/8214","pubDate":"Sun, 25 Aug 2024 19:42:47 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"research.lido.fi-topic-8214"},"source":{"@url":"https://research.lido.fi/t/lemma-delegate-thread/8214.rss","#text":"Lemma - Delegate Thread"}},{"title":"Marcbcs - Delegate Thread","dc:creator":"marcbcs","category":"Delegate Platform","description":"<p><strong>Name</strong>: Marc<br>\n<strong>Contact Information</strong></p>\n<ul>\n<li>X / Telegram / Discord = <a class=\"mention\" href=\"https://research.lido.fi/u/marcbcs\">@marcbcs</a></li>\n</ul>\n<p><strong>Address</strong>: 0x98308b6dA79B47D15e9438CB66831563649Dbd94</p>\n<p><strong>Introduction</strong></p>\n<ul>\n<li>Background: During the day I work in TradFi, at night I work in Crypto. I’m an economist by training which is what got me into crypto a few years ago: the opportunity to create a better “money”, and from there I never escaped from the rabbit hole. I started my working career in management consulting, first at a top consultancy firm and afterwards as a freelancer. My consulting work has involved from high-level projects advising client’s senior leadership team / board of directors on key strategic matters, to hands-on projects defining and implementing cost reductions. My clients are businesses operating in TradFi Services, Public Sector and Investment Funds amongst others. Currently most of my time is dedicated to Revolut working there in Strategy (10%) &amp; Operations (90%), a decent amount of the time on crypto. After hours, I consult for crypto startups (mostly regulated businesses / CeFi) and I’m an active contributor to Lido in the Treasury Management Committee.</li>\n<li>Expertise: Get shit done in business strategy and operations; break down hard stuff into simple terms so people (from devs, to management to operators) can understand each other.</li>\n</ul>\n<p><strong>Motivation</strong></p>\n<ul>\n<li>Make it easier for LDO holders to participate in Lido’s governance: It’s not possible to be on top of everything, specially in an rapidly moving industry like crypto. This is why I myself focus on Lido and delegate my tokens for other projects. If elected, I will stop consulting for other companies to ensure I do a good job here.</li>\n<li>Ensure that Lido continues to be a leader in staking: Lido has a head-start because of it’s large market share with Retail. However, the Institutions are coming and this will be a completely different game. I want to see Lido thrive here and help make it happen.</li>\n<li>Bring the best of the traditional business world to Lido: DAOs are a great invention but have their own set of challenges. I believe that there are a few things we can borrow from traditional businesses improve Lido and I’m well placed to help with that.</li>\n</ul>\n<p><strong>Values and Decision-Making Approach</strong></p>\n<ul>\n<li>Decentralisation</li>\n<li>Meritocracy</li>\n<li>Seek truth (<em>“what do people believe merely by convention and what is truth?”</em>)</li>\n</ul>\n<p><strong>Public Acceptance</strong><br>\nI accept <a href=\"https://ipfs.io/ipfs/QmPwqjn5NiNVFKjxxBnYHivgempeyNNpMNotGYMCXitRd3\">the Lido Public Delegate Code of Conduct </a> and commit to being fully aligned with <a href=\"https://research.lido.fi/t/lido-dao-vibe-alignment-purpose-mission-vision/4380\">Purpose/Mission/Values of Lido DAO</a>.</p>\n<p><strong>Disclosures</strong><br>\nI work a TradFi job for Revolut, which involves working on crypto. I also have to disclose my relationship with Lido to Revolut to avoid any conflicts of interest, and should one arise, I would inform both parties and anyone who has delegated to me.<br>\nI also advise crypto startups, mostly regulated businesses / CeFi. As mentioned above, if elected, I will stop consulting for other companies to ensure I do a good job a Lido Delegate.</p>\n<p><strong>Waiver of Liability</strong><br>\nBy delegating to <a class=\"mention\" href=\"https://research.lido.fi/u/marcbcs\">@marcbcs</a>, you acknowledge and agree that I will participate on a best-efforts basis and will not be liable for any damages related to participation in the Lido Protocol or its DAO.</p>\n            <p><small>1 post - 1 participant</small></p>\n            <p><a href=\"https://research.lido.fi/t/marcbcs-delegate-thread/8209\">Read full topic</a></p>","link":"https://research.lido.fi/t/marcbcs-delegate-thread/8209","pubDate":"Sun, 25 Aug 2024 14:38:06 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"research.lido.fi-topic-8209"},"source":{"@url":"https://research.lido.fi/t/marcbcs-delegate-thread/8209.rss","#text":"Marcbcs - Delegate Thread"}},{"title":"Today in DeFi Delegate Thread","dc:creator":"danger","category":"Delegate Platform","description":"<p><strong>Introduction</strong><br>\nToday in DeFi is a DeFi research media. We’ve been using and trading on chain since 2019 and are familiar with the LSD and DeFi Landscape.</p>\n<p>Because of our work we’re extremely up to date with the DeFi landscape and would be able to propose or vote intelligently on proposals for Lido’s benefit based on that context.</p>\n<p><strong>Address</strong> (Your Ethereum address or ENS name)<br>\n0xf163D77B8EfC151757fEcBa3D463f3BAc7a4D808</p>\n<p><strong>Contact Information</strong> (Twitter, Discord)<br>\ntwitter: todayindefi and safetyth1rd</p>\n<p><strong>Motivation</strong> (Reason for wanting to be a delegate, Objectives, and aspirations within the DAO)</p>\n<p>Lido recently is developing the CSM and also supporting DVT, showing an interest in help promote decentralization in the LSD landscape. As decentralization proponents we’d like to help these initiatives through good governance.</p>\n<p><strong>Values and Decision-Making Approach</strong> (Core Values, Decision-Making Process)</p>\n<p>As Decentralization proponents we’d aim to vote for and push proposals which align Lido’s incentives with decentralizing Ethereum, while still benefiting Lido.</p>\n<p>We have a team of defi analysts who could analyze proposals from various perspectives to provide the best guidance.</p>\n<p>We also have run validators, and created education around staking, including a recent Devcon event on Staking and restaking, so we have knowledge and experience from solo staking to using and farming LSDs, to using RSTs and how restaking works.</p>\n<p>This end to end understanding of staking, as well as knowledge of the restaking landscape would let us make informed decisions about lido governance proposals and may also help us shape new proposals.</p>\n<p><strong>Public Acceptance</strong>: I accept Lido DAO delegate <a href=\"https://ipfs.io/ipfs/QmPwqjn5NiNVFKjxxBnYHivgempeyNNpMNotGYMCXitRd3\" rel=\"noopener nofollow ugc\">Сode of Сonduct</a> and <a href=\"https://snapshot.org/#/lido-snapshot.eth/proposal/0x739fbe56425d355b5e41c22bb346b7a8217afd9e84aa49863648b1c641a482e3\" rel=\"noopener nofollow ugc\">Aligned with Lido’s Vibe (Purpose, Mission, Vision) </a></p>\n<p><strong>Disclosures</strong>:  As traders and farmers we generally are holding positions in LSTs or RSTs in our search for the best risk adjusted yield on ETH. Our search for yield generally means we rotate between providers as market dynamics change and does not tilt us towards any single project.</p>\n            <p><small>1 post - 1 participant</small></p>\n            <p><a href=\"https://research.lido.fi/t/today-in-defi-delegate-thread/8207\">Read full topic</a></p>","link":"https://research.lido.fi/t/today-in-defi-delegate-thread/8207","pubDate":"Sun, 25 Aug 2024 13:40:08 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"research.lido.fi-topic-8207"},"source":{"@url":"https://research.lido.fi/t/today-in-defi-delegate-thread/8207.rss","#text":"Today in DeFi Delegate Thread"}},{"title":"Next Finance Tech Delegate Thread","dc:creator":"NextFinanceTech","category":"Delegate Platform","description":"<h2><a name=\"p-17218-delegate-information-1\" class=\"anchor\" href=\"https://research.lido.fi#p-17218-delegate-information-1\"></a><strong>Delegate information:</strong></h2>\n<p><strong>Name:</strong> Next Finance Tech<br>\n<strong>Address:</strong> 0x18c674F655594F15c490aeEac737895b7903E37f<br>\n<strong>Twitter:</strong> <span class=\"mention\">@nxt_fintech</span><br>\n<strong>Website:</strong> <a href=\"https://nxt-fintech.com/en/\" rel=\"noopener nofollow ugc\">https://nxt-fintech.com</a><br>\n<strong>Discord:</strong> <span class=\"mention\">@shinyabuu</span><br>\n<strong>Telegram:</strong> <span class=\"mention\">@iamshinya</span></p>\n<h2><a name=\"p-17218-background-2\" class=\"anchor\" href=\"https://research.lido.fi#p-17218-background-2\"></a><strong>Background:</strong></h2>\n<p>We are honored to apply as a Lido DAO delegator. Our mission, as a Japan-based staking service provider and blockchain research institution, is to advance decentralized technologies.</p>\n<p>Our leadership, led by CEO Soichiro Tokuriki and CTO/CIO Shinya Tsuchida, brings extensive financial experience. Soichiro, with a background in asset management for institutional investors at Goldman Sachs, engages in strategic analysis and business development related to crypto assets. Shinya, with financial system development experience at Goldman Sachs, ensures the technological innovation and robustness of our staking infrastructure.</p>\n<p>Our investors, including Yamaguchi Capital and GMO Web3, support our vision and operations. Additionally, we collaborate with top-tier academic institutions, including Osaka Institute of Technology and The Hong Kong University of Science and Technology, reinforcing our research-driven approach.</p>\n<h2><a name=\"p-17218-expertise-3\" class=\"anchor\" href=\"https://research.lido.fi#p-17218-expertise-3\"></a><strong>Expertise:</strong></h2>\n<ol>\n<li><strong>Staking Expertise</strong><br>\nNext Finance Tech has a proven track record in staking operations, with a particularly focus on Ethereum. We consistently maintain over 99.9% uptime in our staking services, supporting multi-client and multi-region operations.<br>\nAdditionally, we are leading the introduction of the Lido Community Staking Module (CSM) in Japan, hosting monthly events since July 2024 and creating Japanese documentation to promote knowledge dissemination. We have plans for further CSM development (<a href=\"https://research.lido.fi/t/community-grants-csm-resources/7990/6\">link</a>).</li>\n<li><strong>Traditional Finance and Institutional Expertise (TradFi/Institutional)</strong><br>\nOur leadership team brings extensive experience from the traditional finance sector. Our CEO, Soichiro Tokuriki, notably worked at Goldman Sachs, where he specialized in institutional investor relations. As ETH spot ETFs and staking ETFs frows, an influx of institutional capital into ETH staking is anticipated. Lido Institutional is well-positioned to meet this demand, and we believe our expertise in traditional finance and institutional investor relations will significantly contribute to advancing these efforts.</li>\n</ol>\n<h2><a name=\"p-17218-motivation-4\" class=\"anchor\" href=\"https://research.lido.fi#p-17218-motivation-4\"></a><strong>Motivation:</strong></h2>\n<p>Lido has a robust ecosystem comprised of numerous stakers—both individual and institutional—as well as a diverse array of node operators including professional staking firms and solo validators. By effectively balancing and aligning the interests of these stakeholders, Lido continues to expand its ecosystem and foster a more decentralized Ethereum network.</p>\n<p>Within this context, providing staking services to institutional investors and advancing the development of community stakers emerge as critical challenges. Driven by these considerations, we are motivated to serve as a Lido DAO delegator with the following objectives.</p>\n<ol>\n<li><strong>Decentralization of Ethereum Staking Entities (Integration with Institutional Investors)</strong><br>\nWith the recent introduction of Ethereum spot ETFs, there is an anticipated influx of capital from institutional investors into ETH staking. The continued development of stETH, which allows staking while maintaining decentralization, is crucial for the ecosystem. In this context, providing staking solutions to institutional investors—essentially advancing Lido Institution—is of paramount importance. I believe that discussions within Lido DAO from this perspective are necessary, and we are eager to contribute to these discussions.</li>\n<li><strong>Decentralization of Ethereum Node Operators (Revitalization of Community Stakers)</strong><br>\nA key challenge in Ethereum staking is the decentralization of clients and servers. To enhance the geographical decentralization of servers, efforts to increase the number of Community Stakers in regions such as Asia and Africa are essential. We are committed to engaging in discussions around these initiatives and fostering active dialogue in Lido DAO by incorporating feedback from Community Stakers.</li>\n</ol>\n<h2><a name=\"p-17218-values-and-decision-making-approach-5\" class=\"anchor\" href=\"https://research.lido.fi#p-17218-values-and-decision-making-approach-5\"></a><strong>Values and Decision-Making Approach:</strong></h2>\n<ol>\n<li><strong>Data-Driven</strong>:<br>\nWe prioritize a data-driven approach to sustain and optimize the Lido ecosystem, which hosts numerous stakers and node operators. By making informed and timely adjustments, we aim to continuously improve the platform.</li>\n<li><strong>Community-Centric</strong>:<br>\nWe actively involve the staking community, particularly in APAC/Japan, in our decision-making. By reflecting their insights and needs, we ensure that our strategies are shaped by the community’s perspective.</li>\n<li><strong>Strategic and Long-Term Planning</strong>:<br>\nOur decisions are guided by long-term goals, combining traditional finance with DeFi innovations. We evaluate all decisions for sustainability, ensuring ongoing value creation for $LDO token holders.</li>\n</ol>\n<h2><a name=\"p-17218-public-acceptance-6\" class=\"anchor\" href=\"https://research.lido.fi#p-17218-public-acceptance-6\"></a><strong>Public Acceptance:</strong></h2>\n<p>I accept Lido DAO delegate Сode of Сonduct (<a href=\"https://ipfs.io/ipfs/QmPwqjn5NiNVFKjxxBnYHivgempeyNNpMNotGYMCXitRd3\" rel=\"noopener nofollow ugc\">link</a>) and Aligned with <a href=\"https://snapshot.org/#/lido-snapshot.eth/proposal/0x739fbe56425d355b5e41c22bb346b7a8217afd9e84aa49863648b1c641a482e3\" rel=\"noopener nofollow ugc\">Lido’s Vibe (Purpose, Mission, Vision)</a></p>\n<h2><a name=\"p-17218-disclosures-7\" class=\"anchor\" href=\"https://research.lido.fi#p-17218-disclosures-7\"></a><strong>Disclosures</strong>:</h2>\n<p>As a Node Operator for Lido Finance and a Delegator in the Lido DAO, there is a potential for conflict of interest. Decisions or votes made in the DAO might benefit the Node Operator role disproportionately. I commit to transparency and aligning all actions with the best interests of the Lido community to mitigate this risk.</p>\n            <p><small>1 post - 1 participant</small></p>\n            <p><a href=\"https://research.lido.fi/t/next-finance-tech-delegate-thread/8204\">Read full topic</a></p>","link":"https://research.lido.fi/t/next-finance-tech-delegate-thread/8204","pubDate":"Sun, 25 Aug 2024 07:35:29 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"research.lido.fi-topic-8204"},"source":{"@url":"https://research.lido.fi/t/next-finance-tech-delegate-thread/8204.rss","#text":"Next Finance Tech Delegate Thread"}},{"title":"RockLogic Monthly Notes - 08/2024","dc:creator":"Vithya","category":"Node Operators","description":"<p>Welcome to our monthly news, where we provide you with updates on our efforts to establish a secure Ethereum environment. Here’s a summary of notable developments since our last update.</p>\n<h2><a name=\"p-17215-reconfiguration-of-vm-disks-for-improved-io-latency-1\" class=\"anchor\" href=\"https://research.lido.fi#p-17215-reconfiguration-of-vm-disks-for-improved-io-latency-1\"></a>Reconfiguration of VM Disks for Improved IO Latency:</h2>\n<p>To enhance virtual machine (VM) performance and address potential latency issues, we implemented a series of disk reconfiguration strategies.</p>\n<p>Advancements &amp; Results:</p>\n<ul>\n<li>Moved VMs to faster storage, allocated more space, used SSDs, and defragmented disks for improved performance.</li>\n<li>Adjusted settings to prioritize critical workloads.</li>\n</ul>\n<p>Next Steps:</p>\n<ul>\n<li>Regularly review VM performance, adjust disk settings as needed, to ensure ongoing system health and efficiency.</li>\n</ul>\n<h2><a name=\"p-17215-super-cluster-preparation-updates-2\" class=\"anchor\" href=\"https://research.lido.fi#p-17215-super-cluster-preparation-updates-2\"></a>Super Cluster Preparation Updates:</h2>\n<p>We’ve been actively preparing to participate in the Simple DVT Super Clusters</p>\n<p>Advancements &amp; Results:</p>\n<ul>\n<li>We’ve ensured our node infrastructure is fully prepared to join a Super Cluster.</li>\n</ul>\n<h2><a name=\"p-17215-monitoring-maintenace-updates-3\" class=\"anchor\" href=\"https://research.lido.fi#p-17215-monitoring-maintenace-updates-3\"></a>Monitoring &amp; Maintenace Updates:</h2>\n<p>We continuously monitor system health, apply software updates, and conduct hardware checks to ensure optimal performance and security.</p>\n<p>Advancement &amp; Results:</p>\n<ul>\n<li>Regular maintenance helps prevent unexpected downtime, reduces security vulnerabilities, optimizes performance, and potentially saves costs by addressing issues proactively.</li>\n</ul>\n<p>Next Steps:</p>\n<ul>\n<li>Continue monitoring node health and performance for optimal uptime.</li>\n<li>Stay updated on upcoming upgrades and schedule them accordingly.</li>\n</ul>\n<h2><a name=\"p-17215-testnet-participation-updates-4\" class=\"anchor\" href=\"https://research.lido.fi#p-17215-testnet-participation-updates-4\"></a>Testnet Participation Updates</h2>\n<p>Participating in testnet Lido x SafeStake and continued to provide technical support for Stereum.</p>\n<p>Advancements &amp; Results:</p>\n<ul>\n<li>Stereum: Monitored and maintained node health to ensure optimal testnet performance</li>\n<li>Cluster Member: Maintained system health by adhering to established guidelines, following cluster coordinator instructions, and continuously monitoring node performance and network health</li>\n</ul>\n<p>Next Steps:</p>\n<ul>\n<li>Stereum: Continue to monitor and optimize the Stereum to ensure a seamless user experience.</li>\n<li>Cluster Member: Ensure system health and follow cluster coordinator instructions.</li>\n</ul>\n<p>Best Regards,<br>\nRockLogic Team</p>\n            <p><small>1 post - 1 participant</small></p>\n            <p><a href=\"https://research.lido.fi/t/rocklogic-monthly-notes-08-2024/8202\">Read full topic</a></p>","link":"https://research.lido.fi/t/rocklogic-monthly-notes-08-2024/8202","pubDate":"Sun, 25 Aug 2024 04:43:38 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"research.lido.fi-topic-8202"},"source":{"@url":"https://research.lido.fi/t/rocklogic-monthly-notes-08-2024/8202.rss","#text":"RockLogic Monthly Notes - 08/2024"}},{"title":"Boardroom Delegate Thread","dc:creator":"team_boardroom","category":"Delegate Platform","description":"<h1><a name=\"p-17212-boardroom-delegate-thread-1\" class=\"anchor\" href=\"https://research.lido.fi#p-17212-boardroom-delegate-thread-1\"></a>Boardroom Delegate Thread</h1>\n<p><strong>Name:</strong> Boardroom<br>\n<strong>Delegate Address:</strong> boardroomgov.eth</p>\n<h3><a name=\"p-17212-about-boardroom-2\" class=\"anchor\" href=\"https://research.lido.fi#p-17212-about-boardroom-2\"></a>About Boardroom</h3>\n<p>Boardroom supports the governance of nearly 350 protocols and DAOs via our platform and has been an active participant in the growth of decentralized governance over the last three years. The team is constantly auditing governance contracts, systems, and processes to power our governance data API and governance client which is trusted and widely used across the industry. Boardroom also maintains close relationships with delegates and contributors in most major DAOs and their feedback has been helpful in analyzing tokenholder preferences and relaying industry best practices across the space.</p>\n<h2><a name=\"p-17212-delegate-statement-3\" class=\"anchor\" href=\"https://research.lido.fi#p-17212-delegate-statement-3\"></a>Delegate Statement</h2>\n<p>We support initiatives that onboard delegates, introduce governance improvements, and uphold agreed-upon governance procedures.</p>\n<h3><a name=\"p-17212-what-we-want-to-see-happen-in-lido-governance-over-the-next-year-4\" class=\"anchor\" href=\"https://research.lido.fi#p-17212-what-we-want-to-see-happen-in-lido-governance-over-the-next-year-4\"></a>What we want to see happen in Lido governance over the next year</h3>\n<p>We believe it is critical for the community to prioritize sound governance practices that are responsive to the goals of all stakeholders. As such, three things we want to see happen in Lido governance over the next year are:</p>\n<ol>\n<li><strong>Increased Delegate Activity:</strong> We’d like to see a focus on conversations about delegate engagement, retention, and compensation as we help establish a cultural practice of frequent re-delegation and delegate campaigning.</li>\n<li><strong>Reduced Information Asymmetry:</strong> Keeping up with the latest in DAO governance is cumbersome for the average tokenholder. Boardroom produces the leading weekly DAO governance newsletter and has contributed to several DAOs, including Lido, in the form of helping to reduce information asymmetry by producing easy-to-read Governance updates. As a Lido delegate, we would make solving this problem a priority.</li>\n<li><strong>Experimentation in Governance:</strong> Lido should experiment with innovations in decentralized governance, such as flexible voting, the use of working groups and SubDAOs, and governance privacy enhancements.</li>\n</ol>\n<h3><a name=\"p-17212-reasons-we-want-to-be-a-delegate-5\" class=\"anchor\" href=\"https://research.lido.fi#p-17212-reasons-we-want-to-be-a-delegate-5\"></a>Reasons we want to be a delegate</h3>\n<p>From our vantage point in the industry, we see many recurring issues in DAO governance. Some examples include information asymmetry, social dynamics hindering newcomer participation, limited access and support for large tokenholders and delegates, and widespread apathy and low participation among tokenholders. These issues create barriers to effective governance, making it difficult for stakeholders to stay informed, contribute meaningfully, and navigate the decision-making process.</p>\n<p>Boardroom is well positioned to kickstart initiatives that can address these challenges by improving information dissemination, fostering community engagement, providing support to stakeholders, and promoting a more participatory governance environment in the Lido ecosystem onboarding. As a Lido delegate, Boardroom will offer support to contributors who don’t have the connections or the voting power needed to propose new initiatives and contribute to the governance and growth of the Lido ecosystem.</p>\n<h3><a name=\"p-17212-disclosure-of-conflicts-of-interest-6\" class=\"anchor\" href=\"https://research.lido.fi#p-17212-disclosure-of-conflicts-of-interest-6\"></a>Disclosure of Conflicts of Interest</h3>\n<p>Boardroom is a venture-funded company with investors that include delegates in other protocols that could become competitive with Uniswap. Boardroom also has integrations (client and platform) and has provided governance facilitation services to stakeholders in the Optimism, ENS, Compound, and Aave ecosystems.</p>\n<h4><a name=\"p-17212-public-acceptance-7\" class=\"anchor\" href=\"https://research.lido.fi#p-17212-public-acceptance-7\"></a>Public Acceptance</h4>\n<p>We apply and accept the Lido Public Delegate Code of Conductand with Purpose/Mission/Values of Lido DAO</p>\n            <p><small>1 post - 1 participant</small></p>\n            <p><a href=\"https://research.lido.fi/t/boardroom-delegate-thread/8200\">Read full topic</a></p>","link":"https://research.lido.fi/t/boardroom-delegate-thread/8200","pubDate":"Sat, 24 Aug 2024 20:27:52 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"research.lido.fi-topic-8200"},"source":{"@url":"https://research.lido.fi/t/boardroom-delegate-thread/8200.rss","#text":"Boardroom Delegate Thread"}},{"title":"Daedalus Delegate Thread","dc:creator":"daedalus_angels","category":"Delegate Platform","description":"<p></p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://europe1.discourse-cdn.com/business20/uploads/lido/original/2X/3/34aed82e52916083ae6b83fc17510409371527a6.png\" data-download-href=\"/uploads/short-url/7w3qIHF4aMLPmlckSEZy2YxmUqq.png?dl=1\" title=\"Daedalus_Logo_Black\" rel=\"noopener nofollow ugc\"><img src=\"https://europe1.discourse-cdn.com/business20/uploads/lido/optimized/2X/3/34aed82e52916083ae6b83fc17510409371527a6_2_125x125.png\" alt=\"Daedalus_Logo_Black\" data-base62-sha1=\"7w3qIHF4aMLPmlckSEZy2YxmUqq\" width=\"125\" height=\"125\" srcset=\"https://europe1.discourse-cdn.com/business20/uploads/lido/optimized/2X/3/34aed82e52916083ae6b83fc17510409371527a6_2_125x125.png, https://europe1.discourse-cdn.com/business20/uploads/lido/optimized/2X/3/34aed82e52916083ae6b83fc17510409371527a6_2_187x187.png 1.5x, https://europe1.discourse-cdn.com/business20/uploads/lido/optimized/2X/3/34aed82e52916083ae6b83fc17510409371527a6_2_250x250.png 2x\" data-dominant-color=\"000000\"></a></div><p></p>\n<h2><a name=\"p-17206-delegate-information-1\" class=\"anchor\" href=\"https://research.lido.fi#p-17206-delegate-information-1\"></a>Delegate information:</h2>\n<p><strong>Name:</strong> Daedalus Collective<br>\n<strong>Address:</strong> 0x04827a54F2e345467beAFEfB9EF76Cb2f2c62D83<br>\n<strong>Forum:</strong> <a href=\"https://research.lido.fi/u/daedalus_angels/summary\">@daedalus_angels</a><br>\n<strong>Twitter:</strong> <a href=\"https://x.com/daedalus_angels\" rel=\"noopener nofollow ugc\">@daedalus_angels </a><br>\n<strong>Telegram:</strong> <a href=\"https://t.me/ibidino\" rel=\"noopener nofollow ugc\">@ibidino</a> <a href=\"https://t.me/vmihov\" rel=\"noopener nofollow ugc\">@vmihov</a> <a href=\"https://t.me/ncerovac\" rel=\"noopener nofollow ugc\">@ncerovac</a> <a href=\"https://t.me/lukaskywaIker\" rel=\"noopener nofollow ugc\">@lukaskywaIker</a></p>\n<h2><a name=\"p-17206-introduction-2\" class=\"anchor\" href=\"https://research.lido.fi#p-17206-introduction-2\"></a><strong>Introduction</strong></h2>\n<p>Daedalus is a web3 angel collective made up of veteran founders, builders and operators in the blockchain space. Our team of 10 is a strategic blend of engineers and ex CTOs, BDs and marketers, lawyers and economists, all heavily involved and demonstrably commited to the growth of the Ethereum ecosystem.</p>\n<p>Collectively and over the years, we have either founded or actively contributed to a long list of promising and established protocols (like Yearn Finance, Perpetual Protocol), communities (like lobsterDAO) open-source tools (like smold.app) and infrastructure solutions (like The Graph). We are decentralization maxis and have proven to be longterm, big-picture investors.</p>\n<p>Our full team and track record can be found <a href=\"https://x.com/daedalus_angels/status/1509544280309837826\" rel=\"noopener nofollow ugc\">here</a></p>\n<h2><a name=\"p-17206-motivation-3\" class=\"anchor\" href=\"https://research.lido.fi#p-17206-motivation-3\"></a><strong>Motivation</strong></h2>\n<p>Given its dominant position among incumbent liquid staking providers and an ongoing commitment to decentralizing its Node Operator set, we clearly see Lido as one of the most important stakeholders in Ethereum’s present and future. Thus, it becomes paramount to create and nurture an efficient, transparent and high-touch approach to Lido’s wholesale governance initiatives and all future proposals.</p>\n<p>It is no secret that voter apathy has plagued both young upstarts and established protocols that pledged to decentralize their capacities. The onus is on the Lido delegates to shoulder the bulk of the operative load and herald the interests of not just the underlying protocol, but of the Ethereum ecosystem at large.</p>\n<p>The Daedalus Collective is a group of seasoned builders, founders and operators helping shape the blockchain space for the better part of the last decade. With a healthy blend of technical and soft skills as well as a track record in helping guide, grow and govern successful projects, we now want to leverage our members’ expertise to help streamline Lido’s governance efforts, demystify future proposals and pending innovations to the broader public, and advocate for both sustainable growth and ecosystem-wide alignment of the Lido protocol.</p>\n<h2><a name=\"p-17206-values-and-decision-making-approach-4\" class=\"anchor\" href=\"https://research.lido.fi#p-17206-values-and-decision-making-approach-4\"></a><strong>Values and Decision-Making Approach</strong></h2>\n<p><strong>Clarity and context</strong> - we aim to diminish the massive information asymmetry currently present between most delegates and the wider public. Given many of our members’ history and experience in end-user and community-facing roles, we want to help unscramble the lifecycle of an average proposal and make them more digestible for any Lido community member.</p>\n<p><strong>Decentralization</strong> - we support Lido’s ongoing efforts to expand the Node Operator set and employ novel decentralization mechanisms. We pledge to safeguard the decentralization ethos and help align stakeholder interests in its pursuit.</p>\n<p><strong>High-touch</strong> - our involvement goals go beyond merely proactive - we are committed to engaging fully with 100% of incoming DAO proposals.</p>\n<p><strong>Methodical and thorough</strong> - governance proposals are a highly collaborative effort spanning across teams, departments, contributors and community members. We will always engage with all relevant stakeholders as part of our decision-making process, and ensure a constant and open line of communication from the research phase all the way up until the vote is cast.</p>\n<h2><a name=\"p-17206-public-acceptance-5\" class=\"anchor\" href=\"https://research.lido.fi#p-17206-public-acceptance-5\"></a><strong>Public Acceptance</strong>:</h2>\n<p>Daedalus accepts Lido DAO delegate Сode of Сonduct (<a href=\"https://ipfs.io/ipfs/QmPwqjn5NiNVFKjxxBnYHivgempeyNNpMNotGYMCXitRd3\" rel=\"noopener nofollow ugc\">link</a>) and Aligned with <a href=\"https://snapshot.org/#/lido-snapshot.eth/proposal/0x739fbe56425d355b5e41c22bb346b7a8217afd9e84aa49863648b1c641a482e3\" rel=\"noopener nofollow ugc\">Lido’s Vibe (Purpose, Mission, Vision)</a></p>\n<p><strong>Disclosures</strong>:</p>\n<p>one of Daedalus contributors (<a class=\"mention\" href=\"https://research.lido.fi/u/ncerovac\">@ncerovac</a>) has recently joined Lido as a contributor to the Alliance effort and will abstain from any Alliance-related governance proposals.</p>\n<p>Over the past 3 years, Daedalus and its members have backed a number of promising teams and projects across web3 verticals. At this junction, we see no clear COIs between the Daedalus portfolio and our active involvement in the Lido DAO and its governance efforts. The full portfolio of our collective - as well as many individual investments of our team members - can be found at <a href=\"https://www.daedalus.gg/\" rel=\"noopener nofollow ugc\">daedalus.gg</a></p>\n            <p><small>1 post - 1 participant</small></p>\n            <p><a href=\"https://research.lido.fi/t/daedalus-delegate-thread/8195\">Read full topic</a></p>","link":"https://research.lido.fi/t/daedalus-delegate-thread/8195","pubDate":"Sat, 24 Aug 2024 10:22:10 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"research.lido.fi-topic-8195"},"source":{"@url":"https://research.lido.fi/t/daedalus-delegate-thread/8195.rss","#text":"Daedalus Delegate Thread"}},{"title":"Cp0x Delegate Thread","dc:creator":"cp0x","category":"Delegate Platform","description":"<h4><a name=\"p-17200-introduction-1\" class=\"anchor\" href=\"https://research.lido.fi#p-17200-introduction-1\"></a>Introduction</h4>\n<p>Name:  <strong>cp0x</strong></p>\n<p>Address: <strong>0x6f9BB7e454f5B3eb2310343f0E99269dC2BB8A1d</strong></p>\n<p>Contact Information: <strong>web: <a href=\"https://cp0x.com/\" rel=\"noopener nofollow ugc\">cp0x.com</a> | twitter/X: <a href=\"https://x.com/cp0xdotcom\" rel=\"noopener nofollow ugc\">@cp0xdotcom</a></strong></p>\n<h4><a name=\"p-17200-background-2\" class=\"anchor\" href=\"https://research.lido.fi#p-17200-background-2\"></a>Background</h4>\n<p>We’re <strong>cpox</strong> - а crypto-community created to unite enthusiasts, gain education and understanding of the cryptosphere</p>\n<p>Our commitment to public good values is proven by continued support from people to our grants from <a href=\"https://bounties.gitcoin.co/grants/619/forum-cp0x-cozy-forum-about-cryptospace-in-russia\" rel=\"noopener nofollow ugc\">Gitcoin Grants 4</a> up to the <a href=\"https://explorer.gitcoin.co/#/round/1/0xaa40e2e5c8df03d792a52b5458959c320f86ca18/0xaa40e2e5c8df03d792a52b5458959c320f86ca18-69\" rel=\"noopener nofollow ugc\">present</a>, as well as awards in the Retroactive Public Goods Funding from <a href=\"https://optimism.mirror.xyz/Upn_LtV2-3SviXgX_PE_LyA7YI00jQyoM1yf55ltvvI?rpgf=2\" rel=\"noopener nofollow ugc\">Optimism</a></p>\n<p>Developers trust us. We are active signers in projects like <a href=\"https://docs.yearn.finance/security/multisig\" rel=\"noopener nofollow ugc\">Yearn</a> and <a href=\"https://docs.spiral.farm/risks-and-security/multi-sig\" rel=\"noopener nofollow ugc\">SpiralDAO</a></p>\n<p>We are one of the best delegates of the largest DAO - ArbitrumDAO.<br>\nOver the past 3 months, we have always been in the top 3 best in terms of voting level, communication and commenting proposals.</p>\n<h4><a name=\"p-17200-motivation-3\" class=\"anchor\" href=\"https://research.lido.fi#p-17200-motivation-3\"></a>Motivation</h4>\n<p>We participate in many DAOs as a delegate and we like to work in this direction for the benefit of the development of the crypto. And we have a lot of experience in this.</p>\n<h4><a name=\"p-17200-values-and-decision-making-approach-4\" class=\"anchor\" href=\"https://research.lido.fi#p-17200-values-and-decision-making-approach-4\"></a>Values and Decision-Making Approach</h4>\n<p>In our voting we always adhere to :</p>\n<ul>\n<li>honesty,</li>\n<li>objectivity,</li>\n<li>transparency,</li>\n<li>strive to develop the community for the public good.</li>\n</ul>\n<p>With such principles, we are confident that we can help Lido develop.</p>\n<h4><a name=\"p-17200-public-acceptance-5\" class=\"anchor\" href=\"https://research.lido.fi#p-17200-public-acceptance-5\"></a>Public Acceptance</h4>\n<p>We apply and accept <a href=\"https://ipfs.io/ipfs/QmPwqjn5NiNVFKjxxBnYHivgempeyNNpMNotGYMCXitRd3\" rel=\"noopener nofollow ugc\">the Lido Public Delegate Code of Conduct </a> and with <a href=\"https://research.lido.fi/t/lido-dao-vibe-alignment-purpose-mission-vision/4380\">Purpose/Mission/Values of Lido DAO</a>.</p>\n<h4><a name=\"p-17200-disclosures-6\" class=\"anchor\" href=\"https://research.lido.fi#p-17200-disclosures-6\"></a>Disclosures</h4>\n<p>We are <a href=\"https://www.tally.xyz/profile/graph-node-1-cp0x-hosted-by-ryabina.eth\" rel=\"noopener nofollow ugc\">delegates of several DAOs</a>.</p>\n            <p><small>1 post - 1 participant</small></p>\n            <p><a href=\"https://research.lido.fi/t/cp0x-delegate-thread/8193\">Read full topic</a></p>","link":"https://research.lido.fi/t/cp0x-delegate-thread/8193","pubDate":"Fri, 23 Aug 2024 23:00:06 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"research.lido.fi-topic-8193"},"source":{"@url":"https://research.lido.fi/t/cp0x-delegate-thread/8193.rss","#text":"Cp0x Delegate Thread"}},{"title":"ESPBL: Collective Bargaining for the Lido Alliance","dc:creator":"sambacha","category":"Proposals","description":"<h1><a name=\"p-17199-ethereum-service-providers-business-league-collective-bargaining-in-decentralized-systems-1\" class=\"anchor\" href=\"https://research.lido.fi#p-17199-ethereum-service-providers-business-league-collective-bargaining-in-decentralized-systems-1\"></a>Ethereum Service Providers Business League: Collective Bargaining in Decentralized Systems</h1>\n<h2><a name=\"p-17199-abstract-2\" class=\"anchor\" href=\"https://research.lido.fi#p-17199-abstract-2\"></a>Abstract</h2>\n<p>We propose the formation of the Ethereum Service Providers Business League, a collective bargaining entity, as a solution to the challenges of securing better pricing and rates for  Lido Node Operators. The implications of this organizational should increase network resilience, pricing, marginal costs, and advocate for the ecosystem.</p>\n<h2><a name=\"p-17199-introduction-3\" class=\"anchor\" href=\"https://research.lido.fi#p-17199-introduction-3\"></a>Introduction</h2>\n<p>The infrastructure supporting these systems, primarily composed of validators, node operators, and service providers, faces substantial operational costs and technological hurdles². The formation of the Ethereum Service Providers Business League (ESPBL) under IRS Code 501(c)(6) represents a different approach to addressing these challenges through collective action³.</p>\n<p>We intend to first provide a cost savings measure, then reassess if such a legal entity would provide additional benefit. It is entirely plausible to operate such collective barging without the need of a legal entity, potentially.</p>\n<h2><a name=\"p-17199-methodology-4\" class=\"anchor\" href=\"https://research.lido.fi#p-17199-methodology-4\"></a>Methodology</h2>\n<p>This study employs a mixed-methods approach, combining quantitative analysis of potential cost savings with qualitative assessment of organizational structure and its implications. Data on operational costs were collected from a sample of 20 Ethereum service providers, with projections made for a five-year period assuming a 20% year-over-year growth in membership (re: Node Operator participation). This should be a below estimate in the stated growth metrics for adding Node Operators as we currently understand them today.</p>\n<h2><a name=\"p-17199-results-and-discussion-5\" class=\"anchor\" href=\"https://research.lido.fi#p-17199-results-and-discussion-5\"></a>Results and Discussion</h2>\n<h3><a name=\"p-17199-economic-impact-6\" class=\"anchor\" href=\"https://research.lido.fi#p-17199-economic-impact-6\"></a>Economic Impact</h3>\n<p>Our analysis indicates that the ESPBL could potentially reduce operational costs for its members by 15% through collective negotiation with cloud and bare metal service providers. For an average member spending $12,000 monthly on hosting services, this translates to annual savings of $21,600. Extrapolating to the initial 20 members, the total annual savings for the Ethereum ecosystem could reach $432,000 in the first year, potentially growing to $907,200 by the fifth year with 42 members (Table 1).</p>\n<p>Table 1: Projected Annual Savings</p>\n<div class=\"md-table\">\n<table>\n<thead>\n<tr>\n<th>Year</th>\n<th>Members</th>\n<th>Annual Savings (USD)</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>1</td>\n<td>20</td>\n<td>432,000</td>\n</tr>\n<tr>\n<td>2</td>\n<td>24</td>\n<td>518,400</td>\n</tr>\n<tr>\n<td>3</td>\n<td>29</td>\n<td>626,400</td>\n</tr>\n<tr>\n<td>4</td>\n<td>35</td>\n<td>756,000</td>\n</tr>\n<tr>\n<td>5</td>\n<td>42</td>\n<td>907,200</td>\n</tr>\n</tbody>\n</table>\n</div><h3><a name=\"p-17199-technological-implications-7\" class=\"anchor\" href=\"https://research.lido.fi#p-17199-technological-implications-7\"></a>Technological Implications</h3>\n<p>The formation of the ESPBL may have significant implications for the technological development of the Ethereum network:</p>\n<ol>\n<li>\n<p><strong>Enhanced Network Resilience</strong>: By reducing operational costs, the ESPBL could enable a more diverse set of validators and node operators, potentially increasing the decentralization and resilience of the network⁴.</p>\n</li>\n<li>\n<p><strong>Accelerated Innovation</strong>: Cost savings could be reinvested into research and development, potentially accelerating technological advancements in areas such as scalability and energy efficiency⁵.</p>\n</li>\n<li>\n<p><strong>Security Standardization</strong>: As a unified entity, the ESPBL could play a crucial role in developing and promoting technical standards for Ethereum infrastructure, potentially leading to improved interoperability and efficiency⁶. This cross cuts past just simple Validator service providers and can extend into AVS’s for example.</p>\n</li>\n</ol>\n<h2><a name=\"p-17199-initial-target-ovh-8\" class=\"anchor\" href=\"https://research.lido.fi#p-17199-initial-target-ovh-8\"></a>Initial Target: OVH</h2>\n<p>I spoke with OVH in person, they gave me this to show proof? (This was there idea lol):</p>\n<p></p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://europe1.discourse-cdn.com/business20/uploads/lido/original/2X/b/b7461f587c1a742721c50d7216e44f9478e795da.jpeg\" data-download-href=\"/uploads/short-url/q9jC3ckngnInvm2f1LmWeJ8kmrU.jpeg?dl=1\" title=\"Screenshot 2024-08-23 at 3.32.58 PM\" rel=\"noopener nofollow ugc\"><img src=\"https://europe1.discourse-cdn.com/business20/uploads/lido/optimized/2X/b/b7461f587c1a742721c50d7216e44f9478e795da_2_509x500.jpeg\" alt=\"Screenshot 2024-08-23 at 3.32.58 PM\" data-base62-sha1=\"q9jC3ckngnInvm2f1LmWeJ8kmrU\" width=\"509\" height=\"500\" srcset=\"https://europe1.discourse-cdn.com/business20/uploads/lido/optimized/2X/b/b7461f587c1a742721c50d7216e44f9478e795da_2_509x500.jpeg, https://europe1.discourse-cdn.com/business20/uploads/lido/optimized/2X/b/b7461f587c1a742721c50d7216e44f9478e795da_2_763x750.jpeg 1.5x, https://europe1.discourse-cdn.com/business20/uploads/lido/optimized/2X/b/b7461f587c1a742721c50d7216e44f9478e795da_2_1018x1000.jpeg 2x\" data-dominant-color=\"8D857E\"></a></div><p></p>\n<h2><a name=\"p-17199-tldr-9\" class=\"anchor\" href=\"https://research.lido.fi#p-17199-tldr-9\"></a>TLDR:</h2>\n<p>Lets get cost reductions and ensure SKU inventory and availability for infrastructure providers. OVH is willing to do this, and we can leverage this into getting similar concessions across the board.</p>\n<h3><a name=\"p-17199-references-10\" class=\"anchor\" href=\"https://research.lido.fi#p-17199-references-10\"></a>References</h3>\n<ol>\n<li>\n\n</li>\n<li>Schär, F. (2021). Decentralized Finance: On Blockchain- and Smart Contract-Based Financial Markets. Federal Reserve Bank of St. Louis Review, 103(2), pp. 153-174.</li>\n<li>U.S. Internal Revenue Service. (2021). IRC 501(c)(6) Organizations.</li>\n<li>Sai, A.R., Buckley, J., &amp; Le Gear, A. (2021). Assessing the Security Implication of Bitcoin Exchange Rates. Computers &amp; Security, 107, 102318.</li>\n<li>Sedlmeir, J., Buhl, H.U., Fridgen, G., &amp; Keller, R. (2020). The Energy Consumption of Blockchain Technology: Beyond Myth. Business &amp; Information Systems Engineering, 62, pp. 599–608.</li>\n<li>Zhao, L., Fan, S., &amp; Zheng, B. (2020). Consensus Protocols in the Blockchain Era. Peer-to-Peer Networking and Applications, 13, pp. 2084–2101.</li>\n<li>De Filippi, P., &amp; Wright, A. (2018). Blockchain and the Law: The Rule of Code. Harvard University Press.</li>\n</ol>\n            <p><small>1 post - 1 participant</small></p>\n            <p><a href=\"https://research.lido.fi/t/espbl-collective-bargaining-for-the-lido-alliance/8192\">Read full topic</a></p>","link":"https://research.lido.fi/t/espbl-collective-bargaining-for-the-lido-alliance/8192","pubDate":"Fri, 23 Aug 2024 22:36:07 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"research.lido.fi-topic-8192"},"source":{"@url":"https://research.lido.fi/t/espbl-collective-bargaining-for-the-lido-alliance/8192.rss","#text":"ESPBL: Collective Bargaining for the Lido Alliance"}},{"title":"Proof Group: Delegate Thread","dc:creator":"cnmtennis","category":"Delegate Platform","description":"<p><strong>Delegate information</strong></p>\n<p>Name: Proof Group</p>\n<p>Forum handle: cnmtennis</p>\n<p>Twitter: njess<br>\nTelegram: cnmtennis</p>\n<p><strong>Introduction</strong></p>\n<p>Proof Group is a leading web3 investment fund that has a long history of supporting some of the most promising projects at the earliest stages of their lifecycle such as Aptos, Sui, Thorchain, Lightspark, Farcaster, Ondo, Karak and many others.</p>\n<p>Over the last few years Proof Group has organically grown a sizable infrastructure business- staking much of our own balance sheet and for several friends of our firm. We believe staking will play a crucial role for asset managers in the future and use validators as a way to get closer to the tech for the ecosystems we support and meet really strong builders that we can partner with on our venture business.</p>\n<p>Proof Group has been natively staking Ethereum since the merge and strongly believes in Ethereum’s role in the future of decentralized finance. We recently joined the SSV Testnet <span class=\"hashtag-raw\">#4</span> and are looking forward to becoming a larger voice/ contributor in the Lido ecosystem.</p>\n<p><strong>Motivation, values and decision making</strong></p>\n<p>Why I think our participation in this Lido’s delegate program makes sense:</p>\n<ul>\n<li>Although Proof Group is relatively new to the Lido ecosystem, we are extremely versed in Ethereum staking. Delegators can trust Proof Group as a voice for Ethereum staking because we truly have skin in the game and built our staking business by self-staking all of our own assets as opposed to just receiving delegations from others.</li>\n<li>We can provide a newer voice to the Lido community, especially through the DVT lens. Lido is actively looking to decentralize their operator set and improve their client diversity. Proof Group will be an excellent voice for newer operators and delegators looking to improve decentralization in the Lido set.</li>\n<li>Our engineering team prides ourselves on actively making core protocol contributions. We are actively making PRs to Github of ecosystems we support (IE: m3diumrare-GitHub).</li>\n<li>Governance in web3 can admittedly use a lot of work. Some of our team has a background in TradFi where we have observed how governance in the equity markets works. We have a lot of views on how we can take some of the best of what goes on with proxy voting at large asset managers and vastly improve on it for a web3 audience.</li>\n<li>We truly believe in Ethereum and envision much of the financial rails of the future to be built on it. Lido is the most important player in the Ethereum ecosystem and we feel it is our duty to support governance for the Lido &amp; Ethereum community at the grassroots level.</li>\n</ul>\n<p><strong>Public acceptance</strong></p>\n<p>We accept Lido DAO delegate Сode of Сonduct and Aligned with Lido’s Mission Statement.</p>\n<p><strong>Disclosures</strong></p>\n<p>Proof Group holds liquid assets like Bitcoin, Ethereum, Solana, &amp; other top 50 tokens as part of our investment business. We are also investors in several other Liquid &amp; Re-staking protocols such as Rio Network, Karak, &amp; Stader.</p>\n<p>None of this would affect our role as a delegate on Lido.</p>\n            <p><small>3 posts - 2 participants</small></p>\n            <p><a href=\"https://research.lido.fi/t/proof-group-delegate-thread/8190\">Read full topic</a></p>","link":"https://research.lido.fi/t/proof-group-delegate-thread/8190","pubDate":"Fri, 23 Aug 2024 20:53:06 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"research.lido.fi-topic-8190"},"source":{"@url":"https://research.lido.fi/t/proof-group-delegate-thread/8190.rss","#text":"Proof Group: Delegate Thread"}},{"title":"ProRelGuild Delegate Thread","dc:creator":"Marin","category":"Delegate Platform","description":"<h2><a name=\"p-17192-delegate-information-1\" class=\"anchor\" href=\"https://research.lido.fi#p-17192-delegate-information-1\"></a>Delegate information:</h2>\n<p><strong>Introduction</strong><br>\nProRelGuild consists of four members who are actively contributing to Lido DAO and paving the road to stETH adoption, growth, and industry-wide collaborations. This small but versatile guild is strong in technical and non-technical terms.</p>\n<p><strong>Address</strong><br>\nprorelguild.eth</p>\n<p><strong>Contact Information</strong><br>\nTelegram: <span class=\"mention\">@apegen</span> or <a class=\"mention\" href=\"https://research.lido.fi/u/defiyaco\">@DeFiYaco</a></p>\n<p><strong>Motivation</strong><br>\nGuild already has 930k LDO delegated for Snapshot voting. We’re looking to increase the delegation and start utilizing the new feature of on-chain delegations. Our objectives are driven by Lido first. Everything else comes second approach.</p>\n<p>We strongly believe that for Ethereum to be decentralized, future-proof, and censorship-resistant, Lido middleware must outperform every other solution.</p>\n<p>Given this approach, we’re not afraid to vote “no” to anything that we find non-beneficial for the DAO, staking middleware or related products and integrations.</p>\n<p><strong>Values and Decision-Making Approach</strong><br>\nThe Guild does not seek compensation for participating in this program and encourages delegate diversification by distributing the funds to net new delegates to create a stronger governance process.</p>\n<p>Decisions happen while the guild has its regular syncs. As we want to be innovative in terms of governance approach, the plan is to introduce quarterly delegator calls to brief delegators on the status and discuss all things Lido where you’re free to express uncensored opinions.</p>\n<p><strong>Public Acceptance</strong>:<br>\nProRelGuild accepts Lido DAO delegate Сode of Сonduct (<a href=\"https://ipfs.io/ipfs/QmPwqjn5NiNVFKjxxBnYHivgempeyNNpMNotGYMCXitRd3\">link</a>) and Aligned with <a href=\"https://snapshot.org/#/lido-snapshot.eth/proposal/0x739fbe56425d355b5e41c22bb346b7a8217afd9e84aa49863648b1c641a482e3\">Lido’s Vibe (Purpose, Mission, Vision)</a></p>\n<p><strong>Disclosures</strong>:<br>\nGuild members angel invest, so if there is a vote that would be a conflict of interest, it will be disclosed beforehand, with a specific vote abstination.<br>\nEach individual in the guild owns LDO tokens.</p>\n<p>Voting history: <a href=\"https://snapshot.org/#/profile/0x7A5959855B6508aF1055Af460331fB697dd08e22\">here</a></p>\n            <p><small>1 post - 1 participant</small></p>\n            <p><a href=\"https://research.lido.fi/t/prorelguild-delegate-thread/8186\">Read full topic</a></p>","link":"https://research.lido.fi/t/prorelguild-delegate-thread/8186","pubDate":"Fri, 23 Aug 2024 19:36:00 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"research.lido.fi-topic-8186"},"source":{"@url":"https://research.lido.fi/t/prorelguild-delegate-thread/8186.rss","#text":"ProRelGuild Delegate Thread"}},{"title":"Implementing Governance Calls","dc:creator":"SEEDOrg","category":"General","description":"<p>Hi all!</p>\n<p>As governance is gaining momentum we propose to have Governance calls in order to generate a new meeting point for the community!</p>\n<p>With all the efforts towards fostering and enhancing delegations and the fair amount of proposals coming in it might be of use to have a biweekly/monthly space where initiatives can be presented and debated before jumping into voting. The CLI and Node Operator calls have shown eagerness towards participating in Lido so we’d love to see live governance discussions happening as well!</p>\n<p>This may have been contemplated from the DAO side but considering the workload we are more than happy to host them or find an alternative within the community.</p>\n<p>Feel free to share your thoughts and comments!</p>\n            <p><small>8 posts - 5 participants</small></p>\n            <p><a href=\"https://research.lido.fi/t/implementing-governance-calls/8183\">Read full topic</a></p>","link":"https://research.lido.fi/t/implementing-governance-calls/8183","pubDate":"Fri, 23 Aug 2024 16:03:35 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"research.lido.fi-topic-8183"},"source":{"@url":"https://research.lido.fi/t/implementing-governance-calls/8183.rss","#text":"Implementing Governance Calls"}},{"title":"Simply Staking Delegate Thread","dc:creator":"Damien","category":"Delegate Platform","description":"<h1><a name=\"p-17180-name-1\" class=\"anchor\" href=\"https://research.lido.fi#p-17180-name-1\"></a>Name</h1>\n<p><a href=\"http://simplystaking.com\" rel=\"noopener nofollow ugc\">Simply Staking</a></p>\n<p><strong>Background &amp; Expertise</strong></p>\n<p>We are excited to continue to support the Lido DAO as a Public Delegate and continue to show our expertise when it comes to being an active contributor in the name of good and transparent governance.</p>\n<p>Simply Staking is a blockchain infrastructure provider across 60+ networks, with $1B+ TVL, across various ecosystems. We operate validators on most major ecosystems including the Cosmos Ecosystem, Ethereum, LIDO, EigenLayer, Substrate, Polygon, and many more.</p>\n<p>We also operate node infrastructure on the Chainlink network providing price feeds to Aggregator contracts used by major Ethereum DeFi apps. We offer RPCs and APIs through our NAAS (Node-As-A-Service) offerings which process billions of requests every month.</p>\n<p><strong>Address</strong></p>\n<p>0xCeDF324843775c9E7f695251001531798545614B</p>\n<p><strong>Contact Information</strong></p>\n<ul>\n<li>Twitter: <a href=\"https://x.com/SimplyStaking\" rel=\"noopener nofollow ugc\">Simply Staking</a></li>\n<li>Telegram: <span class=\"mention\">@simplydamien</span> / <a href=\"https://t.me/SimplyVC\" class=\"inline-onebox\" rel=\"noopener nofollow ugc\">Telegram: Contact @SimplyVC</a></li>\n<li>Discord: <a href=\"https://discord.gg/A4SYwnmbRj\" rel=\"noopener nofollow ugc\">Simply Staking Community</a></li>\n</ul>\n<h1><a name=\"p-17180-motivation-2\" class=\"anchor\" href=\"https://research.lido.fi#p-17180-motivation-2\"></a>Motivation</h1>\n<p>Our aspirations are clear. We wish to be at the forefront and become a trusted member of LIDO DAO Governance. In the past, we have taken the role of voting and broadcasting our messages on our socials and written articles.</p>\n<p>In the past, predominantly on other ecosystems such as the Cosmos Hub, we have taken up a very active role in the decentralised Governance of that network. We have, for the past couple of years, voted and created Transparency reports for our delegators to be kept informed on rationale and to ensure alignment between ourselves and them. We have also put forth multiple key proposals that directly affected the network namely:</p>\n<p>Proposal <span class=\"hashtag-raw\">#88</span> - <a href=\"https://www.mintscan.io/cosmos/proposals/88\" rel=\"noopener nofollow ugc\">Increase Community Pool Tax</a><br>\nProposal <span class=\"hashtag-raw\">#687</span> - <a href=\"https://www.mintscan.io/cosmos/proposals/687\" rel=\"noopener nofollow ugc\">Third-Party Audit of Key Code to be deployed on the Cosmos Hub</a><br>\nProposal <span class=\"hashtag-raw\">#826</span> - <a href=\"https://www.mintscan.io/cosmos/proposals/826\" rel=\"noopener nofollow ugc\">Minimum Commission Rate of 5% for Validators</a><br>\nProposal <span class=\"hashtag-raw\">#927</span> - <a href=\"https://www.mintscan.io/cosmos/proposals/927\" rel=\"noopener nofollow ugc\">Hydro Platform 3rd Party Audit</a><br>\nProposal <span class=\"hashtag-raw\">#943</span> - <a href=\"https://www.mintscan.io/cosmos/proposals/927\" rel=\"noopener nofollow ugc\">ICS with Inactive Valset 3rd Party Audit</a></p>\n<p><strong>Please find our previous work on Governance Transparency Reports <a href=\"https://simplystaking.com/reports/\" rel=\"noopener nofollow ugc\">here</a>.</strong></p>\n<p>In addition to this work, we have also been a part of the ATOM Accelerator DAO (AADAO).</p>\n<p>We wish to bring this level of transparency and expertise over to the LIDO DAO.</p>\n<h1><a name=\"p-17180-values-and-decision-making-approach-3\" class=\"anchor\" href=\"https://research.lido.fi#p-17180-values-and-decision-making-approach-3\"></a>Values and Decision-Making Approach</h1>\n<h3><a name=\"p-17180-transparency-at-our-core-4\" class=\"anchor\" href=\"https://research.lido.fi#p-17180-transparency-at-our-core-4\"></a>Transparency at our core</h3>\n<p>We provide commentary on all major proposals for our delegators across other ecosystems. Our role in the DAO as a Delegate will be no different. We thrive off of giving the ecosystem easy to digest reports on complex governance topics.</p>\n<h3><a name=\"p-17180-objective-research-and-decision-making-5\" class=\"anchor\" href=\"https://research.lido.fi#p-17180-objective-research-and-decision-making-5\"></a>Objective research and decision-making</h3>\n<p>When it comes to making a decision we operate mainly in the following fashion. We break down the proposal into pieces to fully understand what the proposal is about, who will it affect, what are its drawbacks and benefits and so on. We then take into consideration the feedback left by the community and/or other key players in the space.</p>\n<p>Our feedback and decisions are based on those factors and more.</p>\n<h1><a name=\"p-17180-public-acceptance-6\" class=\"anchor\" href=\"https://research.lido.fi#p-17180-public-acceptance-6\"></a>Public Acceptance</h1>\n<p>I accept Lido DAO delegate Сode of Сonduct (<a href=\"https://ipfs.io/ipfs/QmPwqjn5NiNVFKjxxBnYHivgempeyNNpMNotGYMCXitRd3\" rel=\"noopener nofollow ugc\">link</a>) and Aligned with <a href=\"https://snapshot.org/#/lido-snapshot.eth/proposal/0x739fbe56425d355b5e41c22bb346b7a8217afd9e84aa49863648b1c641a482e3\" rel=\"noopener nofollow ugc\">Lido’s Vibe (Purpose, Mission, Vision) </a></p>\n<h1><a name=\"p-17180-disclosures-7\" class=\"anchor\" href=\"https://research.lido.fi#p-17180-disclosures-7\"></a>Disclosures</h1>\n<p>Simply Staking is a LIDO stETH Operator, a participant in the DVT Initiative from LIDO, and also participates inside of multiple network’s governance structures. We will always make appropriate disclosures and remove ourselves from voting when necessary.</p>\n            <p><small>2 posts - 1 participant</small></p>\n            <p><a href=\"https://research.lido.fi/t/simply-staking-delegate-thread/8178\">Read full topic</a></p>","link":"https://research.lido.fi/t/simply-staking-delegate-thread/8178","pubDate":"Fri, 23 Aug 2024 12:39:35 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"research.lido.fi-topic-8178"},"source":{"@url":"https://research.lido.fi/t/simply-staking-delegate-thread/8178.rss","#text":"Simply Staking Delegate Thread"}},{"title":"Notjamiedimon Delegate Thread","dc:creator":"notjamiedimon","category":"Delegate Platform","description":"<p><strong>Address</strong>: notjamiedimon.eth<br>\n<strong>Contact information</strong>: notjamiedimon (<a href=\"https://x.com/regentrading\" rel=\"noopener nofollow ugc\">X</a>)</p>\n<h2><a name=\"p-17176-introduction-1\" class=\"anchor\" href=\"https://research.lido.fi#p-17176-introduction-1\"></a>Introduction</h2>\n<p>I have a deep understanding/experience of markets, being a trader by background. I spent time doing portfolio management and trading in both tradfi (macro) and crypto. Also dabbled in business development.</p>\n<h2><a name=\"p-17176-motivation-2\" class=\"anchor\" href=\"https://research.lido.fi#p-17176-motivation-2\"></a>Motivation</h2>\n<p>My objective here are two folds: one for the tokenholders, and another for the DAO. For tokenholders delegating their tokens to me, I strive to provide them with well-informed, biased opinions, and to ensure their voices are heard by the DAO. For Lido DAO, I hope to provide honest feedback relatively free of DAO politics, and to contribute to healthy governance system. My actions will align with the interests of delegators and the broader community, and I hope to be a good bridge and sense-maker between the two.</p>\n<h2><a name=\"p-17176-values-and-decision-making-approach-3\" class=\"anchor\" href=\"https://research.lido.fi#p-17176-values-and-decision-making-approach-3\"></a>Values and Decision-Making Approach</h2>\n<p><strong>Simplicity</strong>: think in first principles. I am a strong believer in first principles thinking, especially in a complex ecosystem like DAO where there are different stakeholders and interests at play.<br>\n<strong>Ownership</strong>: acting with a sense of ownership in Lido. Being an individual delegate, I don’t realistically have the time to be involved as a delegate in other DAOs. The lack of conflict of interest will enable me to act in the best interest of Lido.</p>\n<h2><a name=\"p-17176-public-acceptance-4\" class=\"anchor\" href=\"https://research.lido.fi#p-17176-public-acceptance-4\"></a>Public Acceptance</h2>\n<p>I am fully aligned with Lido’s <a href=\"https://snapshot.org/#/lido-snapshot.eth/proposal/0x739fbe56425d355b5e41c22bb346b7a8217afd9e84aa49863648b1c641a482e3\" rel=\"noopener nofollow ugc\">vibe</a> (purpose, mission, vision), and commit to the <a href=\"https://ipfs.io/ipfs/QmPwqjn5NiNVFKjxxBnYHivgempeyNNpMNotGYMCXitRd3\" rel=\"noopener nofollow ugc\">Delegate Code of Conduct</a>.</p>\n<h2><a name=\"p-17176-disclosures-5\" class=\"anchor\" href=\"https://research.lido.fi#p-17176-disclosures-5\"></a>Disclosures</h2>\n<p>I am not a delegate / contributor to any competing staking projects. I have no conflicts of interests contributing to Lido DAO, but will disclose them should they arise.</p>\n<h2><a name=\"p-17176-waiver-of-responsibility-6\" class=\"anchor\" href=\"https://research.lido.fi#p-17176-waiver-of-responsibility-6\"></a>Waiver of Responsibility</h2>\n<p>By delegating to me, you acknowledge and accept that I will participate on a best-effort basis and will not be liable for any damages related to participation in the Lido Protocol or Lido DAO.</p>\n            <p><small>1 post - 1 participant</small></p>\n            <p><a href=\"https://research.lido.fi/t/notjamiedimon-delegate-thread/8174\">Read full topic</a></p>","link":"https://research.lido.fi/t/notjamiedimon-delegate-thread/8174","pubDate":"Fri, 23 Aug 2024 06:46:06 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"research.lido.fi-topic-8174"},"source":{"@url":"https://research.lido.fi/t/notjamiedimon-delegate-thread/8174.rss","#text":"Notjamiedimon Delegate Thread"}},{"title":"Organize the Lido Alliance Program as a Lido-DAO-Adjacent BORG","dc:creator":"lex-node","category":"Proposals","description":"<h2><a name=\"p-17171-preamble-1\" class=\"anchor\" href=\"https://research.lido.fi#p-17171-preamble-1\"></a>Preamble</h2>\n<p>Title: Organize the Lido Alliance Program as a Lido-DAO-Adjacent BORG</p>\n<p>Author(s): <span class=\"mention\">@lex_node</span> / Gabriel Shapiro (for MetaLeX Pro LLP)</p>\n<h2><a name=\"p-17171-summary-2\" class=\"anchor\" href=\"https://research.lido.fi#p-17171-summary-2\"></a>Summary</h2>\n<ul>\n<li>\n<p>Following the approval of the <a href=\"https://snapshot.org/#/lido-snapshot.eth/proposal/0xd70197783e2a5ce8d32ab2021ee08c21d12fc3e7f7e942b8cdd6aa3f6edb029a\" rel=\"noopener nofollow ugc\">Lido Alliance Proposal</a> in May, Lido DAO contributors have worked with <a href=\"https://www.metalex.tech/\" rel=\"noopener nofollow ugc\">MetaLeX</a> to propose the creation of a LIDO Alliance workstream, including through the incorporation of a Lido-DAO-adjacent cybernetic organization (BORG) to “legally wrap” the “Alliance workgroup” and the related assets and activities.</p>\n</li>\n<li>\n<p>The Lido Alliance BORG Foundation consists of a memberless, beneficiary-less Cayman foundation whose purposes are restricted to furthering the Alliance Program, including submitting or facilitating the proposal of worthwhile Lido DAO Allies to Lido DAO and owning and holding assets contributed by such Lido DAO Allies in onchain multisigs.</p>\n</li>\n<li>\n<p><a href=\"https://github.com/MetaLex-Tech/publicDocs/tree/main/Lido-Alliance-BORG/coreDocs/coreDocs-08-20-24/pdfs\" rel=\"noopener nofollow ugc\">The Bylaws and other legal docs</a> of the Lido Alliance BORG Foundation provide for legal checks-and-balances between the entity and Lido DAO (explained below).</p>\n</li>\n<li>\n<p>To complement the legal check-and-balance mechanisms expressed in the Lido Alliance BORG’s legal documents, the multisigs for holding the Lido Alliance BORG’s operational budget will use <a>EasyTrack</a>, which gives Lido DAO an onchain veto over spending of these assets. The assets contributed by Lido Allies will be subject to legal checks-and-balances with the DAO and held in a transparent 4/7 multisigs staffed by the BORG Personnel. The BORG personnel hope to eventually transition these multisigs to MetaLeX’s forthcoming technology stack to provide a more full-featured set of onchain checks-and-balances mirroring the prescribed legal arrangements.</p>\n</li>\n<li>\n<p>This proposal seeks to inform Lido DAO and the broader Lido community of the details of the Lido Alliance BORG and to obtain a signal of the Lido DAO’s support for the structure through an approval of the proposal. If the proposal is approved, the Lido Alliance BORG will be incorporated as described herein.</p>\n</li>\n</ul>\n<h2><a name=\"p-17171-motivation-3\" class=\"anchor\" href=\"https://research.lido.fi#p-17171-motivation-3\"></a>Motivation</h2>\n<p>The Cybernetic Organization (CybOrg or ‘BORG’) is a new type of web3 legal structure–a traditional legal entity that uses autonomous technologies (such as smart contracts) to augment the entity’s governance and activities. Just as sci-fi cyborgs (‘cybernetic organisms’) augment humans (natural persons) with robotic organs and limbs or microchip or optics implants, BORGs augment state-chartered entities (legal persons) with autonomous software such as smart contracts. Crucially, legal entities that are BORGs do not merely use autonomous technologies as an incidental part of their business–instead, much like a human might have a robotic prosthesis surgically attached to his shoulder, BORGs are legally governed by autonomous technologies through tech-specific rules implanted in their charter documents. DAO-adjacent BORGs, like the proposed Lido Alliance BORG, require that all or most of the BORG’s assets be held in multisig smart contracts empowering the relevant DAO to directly provide feedback to, and exert certain checks and balances against potential misconduct by, the BORG’s human managers.</p>\n<p>The general reasons for using a DAO-adjacent BORG to ‘wrap’ DAO-related multisigs, committees, working groups and similar structures are summarized in Delphi Labs’ seminal article <a href=\"https://delphilabs.medium.com/assimilating-the-borg-a-new-cryptolegal-framework-for-dao-adjacent-entities-569e54a43f83\" rel=\"noopener nofollow ugc\">Assimilating the BORG</a>.</p>\n<p>More specifically, in the case of the Alliance working group:</p>\n<ul>\n<li>\n<p>There may be a need or desire to enter into legal agreements with Lido Allies (or related entities or individuals) in order to express and legally enforce each Lido Ally’s commitments to the Lido community and expectations of support from the Lido community. A legal entity is needed to serve as counterparty to such agreements as Lido DAO cannot enter in agreements itself as it lacks legal personality.</p>\n</li>\n<li>\n<p>The Alliance working group may need to receive or hold tokens or certain rights in future tokens from pre-token Lido Allies—a legal entity may be needed to own/hold such rights.</p>\n</li>\n<li>\n<p>For regulatory reasons, Lido DAO should avoid looking like an on chain ‘venture fund’ or ‘commodities pool’ that holds diversified assets, and thus such assets should be owned by a separate legal entity. (See e.g. <a href=\"https://www.sec.gov/files/litigation/investreport/34-81207.pdf\" rel=\"noopener nofollow ugc\">The SEC DAO Report</a>).</p>\n</li>\n<li>\n<p>If unincorporated, the Alliance working group runs a risk of receiving involuntary legal classifications, which may carry personal liability for the working group members.</p>\n</li>\n<li>\n<p>If unincorporated, the Alliance working group may lack continuity as a result of personnel turnover. A legal entity enables the working group to remain a single cohesive legal person despite personnel changes over time.</p>\n</li>\n<li>\n<p>A legal entity can express all the rules and values that Alliance working group members should exert, and can make these rules and values transparent to Lido DAO.</p>\n</li>\n<li>\n<p>A legal entity can give the Lido community explicit legally facilitated powers to influence the Alliance working group and program in various ways, such as by requiring Lido DAO approval for new Lido Allies and enabling Lido DAO to initiate removal of directors and co-approve new directors.</p>\n</li>\n</ul>\n<p>The formation of the Lido Alliance BORG also serves the approved GOOSE proposals <a href=\"https://research.lido.fi/t/the-guided-open-objective-setting-exercise-goose-proposal-a-genesis-step-to-jump-start-a-dao-wide-goal-setting-exercise-and-cadence/5355\">here</a> and <a href=\"https://research.lido.fi/t/hasus-goose-submission-proposed-goals-for-lido-dao-to-consider/5590\">here</a> as updated with the approved <a href=\"https://research.lido.fi/t/regoose-updated-goals-for-lido-in-the-light-of-mvi-and-restaking/7462\">ReGOOSE proposal</a> goals as follows:</p>\n<ul>\n<li>\n<p>By defining the “Community” served by the BORG broadly, to include not only Lido DAO but also stETH holders and node operators.</p>\n</li>\n<li>\n<p>By emphasizing pro-decentralization/autonomy values in the “Principles” BORG personnel must use for decision-making.</p>\n</li>\n<li>\n<p>By fostering the creation of alliances with other key players in the ETH ecosystem for a broader use of Lido staking systems.</p>\n</li>\n<li>\n<p>By including a “Guardian” role on the BORG multisig that is focused on security.</p>\n</li>\n</ul>\n<h2><a name=\"p-17171-implementation-4\" class=\"anchor\" href=\"https://research.lido.fi#p-17171-implementation-4\"></a>Implementation</h2>\n<ul>\n<li>\n<p>The Lido Alliance BORG is an exempted limited guarantee foundation company incorporated in the Cayman Islands. The BORG does not have any members or beneficiaries, but rather is governed by a relatively change-resistant ruleset embodied in its legal documents (see <a>here</a>) and the associated multisig smart contracts.</p>\n</li>\n<li>\n<p>Cayman foundation companies are a popular choice for DAO wrappers, protocol ‘foundations,’ and other crypto-/DeFi-/web3-related entities. The same features that make such entities useful in those contexts also render them suitable for a DAO-adjacent BORG such as the Lido Alliance Program, i.e.:</p>\n<ul>\n<li>\n<p>Tax-free status within the Cayman Islands;</p>\n</li>\n<li>\n<p>“Memberless” structure so that the entity need not be ‘owned’ by any person(s) and can therefore be operated for non-profit, community-aligned purposes;</p>\n</li>\n<li>\n<p>Limited liability for managers and service providers of the entity (except in the event of fraud, crime, or the knowing and intentional breach of the entity’s rules or applicable laws);</p>\n</li>\n<li>\n<p>Governance customizability capable of accommodating novel smart-contract-based rules and mechanisms; and</p>\n</li>\n<li>\n<p>A jurisdiction with a longstanding commitment to fostering digital asset endeavors and an ecosystem of law firms and other service providers deeply embedded in the crypto ecosystem.</p>\n</li>\n</ul>\n</li>\n<li>\n<p>The Lido Alliance BORG is requesting an initial budget of $125,000 for 2024, as part of the <a href=\"https://research.lido.fi/t/egg-st2024-v2-continuity-grant-funding-to-achieve-goose-goals/\">st2024 v2 EGG </a>request approved in July and is expected to require a yearly budget of $250,000 from 2025 to operate, which will be requested through subsequent EGG requests. The budget includes director fees, local law firm fees, contributor compensation and any other operational expenses, following the <a href=\"https://research.lido.fi/t/ecosystem-grants-grequest-egg-a-budget-request-framework-in-the-service-of-goose/\">EGG budget requests framework</a>.</p>\n</li>\n<li>\n<p>The Board of Directors of the BORG is responsible for running all aspects of the Lido Alliance program and is in charge of the BORG overall. The Directors must sit on all multisigs of the BORG. The initial Directors of the BORG would initially be <a class=\"mention\" href=\"https://research.lido.fi/u/adcv\">@adcv</a> and dsm of <a class=\"mention\" href=\"https://research.lido.fi/u/steakhouse\">@steakhouse</a>. Any future Directors would be approved by Lido DAO and the Board. An individual Director can be removed either by the Board itself or by Lido DAO. An individual Director may also unilaterally resign.</p>\n</li>\n<li>\n<p>The Guardians of the BORG are additional members of the BORG’s multisigs appointed by the Board. They generally should follow the Board’s instructions but may refuse to sign a multisig transaction based on security or compliance considerations. The initial Guardians of the BORG would be shik_happens, mac3w, jenya_k, olga_k, alex_l</p>\n</li>\n<li>\n<p>All Lido Allies must be approved by the Board and Lido DAO, and the BORG would hold all tokens contributed by Lido Allies in the Alliance Multisigs, which will (at minimum) be 4/7 multisigs consisting of the Directors and the Guardians. Lido DAO’s co-approval is required for all usages of the Lido-Ally-contributed tokens as a security measure–this requirement is initially imposed by virtue of the BORG’s Bylaws, and Lido contributors and MetaLeX hope to create additional onchain enforcement of these rules as well, though the technical ability to do so may vary from chain to chain. The addresses and other details of all Alliance Multisigs must be published by the BORG for the Lido community. Operational funds would be held separately at the discretion of the Board and are currently expected to be held in 3/5 multisigs (also using EasyTrack on a quarterly schedule). Mentioned EasyTrack set is requested to be added with a following configuration for the operational multisig:</p>\n</li>\n</ul>\n<ul>\n<li>AllowedTokensRegistry:<a href=\"https://etherscan.io/address/0x4AC40c34f8992bb1e5E856A448792158022551ca\" rel=\"noopener nofollow ugc\"> 0x4AC40c34f8992bb1e5E856A448792158022551ca</a></li>\n<li>TopUpAllowedRecipients: (address TBD)</li>\n<li>AllowedRecipientsRegistry: (address TBD):\n<ul>\n<li>allowedRecipients: 0x606f77BF3dd6Ed9790D9771C7003f269a385D942 (ops MS address);</li>\n<li>limit: 250,000 * 10^18 (i.e. $250K);</li>\n<li>periodDurationMonths: 3</li>\n</ul>\n</li>\n</ul>\n<ul>\n<li>\n<p>The permitted purposes of the BORG are to further the Lido Alliance Program as it was approved by Lido DAO.</p>\n</li>\n<li>\n<p>The BORG Personnel (including the Directors and Guardians) do not owe any direct duties to Lido DAO or Lido community members, but owe duties to the BORG entity, and the BORG entity’s purposes are restricted to fulfilling the Lido Alliance Program, which benefits the Lido DAO and broader Lido community.</p>\n</li>\n<li>\n<p>Alliance Multisig Members have obligations to identify material conflicts of interest and, in certain circumstances, disclose them to the Lido community.</p>\n</li>\n<li>\n<p>Lido DAO approval would be required for any liquidation of the entity or any amendment of the entity’s documents that adversely affect the Lido community or any sub-constituency thereof.</p>\n</li>\n<li>\n<p>The BORG has a ‘supervisor’, which is a statutory role in the Caymans intended to monitor a foundation company’s compliance with the entity’s own rules. The initial supervisor, intended to be temporary, is MetaLeX Pro LLC, the same law firm that led the creation of the BORG in consultation with various Lido contributors. This role is currently un-compensated and MetaLeX has committed to perform the role without additional compensation for up to three months. The final supervisor is expected to be a “Lido OpsBORG” or similar entity, which is currently in ideation phase and will be separately proposed to Lido DAO once various details are finalized.</p>\n</li>\n<li>\n<p>If an “Adverse Event” occurs, Lido DAO may directly appoint an “Emergency Supervisor” for the BORG. “Adverse Event” is defined to include egregious violations of law or the BORG’s own rules by the BORG or BORG Personnel in connection with the BORG’s activities, certain crimes independently committed by BORG Personnel (whether or not related to the BORG’s activities), and sustained deadlocks within the BORG’s governance/decision-making. The Emergency Supervisor would have broad powers under the BORG’s Bylaws and Caymans law, including the power to investigate the Adverse Event, bring lawsuits against BORG personnel in the name of the BORG and to remove and appoint Directors. The Emergency Supervisor role is intended to be temporary and the Emergency Supervisor must resign once the Adverse Event is handled or, in any event, the Emergency Supervisor’s tenure is automatically terminated after 12 months if not renewed by Lido DAO. Lido DAO also has the power to directly set the compensation of Emergency Supervisors.</p>\n</li>\n<li>\n<p>The BORG Personnel are indemnified by the BORG entity, within certain customary limits. This indemnification would be paid solely out of operating funds and not any of the Lido-Ally-contributed assets, unless Lido DAO approves to use additional funds of the BORG to indemnify the BORG personnel who acted on behalf of the BORG.</p>\n</li>\n<li>\n<p>The BORG Personnel would not have personal liability to the BORG for their BORG-related activities except to the extent they engage in gross negligence, willful misconduct, or fraud.</p>\n</li>\n<li>\n<p>The BORG Personnel must satisfy various eligibility criteria including not being subject to sanctions, not having previous egregious criminal convictions, and being reasonably sophisticated regarding blockchain technologies.</p>\n</li>\n</ul>\n<h2><a name=\"p-17171-additional-reading-references-5\" class=\"anchor\" href=\"https://research.lido.fi#p-17171-additional-reading-references-5\"></a>Additional Reading / References</h2>\n<ul>\n<li>\n<p><a href=\"https://github.com/MetaLex-Tech/publicDocs/tree/main/Lido-Alliance-BORG/coreDocs/coreDocs-08-20-24/pdfs\" rel=\"noopener nofollow ugc\">Lido Alliance BORG Bylaws, Memorandum of Association and Articles of Association</a></p>\n</li>\n<li>\n<p><a href=\"https://research.lido.fi/t/lido-alliance-an-ethereum-aligned-ecosystem/7475\">Proposal for Lido Alliance: An Ethereum-Aligned Ecosystem</a></p>\n</li>\n<li>\n<p>Delphi Labs, <a href=\"https://delphilabs.medium.com/assimilating-the-borg-a-new-cryptolegal-framework-for-dao-adjacent-entities-569e54a43f83\" rel=\"noopener nofollow ugc\">Assimilating the BORG</a></p>\n</li>\n<li>\n<p><a href=\"https://metalex.substack.com/p/the-metalex-whitepaper\" rel=\"noopener nofollow ugc\">MetaleX Whitepaper</a></p>\n</li>\n<li>\n<p><a href=\"https://lawcom.gov.uk/project/decentralised-autonomous-organisations-daos\" rel=\"noopener nofollow ugc\">UK Law Commission Scoping Paper on DAOs</a> (covering DAO-adjacent BORGs in substantial detail)</p>\n</li>\n</ul>\n<h2><a name=\"p-17171-voting-discussion-6\" class=\"anchor\" href=\"https://research.lido.fi#p-17171-voting-discussion-6\"></a>Voting &amp; Discussion</h2>\n<p>Note: The Lido Alliance program has already been approved by the Lido DAO. This proposal solely concerns the manner in which the Lido Alliance program is to be carried out.</p>\n<p>The Lido community is invited to weigh in on the proposal. This proposal will be followed by a Snapshot vote with the link published here, when ready.</p>\n<p>By voting YES in the Snapshot vote, you indicate support for funding and operating the Lido Alliance BORG as described herein.</p>\n<p>By voting AGAINST in the Snapshot vote, you indicate you do not support funding and operating the Lido Alliance BORG as described herein.</p>\n            <p><small>24 posts - 15 participants</small></p>\n            <p><a href=\"https://research.lido.fi/t/organize-the-lido-alliance-program-as-a-lido-dao-adjacent-borg/8173\">Read full topic</a></p>","link":"https://research.lido.fi/t/organize-the-lido-alliance-program-as-a-lido-dao-adjacent-borg/8173","pubDate":"Thu, 22 Aug 2024 14:32:12 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"research.lido.fi-topic-8173"},"source":{"@url":"https://research.lido.fi/t/organize-the-lido-alliance-program-as-a-lido-dao-adjacent-borg/8173.rss","#text":"Organize the Lido Alliance Program as a Lido-DAO-Adjacent BORG"}}]}}}