{"rss":{"@version":"2.0","@xmlns:discourse":"http://www.discourse.org/","@xmlns:atom":"http://www.w3.org/2005/Atom","@xmlns:dc":"http://purl.org/dc/elements/1.1/","channel":{"title":"Octant - Latest topics","link":"https://discuss.octant.app/latest","description":"Latest topics","lastBuildDate":"Tue, 23 Jul 2024 23:48:57 +0000","atom:link":{"@href":"https://discuss.octant.app/latest.rss","@rel":"self","@type":"application/rss+xml"},"item":[{"title":"Reflections From The First Community Fund Round","dc:creator":"james","category":"Governance","description":"<h3><a name=\"intro-1\" class=\"anchor\" href=\"https://discuss.octant.app#intro-1\"></a>Intro:</h3>\n<p>Octant has taken upon itself beginning the process of progressively decentralizing aspects of the project.  In due time, if a governance structure can be battle tested and the team is confident, we see the community taking more and more ownership over key aspects of Octant, maybe everything in total minus ownership of staking… But 1 step at a time <img src=\"https://emoji.discourse-cdn.com/twitter/slight_smile.png?v=12\" title=\":slight_smile:\" class=\"emoji\" alt=\":slight_smile:\" loading=\"lazy\" width=\"20\" height=\"20\"></p>\n<p>So we started out with that intention, to design a governance framework that would empower our community to initially govern the recent Community Fund.  What began as a simple experiment to give more power to our community has lead to a lot of learnings for the Octant core team in how we can improve the next version of this moving forward.</p>\n<h3><a name=\"chronology-2\" class=\"anchor\" href=\"https://discuss.octant.app#chronology-2\"></a>Chronology</h3>\n<p>This first started with bringing together the contributors in January, where we had our first call mid February, &amp; with calls taking place every 2 weeks to 1 month.  Organization over the first rounds operation began to formalize in March, with key pieces coming together (roles, Charmverse setup etc) in April.  In May, we opened up applications to the public for 3 key directives (<a href=\"https://app.charmverse.io/octant-community-fund/octant-community-fund-hq-8956739992421918\">Marketing, Tooling, &amp; Public Goods ecosystem collaboration</a>), and in early June the final votes were approved for 11 applicants.  47.99 ETH has been awarded, and all projects are moving forward with their work.</p>\n<h3><a name=\"group-3\" class=\"anchor\" href=\"https://discuss.octant.app#group-3\"></a>Group</h3>\n<p>Before this process began, we had a tremendous amount of support from key allies in the space, and naturally, inviting many of them to join us in the development of this framework made sense.  Their expertise in different areas cannot be understated, which further cemented my feelings in what is the superpower of web3, <em><strong>‘diversity’</strong></em>. One of the problems from managing this, was that we didn’t have a clear idea in what the optimal group size would be.  So the group grew to almost 20 people!  Whenever you have a large group like this, coordination can be quite tricky, so participation within the monthly or bi monthly calls began to fluctuate.  But nevertheless, with a largely committed group. it ended up working out well.</p>\n<h3><a name=\"timing-scope-4\" class=\"anchor\" href=\"https://discuss.octant.app#timing-scope-4\"></a>Timing &amp; Scope</h3>\n<p>I as the core team member putting all of this together, was a bit naive in how long some of these processes can ultimately take.  Taking a step back, it was not the initial intention to have this group of individuals being the driving force behind decision-making over how the first round of funds would be distributed.  Instead, this group was brought together to design a broader community governance framework so that the Octant community (at least at a larger scale than this group) could participate in some capacity in the first round.</p>\n<p>This work takes a while, and definitely not something that you can whip up quickly, without potential problems rearing their faces.  So in March, with the realization that staking rewards coming in and ready to allocate May 1st, we pivoted from the longer term design, to this group being that decision-making body.</p>\n<p>Ultimately, this went as well as it possibly could have.  But that isn’t to say there weren’t some drawbacks.  Naturally, when you bring a group in for a different intention, there are going to be issues with what some of the members had committed to, both in timing, and requirements.  With that in mind, I cannot express my gratitude enough for the flexibility, and the work, that each of these members had contributed.  They made for a very productive first round.</p>\n<h3><a name=\"evolution-moving-forward-5\" class=\"anchor\" href=\"https://discuss.octant.app#evolution-moving-forward-5\"></a>Evolution Moving Forward</h3>\n<p>The easiest way to understand where we are now is that Octant governance is moving on two separate tracks.</p>\n<ul>\n<li>\n<p>We are going to continue running Octant Community Fund rounds, with the next taking place in October/November.  Changes with this upcoming round will include: holding an open process for community members to participate in being on the next council, while getting really clear on expectations for those who participate next round.  Additionally, we’ll be refining what will be the directives of intent for proposals.  Some of that will be based upon early learnings in what was effective from this first round.  Lastly it’s worth noting that the treasury for this next round will be ~2x what it was this first round.</p>\n</li>\n<li>\n<p>Separately, <a href=\"https://www.hatsprotocol.xyz/\">Hats Protocol</a> a recent grantee, will collaborate with key stakeholders and the core team to resume the initial efforts of designing a long-term governance structure for the Octant community. Their work will focus on supporting Octant’s journey towards progressive decentralization.</p>\n</li>\n</ul>\n<p>There is much more I can share about this process, but this may be a good stopping point for now.  I want to emphasize that we are looking interested community members to consider applying to be a part of this upcoming round.  More details will be shared on this soon!</p>\n            <p><small>3 posts - 3 participants</small></p>\n            <p><a href=\"https://discuss.octant.app/t/reflections-from-the-first-community-fund-round/381\">Read full topic</a></p>","link":"https://discuss.octant.app/t/reflections-from-the-first-community-fund-round/381","pubDate":"Tue, 23 Jul 2024 23:48:57 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"discuss.octant.app-topic-381"},"source":{"@url":"https://discuss.octant.app/t/reflections-from-the-first-community-fund-round/381.rss","#text":"Reflections From The First Community Fund Round"}},{"title":"About the Governance category","dc:creator":"james","category":"Governance","description":"<p>Octant is steering this ship towards more community ownership.  This channel is for all governance related discussions.</p>\n            <p><small>1 post - 1 participant</small></p>\n            <p><a href=\"https://discuss.octant.app/t/about-the-governance-category/380\">Read full topic</a></p>","link":"https://discuss.octant.app/t/about-the-governance-category/380","pubDate":"Tue, 23 Jul 2024 22:03:23 +0000","discourse:topicPinned":"Yes","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"discuss.octant.app-topic-380"},"source":{"@url":"https://discuss.octant.app/t/about-the-governance-category/380.rss","#text":"About the Governance category"}},{"title":"Octant Community Fund Grantees - a series of showcasing interviews on LI","dc:creator":"martab","category":"General","description":"<p>Hey! Marta form Octant’s comms here. We’re doing a series of interviews on our LinkedIn showcasing the grantees of the Octant Community Fund. Please let me know if your a Grantee who’d like to be featured!</p>\n            <p><small>3 posts - 2 participants</small></p>\n            <p><a href=\"https://discuss.octant.app/t/octant-community-fund-grantees-a-series-of-showcasing-interviews-on-li/378\">Read full topic</a></p>","link":"https://discuss.octant.app/t/octant-community-fund-grantees-a-series-of-showcasing-interviews-on-li/378","pubDate":"Tue, 23 Jul 2024 13:50:02 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"discuss.octant.app-topic-378"},"source":{"@url":"https://discuss.octant.app/t/octant-community-fund-grantees-a-series-of-showcasing-interviews-on-li/378.rss","#text":"Octant Community Fund Grantees - a series of showcasing interviews on LI"}},{"title":"What's a good enough approach for sybil's in the near future?","dc:creator":"james","category":"General","description":"<p>I spend more time on Farcaster these days, so I find myself a little insulated from Twitter, but jumped in today to find that many were upset about Octant using Gitcoin Passport for our first round of QF.</p>\n<p>I get the frustration:</p>\n<ul>\n<li>We didn’t have clear enough communication around how this unique setup works.</li>\n<li>Many find Gitcoin Passport to be a pain for real users, while still allowing Sybils into the system.</li>\n</ul>\n<p>We obviously want to improve as best as we can.  The reason we moved quicker than we had planned was because our last round experienced full exposure of why a plutocracy doesn’t work from a community members perspective.  Why have a system that wishes to be a platform that aggregates funds based upon user preferences if there are only a few users that actually have influence over the funds?</p>\n<p>I agree.</p>\n<p>So moving to QF, and using Gitcoin Passport was the path forward that we felt was better than remaining a plutocracy.  We did explore a lot of other options. ALOT.  Nothing else seemed to be a better alternative at this stage.  People wouldn’t be happy with getting on a call with BrightID.  People sure as hell wouldn’t be happy scanning their eyeball.  DisruptionJoe made it clear that the FDD option isn’t an option right now…</p>\n<p>So I’m here to listen, because trying to filter through comment after comment on twitter, and the sub threads that get created is really hard to manage.  Got any ideas?  Maybe creating a social graph of trust, along with Passport until we can move to what would work even better?  I’m really curious to hear your thoughts.</p>\n            <p><small>27 posts - 12 participants</small></p>\n            <p><a href=\"https://discuss.octant.app/t/whats-a-good-enough-approach-for-sybils-in-the-near-future/375\">Read full topic</a></p>","link":"https://discuss.octant.app/t/whats-a-good-enough-approach-for-sybils-in-the-near-future/375","pubDate":"Thu, 18 Jul 2024 22:37:34 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"discuss.octant.app-topic-375"},"source":{"@url":"https://discuss.octant.app/t/whats-a-good-enough-approach-for-sybils-in-the-near-future/375.rss","#text":"What's a good enough approach for sybil's in the near future?"}},{"title":"Public Goods FlyWheel","dc:creator":"lanzdingz","category":"Mechanism Design","description":"<p>We recently were one of the selected grantees for Octant’s Community Fund, for our Public Goods FlyWheel growth campaign. We wanted to get our proposal up here in hopes of some cross-pollution and experimentation.</p>\n<p>TLDR;</p>\n<p>We are creating a Public Goods Flywheel, by ensuring that GLM gets into the hands of regenerative and public goods-minded individuals so that more people stake and use Octant.</p>\n<p>A more in depth look:</p>\n<p>Octant is an app that looks to fund various public goods projects using democratic and community led voting systems. Unlike many other projects, Octant has a reliable funding supply, but needs to have a larger public reach, with more engaged GLM holders in order to grow and scale its user base. Our marketing and growth campaign pulls inspiration from Octants self nomination system for projects looking to receive funding via their app, but instead looks to reward high quality individuals interested in supporting public goods.</p>\n<p>In a play on a retro citizens round, people will be able to nominate themselves or nominate others in a series of call to actions that require people to post and engage in the Octant farcaster channel. This will include needing to quote tweet and answer a weekly prompt. These prompts will not only serve as a means of selecting those who will receive GLM,  but these prompts will also help highlight and teach people about Octant works and how to get involved.</p>\n<p>The final weeks prompt is ‘proof of stake’ where participants will stake their GLM in Octant and be entered into a contest to win a larger pool of GLM tokens.</p>\n<p>Our end goal is to create a Public Goods Flywheel, by ensuring that GLM gets into the hands of regenerative and public goods-minded individuals so that more people stake and use Octant.</p>\n<p>If you want to read more about our campaign and read our original proposal you can check it out here - <a href=\"https://app.charmverse.io/octant-community-fund/public-goods-flywheel-9797027594937666\" rel=\"noopener nofollow ugc\">https://app.charmverse.io/octant-community-fund/public-goods-flywheel-9797027594937666</a></p>\n<p>We are looking to launch this at the end of July and have participants staked and able to participate in epoch 5.</p>\n            <p><small>2 posts - 2 participants</small></p>\n            <p><a href=\"https://discuss.octant.app/t/public-goods-flywheel/368\">Read full topic</a></p>","link":"https://discuss.octant.app/t/public-goods-flywheel/368","pubDate":"Wed, 03 Jul 2024 20:27:59 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"discuss.octant.app-topic-368"},"source":{"@url":"https://discuss.octant.app/t/public-goods-flywheel/368.rss","#text":"Public Goods FlyWheel"}},{"title":"Octant Community Growth Strategy","dc:creator":"Abundance","category":"Mechanism Design","description":"<p>I wanted to share some thoughts on what I see as a great potential for Octant’s growth, and get input from the Octant team and broader community on strategy etc.</p>\n<p>What I mean by “growth” is: (1) more people familiar with Octant and its mission (2) more people actively engaged in the Octant community/public goods funding, and (3) more people holding/locking GLM (ie. driving demand for the GLM token).</p>\n<p>My thesis is that the key to driving growth in all these metrics is harnessing the open social graph - in particular the one implemented on <a href=\"https://www.farcaster.xyz/\" rel=\"noopener nofollow ugc\">Farcaster Protocol</a>.</p>\n<p>(Fair disclosure: I have no financial interest in promoting Farcaster. I am however building a public goods project on Farcaster for the same reasons I’m outlining here - because I believe that the open social graph is a key component for creating an effective and self-sustainable public goods funding mechanism - more on that later).</p>\n<p><strong>What is Farcaster?</strong></p>\n<p>Farcaster (FC) is a “sufficiently decentralized” social media protocol (meaning that user posts are censorship resistant but display of the posts is client-dependent). FC currently has about 500,000 registered users (though I estimate the number of “real” accounts is probably around 100K)</p>\n<p><strong>Why Farcaster?</strong></p>\n<p>Octant’s main venue for community engagement right now is through Epochs (and to a lesser extent the nascent community fund). Epochs recur on a quarterly basis. For a short period, projects (and their respective communities) compete for a share of Octant’s ETH staking rewards. This brings some engagement and publicity to Octant but it’s not persistent.</p>\n<p>While Epochs are the core of Octant, I believe that to have sustained growth on all metrics we need to have persistent community engagement - and preferably it should be driven by the community itself rather than top-down - this is where Farcaster comes in.</p>\n<p>FC obviously has a tiny fraction of the users of a platform like Twitter. It does however have a large (and growing) base of the Ethereum community (Vitalik, for example, casts there much more often than on X), and it’s one of the most exciting ecosystems in crypto in my view. I also believe there is a much greater potential to build and grow an active and engaged Octant community there thanks to the open social graph and everything that can be built on it and integrated with Octant.</p>\n<p><strong>What’s the Strategy?</strong></p>\n<p>What I’m proposing here is a very rough outline with a few suggestions just to get a sense of what’s possible. I’d love to have a lot more community/team input on this so we can make it into a more robust plan, and look into what resources Octant would consider dedicating to this (if that is indeed a path that Octant would want to pursue in the first place…) I’m putting it out here because I believe it’s worth pursuing and has a lot of potential. I don’t think it should necessarily be the sole focus of Octant, but I do think it should be a major element in Octant’s overall growth strategy.</p>\n<p><strong>The key elements of the strategy include:</strong></p>\n<ul>\n<li>Growing awareness of Octant on FC through contests, games, and other forms of community engagement.</li>\n<li>Periodic partnerships with other communities on FC (eg Purple, Regen, Greenpill, Lotto, etc.) to both build the Octant brand and fund public goods.</li>\n<li>Harness FC’s tipping economy toward activities that align with Octant’s growth goals and funding public goods more generally</li>\n<li>Use the open social graph to get quantitative (eg. GLM locked by FC user, number of Octant-related casts etc.) and qualitative data (eg. quality of content posted or benefit to community provided) on users which can then be used for Octant’s effort to decentralize its governance (as well for sybil resistance in Epoch voting)</li>\n<li>Set up broad categories of how community members can contribute to Octant’s growth (eg. memes, tooling, data analysis, Frames, etc. etc.) on FC and then periodically reward community members (both through the community tipping those users and through Octant funds) for their contributions. We can then use (shameless plug:) Impact App’s (free) curation tools to get the community itself involved in estimating the effect of the contributions (this is especially useful at scale, when the team will not have the capacity to review many posts, and it’s also a way to promote bottom-up involvement/potential governance for the community). Then measure the efficacy of the campaign and adjust accordingly.</li>\n</ul>\n<p>So these are just some ideas and of course we can brainstorm other ways to harness the open social graph for Octant’s growth (I think there is a lot of potential with Frames, for example).</p>\n<p>This strategy would obviously require both time and funding from Octant. But I think that it is flexible enough that it can be adjusted over time (based on KPIs) for both the time and resources invested in it.</p>\n<p>Thoughts?</p>\n            <p><small>6 posts - 3 participants</small></p>\n            <p><a href=\"https://discuss.octant.app/t/octant-community-growth-strategy/366\">Read full topic</a></p>","link":"https://discuss.octant.app/t/octant-community-growth-strategy/366","pubDate":"Mon, 01 Jul 2024 14:48:21 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"discuss.octant.app-topic-366"},"source":{"@url":"https://discuss.octant.app/t/octant-community-growth-strategy/366.rss","#text":"Octant Community Growth Strategy"}},{"title":"EcoSynthesisX: Impact in real life through Web3 for a Better Future","dc:creator":"paul_burg","category":"General","description":"<p>Empowering Change with Blockchain<br>\nEcoSynthesisX: Impact in real life through Web3 for a Better Future</p>\n<p>At EcoSynthesisX, we are leveraging the latest Web3 and blockchain technology to make a significant impact on public goods funding. Our flagship initiatives include ImpactNFT Collections and the Impact Marketplace, designed to highlight and reward positive contributions through our Impact Onchain Rank system.</p>\n<p><strong>Main Funding Sources:</strong></p>\n<ul>\n<li>Grants funding</li>\n<li>User donations</li>\n</ul>\n<p><strong>Funding Achievements:</strong></p>\n<ul>\n<li>GG19 Climate Solutions QF: $3,200</li>\n<li>Giveth (Giving Season) QF: $1,200</li>\n<li>Meta Pool Asia Pacific QF: $2,700</li>\n<li>EcoSynthesisX Spring QF: $25,000</li>\n<li>Hyper DeSci QF: $400</li>\n<li>Glo Dollar QF: $1,000</li>\n<li>GreenPill Octant QF: $400</li>\n</ul>\n<p><strong>Roadmap (Next 6 Months):</strong></p>\n<ul>\n<li>Release two new ImpactNFT collections</li>\n<li>Launch the first Phangan QF (matching pool prepared)</li>\n<li>Release website v1</li>\n<li>Develop the DeCleanup dynamic NFT</li>\n<li>Begin developing the Impact Marketplace and Impact Onchain Rank system</li>\n</ul>\n<p><strong>Achievements to Date:</strong></p>\n<ul>\n<li>Released the first Impact NFT collection</li>\n<li>Completed the EcoSynthesisX Spring QF</li>\n<li>Active participation in Gitcoin and Giveth QF rounds</li>\n<li>Contributions to HyperDeSci, ReFi DAO Local Node, and other matching pools</li>\n<li>Started work on DeCleanup dynamic NFT</li>\n</ul>\n<p><strong>Future Milestones:</strong></p>\n<ul>\n<li>Release the second and third ImpactNFT collections</li>\n<li>Develop the Impact Marketplace (including ReFi mechanics &amp; other incentive for users)</li>\n<li>Develop the Impact Onchain Rank</li>\n</ul>\n<p><strong>Team:</strong></p>\n<ul>\n<li><strong>Paul</strong> - Founder and CEO, manages grants/donations, design, and tool implementation</li>\n<li><strong>Anastasia</strong> - Co-founder, manages SMM, community, ImpactNFT, and DeCleanUP</li>\n<li><strong>Badre</strong> - Developer</li>\n<li><strong>Mark and Alisa</strong> - Graphic designers</li>\n</ul>\n<p><strong>Social Credibility:</strong></p>\n<ul>\n<li>Successful Impact NFT collection releases</li>\n<li>Active participation and sponsorship in QF rounds</li>\n<li>Strategic partnerships and memberships with notable organizations</li>\n</ul>\n<p><strong>Contact and More Information:</strong></p>\n<ul>\n<li><strong>GitHub:</strong> <a href=\"https://github.com/EcoSynthesisX\" rel=\"noopener nofollow ugc\">EcoSynthesisX GitHub</a></li>\n<li><strong>Discord:</strong> <a href=\"https://discord.gg/vp7ADVg6Ud\" rel=\"noopener nofollow ugc\">EcoSynthesisX Discord</a></li>\n<li><strong>X:</strong> <a href=\"https://twitter.com/EcoSynthesisX\" rel=\"noopener nofollow ugc\">EcoSynthesisX</a></li>\n</ul>\n<p><strong>Why Funding EcoSynthesisX?</strong> EcoSynthesisX is a vibrant web3 IRL startup with a robust team and a clear vision. Our projects aim to create new products, foster collaborations, and drive significant social impact. With your support, we can transform innovative ideas into reality and contribute to a better future.</p>\n            <p><small>5 posts - 3 participants</small></p>\n            <p><a href=\"https://discuss.octant.app/t/ecosynthesisx-impact-in-real-life-through-web3-for-a-better-future/353\">Read full topic</a></p>","link":"https://discuss.octant.app/t/ecosynthesisx-impact-in-real-life-through-web3-for-a-better-future/353","pubDate":"Wed, 12 Jun 2024 07:41:35 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"discuss.octant.app-topic-353"},"source":{"@url":"https://discuss.octant.app/t/ecosynthesisx-impact-in-real-life-through-web3-for-a-better-future/353.rss","#text":"EcoSynthesisX: Impact in real life through Web3 for a Better Future"}},{"title":"Trustful Reputation System","dc:creator":"Zeugh.eth","category":"Public Good Projects Discussion","description":"<p>Trustful is a reputation system made by Blockful</p>\n<p>This is a placeholder to bring everything else in an update this Monday as discussed in the discord submissions DM</p>\n            <p><small>3 posts - 1 participant</small></p>\n            <p><a href=\"https://discuss.octant.app/t/trustful-reputation-system/334\">Read full topic</a></p>","link":"https://discuss.octant.app/t/trustful-reputation-system/334","pubDate":"Fri, 07 Jun 2024 23:02:45 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"discuss.octant.app-topic-334"},"source":{"@url":"https://discuss.octant.app/t/trustful-reputation-system/334.rss","#text":"Trustful Reputation System"}},{"title":"PizzaDAO: Bringing Retail Onchain","dc:creator":"snax","category":"Public Good Projects Discussion","description":"<h1><a name=\"describe-your-project-and-why-you-classify-as-a-public-good-1\" class=\"anchor\" href=\"https://discuss.octant.app#describe-your-project-and-why-you-classify-as-a-public-good-1\"></a>Describe your project and why you classify as a Public Good?</h1>\n<p>PizzaDAO is a global pizza co-op, a pizza party planner, and a pizza faucet for onchain builders. We aim to enable community ownership of commercial real estate and build open source small business software, both of which are fundamental tools to help communities all over the world build wealth and maintain ownership of their neighborhoods.</p>\n<p>We strive to operate as a true DAO, maximizing our surface area for permissionless contribution. We do this with open community calls and chats, a constellation of open edit spreadsheets and documents, and a spirit of improvisational collaboration.</p>\n<h1><a name=\"how-much-have-you-raised-from-each-of-your-funding-sources-and-from-who-2\" class=\"anchor\" href=\"https://discuss.octant.app#how-much-have-you-raised-from-each-of-your-funding-sources-and-from-who-2\"></a>How much have you raised from each of your funding sources and from who?</h1>\n<p>For Global Pizza Party 2024, we raised $69,420 from NounsDAO, $13,370 each from Stand With Crypto and Unlock Protocol, $10,000 from Bitget, $6,942 from PayPal, and $5,000 each from Ledger and Helium Mobile. We raised our initial funding with the sale of our Rare Pizza NFT, bringing in 330 ETH in February 2021.</p>\n<h1><a name=\"share-your-project-roadmap-3\" class=\"anchor\" href=\"https://discuss.octant.app#share-your-project-roadmap-3\"></a>Share your project roadmap:</h1>\n<p>We plan to continue organizing events at major conferences (<a href=\"https://events.pizzadao.xyz\" rel=\"noopener nofollow ugc\">https://events.pizzadao.xyz</a>), throw our 5th Global Pizza Party (<a href=\"https://globalpizza.party\" rel=\"noopener nofollow ugc\">https://globalpizza.party</a>), and fund ongoing pizza support proposals that come before the DAO. Beyond that, the next step for PizzaDAO is to acquire pizzeria real estate in partnership with pizzerias and communities, then build open source products and services for our partners.</p>\n<h1><a name=\"what-milestones-have-you-achieved-4\" class=\"anchor\" href=\"https://discuss.octant.app#what-milestones-have-you-achieved-4\"></a>What milestones have you achieved?</h1>\n<p>We’ve thrown four global pizza parties, most recently bringing together over 10,000 people in 220 cities across more than 80 countries. We’ve organized 20+ celebrated conference events, from the USA to Europe, Latam, and Asia. In total, we’ve purchased and given away nearly $1m of pizza, supporting hundreds of pizzerias and feeding tens of thousands of people.</p>\n<h1><a name=\"tell-us-more-about-milestones-youd-like-to-achieve-5\" class=\"anchor\" href=\"https://discuss.octant.app#tell-us-more-about-milestones-youd-like-to-achieve-5\"></a>Tell us more about milestones you’d like to achieve</h1>\n<p>Within the next year, we’d like to organize the first real estate acquisition within the PizzaDAO ecosystem. We’ll also ship some simple open source projects, starting with a proof of pizza reimbursement tool (basically an onchain version of <a href=\"https://pizzafaucet.xyz\" rel=\"noopener nofollow ugc\">https://pizzafaucet.xyz</a>)</p>\n<p>For Global Pizza Party 2025, we’re targeting 400+ cities (double the 214 we did this year).</p>\n<h1><a name=\"funding-goal-and-budget-6\" class=\"anchor\" href=\"https://discuss.octant.app#funding-goal-and-budget-6\"></a>Funding Goal and Budget:</h1>\n<p>Any amount of funding would help, but $25,000 would be massively supportive for us. That would support 40 weeks of pizza sponsorships at $625 per event.</p>\n<h1><a name=\"tell-us-more-about-your-team-7\" class=\"anchor\" href=\"https://discuss.octant.app#tell-us-more-about-your-team-7\"></a>Tell us more about your team:</h1>\n<p>Snax, founder + Dread Pizza Roberts is a lifetime community organizer and early Bitcoiner</p>\n<p>Matt Wilhelm, lead developer is a full-stack veteran who works on voting software for the US Congress</p>\n<p>Anthony Shafer, lead NFT artist is a Hollywood alum who worked on projects like Harry Potter and the Star Wars prequels</p>\n<p>You can see all the hires we’ve made in our pizza mafia epochs spreadsheet: <a href=\"https://docs.google.com/spreadsheets/d/1wgGZ5ZJNZ0j6qj7af6HQHTljJpbytlEgq3i71rcODvg/edit#gid=16724327\" class=\"inline-onebox\" rel=\"noopener nofollow ugc\">Rare Pizzas Mafia Slice Allocations - Google Sheets</a></p>\n<p>Beyond the core hires, we have a huge community that supports PizzaDAO’s operations all over the world. You can get a sense of how large it is by looking at the <a href=\"https://map.pizzadao.xyz\" rel=\"noopener nofollow ugc\">map</a> or <a href=\"https://parties.pizzadao.xyz\" rel=\"noopener nofollow ugc\">spreadsheet</a> of global pizza parties.</p>\n<h1><a name=\"team-social-accounts-8\" class=\"anchor\" href=\"https://discuss.octant.app#team-social-accounts-8\"></a>Team Social Accounts:</h1>\n<p><a href=\"https://twitter.com/snack_man\" rel=\"noopener nofollow ugc\">@snack_man</a> is the one filling this out, here’s a <a href=\"https://x.com/i/lists/1734986035434598911\" rel=\"noopener nofollow ugc\">twitter list of PizzaDAO members</a>.</p>\n<h1><a name=\"social-credibility-development-progress-awards-notable-github-commits-referrals-9\" class=\"anchor\" href=\"https://discuss.octant.app#social-credibility-development-progress-awards-notable-github-commits-referrals-9\"></a>Social Credibility (development progress, awards, notable GitHub commits, referrals)</h1>\n<p>Ask anyone you know in the onchain ecosystem about PizzaDAO and it’s likely they’ve not only heard of us but eaten pizza at one of our events. You can also check out our <a href=\"https://github.com/PizzaDAO\" rel=\"noopener nofollow ugc\">open source codebase</a>.</p>\n<h1><a name=\"whys-your-project-important-10\" class=\"anchor\" href=\"https://discuss.octant.app#whys-your-project-important-10\"></a>Why’s your project important?</h1>\n<p>We’ve onboarded thousands of people into the onchain ecosystem (many now work for companies or have started their own projects) and some say we’re one of the only functional DAOs.</p>\n<p>How do you define impact for your project? What metrics are you tracking?</p>\n<ul>\n<li>\n<p>attendance</p>\n</li>\n<li>\n<p>cities reached</p>\n</li>\n<li>\n<p>countries reached</p>\n</li>\n<li>\n<p>properties acquired</p>\n</li>\n<li>\n<p>pizzeria ecosystem partners</p>\n</li>\n<li>\n<p>onchain ecosystem relationships</p>\n</li>\n<li>\n<p>supporting small businesses</p>\n</li>\n</ul>\n<h1><a name=\"share-your-project-impact-metrics-and-results-11\" class=\"anchor\" href=\"https://discuss.octant.app#share-your-project-impact-metrics-and-results-11\"></a>Share your project impact metrics and results</h1>\n<p>Most recently, on May 22, 2024, we brought together well over 10,000 attendees in more than 220 cities across over 80 countries in one day. In the lifetime of PizzaDAO, we’ve supported hundreds of independent pizzerias, fed tens of thousands of people, built relationships with a large portion of the onchain ecosystem, and taught thousands about the blockchain in friendly, nonthreatening environments.</p>\n<h1><a name=\"discordtelegram-contact-12\" class=\"anchor\" href=\"https://discuss.octant.app#discordtelegram-contact-12\"></a>Discord/Telegram Contact</h1>\n<p>Telegram: <a href=\"https://t.me/snack_man\" rel=\"noopener nofollow ugc\">@snack_man</a><br>\nDiscord: snax#6922</p>\n<h1><a name=\"project-links-13\" class=\"anchor\" href=\"https://discuss.octant.app#project-links-13\"></a>Project Links</h1>\n<ul>\n<li><a href=\"https://x.com/Pizza_DAO\" rel=\"noopener nofollow ugc\">PizzaDAO Twitter</a></li>\n<li><a href=\"https://discord.gg/pizzamafia\" rel=\"noopener nofollow ugc\">Discord</a></li>\n<li><a href=\"https://globalpizza.party\" rel=\"noopener nofollow ugc\">Global Pizza Party Website</a></li>\n<li><a href=\"https://map.pizzadao.xyz\" rel=\"noopener nofollow ugc\">Global Pizza Party Map</a></li>\n<li><a href=\"https://app.safe.global/balances?safe=eth:0xBA5E28a2D1C8cF67Ac9E0dfc850DC8b7b21A4DE2\" rel=\"noopener nofollow ugc\">Multisig</a></li>\n</ul>\n            <p><small>1 post - 1 participant</small></p>\n            <p><a href=\"https://discuss.octant.app/t/pizzadao-bringing-retail-onchain/333\">Read full topic</a></p>","link":"https://discuss.octant.app/t/pizzadao-bringing-retail-onchain/333","pubDate":"Fri, 07 Jun 2024 22:26:34 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"discuss.octant.app-topic-333"},"source":{"@url":"https://discuss.octant.app/t/pizzadao-bringing-retail-onchain/333.rss","#text":"PizzaDAO: Bringing Retail Onchain"}},{"title":"🏰 BuidlGuidl - Learn, build, and thrive on Ethereum","dc:creator":"pabl0cks","category":"Public Good Projects Discussion","description":"<p></p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://europe1.discourse-cdn.com/standard21/uploads/octant/original/1X/d3770e7b088c9aa795acb336f7881fc834924b66.png\" data-download-href=\"/uploads/short-url/uaHP4Bu96HqV5fwMtYj9n7OFjoi.png?dl=1\" title=\"bg-octant\" rel=\"noopener nofollow ugc\"><img src=\"https://europe1.discourse-cdn.com/standard21/uploads/octant/optimized/1X/d3770e7b088c9aa795acb336f7881fc834924b66_2_690x277.png\" alt=\"bg-octant\" data-base62-sha1=\"uaHP4Bu96HqV5fwMtYj9n7OFjoi\" width=\"690\" height=\"277\" srcset=\"https://europe1.discourse-cdn.com/standard21/uploads/octant/optimized/1X/d3770e7b088c9aa795acb336f7881fc834924b66_2_690x277.png, https://europe1.discourse-cdn.com/standard21/uploads/octant/optimized/1X/d3770e7b088c9aa795acb336f7881fc834924b66_2_1035x415.png 1.5x, https://europe1.discourse-cdn.com/standard21/uploads/octant/original/1X/d3770e7b088c9aa795acb336f7881fc834924b66.png 2x\" data-dominant-color=\"B9BBCD\"></a></div><p></p>\n<h1><a name=\"buidlguidl-1\" class=\"anchor\" href=\"https://discuss.octant.app#buidlguidl-1\"></a><img src=\"https://emoji.discourse-cdn.com/twitter/european_castle.png?v=12\" title=\":european_castle:\" class=\"emoji\" alt=\":european_castle:\" loading=\"lazy\" width=\"20\" height=\"20\"> BuidlGuidl</h1>\n<h2><a name=\"describe-your-project-and-why-you-classify-it-as-a-public-good-2\" class=\"anchor\" href=\"https://discuss.octant.app#describe-your-project-and-why-you-classify-it-as-a-public-good-2\"></a>Describe your project and why you classify it as a Public Good:</h2>\n<p>BuidlGuidl is a curated group of builders creating open source tools and educational content.</p>\n<p>The main focus is developer growth and mentoring. We build tools and educational content to teach the next wave of builders how/what they can build on Ethereum / EVMs.</p>\n<ul>\n<li>\n<p><strong>Tooling</strong>: We built and actively maintain <a href=\"https://scaffoldeth.io/\" rel=\"noopener nofollow ugc\"><img src=\"https://emoji.discourse-cdn.com/twitter/building_construction.png?v=12\" title=\":building_construction:\" class=\"emoji\" alt=\":building_construction:\" loading=\"lazy\" width=\"20\" height=\"20\"> Scaffold-ETH-2</a>, an open-source toolkit which allows for rapid prototyping and full scale dApp development on Ethereum.<br>\nWe have also lots of handy tools (OSS) created with SE-2 by our community, like <a href=\"https://abi.ninja/\" rel=\"noopener nofollow ugc\">Abi.Ninja</a>, <a href=\"https://hackedwalletrecovery.com/\" rel=\"noopener nofollow ugc\">Hacked Wallet Recovery,</a> <a href=\"http://address.vision\" rel=\"noopener nofollow ugc\">address.vision</a> and others.</p>\n</li>\n<li>\n<p><strong>Education</strong>: We provide a free curriculum at <img src=\"https://emoji.discourse-cdn.com/twitter/running_woman.png?v=12\" title=\":running_woman:\" class=\"emoji\" alt=\":running_woman:\" loading=\"lazy\" width=\"20\" height=\"20\"> <a href=\"http://SpeedRunEthereum.com\" rel=\"noopener nofollow ugc\">SpeedRunEthereum.com</a>. A hands on, guided series of challenges to learn how to code and deploy smart contracts all while receiving the assistance of our community. We also conduct monthly batches with developers who have just finished SRE, in which we encourage teamwork and collaboration among them, developing a group project. Also lots of content in youtube, like BG Labs, Web2 to Web3, BG Episodes, among other video series, and IRL talks and workshops in ETH Global, Edcon and other events.</p>\n</li>\n<li>\n<p><strong>Small Grants</strong> We have different funding mechanisms to support high-impact devs, like BuidlGuidl streams, Cohort Streams towards a common objective, Ecosystem impact grants and BG Community Grants.</p>\n</li>\n</ul>\n<h2><a name=\"what-are-your-main-project-funding-sources-3\" class=\"anchor\" href=\"https://discuss.octant.app#what-are-your-main-project-funding-sources-3\"></a>What are your main project funding sources?</h2>\n<p>Grants funding.</p>\n<h2><a name=\"how-much-have-you-raised-from-each-of-your-funding-sources-and-from-who-4\" class=\"anchor\" href=\"https://discuss.octant.app#how-much-have-you-raised-from-each-of-your-funding-sources-and-from-who-4\"></a>How much have you raised from each of your funding sources and from who?</h2>\n<ul>\n<li>\n<p><strong>Ethereum Foundation:</strong> We received ~700ETH from the EF over the last couple of years, which we “passed through” as Small Grants to high impact devs.</p>\n</li>\n<li>\n<p><strong>Optimism RPGF2</strong> (221k OP) and <strong>Optimism RPGF3</strong> (227k OP), which we’re using to fund our Cohorts.</p>\n</li>\n<li>\n<p><strong>Gitcoin Grants <span class=\"hashtag-raw\">#20</span></strong>: 12k USD</p>\n</li>\n</ul>\n<h2><a name=\"are-you-seeking-5\" class=\"anchor\" href=\"https://discuss.octant.app#are-you-seeking-5\"></a>Are you seeking</h2>\n<p>Funding for general operations(a little) and passing through to small grants to high-impact devs.</p>\n<h2><a name=\"has-your-project-launched-or-planning-to-launch-a-token-6\" class=\"anchor\" href=\"https://discuss.octant.app#has-your-project-launched-or-planning-to-launch-a-token-6\"></a>Has your project launched or planning to launch a token?</h2>\n<p>No.</p>\n<h2><a name=\"what-milestones-have-you-achieved-7\" class=\"anchor\" href=\"https://discuss.octant.app#what-milestones-have-you-achieved-7\"></a>What milestones have you achieved?</h2>\n<p><strong>Education</strong></p>\n<ul>\n<li>SpeedRunEthereum challenges are up to date with Scaffold-ETH-2 recent features.</li>\n<li>3500 Builders passed at least 1 SRE Challenge</li>\n<li>1100 Builders passed SpeedRunEthereum and joined BuidlGuidl community</li>\n<li>1131 Builds created by BG members</li>\n<li>6 monthly batches</li>\n<li>We just launched <a href=\"https://www.youtube.com/@BuidlGuidl\" rel=\"noopener nofollow ugc\">BuidlGuidl youtube channel</a> with a new Bow Tie Friday format and new BG Episodes video series. Previous youtube material was in <a href=\"https://www.youtube.com/@austingriffith3550\" rel=\"noopener nofollow ugc\">Austin Griffith channel</a></li>\n</ul>\n<p><strong>Tooling</strong></p>\n<ul>\n<li>Scaffold ETH-2 reached 1000 stars and 657 forks on Github.\n<ul>\n<li>(predecessor to Scaffold-ETH with 9000 stars and 3500 forks)</li>\n</ul>\n</li>\n<li>SE-2 recent features:\n<ul>\n<li>App Router and Next 14 migration</li>\n<li>CLI tool (beta)</li>\n<li>Wagmi v2</li>\n<li><a href=\"https://www.npmjs.com/package/burner-connector\" rel=\"noopener nofollow ugc\">Burner-connector package</a></li>\n</ul>\n</li>\n<li><a href=\"http://Abi.ninja\" rel=\"noopener nofollow ugc\">Abi.ninja</a>  recent features:\n<ul>\n<li>Added proxy contract support</li>\n<li>Added Heimdall rs for unverified contracts</li>\n<li>Dark mode</li>\n</ul>\n</li>\n</ul>\n<p><strong>Small Grants</strong></p>\n<ul>\n<li>773 ETH Streamed with BG Streams &amp;&amp; grants</li>\n<li>13 cohorts with 87 hackers, and 219 ETH streamed to them.</li>\n<li>We just launched <a href=\"https://grants.buidlguidl.com/\" rel=\"noopener nofollow ugc\">https://grants.buidlguidl.com/</a>\n<ul>\n<li>33 BG Community Grants (19 completed and 14 active)</li>\n<li>135 ETH to Ecosystem Grants</li>\n</ul>\n</li>\n</ul>\n<h2><a name=\"share-your-project-impact-metrics-and-results-8\" class=\"anchor\" href=\"https://discuss.octant.app#share-your-project-impact-metrics-and-results-8\"></a>Share your project impact metrics and results</h2>\n<p><strong>Education</strong></p>\n<ul>\n<li>3500 Builders passed at least 1 SRE Challenge</li>\n<li>1100 Builders passed SpeedRunEthereum and joined BuidlGuidl community</li>\n<li>1131 Builds created by BG members</li>\n<li>6 monthly batches completed</li>\n<li>18K subscribers in Youtube</li>\n<li>4.6k monthly visitors to SpeedRunEthereum website.</li>\n</ul>\n<p><strong>Tooling</strong></p>\n<ul>\n<li>Scaffold ETH-2 reached 1000 stars and 657 forks on Github.\n<ul>\n<li>(predecessor to Scaffold-ETH with 9000 stars and 3500 forks)</li>\n</ul>\n</li>\n<li><a href=\"http://buidlguidl.com\" rel=\"noopener nofollow ugc\">buidlguidl.com</a>: 1.5k unique visitors last month</li>\n<li><a href=\"http://app.buidlguidl.com\" rel=\"noopener nofollow ugc\">app.buidlguidl.com</a>: 1.2k unique visitors last month</li>\n<li><a href=\"http://scaffoldeth.io\" rel=\"noopener nofollow ugc\">scaffoldeth.io</a>: 2.3k unique visitors last month</li>\n<li><a href=\"http://docs.scaffoldeth.io\" rel=\"noopener nofollow ugc\">docs.scaffoldeth.io</a>: 1.6k unique visitors last month</li>\n<li><a href=\"https://abi.ninja/\" rel=\"noopener nofollow ugc\">abi.ninja</a>: 1.8k unique visitors last month</li>\n<li><a href=\"https://address.vision/\" rel=\"noopener nofollow ugc\">address.vision</a>: 120 unique visitors last month</li>\n<li><a href=\"http://hackedwalletrecovery.com\" rel=\"noopener nofollow ugc\">hackedwalletrecovery.com</a>: 200 unique visitors last month</li>\n<li><a href=\"http://punkwallet.io\" rel=\"noopener nofollow ugc\">punkwallet.io</a>: 625 unique visitors last month</li>\n<li><a href=\"https://nifty.ink/explore\" rel=\"noopener nofollow ugc\">nifty.ink</a>: 1k unique visitors last month</li>\n<li><a href=\"http://signator.io\" rel=\"noopener nofollow ugc\">signator.io</a>: 400 unique visitors last month</li>\n</ul>\n<p><strong>Small Grants</strong></p>\n<ul>\n<li>773 ETH Streamed with BG Streams &amp;&amp; grants</li>\n<li>13 cohorts with 87 hackers, and 219 ETH streamed to them.</li>\n<li>33 BG Community Grants (19 completed and 14 active)</li>\n<li>135 ETH to Ecosystem Grants</li>\n</ul>\n<h2><a name=\"share-your-project-roadmap-tell-us-more-about-milestones-youd-like-to-achieve-9\" class=\"anchor\" href=\"https://discuss.octant.app#share-your-project-roadmap-tell-us-more-about-milestones-youd-like-to-achieve-9\"></a>Share your project roadmap, tell us more about milestones you’d like to achieve</h2>\n<p><strong>Tooling</strong></p>\n<ul>\n<li>Scaffold-ETH 2 next milestones\n<ul>\n<li>Move CLI to a separate repo (instead of a SE-2 branch), and rebuild it as a “Toolkit creator”</li>\n<li>Introduce first curated package to new CLI ⇒ The Graph</li>\n<li>Allow third party extensions in our CLI, announcing the standard they must follow to work</li>\n<li>Set Foundry as default blockchain development framework in Scaffold-ETH 2.</li>\n<li>Create our own external extension to use it as showcase example for other devs to develop their own extensions SE-2 CLI - compatible</li>\n<li>Add automated testing</li>\n</ul>\n</li>\n<li>Other tooling\n<ul>\n<li>Keep improving our current tools to increase the impact and usage</li>\n<li>Support the creation of new tools from BuildGuidl community members</li>\n</ul>\n</li>\n</ul>\n<p><strong>Education</strong></p>\n<ul>\n<li>More medium-to-hard curriculum. Create new challenges focused on specific areas of the web3 tech tree</li>\n<li>Add more tasks to our monthly batches</li>\n<li>Keep creating content for BG Episodes and keep polishing the new format of Bow Tie Friday</li>\n<li>Increase the number of devs who go through SpeedRunEthereum and Batches each month</li>\n</ul>\n<p><strong>Small Grants</strong></p>\n<ul>\n<li>Give more small grants with <a href=\"https://grants.buidlguidl.com/\" rel=\"noopener nofollow ugc\">https://grants.buidlguidl.com/</a> and polish the grant loop process.</li>\n<li>Shift from generalist BG Streams to Cohort Streams to be more objective-oriented to increase the impact from dev efforts.</li>\n</ul>\n<h2><a name=\"funding-goal-and-budget-10\" class=\"anchor\" href=\"https://discuss.octant.app#funding-goal-and-budget-10\"></a>Funding Goal and Budget</h2>\n<p>The goal of the funding is:</p>\n<ul>\n<li>Give more small grants.</li>\n<li>Dev streams (BG + Cohorts).</li>\n<li>Talks, workshops, Youtube content and newsletter.</li>\n</ul>\n<h2><a name=\"tell-us-more-about-your-team-11\" class=\"anchor\" href=\"https://discuss.octant.app#tell-us-more-about-your-team-11\"></a>Tell us more about your team</h2>\n<p>Sometimes when a builder comes through our system they want to stick around and help out.<br>\nWe have a handful of devs, designers, etc that are working to help Buidlguidl have the most impact in the Ethereum ecosystem.</p>\n<h2><a name=\"whys-your-project-important-12\" class=\"anchor\" href=\"https://discuss.octant.app#whys-your-project-important-12\"></a>Why’s your project important?</h2>\n<p>We help developers at multiple stages through their dev journey. At first we give you all the a-ha moments in a condensed curriculum. Then, we give you the tools and mentoring to ship dapps. Finally, we provide small grants to keep you shipping and contributing to Ethereum.</p>\n<h2><a name=\"whats-your-projects-twitter-handle-13\" class=\"anchor\" href=\"https://discuss.octant.app#whats-your-projects-twitter-handle-13\"></a>What’s your project’s Twitter handle?</h2>\n<p><a href=\"https://twitter.com/buidlguidl\" class=\"onebox\" target=\"_blank\" rel=\"noopener nofollow ugc\">https://twitter.com/buidlguidl</a></p>\n<h2><a name=\"github-link-14\" class=\"anchor\" href=\"https://discuss.octant.app#github-link-14\"></a>GitHub Link</h2>\n<ul>\n<li><a href=\"https://github.com/BuidlGuidl\" class=\"inline-onebox\" rel=\"noopener nofollow ugc\">BuidlGuidl · GitHub</a></li>\n<li><a href=\"https://github.com/scaffold-eth\" class=\"inline-onebox\" rel=\"noopener nofollow ugc\">scaffold-eth · GitHub</a></li>\n</ul>\n<h2><a name=\"project-website-15\" class=\"anchor\" href=\"https://discuss.octant.app#project-website-15\"></a>Project Website:</h2>\n<aside class=\"onebox allowlistedgeneric\" data-onebox-src=\"https://buidlguidl.com/\">\n  <header class=\"source\">\n      <img src=\"https://europe1.discourse-cdn.com/standard21/uploads/octant/original/1X/2336857d4752b4231ecabe7d64ff3a69e933c8a8.png\" class=\"site-icon\" data-dominant-color=\"182232\" width=\"32\" height=\"32\">\n\n      <a href=\"https://buidlguidl.com/\" target=\"_blank\" rel=\"noopener nofollow ugc\">buidlguidl.com</a>\n  </header>\n\n  <article class=\"onebox-body\">\n    <div class=\"aspect-image\" style=\"--aspect-ratio:690/448;\"><img src=\"https://europe1.discourse-cdn.com/standard21/uploads/octant/optimized/1X/882db66f6b421456a524ab866a4a7a1560abc745_2_690x448.png\" class=\"thumbnail\" data-dominant-color=\"C5CACA\" width=\"690\" height=\"448\"></div>\n\n<h3><a href=\"https://buidlguidl.com/\" target=\"_blank\" rel=\"noopener nofollow ugc\">BuidlGuidl</a></h3>\n\n  <p>A curated group of Ethereum builders creating products, prototypes, and tutorials to enrich the web3 ecosystem.</p>\n\n\n  </article>\n\n  <div class=\"onebox-metadata\">\n    \n    \n  </div>\n\n  <div style=\"clear: both\"></div>\n</aside>\n\n<h2><a name=\"team-social-accounts-16\" class=\"anchor\" href=\"https://discuss.octant.app#team-social-accounts-16\"></a>Team Social Accounts</h2>\n<ul>\n<li><a href=\"https://twitter.com/austingriffith\" class=\"inline-onebox\" rel=\"noopener nofollow ugc\">x.com</a></li>\n<li><a href=\"https://warpcast.com/austingriffith\" class=\"inline-onebox\" rel=\"noopener nofollow ugc\">Warpcast</a></li>\n<li><a href=\"https://twitter.com/_carletex_\" class=\"inline-onebox\" rel=\"noopener nofollow ugc\">x.com</a></li>\n<li><a href=\"https://twitter.com/damianmarti\" class=\"inline-onebox\" rel=\"noopener nofollow ugc\">x.com</a></li>\n<li><a href=\"https://twitter.com/Pabl0cks\" class=\"inline-onebox\" rel=\"noopener nofollow ugc\">x.com</a></li>\n<li><a href=\"https://twitter.com/0xrinat\" class=\"inline-onebox\" rel=\"noopener nofollow ugc\">x.com</a></li>\n<li><a href=\"https://twitter.com/ShivBhonde\" class=\"inline-onebox\" rel=\"noopener nofollow ugc\">x.com</a></li>\n<li><a href=\"https://x.com/edatweets_\" class=\"inline-onebox\" rel=\"noopener nofollow ugc\">x.com</a></li>\n<li><a href=\"https://x.com/escottalexander\" class=\"inline-onebox\" rel=\"noopener nofollow ugc\">x.com</a></li>\n<li><a href=\"https://x.com/ZakAgain\" class=\"inline-onebox\" rel=\"noopener nofollow ugc\">x.com</a></li>\n<li><a href=\"https://x.com/port_dev\" class=\"inline-onebox\" rel=\"noopener nofollow ugc\">x.com</a></li>\n</ul>\n<h2><a name=\"discord-contact-17\" class=\"anchor\" href=\"https://discuss.octant.app#discord-contact-17\"></a>Discord Contact</h2>\n<p>pabl0cks</p>\n<h2><a name=\"telegram-contact-18\" class=\"anchor\" href=\"https://discuss.octant.app#telegram-contact-18\"></a>Telegram Contact</h2>\n<aside class=\"onebox allowlistedgeneric\" data-onebox-src=\"https://t.me/austingriffith\">\n  <header class=\"source\">\n      <img src=\"https://telegram.org/img/website_icon.svg?4\" class=\"site-icon\" width=\"16\" height=\"16\">\n\n      <a href=\"https://t.me/austingriffith\" target=\"_blank\" rel=\"noopener nofollow ugc\">Telegram</a>\n  </header>\n\n  <article class=\"onebox-body\">\n    <img width=\"320\" height=\"320\" src=\"https://europe1.discourse-cdn.com/standard21/uploads/octant/original/1X/c94e10f5d4ec9c3104c5e9c5f6d0470bdfcca326.jpeg\" class=\"thumbnail onebox-avatar\" data-dominant-color=\"483E38\">\n\n<h3><a href=\"https://t.me/austingriffith\" target=\"_blank\" rel=\"noopener nofollow ugc\">Austin Griffith</a></h3>\n\n  <p>You can contact @austingriffith right away.</p>\n\n\n  </article>\n\n  <div class=\"onebox-metadata\">\n    \n    \n  </div>\n\n  <div style=\"clear: both\"></div>\n</aside>\n\n<h2><a name=\"wallet-address-19\" class=\"anchor\" href=\"https://discuss.octant.app#wallet-address-19\"></a>Wallet Address</h2>\n<p>0x00080706a7D99CBC163D52dcF435205B1aD940D1<br>\n(safe.buidlguidl.eth on all EVM networks)</p>\n<h2><a name=\"anything-else-youd-like-us-to-know-20\" class=\"anchor\" href=\"https://discuss.octant.app#anything-else-youd-like-us-to-know-20\"></a>Anything else you’d like us to know?</h2>\n<p>We love ethereum and we strive to be a public good; helping developers learn, build, and thrive.</p>\n<h2><a name=\"what-can-the-octant-team-help-you-with-21\" class=\"anchor\" href=\"https://discuss.octant.app#what-can-the-octant-team-help-you-with-21\"></a>What can the Octant team help you with?</h2>\n<p>Offering guidance through the Epoch and keeping us in the loop of feedback.</p>\n<h2><a name=\"how-do-you-define-impact-for-your-project-what-metrics-are-you-tracking-22\" class=\"anchor\" href=\"https://discuss.octant.app#how-do-you-define-impact-for-your-project-what-metrics-are-you-tracking-22\"></a>How do you define impact for your project? What metrics are you tracking?</h2>\n<ul>\n<li><strong>Tooling impact</strong>\n<ul>\n<li>Number of stars, forks, npm downloads of Scaffold-ETH 2</li>\n<li>Usage of the tools/products created with SE-2</li>\n</ul>\n</li>\n<li><strong>Education impact</strong>\n<ul>\n<li>Builders completing SpeedRunEthereum</li>\n<li>Builds/Prototypes created by builders</li>\n<li>Number of views of our educational content</li>\n</ul>\n</li>\n<li><strong>Small Grants</strong>\n<ul>\n<li>ETH streamed to ecosystem builders</li>\n<li>ETH streamed to cohorts</li>\n<li>Number of Small grants and amount granted</li>\n<li>Dapps built by devs educated with SRE that eventually get users</li>\n</ul>\n</li>\n</ul>\n<h2><a name=\"share-your-project-impact-metrics-and-results-23\" class=\"anchor\" href=\"https://discuss.octant.app#share-your-project-impact-metrics-and-results-23\"></a>Share your project impact metrics and results</h2>\n<p><strong>Impact Link 1:</strong> <a href=\"https://github.com/scaffold-eth/scaffold-eth-2\" class=\"inline-onebox\" rel=\"noopener nofollow ugc\">GitHub - scaffold-eth/scaffold-eth-2: Open source forkable Ethereum dev stack</a></p>\n<p><strong>Impact Link 2:</strong> <a href=\"https://plausible.io/share/speedrunethereum.com?auth=ahsrWg2wE0Stur6ggwo2E\" class=\"inline-onebox\" rel=\"noopener nofollow ugc\">Plausible · speedrunethereum.com</a></p>\n<p><strong>Impact Link 3:</strong> <a href=\"https://buidlguidl.com/\" rel=\"noopener nofollow ugc\">https://buidlguidl.com/</a></p>\n<p><strong>Impact Link 4:</strong> <a href=\"https://grants.buidlguidl.com/\" rel=\"noopener nofollow ugc\">https://grants.buidlguidl.com/</a></p>\n<p><strong>Impact Link 5:</strong> <a href=\"https://www.youtube.com/@austingriffith3550\" rel=\"noopener nofollow ugc\">https://www.youtube.com/@austingriffith3550</a></p>\n<p><strong>Impact Link 6:</strong> <a href=\"https://www.youtube.com/@BuidlGuidl\" rel=\"noopener nofollow ugc\">https://www.youtube.com/@BuidlGuidl</a></p>\n<h2><a name=\"i-confirm-that-my-project-hasis-24\" class=\"anchor\" href=\"https://discuss.octant.app#i-confirm-that-my-project-hasis-24\"></a>I confirm that my project has/is:</h2>\n<ul>\n<li><span class=\"chcklst-box checked fa fa-check-square-o fa-fw\"></span> Commitment to open-source technology and sharing results publicly</li>\n<li><span class=\"chcklst-box checked fa fa-check-square-o fa-fw\"></span> Determined to provide transparency about how exactly funding will be used</li>\n<li><span class=\"chcklst-box checked fa fa-check-square-o fa-fw\"></span> Advancing values of freedom and privacy (no surveillance and handling of personal data)</li>\n<li><span class=\"chcklst-box checked fa fa-check-square-o fa-fw\"></span> Supporting decentralization in various fields (for example, building a Web3 related project)</li>\n<li><span class=\"chcklst-box checked fa fa-check-square-o fa-fw\"></span> Social proof, being recognizable in the area the project is being developed in</li>\n</ul>\n<h2><a name=\"i-confirm-that-my-project-is-not-a-25\" class=\"anchor\" href=\"https://discuss.octant.app#i-confirm-that-my-project-is-not-a-25\"></a>I confirm that my project is not a:</h2>\n<ul>\n<li><span class=\"chcklst-box checked fa fa-check-square-o fa-fw\"></span> For profit project</li>\n<li><span class=\"chcklst-box checked fa fa-check-square-o fa-fw\"></span> Financial (lending, investing, trading) product</li>\n</ul>\n<h2><a name=\"by-checking-this-box-you-confirm-that-you-have-read-and-understood-our-octant-privacy-policyhttpsdocsoctantappterms-of-usehtml_11-data-privacy-policy-and-agree-to-its-terms-26\" class=\"anchor\" href=\"https://discuss.octant.app#by-checking-this-box-you-confirm-that-you-have-read-and-understood-our-octant-privacy-policyhttpsdocsoctantappterms-of-usehtml_11-data-privacy-policy-and-agree-to-its-terms-26\"></a>By checking this box, you confirm that you have read and understood our <a href=\"https://docs.octant.app/terms-of-use.html#_11-data-privacy-policy\" rel=\"noopener nofollow ugc\">Octant privacy policy</a> and agree to its terms</h2>\n<ul>\n<li>\n<p><span class=\"chcklst-box checked fa fa-check-square-o fa-fw\"></span> I hereby certify that the information provided in this application is true, complete, and accurate to the best of my knowledge and belief, and I understand that any false statements or omissions may result in the denial of proceeding in the project’s Octant funding application.</p>\n</li>\n<li>\n<p><span class=\"chcklst-box checked fa fa-check-square-o fa-fw\"></span> I give the Octant team permission to reach out and get in touch using the contact information provided.</p>\n</li>\n</ul>\n            <p><small>1 post - 1 participant</small></p>\n            <p><a href=\"https://discuss.octant.app/t/buidlguidl-learn-build-and-thrive-on-ethereum/329\">Read full topic</a></p>","link":"https://discuss.octant.app/t/buidlguidl-learn-build-and-thrive-on-ethereum/329","pubDate":"Thu, 06 Jun 2024 21:15:07 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"discuss.octant.app-topic-329"},"source":{"@url":"https://discuss.octant.app/t/buidlguidl-learn-build-and-thrive-on-ethereum/329.rss","#text":"🏰 BuidlGuidl - Learn, build, and thrive on Ethereum"}},{"title":"Vyper: Pythonic Smart Contract Language for the EVM","dc:creator":"benny","category":"Public Good Projects Discussion","description":"<p><strong>Describe your project and why you classify it as a Public Good</strong></p>\n<p>Vyper is a contract-oriented, pythonic programming language that targets the Ethereum Virtual Machine (EVM). There are over 5000 Vyper contracts deployed across a dozen chains, securing over $2 billion of value. Vyper is free, open-source under a permissive license and usable on all EVM-compatible chains.</p>\n<p><strong>What are your main project funding sources?</strong></p>\n<ul>\n<li>Grants funding and user donations</li>\n</ul>\n<p><strong>How much have you raised from each of your funding sources and from who?</strong></p>\n<ul>\n<li>Optimism RetroPGF Grant 3, 2024 : 250,000 $OP (~$1m at the time of award)</li>\n<li>Optimism RetroPGF Grant 2, 2023 : 135,200 $OP (~$250k at the time of award)</li>\n<li>LIDO Grant, 2022: $100k paid in $LIDO</li>\n<li>Curve veFunder Grant, 2022-Present: 323,926 $CRV (~$400k)</li>\n<li>GitCoin grants, multiple rounds since 2020</li>\n</ul>\n<p><strong>Are you seeking:</strong></p>\n<ul>\n<li>Funding for general operations</li>\n</ul>\n<p><strong>Has your project launched or planning to launch a token?</strong></p>\n<ul>\n<li>No</li>\n</ul>\n<p><strong>Share your project roadmap:</strong></p>\n<ul>\n<li>Officially release the major 0.4.0 update that will include modules, a new import system, a new IR and many other features to improve developer experience.</li>\n<li>Further develop the Vyper intermediary language (Venom) to give developers ever more optimized bytecode and reduce contracts’ gas usage.</li>\n<li>Continue to strengthen the security of the language through close collaboration with auditors, bug bounty programs, auditing competitions and providing better Vyper support to security tools such Slither or Echidna.</li>\n<li>Improve developer UX through tools such as titanoboa (<a href=\"https://github.com/vyperlang/titanoboa\" class=\"inline-onebox\" rel=\"noopener nofollow ugc\">GitHub - vyperlang/titanoboa: a vyper interpreter</a>) or the Vyper Jupyter Lab environment (<a href=\"https://try.vyperlang.org/\" rel=\"noopener nofollow ugc\">https://try.vyperlang.org/</a>) to facilitate thorough testing and quick prototyping</li>\n<li>Promote Vyper adoption and onboard new developers by participating in major blockchain conferences, organizing workshops, outreach programs and producing more educational resources.</li>\n</ul>\n<p><strong>What milestones have you achieved?</strong></p>\n<ul>\n<li>Vyper is now the second most widely used smart contract programming language.</li>\n<li>The tooling developed by the team around Vyper has constantly improved, with projects like titanoboa now offering fuzzing, code coverage and gas profiling with faster execution speed than Foundry.</li>\n<li>Optimizations to the Vyper compiler consistently reduce gas costs and produce binaries that are on average 50% smaller compared to Solidity.</li>\n<li>Following the discovery of a vulnerability in 2023, the team organized bug bounty programs, security competitions and worked with auditors to thoroughly review the codebase.</li>\n</ul>\n<p><strong>Tell us more about milestones you’d like to achieve</strong></p>\n<ul>\n<li>The official release of the 0.4.0 version of Vyper will be a major milestone for the language, offering more modularity, security and efficiency to users.</li>\n<li>We hope to significantly increase the number of developers and protocols adopting Vyper and eventually make it the go-to smart contract programming language on the EVM.</li>\n</ul>\n<p><strong>Funding Goal and Budget:</strong><br>\nWe are looking to raise $3 millions USD across all our funding sources, including $1 million from Octant at $250k per round</p>\n<p><strong>Tell us more about your team:</strong></p>\n<p>Lead Developer: Charles Cooper (<a href=\"https://github.com/charles-cooper\" class=\"inline-onebox\" rel=\"noopener nofollow ugc\">charles-cooper (Charles Cooper) · GitHub</a>)<br>\nContributors: fubuloubu (yearn, ApeWorX, <a href=\"https://github.com/fubuloubu\" class=\"inline-onebox\" rel=\"noopener nofollow ugc\">fubuloubu (El De-dog-lo) · GitHub</a>), tserg (<a href=\"https://github.com/tserg\" class=\"inline-onebox\" rel=\"noopener nofollow ugc\">tserg · GitHub</a>), Harry Kalogirou (<a href=\"https://github.com/harkal\" class=\"inline-onebox\" rel=\"noopener nofollow ugc\">harkal (Harry Kalogirou) · GitHub</a>), Pascal Caversaccio (<a href=\"https://github.com/pcaversaccio\" class=\"inline-onebox\" rel=\"noopener nofollow ugc\">pcaversaccio (sudo rm -rf --no-preserve-root /) · GitHub</a>), Daniel Schiavini (<a href=\"https://github.com/DanielSchiavini\" class=\"inline-onebox\" rel=\"noopener nofollow ugc\">DanielSchiavini (Daniel Schiavini) · GitHub</a>)</p>\n<p><strong>Why’s your project important?</strong></p>\n<p>Vyper is the second most popular smart contract programming languages today, used by major protocols such as Curve Finance, Lido and Yearn and securing over $2 billion dollars of TVL.<br>\nWith faster compilation times and better code output than its major competitors, as well excellent and ever-improving tooling, Vyper is quickly establishing itself as the preferred choice for developers prioritizing security and efficiency in their smart contract development.<br>\nBy offering a Python-like syntax and integrating with Python tooling such as Jupyter, pip, and pytest, Vyper makes it easy for developers of the 2nd most popular programming language in the world (Python) to transition to web3.</p>\n<p><strong>What’s the impact you’ve had, and what can funders expect?</strong></p>\n<p>The Vyper team has been consistantly delivering new features and allowing protocols such as Curve Finance to deploy larger, more gas-efficient contracts and to create complex factory patterns.<br>\nVyper’s opinionated approach to language design is contributing to making smart contracts more readable and secure.<br>\nFunders can expect the team to continue to deliver major technical improvements to the compiler, better tooling and more outreach activities to promote the language.</p>\n<p><strong>What’s your project’s Twitter handle?</strong></p>\n<p><a href=\"https://twitter.com/vyperlang\" class=\"onebox\" target=\"_blank\" rel=\"noopener nofollow ugc\">https://twitter.com/vyperlang</a></p>\n<p><strong>GitHub Link:</strong></p>\n<aside class=\"onebox allowlistedgeneric\" data-onebox-src=\"https://github.com/vyperlang\">\n  <header class=\"source\">\n      <img src=\"https://github.githubassets.com/favicons/favicon.svg\" class=\"site-icon\" width=\"32\" height=\"32\">\n\n      <a href=\"https://github.com/vyperlang\" target=\"_blank\" rel=\"noopener nofollow ugc\">GitHub</a>\n  </header>\n\n  <article class=\"onebox-body\">\n    <img width=\"280\" height=\"280\" src=\"https://europe1.discourse-cdn.com/standard21/uploads/octant/original/1X/59e745fe838b8e5b89ee38786f8766ffe7603d29.png\" class=\"thumbnail onebox-avatar\" data-dominant-color=\"E5D1EF\">\n\n<h3><a href=\"https://github.com/vyperlang\" target=\"_blank\" rel=\"noopener nofollow ugc\">vyperlang</a></h3>\n\n  <p>vyperlang has 29 repositories available. Follow their code on GitHub.</p>\n\n\n  </article>\n\n  <div class=\"onebox-metadata\">\n    \n    \n  </div>\n\n  <div style=\"clear: both\"></div>\n</aside>\n\n<p><strong>Project Discord Link:</strong></p>\n<aside class=\"onebox allowlistedgeneric\" data-onebox-src=\"https://discord.com/invite/UHabzfNk\">\n  <header class=\"source\">\n      <img src=\"https://europe1.discourse-cdn.com/standard21/uploads/octant/original/1X/d917ebba1c185b494caf5a6fcff684367cf2c1d1.png\" class=\"site-icon\" data-dominant-color=\"8891F6\" width=\"256\" height=\"256\">\n\n      <a href=\"https://discord.com/invite/UHabzfNk\" target=\"_blank\" rel=\"noopener nofollow ugc\">Discord</a>\n  </header>\n\n  <article class=\"onebox-body\">\n    <div class=\"aspect-image\" style=\"--aspect-ratio:690/362;\"><img src=\"https://europe1.discourse-cdn.com/standard21/uploads/octant/optimized/1X/1ac19fb14b209b7504ca71c0b119810f5f86f358_2_690x362.png\" class=\"thumbnail\" data-dominant-color=\"202054\" width=\"690\" height=\"362\"></div>\n\n<h3><a href=\"https://discord.com/invite/UHabzfNk\" target=\"_blank\" rel=\"noopener nofollow ugc\">Discord - Group Chat That’s All Fun &amp; Games</a></h3>\n\n  <p>Discord is great for playing games and chilling with friends, or even building a worldwide community. Customize your own space to talk, play, and hang out.</p>\n\n\n  </article>\n\n  <div class=\"onebox-metadata\">\n    \n    \n  </div>\n\n  <div style=\"clear: both\"></div>\n</aside>\n\n<p><strong>Project Website:</strong></p>\n<p><a href=\"https://docs.vyperlang.org/en/stable/\" class=\"onebox\" target=\"_blank\" rel=\"noopener nofollow ugc\">https://docs.vyperlang.org/en/stable/</a></p>\n<p><strong>Team Social Accounts:</strong></p>\n<p><a href=\"https://twitter.com/big_tech_sux\" class=\"onebox\" target=\"_blank\" rel=\"noopener nofollow ugc\">https://twitter.com/big_tech_sux</a></p>\n<p><a href=\"https://twitter.com/fubuloubu\" class=\"onebox\" target=\"_blank\" rel=\"noopener nofollow ugc\">https://twitter.com/fubuloubu</a></p>\n<p><a href=\"https://twitter.com/_tserg\" class=\"onebox\" target=\"_blank\" rel=\"noopener nofollow ugc\">https://twitter.com/_tserg</a></p>\n<p><a href=\"https://twitter.com/harkal\" class=\"onebox\" target=\"_blank\" rel=\"noopener nofollow ugc\">https://twitter.com/harkal</a></p>\n<p><a href=\"https://twitter.com/0xz80\" class=\"onebox\" target=\"_blank\" rel=\"noopener nofollow ugc\">https://twitter.com/0xz80</a></p>\n<p><a href=\"https://twitter.com/pcaversaccio\" class=\"onebox\" target=\"_blank\" rel=\"noopener nofollow ugc\">https://twitter.com/pcaversaccio</a></p>\n<p><a href=\"https://twitter.com/danielschiavini\" class=\"onebox\" target=\"_blank\" rel=\"noopener nofollow ugc\">https://twitter.com/danielschiavini</a></p>\n<p><strong>Discord Contact:</strong></p>\n<p><span class=\"mention\">@big_tech_sux</span><br>\n<span class=\"mention\">@benny_lada</span></p>\n<p><strong>Telegram Contact:</strong></p>\n<aside class=\"onebox allowlistedgeneric\" data-onebox-src=\"https://t.me/big_tech_sux\">\n  <header class=\"source\">\n      <img src=\"https://telegram.org/img/website_icon.svg?4\" class=\"site-icon\" width=\"16\" height=\"16\">\n\n      <a href=\"https://t.me/big_tech_sux\" target=\"_blank\" rel=\"noopener nofollow ugc\">Telegram</a>\n  </header>\n\n  <article class=\"onebox-body\">\n    <img width=\"320\" height=\"320\" src=\"https://europe1.discourse-cdn.com/standard21/uploads/octant/original/1X/77c84c514b45a6a922654463eaf27485e2029e0a.jpeg\" class=\"thumbnail onebox-avatar\" data-dominant-color=\"866E64\">\n\n<h3><a href=\"https://t.me/big_tech_sux\" target=\"_blank\" rel=\"noopener nofollow ugc\">Charles Cooper</a></h3>\n\n  <p>quis custodiet ipsos custodes?</p>\n\n\n  </article>\n\n  <div class=\"onebox-metadata\">\n    \n    \n  </div>\n\n  <div style=\"clear: both\"></div>\n</aside>\n<aside class=\"onebox allowlistedgeneric\" data-onebox-src=\"https://t.me/benny_lada\">\n  <header class=\"source\">\n      <img src=\"https://telegram.org/img/website_icon.svg?4\" class=\"site-icon\" width=\"16\" height=\"16\">\n\n      <a href=\"https://t.me/benny_lada\" target=\"_blank\" rel=\"noopener nofollow ugc\">Telegram</a>\n  </header>\n\n  <article class=\"onebox-body\">\n    <img width=\"320\" height=\"320\" src=\"https://europe1.discourse-cdn.com/standard21/uploads/octant/original/1X/665cfaeb40fcd39c3e4301b34fb8d663e5389af5.jpeg\" class=\"thumbnail onebox-avatar\" data-dominant-color=\"AFA673\">\n\n<h3><a href=\"https://t.me/benny_lada\" target=\"_blank\" rel=\"noopener nofollow ugc\">benny_lada</a></h3>\n\n  <p>You can contact @benny_lada right away.</p>\n\n\n  </article>\n\n  <div class=\"onebox-metadata\">\n    \n    \n  </div>\n\n  <div style=\"clear: both\"></div>\n</aside>\n\n<p><strong>Wallet Address:</strong></p>\n<p><code>0x70CCBE10F980d80b7eBaab7D2E3A73e87D67B775</code></p>\n            <p><small>2 posts - 1 participant</small></p>\n            <p><a href=\"https://discuss.octant.app/t/vyper-pythonic-smart-contract-language-for-the-evm/325\">Read full topic</a></p>","link":"https://discuss.octant.app/t/vyper-pythonic-smart-contract-language-for-the-evm/325","pubDate":"Thu, 06 Jun 2024 01:45:51 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"discuss.octant.app-topic-325"},"source":{"@url":"https://discuss.octant.app/t/vyper-pythonic-smart-contract-language-for-the-evm/325.rss","#text":"Vyper: Pythonic Smart Contract Language for the EVM"}},{"title":"Dappnode - Decentralized Infrastructure for Everyone","dc:creator":"Lanski","category":"Public Good Projects Discussion","description":"<h2><a name=\"project-name-1\" class=\"anchor\" href=\"https://discuss.octant.app#project-name-1\"></a>Project Name:</h2>\n<p>Dappnode</p>\n<h2><a name=\"describe-your-project-and-why-you-classify-it-as-a-public-good-2\" class=\"anchor\" href=\"https://discuss.octant.app#describe-your-project-and-why-you-classify-it-as-a-public-good-2\"></a>Describe your project and why you classify it as a Public Good</h2>\n<p>Dappnode is a Free Open Source Software project with the mission to make web3 infrastructure accessible to anyone. That is: for everyone to be able to run validators and nodes, and decentralize the networks they use and love - regardless of their technical ability or economic situation.</p>\n<p>It’s a public good because we do not only not charge anything for the software, and we keep the values of decentralization, self-sovereignty and privacy as our main design principle: we don’t capture telemetry and we don’t know how many people use dappnode except if they decide to self-identify as validators in EVM chains by putting the word “dappnode” in the graffiti.</p>\n<p>The FOSS nature of it means that individuals use it, teams use it, companies use it and even knowledgeable developers use it despite having the knowledge to run nodes and validators by themselves because it makes their life simpler.</p>\n<h2><a name=\"what-are-your-main-project-funding-sources-3\" class=\"anchor\" href=\"https://discuss.octant.app#what-are-your-main-project-funding-sources-3\"></a>What are your main project funding sources?</h2>\n<p>Grants funding, User donations, Other</p>\n<h2><a name=\"how-much-have-you-raised-from-each-of-your-funding-sources-and-from-who-4\" class=\"anchor\" href=\"https://discuss.octant.app#how-much-have-you-raised-from-each-of-your-funding-sources-and-from-who-4\"></a>How much have you raised from each of your funding sources and from who?</h2>\n<p>482000 from EF, Aragon, Gitcoin Grants and Giveth</p>\n<h2><a name=\"are-you-seeking-5\" class=\"anchor\" href=\"https://discuss.octant.app#are-you-seeking-5\"></a>Are you seeking:</h2>\n<p>Funding for general operations</p>\n<h2><a name=\"has-your-project-launched-or-planning-to-launch-a-token-6\" class=\"anchor\" href=\"https://discuss.octant.app#has-your-project-launched-or-planning-to-launch-a-token-6\"></a>Has your project launched or planning to launch a token?</h2>\n<p>We do not have a token.</p>\n<p>Dappnode had a governance token called $NODE that was hacked. Anyone providing LP was reimbursed on their ETH and GNO positions by Dappnode. This token was <strong>not sold</strong> - no money ever entered our treasury thanks to it - and contributed negatively to Dappnode’s sustainability because of the hack refunds… we lost a bunch of money. There is no token at the current moment nor plans to restore it in the near future.</p>\n<h2><a name=\"does-your-project-plan-to-run-funding-rounds-giving-funding-to-other-projects-7\" class=\"anchor\" href=\"https://discuss.octant.app#does-your-project-plan-to-run-funding-rounds-giving-funding-to-other-projects-7\"></a>Does your project plan to run funding rounds, giving funding to other projects?</h2>\n<p>Yes</p>\n<h2><a name=\"what-milestones-have-you-achieved-8\" class=\"anchor\" href=\"https://discuss.octant.app#what-milestones-have-you-achieved-8\"></a>What milestones have you achieved?</h2>\n<p>Ideated in 2017 but born in 2018, we have achieved a lot since <img src=\"https://emoji.discourse-cdn.com/twitter/slight_smile.png?v=12\" title=\":slight_smile:\" class=\"emoji\" alt=\":slight_smile:\" loading=\"lazy\" width=\"20\" height=\"20\"></p>\n<ul>\n<li>Full GUI to manage deployment of nodes</li>\n<li>First decentralized dappstore: A Smart Contract on Ethereum is the repository, containing IPFS hashes where the latest version of the node software can be downloaded.</li>\n<li>SDK to permissionlessly contribute to the ecosystem, create dapps/dappnode packages, upload them to the dappstore. Everyone can make a dappnode app of any node without having to consult us!</li>\n<li>Access to the machine via VPN for remote access to the GUI</li>\n<li>Opt-in Auto-updates: hands-free node updates. Extremely useful for users but also networks as they get the subset of nodes running on dappnode automatically updated - simplifies potential fork situations.</li>\n<li>Stakers UI: A dedicated UI for EVM/Ethereum-like Proof-of-Stake validator setups (choosing EL, CL, Web3signer, MEV Boost) - intuitive and easy to choose! Allows for almost-instant consensus client switch without risking slashing to promote client diversity.</li>\n<li>Ethical Monitoring: Tor-based monitoring system to alert users when their Dappnodes are down but respecting the privacy of the user: we route liveness pings via Tor so we never get IPs! - Coordinated a standard API for the keymanager with Ethereum Core developers to facilitate validator key management between clients and other software.</li>\n<li>Developed a FOSS dashboard to manage keys irrespective of the underlying client software (using the Key Manager API)</li>\n<li>Created Smooth, a MEV Smoothing Pool to counterbalance the centralizing forces of the uneven distribution of MEV rewards that makes it that effectively pools with lots of validators end up with higher rewards than the median/expected solo staker. Smooth validators get 104% MORE execution layer rewards (DOUBLE!) than the expected non-smooth solo staker. This is absolutely necessary to make it economically fair for solo stakers and keep promoting decentralization.</li>\n<li>Operation Solo Staker with <a href=\"http://Ether.fi\" rel=\"noopener nofollow ugc\">Ether.fi</a> provided dappnode machines to community members around the world to geographically decentralize the node set of Ethereum and allow them to run validators and get benefits without needing to put the ETH themselves. This was our first economical accessibility project after years of working on technological accessibility.</li>\n<li>Being alive through bear and bull markets alike since 2018!</li>\n</ul>\n<h2><a name=\"tell-us-more-about-milestones-youd-like-to-achieve-9\" class=\"anchor\" href=\"https://discuss.octant.app#tell-us-more-about-milestones-youd-like-to-achieve-9\"></a>Tell us more about milestones you’d like to achieve</h2>\n<p>The next upcoming milestones are:<br>\n• Revamp the developer experience to make it easier for projects to create and maintain their own dapps/dappnode packages. This includes documentation, educational videos and a devrel program. Creating a healthy ecosystem around the dappstore will bring value to existing users and expand the reach of the software to other communities.<br>\n• Partnering with Gnosis Chain to bootstrap decentralized validators via a validator incentivization program. We are expected to make grow the number of nodes significantly.<br>\n• Smooth v2, improving on the first design of the MEV Smoothing pool considering the feedback of current users and expand the reach so solo stakers will get better rewards.</p>\n<p>Aside from specific milestones, we would like to keep working on 3 directions:</p>\n<ol>\n<li>advocacy and practical solutions implementation to defend decentralization like the Keymanager API, Smooth.</li>\n<li>Technological accessibility - keep improving our software to fulfil our general mission to bring ease of use for the web3 decentralized stack and make it more accessible. Decentralization through good UX.</li>\n<li>Economic accessibility - keep forging partnerships within the ecosystem to bring the economic barriers of entry to Staking down (&lt;32 ETH) to gain users and stakers in regions of the world with less disposable income and increase decentralization.</li>\n</ol>\n<p>The Moonshot objective for this year are to explore AI integrations. Dappnode, as software that you install in a machine at home that is 24/7 online (needs to be to validate), is perfectly positioned to also be a private local server for personal AI assistants.</p>\n<h2><a name=\"funding-goal-and-budget-10\" class=\"anchor\" href=\"https://discuss.octant.app#funding-goal-and-budget-10\"></a>Funding Goal and Budget:</h2>\n<p>Our burn rate is of around 650,000 yearly (yes, we try to keep costs low - missionaries not mercenaries!). Needless to say, if instead of maintaining our current team we could grow, we could advance much faster on the milestones and expand on other activities :).</p>\n<h2><a name=\"tell-us-more-about-your-team-11\" class=\"anchor\" href=\"https://discuss.octant.app#tell-us-more-about-your-team-11\"></a>Tell us more about your team:</h2>\n<p>Founders:</p>\n<p>Jordi Baylina - OGs know him as part of the WHG who participated in the recovery of funds in The DAO and the Parity multisig hacks. Since then has founded Dappnode but also Iden3, Hermez - now Polygon ID and Polygon ZKEVM. Jordi is no longer active in the development of Dappnode but is an advisor to the project.</p>\n<p>Griff Green - Founder of Giveth, Token Engineering Commons, Commons Stack and Dappnode. Met Jordi during his WHG work and has worked in blockchain for good tirelessly since then. Griff is no longer active in the development of Dappnode but is an advisor to the project.</p>\n<p>Eduardo Antuña Diez - Telecommunications Engineer, founder and current CTO of Dappnode and tech lead at the Polygon ZKEVM. The architect of most of the code and solutions in Dappnode.</p>\n<p>Team: While the founders are not active in the day-to-day operations, the team carrying away the good work are the following:<br>\nPol Lanski - Project Lead - His interest in decentralized systems started with the realization that countries’ political sovereignty is subordinated to the economic sovereignty. He saw Open Source, forkable scarce mechanisms like Bitcoin as a way to create opt-in economies led by the participants in them, and started mining Dogecoin because was late to papa BTC. Currently serving as coordinator and Moloch slayer for the amazing talent in the Dappnode team.</p>\n<p>The rest of the team does not participate so much in conferences and did not have available bios at the moment of request.<br>\nPablo - Engineering Lead<br>\nDiego - Integrations Lead<br>\nMarc - Senior Developer<br>\nMateu - Junior Developer<br>\nLuka - DevOps<br>\nClara - Marketing Lead<br>\nChuy - Community Manager</p>\n<h2><a name=\"social-credibility-development-progress-awards-notable-github-commits-referrals-12\" class=\"anchor\" href=\"https://discuss.octant.app#social-credibility-development-progress-awards-notable-github-commits-referrals-12\"></a>Social Credibility (development progress, awards, notable GitHub commits, referrals)</h2>\n<p>Dappnode’s privacy and self-sovereignty principles have made us build a product that captures no telemetry and only by opting in to our service of Ethical Monitoring you’d share any data with us.<br>\nLots of users don’t do that so we don’t have user metrics like other projects.</p>\n<p>We can, nonethless, get some proxy metrics like:</p>\n<ul>\n<li>Number validators that have self-reported as Dappnode users by including the word Dappnode in the graffiti: <a href=\"https://ethseer.io/entity/dappnode?network=mainnet\" class=\"inline-onebox\" rel=\"noopener nofollow ugc\">Entity Profile: dappnode - Ethereum Staking | EthSeer.io</a></li>\n<li>1 of the top 25 graffitis of Ethereum and Gnosis chain is “validating_from_Dappnode”, our default grafitti that users can change at any point.</li>\n<li>1960 validators joined Smooth, the MEV Smoothing pool.</li>\n</ul>\n<p>Probably the most important social validation is just searching for “dappnode” in X and seeing the incredible amount of love that we get from users and high profile members of the community: <a href=\"https://x.com/search?q=dappnode&amp;src=typed_query\" class=\"inline-onebox\" rel=\"noopener nofollow ugc\">x.com</a></p>\n<p>Other links:<br>\nGithub - more than 280 repos for all the packages and core components: <a href=\"https://github.com/dappnode\" class=\"inline-onebox\" rel=\"noopener nofollow ugc\">dappnode · GitHub</a></p>\n<ul>\n<li>\n<ul>\n<li>Dappmanager (Github): the heart of dappnode and what makes everything tick!</li>\n</ul>\n</li>\n</ul>\n<p>Documentation - to get a feel for what dappnode can do: <a href=\"https://docs.dappnode.io\" rel=\"noopener nofollow ugc\">https://docs.dappnode.io</a> Dappnode</p>\n<p>Driving School - Short form videos to get started on Dappnode: <a href=\"https://www.youtube.com/watch?v=lh5hADm1Iuk&amp;list=PLpMpAvZuB3w56Z__TProOhu767X1Udoyc\" rel=\"noopener nofollow ugc\">https://www.youtube.com/watch?v=lh5hADm1Iuk&amp;list=PLpMpAvZuB3w56Z__TProOhu767X1Udoyc</a></p>\n<p>Dappnode Crash Courses - Longer form videos on long tutorials for how to use dappnode in depth with particular use-cases and community QA at the end.</p>\n<p>Keymanager API: <a href=\"https://ethereum.github.io/keymanager-APIs/\" class=\"inline-onebox\" rel=\"noopener nofollow ugc\">Keymanager-API</a></p>\n<p>Smooth: <a href=\"https://smooth.dappnode.io/\" rel=\"noopener nofollow ugc\">https://smooth.dappnode.io/</a></p>\n<h2><a name=\"whys-your-project-important-13\" class=\"anchor\" href=\"https://discuss.octant.app#whys-your-project-important-13\"></a>Why’s your project important?</h2>\n<p>Dappnode has established itself as a decentralization advocate. Thousands of users use dappnode to validate on Ethereum, Gnosis Chain and LUKSO and we continue to advocate for increasing nodes run in home setups and in underrepresented geographical regions.</p>\n<p>Decentralization is a spectrum where different properties emerge: Got 2 nodes? you have data redundancy. You have a few nodes in different countries? Political interference resilience. You have nodes in different power grids? You have resilience to power grid failure. In different hardware? You have resilience to 0 day attacks, etc. The firm belief that an uncensorable, self-sovereign platform needs decentralized infrastructure to maintain these properties is why we will keep pushing to make it extremely simple to achieve such degree of decentralization.</p>\n<h2><a name=\"whats-your-projects-twitter-handle-14\" class=\"anchor\" href=\"https://discuss.octant.app#whats-your-projects-twitter-handle-14\"></a>What’s your project’s Twitter handle?</h2>\n<p><span class=\"mention\">@dappnode</span></p>\n<h2><a name=\"github-link-15\" class=\"anchor\" href=\"https://discuss.octant.app#github-link-15\"></a>GitHub Link:</h2>\n<aside class=\"onebox allowlistedgeneric\" data-onebox-src=\"https://github.com/dappnode/\">\n  <header class=\"source\">\n      <img src=\"https://github.githubassets.com/favicons/favicon.svg\" class=\"site-icon\" width=\"32\" height=\"32\">\n\n      <a href=\"https://github.com/dappnode/\" target=\"_blank\" rel=\"noopener nofollow ugc\">GitHub</a>\n  </header>\n\n  <article class=\"onebox-body\">\n    <img width=\"280\" height=\"280\" src=\"https://europe1.discourse-cdn.com/standard21/uploads/octant/original/1X/15a08c0a111d0289e1b18281709c77ab272f4bff.jpeg\" class=\"thumbnail onebox-avatar\" data-dominant-color=\"453E61\">\n\n<h3><a href=\"https://github.com/dappnode/\" target=\"_blank\" rel=\"noopener nofollow ugc\">dappnode</a></h3>\n\n  <p>dappnode has 237 repositories available. Follow their code on GitHub.</p>\n\n\n  </article>\n\n  <div class=\"onebox-metadata\">\n    \n    \n  </div>\n\n  <div style=\"clear: both\"></div>\n</aside>\n\n<h2><a name=\"project-discord-link-16\" class=\"anchor\" href=\"https://discuss.octant.app#project-discord-link-16\"></a>Project Discord Link:</h2>\n<aside class=\"onebox allowlistedgeneric\" data-onebox-src=\"https://discord.com/invite/dappnode\">\n  <header class=\"source\">\n      <img src=\"https://europe1.discourse-cdn.com/standard21/uploads/octant/original/1X/df8943cf94c9f3a212d6e7d405d7fb1f930f5468.png\" class=\"site-icon\" data-dominant-color=\"8891F6\" width=\"256\" height=\"256\">\n\n      <a href=\"https://discord.com/invite/dappnode\" target=\"_blank\" rel=\"noopener nofollow ugc\">Discord</a>\n  </header>\n\n  <article class=\"onebox-body\">\n    <img width=\"500\" height=\"500\" src=\"https://europe1.discourse-cdn.com/standard21/uploads/octant/original/1X/6cf851d5a0bf4a698b40c6ff71792c55441272d1.jpeg\" class=\"thumbnail onebox-avatar\" data-dominant-color=\"1F3B5A\">\n\n<h3><a href=\"https://discord.com/invite/dappnode\" target=\"_blank\" rel=\"noopener nofollow ugc\">Join the Dappnode Discord Server!</a></h3>\n\n  <p>Dappnode is your gateway to Web3 and Crypto Infra. It allows anyone to run nodes easily and earn passive income from it. | 6008 members</p>\n\n\n  </article>\n\n  <div class=\"onebox-metadata\">\n    \n    \n  </div>\n\n  <div style=\"clear: both\"></div>\n</aside>\n\n<h2><a name=\"project-website-17\" class=\"anchor\" href=\"https://discuss.octant.app#project-website-17\"></a>Project Website:</h2>\n<aside class=\"onebox allowlistedgeneric\" data-onebox-src=\"https://dappnode.com\">\n  <header class=\"source\">\n      <img src=\"https://europe1.discourse-cdn.com/standard21/uploads/octant/original/1X/a869087090b3328d3cc0b94e6db24b2f9d22ad2c.png\" class=\"site-icon\" data-dominant-color=\"8F5EB6\" width=\"180\" height=\"180\">\n\n      <a href=\"https://dappnode.com\" target=\"_blank\" rel=\"noopener nofollow ugc\">Dappnode</a>\n  </header>\n\n  <article class=\"onebox-body\">\n    <img width=\"268\" height=\"268\" src=\"https://europe1.discourse-cdn.com/standard21/uploads/octant/original/1X/585b4ca95a270341f07c0af45a8e9fedde337b64.jpeg\" class=\"thumbnail onebox-avatar\" data-dominant-color=\"986BBC\">\n\n<h3><a href=\"https://dappnode.com\" target=\"_blank\" rel=\"noopener nofollow ugc\">Run a node and stake on Ethereum and many other blockchains | Dappnode</a></h3>\n\n  <p>The easiest way to run your own blockchain nodes and earn rewards. Buy plug-n-play machines, ready to run. 100% secure payment, free shipping worldwide.</p>\n\n\n  </article>\n\n  <div class=\"onebox-metadata\">\n    \n    \n  </div>\n\n  <div style=\"clear: both\"></div>\n</aside>\n\n<h2><a name=\"team-social-accounts-18\" class=\"anchor\" href=\"https://discuss.octant.app#team-social-accounts-18\"></a>Team Social Accounts:</h2>\n<p><a href=\"https://x.com/eduadiez\" class=\"inline-onebox\" rel=\"noopener nofollow ugc\">x.com</a>, <a href=\"https://x.com/Pol_Lanski\" class=\"inline-onebox\" rel=\"noopener nofollow ugc\">x.com</a>, <a href=\"https://warpcast.com/chuy\" class=\"inline-onebox\" rel=\"noopener nofollow ugc\">Warpcast</a></p>\n<h2><a name=\"anything-else-youd-like-us-to-know-19\" class=\"anchor\" href=\"https://discuss.octant.app#anything-else-youd-like-us-to-know-19\"></a>Anything else you’d like us to know?</h2>\n<p>Dappnode doesn’t take a cut of any validators running on them and Dappnode users are completely self-sovereign, but at the same time Dappnode has tried to find many ways to financial sustainability, to continue supporting the thousands of users that use our software. On one side, some of them have bought the Dappnode Hardware, making a contribution with their payment to the team that also builds the software, but that unfortunately is not enough to maintain the project at the current rate of updates in the sector. Our intention is to become sustainable and not to rely on grants, and we believe we can find a non-extractive business model that will leverage web3 characteristics to create truly win-win-win situations.</p>\n<h2><a name=\"what-can-the-octant-team-help-you-with-20\" class=\"anchor\" href=\"https://discuss.octant.app#what-can-the-octant-team-help-you-with-20\"></a>What can the Octant team help you with?</h2>\n<p>There are many things we could do to collaborate and help Dappnode:</p>\n<ol>\n<li>\n<p>With 100,000 ETH staked, it achieves enough smoothing effects to get Execution rewards a lot closer to the average than the median. By joining Smooth with even just a portion of such validators and thousands of Solo Stakers would benefit from exposure to the MEV of the blocks produced by such a big influx of validators, effectively smoothing their rewards to the same level as validator pools and centralized actors. Octant would be contributing to all solo stakers and also to Dappnode in a more long-term sustainable way with the 7% fee on Execution Layer rewards of the pool.</p>\n</li>\n<li>\n<p>Would love to hear more about how Octant is running these validators. At dappnode we can provide you with a turnkey solution to put all or some of these validators in more decentralized setups but without losing control - by distributing machines to team mebmers and using DVT to reduce impact of downtime of some of machines. This would put a substantial amount of ETH validating in completely decentralized setups, being completely ethereum aligned and actively pushing for decentralization while engaging the team to do it.</p>\n</li>\n</ol>\n<p>Another model is to allow for a contest where we distribute such machines and DVT setups to applicants in different places in the world to achieve maximal geographical decentralization and then move part of Octant’s ETH to validate in these machines. Would love to hop in a call to jam ideas on this!</p>\n<h2><a name=\"how-do-you-define-impact-for-your-project-what-metrics-are-you-tracking-21\" class=\"anchor\" href=\"https://discuss.octant.app#how-do-you-define-impact-for-your-project-what-metrics-are-you-tracking-21\"></a>How do you define impact for your project? What metrics are you tracking?</h2>\n<p>For Dappnode, impact is defined by how much we can contribute to the decentralization of the web3 infrastructure. Our primary measure of impact would be the number of nodes and validators running on Dappnode, as this directly reflects our mission to make web3 infrastructure accessible to all. We would also consider the geographic distribution of these nodes, as this is a key indicator of the networks that we serve’s resilience to various potential challenges. I say WOULD because since our design principles are decentralization, privacy and self-sovereignty, we actually do not track our users. Some metrics that we can track is how many users self-report as using Dappnode by putting Dappnode in their grafitti and we also track how many validators have decided to share this information with us. That makes around 7400+ validators on Ethereum and more than 20000 on Gnosis Chain. We can’t track the usage of our FOSS at a user level, but we do establish partnerships with companies and networks/foundations: <a href=\"https://dappnode.com/en-us/pages/partners\" class=\"inline-onebox\" rel=\"noopener nofollow ugc\">Dappnodes Partners - Building a Decentralized World</a> We believe that the widespread usage of our software is a testament to its utility and effectiveness. Finally, we monitor the growth and activity of our on-chain product, Smooth, and of the activity in our community. The first directly impacts the smoothing effects and the increase in rewards for Solo Stakers, and the second, the engagement of our community, is crucial to our mission and serves as a barometer for our impact.</p>\n<h2><a name=\"share-your-project-impact-metrics-and-results-22\" class=\"anchor\" href=\"https://discuss.octant.app#share-your-project-impact-metrics-and-results-22\"></a>Share your project impact metrics and results</h2>\n<p>Link 1: Graffiti word cloud where we can see the Default validator of Dappnode as one of the top 25 graffitis. Since the graffiti can be changed at any time and many users do, this is a “lower bound” metric. Link 2: The same for Gnosis Chain. Here we can see that dappnode appears in different variations of the biggest graffitis. Link 3: 14 companies and their partnerships with Dappnode are described in our partners page. Link 4: The Smooth stats page helps show the number of validators impacted but also how it doubles execution layer rewards for the participants, aside from more information from the blocks and MEV rewards going into the pool.</p>\n<h2><a name=\"link-1-23\" class=\"anchor\" href=\"https://discuss.octant.app#link-1-23\"></a>Link 1:</h2>\n<aside class=\"onebox allowlistedgeneric\" data-onebox-src=\"https://beaconcha.in/charts/graffiti_wordcloud\">\n  <header class=\"source\">\n      <img src=\"https://europe1.discourse-cdn.com/standard21/uploads/octant/original/1X/2e0e44aa479ddf5c258f86cb7ab48c2b7f0568b8.png\" class=\"site-icon\" data-dominant-color=\"585659\" width=\"36\" height=\"36\">\n\n      <a href=\"https://beaconcha.in/charts/graffiti_wordcloud\" target=\"_blank\" rel=\"noopener nofollow ugc\">beaconcha.in</a>\n  </header>\n\n  <article class=\"onebox-body\">\n    <img width=\"192\" height=\"192\" src=\"https://europe1.discourse-cdn.com/standard21/uploads/octant/original/1X/4e6ce1d9c60e2bd889c4986ea4626367215e5d51.png\" class=\"thumbnail onebox-avatar\" data-dominant-color=\"5C5A5D\">\n\n<h3><a href=\"https://beaconcha.in/charts/graffiti_wordcloud\" target=\"_blank\" rel=\"noopener nofollow ugc\">Graffiti Word Cloud Chart - Open Source Ethereum Blockchain Explorer -...</a></h3>\n\n  <p>beaconcha.in makes Ethereum accessible to non-technical end users</p>\n\n\n  </article>\n\n  <div class=\"onebox-metadata\">\n    \n    \n  </div>\n\n  <div style=\"clear: both\"></div>\n</aside>\n\n<h2><a name=\"link-2-24\" class=\"anchor\" href=\"https://discuss.octant.app#link-2-24\"></a>Link 2:</h2>\n<aside class=\"onebox allowlistedgeneric\" data-onebox-src=\"https://gnosischa.in/charts/graffiti_wordcloud\">\n  <header class=\"source\">\n      <img src=\"https://europe1.discourse-cdn.com/standard21/uploads/octant/original/1X/a82d80ca17a57764d16495be8c4f63773b7dab12.png\" class=\"site-icon\" data-dominant-color=\"585659\" width=\"36\" height=\"36\">\n\n      <a href=\"https://gnosischa.in/charts/graffiti_wordcloud\" target=\"_blank\" rel=\"noopener nofollow ugc\">beaconcha.in</a>\n  </header>\n\n  <article class=\"onebox-body\">\n    <img width=\"192\" height=\"192\" src=\"https://europe1.discourse-cdn.com/standard21/uploads/octant/original/1X/4e6ce1d9c60e2bd889c4986ea4626367215e5d51.png\" class=\"thumbnail onebox-avatar\" data-dominant-color=\"5C5A5D\">\n\n<h3><a href=\"https://gnosischa.in/charts/graffiti_wordcloud\" target=\"_blank\" rel=\"noopener nofollow ugc\">Charts - Open Source Ethereum Blockchain Explorer - beaconcha.in - 2024</a></h3>\n\n  <p>beaconcha.in makes Ethereum accessible to non-technical end users</p>\n\n\n  </article>\n\n  <div class=\"onebox-metadata\">\n    \n    \n  </div>\n\n  <div style=\"clear: both\"></div>\n</aside>\n\n<h2><a name=\"link-3-25\" class=\"anchor\" href=\"https://discuss.octant.app#link-3-25\"></a>Link 3:</h2>\n<aside class=\"onebox allowlistedgeneric\" data-onebox-src=\"https://dappnode.com/pages/partners\">\n  <header class=\"source\">\n      <img src=\"https://europe1.discourse-cdn.com/standard21/uploads/octant/original/1X/a869087090b3328d3cc0b94e6db24b2f9d22ad2c.png\" class=\"site-icon\" data-dominant-color=\"8F5EB6\" width=\"180\" height=\"180\">\n\n      <a href=\"https://dappnode.com/pages/partners\" target=\"_blank\" rel=\"noopener nofollow ugc\">Dappnode</a>\n  </header>\n\n  <article class=\"onebox-body\">\n    <img width=\"268\" height=\"268\" src=\"https://europe1.discourse-cdn.com/standard21/uploads/octant/original/1X/585b4ca95a270341f07c0af45a8e9fedde337b64.jpeg\" class=\"thumbnail onebox-avatar\" data-dominant-color=\"986BBC\">\n\n<h3><a href=\"https://dappnode.com/pages/partners\" target=\"_blank\" rel=\"noopener nofollow ugc\">Partners</a></h3>\n\n  <p>Explore our partners who contribute to a decentralized world. From staking solutions to privacy efforts, discover how these companies, including LUKSO and Gnosis Chain, can assist you</p>\n\n\n  </article>\n\n  <div class=\"onebox-metadata\">\n    \n    \n  </div>\n\n  <div style=\"clear: both\"></div>\n</aside>\n\n<h2><a name=\"link-4-26\" class=\"anchor\" href=\"https://discuss.octant.app#link-4-26\"></a>Link 4:</h2>\n<aside class=\"onebox allowlistedgeneric\" data-onebox-src=\"https://smooth.dappnode.io/stats\">\n  <header class=\"source\">\n\n      <a href=\"https://smooth.dappnode.io/stats\" target=\"_blank\" rel=\"noopener nofollow ugc\">Smooth | Dappnode's MEV Smoothing Pool | Maximize your eth staking rewards</a>\n  </header>\n\n  <article class=\"onebox-body\">\n    <div class=\"aspect-image\" style=\"--aspect-ratio:690/361;\"><img src=\"https://europe1.discourse-cdn.com/standard21/uploads/octant/optimized/1X/8620377953a79161921de0714f66f678ab4a5c01_2_690x362.png\" class=\"thumbnail\" data-dominant-color=\"7C35C8\" width=\"690\" height=\"362\"></div>\n\n<h3><a href=\"https://smooth.dappnode.io/stats\" target=\"_blank\" rel=\"noopener nofollow ugc\">Smooth | Dappnode's MEV Smoothing Pool | Maximize your eth staking rewards |...</a></h3>\n\n  <p>Elevate your Ethereum solo staking experience and maximize your rewards with Smooth. Pool your MEV rewards seamlessly with other stakers and enjoy payouts from every block. Join Dappnode's MEV Smoothing Pool today!</p>\n\n\n  </article>\n\n  <div class=\"onebox-metadata\">\n    \n    \n  </div>\n\n  <div style=\"clear: both\"></div>\n</aside>\n\n<h2><a name=\"i-confirm-that-my-project-hasis-27\" class=\"anchor\" href=\"https://discuss.octant.app#i-confirm-that-my-project-hasis-27\"></a>I confirm that my project has/is:</h2>\n<p>Commitment to open-source technology and sharing results publicly, Determined to provide transparency about how exactly funding will be used, Advancing values of freedom and privacy (no surveillance and handling of personal data), Supporting decentralization in various fields (for example, building a Web3 related project), Social proof, being recognizable in the area the project is being developed in</p>\n<h2><a name=\"i-confirm-that-my-project-is-not-a-28\" class=\"anchor\" href=\"https://discuss.octant.app#i-confirm-that-my-project-is-not-a-28\"></a>I confirm that my project is not a:</h2>\n<p>For profit project, Financial (lending, investing, trading) product</p>\n            <p><small>2 posts - 2 participants</small></p>\n            <p><a href=\"https://discuss.octant.app/t/dappnode-decentralized-infrastructure-for-everyone/323\">Read full topic</a></p>","link":"https://discuss.octant.app/t/dappnode-decentralized-infrastructure-for-everyone/323","pubDate":"Wed, 05 Jun 2024 11:07:59 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"discuss.octant.app-topic-323"},"source":{"@url":"https://discuss.octant.app/t/dappnode-decentralized-infrastructure-for-everyone/323.rss","#text":"Dappnode - Decentralized Infrastructure for Everyone"}},{"title":"MASQ Network - a privacy solution offering a dMeshVPN, browser, dAppStore, and earning ecosystem","dc:creator":"kaurihero_masq","category":"Public Good Projects Discussion","description":"<h1><a name=\"p-633-project-name-masq-network-1\" class=\"anchor\" href=\"https://discuss.octant.app#p-633-project-name-masq-network-1\"></a>Project Name: MASQ Network</h1>\n<p></p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://europe1.discourse-cdn.com/standard21/uploads/octant/original/1X/aa8faf7c3c92ece031eb731ff80037e1e45b266b.png\" data-download-href=\"/uploads/short-url/okR0UzDZYI03YmgYJOfMmRrf4Gn.png?dl=1\" title=\"MASQ-Logo\" rel=\"noopener nofollow ugc\"><img src=\"https://europe1.discourse-cdn.com/standard21/uploads/octant/optimized/1X/aa8faf7c3c92ece031eb731ff80037e1e45b266b_2_690x174.png\" alt=\"MASQ-Logo\" data-base62-sha1=\"okR0UzDZYI03YmgYJOfMmRrf4Gn\" width=\"690\" height=\"174\" srcset=\"https://europe1.discourse-cdn.com/standard21/uploads/octant/optimized/1X/aa8faf7c3c92ece031eb731ff80037e1e45b266b_2_690x174.png, https://europe1.discourse-cdn.com/standard21/uploads/octant/original/1X/aa8faf7c3c92ece031eb731ff80037e1e45b266b.png 1.5x, https://europe1.discourse-cdn.com/standard21/uploads/octant/original/1X/aa8faf7c3c92ece031eb731ff80037e1e45b266b.png 2x\" data-dominant-color=\"1CA8FD\"></a></div><p></p>\n<p><a href=\"https://discuss.octant.app/t/masq-network-a-privacy-solution-offering-a-dmeshvpn-browser-dappstore-and-earning-ecosystem/319/33\">UPDATE HERE 6 August</a></p>\n<h2><a name=\"p-633-project-description-2\" class=\"anchor\" href=\"https://discuss.octant.app#p-633-project-description-2\"></a>Project Description</h2>\n<p>At MASQ, we believe today’s digital world should not have barriers online, where tracking, blocking and censoring normal citizens has become an everyday thing!<br>\nOur personal data should be <strong>just that</strong> - PERSONAL - not harvested, shared and monetized to the highest bidder.<br>\nMost importantly, everyone should be able to access the world of web3 and blockchain applications and have the freedom to do so from where ever they live in the world.</p>\n<p>Over the last four years, the team and community at MASQ Network has delivered an innovative and attractive browsing software solution to unlock borderless browsing with privacy by default!</p>\n<h4><a name=\"p-633-no-tracking-no-central-servers-no-siloed-personal-data-no-sign-ups-just-a-wallet-and-the-will-to-try-out-something-uniquely-private-by-default-3\" class=\"anchor\" href=\"https://discuss.octant.app#p-633-no-tracking-no-central-servers-no-siloed-personal-data-no-sign-ups-just-a-wallet-and-the-will-to-try-out-something-uniquely-private-by-default-3\"></a>No tracking, no central servers, no silo’ed personal data, no sign-ups. Just a wallet and the will to try out something uniquely private-by-default!</h4>\n<p>This is achieved through the MASQ open-sourced mesh network solution (called MASQ Node) powered by the users themselves, that works on top of the normal internet without special hardware or traditional VPN or Tor technology.</p>\n<p>Coupled with the MASQ web3 privacy browser, any user can try out the MASQ Network now for free on Polygon Amoy testnet, and see the exciting user experience created so far.</p>\n<p>Some of the key features include:</p>\n<ul>\n<li>Borderless browsing and privacy online without tracking, from anywhere in the world</li>\n<li>Native handling of ENS domain profiles, dot eth content, IPFS websites, Handshake domain resolution</li>\n<li>Uncensored access to crypto platforms, web3 dApps, and the social platforms</li>\n<li>In-built web3 dApps library, curated by the team and community</li>\n<li>Ability to earn passive crypto by sharing Internet bandwidth with the MASQ Network</li>\n</ul>\n<h2><a name=\"p-633-classification-as-a-public-good-4\" class=\"anchor\" href=\"https://discuss.octant.app#p-633-classification-as-a-public-good-4\"></a>Classification as a Public Good</h2>\n<p>MASQ is characterized as a Public Good for several core reasons:</p>\n<ul>\n<li><strong>Freedom of Information:</strong> MASQ enables access to uncensored information and content on the clear web, supporting freedom of expression and the democratization of knowledge.</li>\n<li><strong>Benefits to Society with Enhanced Privacy:</strong> MASQ helps protect individuals from intrusive surveillance and data collection, promoting digital privacy rights. Your data stays your data!<br>\nMASQ does not harvest, track or log anything on users and ensures privacy and enhanced browsing security for all users, serving the public interest and contributing to the common good of the web2 and web3 users.<br>\nTruthfully, the MASQ team doesn’t even know exactly how many active Nodes are worldwide at any given time - no personal user information or app analytics are collected. (on-chain data and privacy-respecting download metrics are used to estimate network use and growth trends)</li>\n<li><strong>Non-Excludability</strong>: MASQ Core networking software is open-source and the browser is available publicly to all users, (also hosted in IPFS) so it is impossible to exclude anyone from using them. This means that anyone with access to the internet can benefit from the privacy and security features offered by MASQ.</li>\n<li><strong>Non-Rivalrous Consumption:</strong> The use of the MASQ Network/Browser by one individual does not reduce its availability to others. Multiple users can simultaneously benefit from the network without disrupting the availability of the service. In fact, the more users supporting the MASQ Network, the more capacity and network stability is present overall.</li>\n</ul>\n<h2><a name=\"p-633-main-project-funding-sources-5\" class=\"anchor\" href=\"https://discuss.octant.app#p-633-main-project-funding-sources-5\"></a>Main Project Funding Sources</h2>\n<p>Having started from community grass-roots, MASQ has operated without conducting an ICO, public raises or Angel/VC backing. A pure utility token was launched after community discussion in 2020, and donations from community facilitated the first Liquidity Pool in late 2020.<br>\nMASQ has sustained growth and development through volunteer work, community donations, minor grants in the last two years and a small stream of fees from Protocol Owner Liquidity (currently on v3 Quickswap and v3 Uniswap).</p>\n<p><strong>IMPORTANT: No grants, public funding or donations are utilized for Liquidity provisioning of token buybacks - this has never been considered appropriate within any aspect of grant funding awarded to the MASQ project</strong></p>\n<p>The following are several grants awarded in past two years, in order of size:</p>\n<ul>\n<li><a href=\"https://giveth.io/project/masq-network\" rel=\"noopener nofollow ugc\">Giveth QF Polygon campaign</a> in Q1 2024 of 10,000 MATIC, and roughly $4,000 in user donations</li>\n<li>$3,000 micro grant from Polygon in 2022</li>\n<li>ETH donated for gas to deploy contracts in 2019/2020 and facilitate airdrop distribution to community</li>\n</ul>\n<h2><a name=\"p-633-seeking-project-specific-funding-or-funding-for-general-operations-6\" class=\"anchor\" href=\"https://discuss.octant.app#p-633-seeking-project-specific-funding-or-funding-for-general-operations-6\"></a>Seeking project-specific funding or funding for general operations</h2>\n<p>General operations - funding will go towards our developers, with a specific focus on development of the MASQ Lite client which will act as a browser extension and desktop app that users can run to privatize their default browser and device network traffic.</p>\n<h3><a name=\"p-633-importantly-no-grants-public-funding-or-donations-are-utilized-for-liquidity-provisioning-7\" class=\"anchor\" href=\"https://discuss.octant.app#p-633-importantly-no-grants-public-funding-or-donations-are-utilized-for-liquidity-provisioning-7\"></a>Importantly, no grants, public funding or donations are utilized for Liquidity provisioning.</h3>\n<h2><a name=\"p-633-team-information-8\" class=\"anchor\" href=\"https://discuss.octant.app#p-633-team-information-8\"></a>Team Information:</h2>\n<p>MASQ has a distributed team of full-time and part-time contributors, as well as volunteers - in summary there are 8 fulltime team developers, 4 part-time contributors, and 2 volunteer tech advisors</p>\n<ul>\n<li>KauriHero - Project Lead  <a href=\"https://twitter.com/KauriHero\" rel=\"noopener nofollow ugc\">Twitter</a> | <a href=\"https://github.com/kauri-hero\" rel=\"noopener nofollow ugc\">GitHub</a></li>\n<li>Suiux - Product UX/UI Design Lead</li>\n<li>2 fulltime engineers working on the MASQ Core codebase + 2 interns part-time working on MASQ Core (<a href=\"https://github.com/MASQ-Project/Node\" rel=\"noopener nofollow ugc\">built in Rust</a>) - (Backend)<br>\nThe Core team is guided by tech advisors who have over 30 years experience in software development</li>\n<li>3 fulltime front-end developers working on Electron Chromium Browser front-end,</li>\n<li>1 Marketing Coordinator full time + 2 community admins part-time</li>\n</ul>\n<h2><a name=\"p-633-social-credibility-development-progress-awards-notable-github-commits-referrals-9\" class=\"anchor\" href=\"https://discuss.octant.app#p-633-social-credibility-development-progress-awards-notable-github-commits-referrals-9\"></a>Social Credibility (development progress, awards, notable GitHub commits, referrals):</h2>\n<p>There are many to list since our inception in late 2019, but most notable ones are:</p>\n<ul>\n<li><span class=\"chcklst-box checked fa fa-check-square-o fa-fw\"></span> Released our open-source MASQ Core upgrades, with most recent in April 2024 allowing mesh network hops to be changed by the user (this is unique in the privacy tool space)</li>\n<li><span class=\"chcklst-box checked fa fa-check-square-o fa-fw\"></span> Released fully-featured MASQ web3 privacy browser (built on Chromium) customized for web3-natives, providing a 60 second onboard into the MASQ Network with minimal to zero additional configuration for most users.</li>\n<li><span class=\"chcklst-box checked fa fa-check-square-o fa-fw\"></span> Ranked in top 20 projects on Giveth QF Polygon web3 round, out of a few hundred projects</li>\n<li><span class=\"chcklst-box checked fa fa-check-square-o fa-fw\"></span> Official partnership integrations with Handshake, Presearch, Filebase, Akash and more</li>\n<li><span class=\"chcklst-box checked fa fa-check-square-o fa-fw\"></span> Multichain with current network compatibility with Eth mainnet, Polygon mainnet and their relative testnets (with more blockchain and EVM ecosystems in the pipeline)</li>\n</ul>\n<h2><a name=\"p-633-additional-information-10\" class=\"anchor\" href=\"https://discuss.octant.app#p-633-additional-information-10\"></a>Additional Information</h2>\n<blockquote>\n<p>How many users have downloaded the MASQ browser and actively use the network?</p>\n</blockquote>\n<ul>\n<li>Since the MASQ Browser public launch on Sept 2023:\n<ul>\n<li>over 3,000 unique downloads (plus additional ones from IPFS hosted files)</li>\n<li><a href=\"http://masqbrowser.com\" rel=\"noopener nofollow ugc\">masqbrowser.com</a> website received over 21,000 unique visitors</li>\n<li>over 500 verified Discord users joined MASQ Discord feedback channel to actively share their user experiences.</li>\n</ul>\n</li>\n<li>As MASQ doesn’t conduct user tracking or centralized reporting, active users are estimated using on-chain metrics:\n<ul>\n<li>As of May 2024, there are over 23,000 test token transactions - Roughly each transaction equates to an average of 100-200MB of data browsing.<br>\n(<a href=\"https://mumbai.polygonscan.com/token/0x9b27034acabd44223fb23d628ba4849867ce1db2\" rel=\"noopener nofollow ugc\">source on Mumbai</a>, and <a href=\"https://www.oklink.com/amoy/token/0xd98c3ebd6b7f9b7cda2449ecac00d1e5f47a8193\" rel=\"noopener nofollow ugc\">Amoy</a>)</li>\n</ul>\n</li>\n<li>There is a MASQ <a href=\"https://dune.com/masq_network/masq-network-dashboard\" rel=\"noopener nofollow ugc\">Dune dashboard</a> for onchain analytics for MASQ holders - As of May 2024, there are over 7,000 $MASQ utility token holders on Ethereum &amp; Polygon networks.</li>\n</ul>\n<h2><a name=\"p-633-social-media-11\" class=\"anchor\" href=\"https://discuss.octant.app#p-633-social-media-11\"></a>Social Media</h2>\n<p>You can find a full list of our social media channels here: <a href=\"https://docs.masq.ai/masq/getting-started/official-community-links\" rel=\"noopener nofollow ugc\">MASQ Official Links</a></p>\n<h2><a name=\"p-633-discord-contact-12\" class=\"anchor\" href=\"https://discuss.octant.app#p-633-discord-contact-12\"></a>Discord contact</h2>\n<p><span class=\"mention\">@Kaurihero</span></p>\n<h2><a name=\"p-633-eligibility-criteria-13\" class=\"anchor\" href=\"https://discuss.octant.app#p-633-eligibility-criteria-13\"></a>Eligibility criteria</h2>\n<ul>\n<li><span class=\"chcklst-box checked fa fa-check-square-o fa-fw\"></span> Do you have a commitment to open-source (i.e. every open-source license accepted by the <a href=\"https://opensource.org/licenses/\" rel=\"noopener nofollow ugc\">Open-Source Initiative</a> technology and sharing results publicly?<br>\n<em>Absolutely, and the MASQ Core software is under GPLv3 on GitHub, powering the networking protocol.</em></li>\n<li><span class=\"chcklst-box checked fa fa-check-square-o fa-fw\"></span> Have you provided transparency about how exactly funding will be used?<br>\n<em>All funding will go to developers of the software, with specific focus to delivering a MASQ Lite client and browser extension. This can be tracked on-chain with a treasury multi-sig where grants would be securely stored</em></li>\n<li><span class=\"chcklst-box checked fa fa-check-square-o fa-fw\"></span>  Are you advancing values of freedom and privacy (no surveillance and handling of personal data)?<br>\n<em>Without a doubt, and that is the core ethos of MASQ from day 1 - privacy-by-default, respecting user privacy, no collecting or storing user data, decentralization of the network itself and no central controlling entities in the MASQ mesh network</em></li>\n<li><span class=\"chcklst-box checked fa fa-check-square-o fa-fw\"></span> Are you supporting decentralization in various fields (for example building <a href=\"https://ethereum.org/en/web3\" rel=\"noopener nofollow ugc\">Web3 projects</a>)?<br>\n<em>Yes, and the team strives to include various layers of decentralization and leveraging partners to grow alongside the ecosystem and expand use-cases to the broader user-base</em></li>\n<li><span class=\"chcklst-box checked fa fa-check-square-o fa-fw\"></span> Have you provided social media channels to the extent that we can confirm social proof of your project?<br>\nYes.</li>\n</ul>\n            <p><small>35 posts - 19 participants</small></p>\n            <p><a href=\"https://discuss.octant.app/t/masq-network-a-privacy-solution-offering-a-dmeshvpn-browser-dappstore-and-earning-ecosystem/319\">Read full topic</a></p>","link":"https://discuss.octant.app/t/masq-network-a-privacy-solution-offering-a-dmeshvpn-browser-dappstore-and-earning-ecosystem/319","pubDate":"Tue, 04 Jun 2024 10:34:44 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"discuss.octant.app-topic-319"},"source":{"@url":"https://discuss.octant.app/t/masq-network-a-privacy-solution-offering-a-dmeshvpn-browser-dappstore-and-earning-ecosystem/319.rss","#text":"MASQ Network - a privacy solution offering a dMeshVPN, browser, dAppStore, and earning ecosystem"}},{"title":"DeSci LATAM: Connecting Latin American Science with Blockchain Innovations","dc:creator":"cryptonahue","category":"Public Good Projects Discussion","description":"<h2><a name=\"project-name-1\" class=\"anchor\" href=\"https://discuss.octant.app#project-name-1\"></a>Project Name:</h2>\n<p>DeSci LATAM</p>\n<h2><a name=\"project-description-and-why-its-classified-as-a-public-good-2\" class=\"anchor\" href=\"https://discuss.octant.app#project-description-and-why-its-classified-as-a-public-good-2\"></a>Project Description and why it’s classified as a Public Good</h2>\n<p>DeSci LATAM is a public good with a mission to promote the advancement of science in Latin America, by bridging the gap between the scientific community and the blockchain ecosystem. Founded in June 2022, DeSci LATAM aims to make the knowledge of decentralized science (DeSci) accessible in Spanish and Portuguese. We achieve this by organizing events, producing educational content, and seeking to collaborate with universities and research centers. Our resources are freely accessible and address critical issues in Latin American science such as funding, visibility and resource scarcity, fostering collaboration and innovation for the greater good.</p>\n<h2><a name=\"main-project-funding-sources-3\" class=\"anchor\" href=\"https://discuss.octant.app#main-project-funding-sources-3\"></a>Main Project Funding Sources</h2>\n<p>Gitcoin Grants and QF ETH Bogotá</p>\n<h2><a name=\"amount-raised-4\" class=\"anchor\" href=\"https://discuss.octant.app#amount-raised-4\"></a>Amount Raised</h2>\n<p>4500</p>\n<p>#<span class=\"hashtag-raw\">#Seeking</span> Funding for:<br>\nProject-specific funding<br>\nFunding for general operations</p>\n<p>Token Launch: No</p>\n<h2><a name=\"project-roadmap-5\" class=\"anchor\" href=\"https://discuss.octant.app#project-roadmap-5\"></a>Project Roadmap:</h2>\n<aside class=\"onebox googledocs\" data-onebox-src=\"https://docs.google.com/document/d/1_ZIlOcJf52EHxnhoTzivDMma-DyLubflQ7fUQgrHIiY/edit?usp=sharing\">\n  <header class=\"source\">\n\n      <a href=\"https://docs.google.com/document/d/1_ZIlOcJf52EHxnhoTzivDMma-DyLubflQ7fUQgrHIiY/edit?usp=sharing\" target=\"_blank\" rel=\"noopener nofollow ugc\">docs.google.com</a>\n  </header>\n\n  <article class=\"onebox-body\">\n    <a href=\"https://docs.google.com/document/d/1_ZIlOcJf52EHxnhoTzivDMma-DyLubflQ7fUQgrHIiY/edit?usp=sharing\" target=\"_blank\" rel=\"noopener nofollow ugc\"><span class=\"googledocs-onebox-logo g-docs-logo\"></span></a>\n\n<h3><a href=\"https://docs.google.com/document/d/1_ZIlOcJf52EHxnhoTzivDMma-DyLubflQ7fUQgrHIiY/edit?usp=sharing\" target=\"_blank\" rel=\"noopener nofollow ugc\">Roadmap DeSci LATAM</a></h3>\n\n<p>Previous activity https://descilatam.org/es-AR/changelogMilestone 1: Content Generation Objective: Increase the creation and distribution of educational content about DeSci. Time Frame: 4 months Outputs:  Livestreams about DeSci, open science, and...</p>\n\n  </article>\n\n  <div class=\"onebox-metadata\">\n    \n    \n  </div>\n\n  <div style=\"clear: both\"></div>\n</aside>\n\n<h2><a name=\"milestones-achieved-6\" class=\"anchor\" href=\"https://discuss.octant.app#milestones-achieved-6\"></a>Milestones Achieved:</h2>\n<ul>\n<li>Organized the first DeSci LATAM event in Buenos Aires.</li>\n<li>Co-organized an event in Rio de Janeiro.</li>\n<li>Participated in a DeSci panel at ETH Brazil.</li>\n<li>Presented at Vitalia, discussing DeSci and our activities.<br>\nMore information about our milestones: Changelog</li>\n</ul>\n<h2><a name=\"tell-us-more-about-milestones-youd-like-to-achieve-7\" class=\"anchor\" href=\"https://discuss.octant.app#tell-us-more-about-milestones-youd-like-to-achieve-7\"></a>Tell us more about milestones you’d like to achieve</h2>\n<ul>\n<li>Increase the creation and distribution of educational content about DeSci.</li>\n<li>Side event at ETH Argentina: DeSci DAY Argentina 2024 (August)</li>\n<li>DeSci LATAM Virtual Conference (September)</li>\n<li>Presence at major events like ETH Chile, ETH Argentina, ETH Uruguay.</li>\n<li>Include the DeSci category in hackathons.</li>\n</ul>\n<h2><a name=\"funding-goal-and-budget-8\" class=\"anchor\" href=\"https://discuss.octant.app#funding-goal-and-budget-8\"></a>Funding Goal and Budget:</h2>\n<p>Our aim is to raise $20,000 to cover the cost of organizing events and producing educational content. The funds will be allocated as follows $6,000 for content production 10,000 for events 4,000 for team and staff expenses</p>\n<h2><a name=\"our-team-9\" class=\"anchor\" href=\"https://discuss.octant.app#our-team-9\"></a>Our Team:</h2>\n<p>Brenda: Virtual and in-person event host, networking, and design.<br>\nNahuel: Project Manager, development, and technology.<br>\nDaniela: Community Manager, Streaming Coordinator, and Event Planning.</p>\n<p>Collaborators<br>\nLaura: Portuguese host and content creator.<br>\nFabián: Content Creator.</p>\n<h2><a name=\"social-credibility-10\" class=\"anchor\" href=\"https://discuss.octant.app#social-credibility-10\"></a>Social Credibility:</h2>\n<ul>\n<li>Successfully organized and co-organized major DeSci events in Buenos Aires and Rio de Janeiro.</li>\n<li>Invited to speak at prominent conferences such as ETH Brazil and Vitalia.</li>\n<li>Active presence on social media and engagement with the DeSci community.</li>\n</ul>\n<h2><a name=\"project-importance-11\" class=\"anchor\" href=\"https://discuss.octant.app#project-importance-11\"></a>Project Importance:</h2>\n<p>Humanity is facing an evolutionary challenge because science faces many obstacles in its progress. DeSci comes to solve many of these problems, and we aim to raise awareness of these solutions. Our goal is for science to adopt and evolve these solutions, thereby significantly improving the way scientific research is conducted and how it benefits humanity.</p>\n<p><strong>Project Social Media and Links:</strong></p>\n<ul>\n<li><strong>Twitter:</strong> <a href=\"https://twitter.com/descilatam\" rel=\"noopener nofollow ugc\">@descilatam</a></li>\n<li><strong>GitHub:</strong> <a href=\"https://github.com/DeSci-Latam\" rel=\"noopener nofollow ugc\">DeSci-Latam</a></li>\n<li><strong>Discord:</strong> <a href=\"https://discord.com/invite/4fKXZQNdEN\" rel=\"noopener nofollow ugc\">Discord Link</a></li>\n<li><strong>Website:</strong> <a href=\"https://descilatam.org/\" rel=\"noopener nofollow ugc\">DeSci LATAM</a></li>\n<li><strong>Telegram:</strong> <span class=\"mention\">@GordaBitcoin</span> <a class=\"mention\" href=\"https://discuss.octant.app/u/cryptonahue\">@CryptoNahue</a></li>\n</ul>\n<p><strong>Discord Contact:</strong><br>\ncryptonahue</p>\n<p><strong>Additional Information:</strong></p>\n<p>We are currently working with <a href=\"https://x.com/crecimientoar/\" rel=\"noopener nofollow ugc\">@crecimiento</a>, a movement of emerging cities, and we are helping in the area of DeSci to support Argentine science.</p>\n            <p><small>3 posts - 2 participants</small></p>\n            <p><a href=\"https://discuss.octant.app/t/desci-latam-connecting-latin-american-science-with-blockchain-innovations/315\">Read full topic</a></p>","link":"https://discuss.octant.app/t/desci-latam-connecting-latin-american-science-with-blockchain-innovations/315","pubDate":"Mon, 03 Jun 2024 03:45:16 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"discuss.octant.app-topic-315"},"source":{"@url":"https://discuss.octant.app/t/desci-latam-connecting-latin-american-science-with-blockchain-innovations/315.rss","#text":"DeSci LATAM: Connecting Latin American Science with Blockchain Innovations"}},{"title":"Blockscout Open Source Block Explorer","dc:creator":"andrewg1","category":"Public Good Projects Discussion","description":"<h2><a name=\"what-is-blockscout-and-why-is-it-a-public-good-1\" class=\"anchor\" href=\"https://discuss.octant.app#what-is-blockscout-and-why-is-it-a-public-good-1\"></a>What is Blockscout and why is it a public good?</h2>\n<p>Blockscout is an open-source explorer serving the Ethereum community. Blockscout has been active since 2018 and has made considerable improvements to the product over the past 1 1/2 years to support the vast array of chains entering the ecosytem.  Any project can fork Blockscout and use it as a block explorer for their network free of charge. This includes optimistic rollups, zk rollups, L3s, Bitcoin L2s, appchains - all shapes and sizes of EVM-compatible chain.</p>\n<p>Blockscout runs Ethereum instances as a public good (including <a href=\"https://eth.blockscout.com/\" rel=\"noopener nofollow ugc\">Mainnet</a> , <a href=\"https://eth-sepolia.blockscout.com/\" rel=\"noopener nofollow ugc\">Sepolia</a> and <a href=\"https://eth-holesky.blockscout.com/\" rel=\"noopener nofollow ugc\">Holesky</a>) without ongoing compensation. This is paramount for transparency and redundancy and provides many useful tools for developers (APIs, contract verification) as well as transaction tracking capabilities for the blockchain public.</p>\n<p>Paid hosting services are offered for networks who want to offload archive node and explorer hosting, customizations, maintenance and upgrades to our team of experts and optimized infrastructure. At any given time projects who choose the EaaS or RaaS services may have access to alpha features in development (such as an advanced admin panel and transaction interpreter). However, once new features are thoroughly tested they are released to the open-source community for unlimited use. Currently, all features that have undergone the required QA process are available to the public.</p>\n<h2><a name=\"primary-funding-sources-2\" class=\"anchor\" href=\"https://discuss.octant.app#primary-funding-sources-2\"></a>Primary funding sources</h2>\n<p>Grant funding, user support and donations, and our EaaS offering are our primary revenue sources.</p>\n<p>These include previous grants with approximate funding amounts from the EthPrize Foundation (250K), the Ethereum Foundation (80K), Gitcoin (80K), Optimism RetroPGF (265 OP), ETC DAO (50K), Gnosis DAO (300K), and many projects who we’ve collaborated with to provide EaaS and/or development services.</p>\n<p>Any additional funding we receive from this campaign will go towards defraying infrastructure costs for our public goods instances and developing new features to support open-source exploration.</p>\n<h2><a name=\"project-milestones-and-roadmap-3\" class=\"anchor\" href=\"https://discuss.octant.app#project-milestones-and-roadmap-3\"></a>Project milestones and roadmap</h2>\n<p>We have achieved many milestones in the past year, notably a large push towards feature parity with Etherscan, support for all EIPs (<a href=\"https://www.blog.blockscout.com/blobs/\" rel=\"noopener nofollow ugc\">including 4844</a>), a standalone smart contract verification service, <a href=\"https://www.blog.blockscout.com/ui-features/\" rel=\"noopener nofollow ugc\">major UI upgrades</a> and <a href=\"https://www.blog.blockscout.com/performance-update/\" rel=\"noopener nofollow ugc\">major performance optimizations</a>. We will continue developing features as required and requested to support developers and blockchain users.</p>\n<p>We are working on a more defined roadmap for the remainder of the year which will be published soon and include items such as: Account Abstraction (AA) support, Advanced ENS support, Admin panel improvements for projects, Additional DA support ( EigenDA, Celestia), DAppscout marketplace upgrades and more developer tooling additions and improvements.</p>\n<p>Our current roadmap is available here: <a href=\"https://docs.blockscout.com/about/roadmap\" class=\"inline-onebox\" rel=\"noopener nofollow ugc\">Roadmap | Blockscout</a></p>\n<h2><a name=\"additional-projects-4\" class=\"anchor\" href=\"https://discuss.octant.app#additional-projects-4\"></a>Additional Projects</h2>\n<p>We are also founding members of the Verifier Alliance, an ecosystem collective aiming for easy, unified, and open access to the source-code of EVM smart contracts. We are committed to continued growth of this collective to provide universal smart contract transparency and availability. <a href=\"https://verifieralliance.org/who.html\" rel=\"noopener nofollow ugc\">Learn more</a>.</p>\n<h2><a name=\"blockscout-team-5\" class=\"anchor\" href=\"https://discuss.octant.app#blockscout-team-5\"></a>Blockscout team:</h2>\n<ul>\n<li><strong>25+ Developers &amp; Researchers</strong>: Our team is heavily focused on development and research and is primarily made up of developers working to support new features (like DA, AA, all EIPs etc). Please see our github for more insights into this amazing group of builders.</li>\n</ul>\n<p>In addition, Blockscout’s team includes the following individuals:</p>\n<ul>\n<li><strong>Igor Barinov,</strong> Founder: Igor has been implementing novel solutions for Ethereum-based projects for the past 8+ years. He’s led devops and strategy for multiple organizations and is currently focused on multi-chain functionality and post-merge implications for data exploration.</li>\n<li><strong>Ulyana Skladchikova</strong>, Head of Product: With a background in software development and blockchain technology, Ulyana manages all aspects of the Blockscout ecosystem to prioritize features, create a streamlined workflow, and ensure timely delivery.</li>\n<li><strong>Victor Baranov</strong>, Principal Architect: Victor has been the principal architect on Blockscout for more than 5 years. He manages the core development team and leads all development efforts.</li>\n<li><strong>Kirill Fedoseev</strong>, Head of Research: Kirill is responsible for researching new features and implementing novel design mechanisms as they relate to specific chain requirements (ie zk, DA etc).</li>\n<li><strong>Tatyana Gladilina</strong>, Head of Design: Tatyana is the lead designer for Blockscout. She is currently working on an updated UI, designed from the ground up to greatly improve the user experience and create a clean, modern interface.</li>\n<li><strong>Mike Krupin</strong>, DAppscout senior product manager: Mike is in charge of growing the new DAppscout marketplace, a comprehensive platform within Blockscout for viewing and interacting with on-chain applications.</li>\n<li><strong>Andrew Gross</strong>, Head of Technical Comms: Andrew oversees technical documentation for Blockscout and heads the technical marketing and content creation teams.</li>\n<li><strong>Mojmir Racak</strong>, Head of Business Development: Mojmir interfaces with projects and the community to coordinate teams, educate users and bring on new networks. He is the primary point of contact for questions and concerns and the go-to resource for all things Blockscout.</li>\n</ul>\n<h2><a name=\"social-credibility-development-progress-awards-notable-github-commits-referrals-6\" class=\"anchor\" href=\"https://discuss.octant.app#social-credibility-development-progress-awards-notable-github-commits-referrals-6\"></a>Social Credibility (development progress, awards, notable GitHub commits, referrals)</h2>\n<p>Blockscout is used by nearly 600 networks that we are aware of. We constantly find new instances in the wild and are the go-to explorer for RaaS providers including Conduit, Gelato, Caldera, Altlayer and more. <a href=\"https://docs.google.com/spreadsheets/d/1gGgpymFvQL48lxoR-yBRBx3ZV0w8ltzH-G5rl1Y-540/edit?usp=sharing\" rel=\"noopener nofollow ugc\">Current list of known networks</a></p>\n<h2><a name=\"the-importance-of-open-source-explorers-7\" class=\"anchor\" href=\"https://discuss.octant.app#the-importance-of-open-source-explorers-7\"></a>The importance of open-source explorers</h2>\n<p>Public blockchains are decentralized and available to everyone, and blockchain data access and tooling should also meet this standard! Blockchain explorers are not meant to be siloed in gated, closed-source environments, but transparent and available to all. They are meant to serve vital information quickly and effectively, be auditable and customizable by the community, and provide much needed infrastructure redundancy when required. Just like we need multiple clients for Ethereum, we need multiple explorers and tooling diversity for the Ethereum ecosystem. If one goes down or contains inaccuracies, others are there to step in and support.</p>\n<p>We appreciate your support of this and other vital infrastructure for a decentralized future!!</p>\n<h2><a name=\"project-llinks-8\" class=\"anchor\" href=\"https://discuss.octant.app#project-llinks-8\"></a>Project Llinks</h2>\n<ul>\n<li>Twitter: <a href=\"https://twitter.com/blockscoutcom\" class=\"inline-onebox\" rel=\"noopener nofollow ugc\">x.com</a></li>\n<li>Github: <a href=\"https://github.com/blockscout\" class=\"inline-onebox\" rel=\"noopener nofollow ugc\">Blockscout · GitHub</a></li>\n<li>Discord: <a href=\"https://discord.gg/blockscout\" class=\"inline-onebox\" rel=\"noopener nofollow ugc\">Blockscout</a> - Discord Contact (.mojmir)</li>\n<li>Website: <a href=\"https://www.blockscout.com/\" rel=\"noopener nofollow ugc\">https://www.blockscout.com/</a></li>\n</ul>\n            <p><small>1 post - 1 participant</small></p>\n            <p><a href=\"https://discuss.octant.app/t/blockscout-open-source-block-explorer/313\">Read full topic</a></p>","link":"https://discuss.octant.app/t/blockscout-open-source-block-explorer/313","pubDate":"Sun, 02 Jun 2024 23:10:58 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"discuss.octant.app-topic-313"},"source":{"@url":"https://discuss.octant.app/t/blockscout-open-source-block-explorer/313.rss","#text":"Blockscout Open Source Block Explorer"}},{"title":"Blockchain Innovation Hub: Abakhus Protocol to bring privacy to Golem Network","dc:creator":"amrdavila","category":"Public Good Projects Discussion","description":"<h3><a name=\"project-description-and-why-we-classify-it-as-a-public-good-1\" class=\"anchor\" href=\"https://discuss.octant.app#project-description-and-why-we-classify-it-as-a-public-good-1\"></a>Project Description and why we classify it as a Public Good</h3>\n<p>Privacy is a human right, widely recognized by United Nations (<a href=\"https://www.un.org/en/delegate/data-privacy-right-read-without-being-read\" class=\"inline-onebox\" rel=\"noopener nofollow ugc\">Data privacy: A right to read without being read | United Nations</a>) and is also considered a public good in Gitcoin definitions of public goods (<a href=\"https://support.gitcoin.co/gitcoin-knowledge-base/gitcoin-grants/general-questions/what-are-public-goods\" class=\"inline-onebox\" rel=\"noopener nofollow ugc\">What are Public Goods? | Gitcoin support</a>) as well as Joshua A.T. Fairfield &amp; Christoph Engel, Privacy as a Public Good, 65 Duke L.J. 385 (2015) (<a href=\"https://dlj.law.duke.edu/article/privacy-as-a-public-good-fairfield-vol65-iss3/\" class=\"inline-onebox\" rel=\"noopener nofollow ugc\">Privacy as a Public Good | Duke Law Journal</a>). Blockchain data and metadata is largely and by default open and transparent, then there is a need for privacy-preserving features for dApps and projects that deal with sensitive data, this is especially true in order to comply with the European GDPR, Brazilian LGPD etc. We developed the Abakhus protocol (<a href=\"https://abakhus.io\" rel=\"noopener nofollow ugc\">https://abakhus.io</a>) that started as a dApp for the tokenization of medical records and evolved to a tokenization platform with an API and library (<a href=\"https://github.com/Abakhus/\" class=\"inline-onebox\" rel=\"noopener nofollow ugc\">Abakhus · GitHub</a>) able to offer privacy-preserving features to data/metadata to many other dApps and Web3 projects. The project we are submitting to Epoch 4 is to start the integration of the Abakhus protocol with the Golem Network, in order to provide several privacy-preserving features to data/metadata generated or needed by Golem Network end-users.</p>\n<h3><a name=\"project-funding-sources-2\" class=\"anchor\" href=\"https://discuss.octant.app#project-funding-sources-2\"></a>Project funding sources</h3>\n<p>Grants funding, User donations</p>\n<h3><a name=\"how-much-you-have-raised-from-each-of-your-funding-sources-and-from-who-3\" class=\"anchor\" href=\"https://discuss.octant.app#how-much-you-have-raised-from-each-of-your-funding-sources-and-from-who-3\"></a>How much you have raised from each of your funding sources and from who</h3>\n<p>12.000 $SCRT from a Secret Network Ecosystem Grant to develop Abakhus dApp from scratch and deploy in Secret Network mainnet. The recently developed Abakhus API and AbakhusJS have not received any support or funding so far.</p>\n<h3><a name=\"project-roadmap-4\" class=\"anchor\" href=\"https://discuss.octant.app#project-roadmap-4\"></a>Project roadmap:</h3>\n<p>Month 1. Planning and Design: Define library objectives, use cases, and key abstractions. Design the architecture incorporating the required design patterns.<br>\nMonth 2. Development: Implement the Abstract Factory for creating blockchain clients. Develop Factory Methods for different network clients. Implement Singleton for client instances. Use Composite for complex blockchain objects. Integrate Observer for event handling and notifications. Define TypeScript interfaces and types for clarity and safety.<br>\nMonth 3. Testing and Optimization: Conduct unit and integration tests for each component. Optimize performance and memory usage.<br>\nMonth 4. Documentation: Create thorough documentation including code examples, usage guidelines, and API references.<br>\nMonth 5. Release and Maintenance: Release the library with versioning and changelogs. Monitor user feedback and make continuous improvements. Maintain compatibility with new blockchain protocols and updates.</p>\n<h3><a name=\"milestones-previously-achieved-5\" class=\"anchor\" href=\"https://discuss.octant.app#milestones-previously-achieved-5\"></a>Milestones previously achieved</h3>\n<p>(i) Abakhus dApp was initially developed in 2022 and deployed at Secret Network mainnet in November 2023</p>\n<p>(ii) Abakhus API and AbakhusJS library initial versions were developed in Q1-Q2 2024</p>\n<p>(iii) Blockchain Innovation Hub (the first of its kind in Brazil) officially launched on March 19th 2024 (<a href=\"https://github.com/iberoam/blockchain-innovation-hub\" class=\"inline-onebox\" rel=\"noopener nofollow ugc\">GitHub - iberoam/blockchain-innovation-hub: Blockchain Innovation Hub initiative</a>)</p>\n<p>(iv) 6 proposals (in need of privacy-preserving features) selected to be mentored in the Hacker House first cohort. New dApps prototypes will be one of the Hacker House deliverables (<a href=\"https://x.com/iberoam_xyz/status/1785410632583381140\" class=\"inline-onebox\" rel=\"noopener nofollow ugc\">x.com</a>)</p>\n<h3><a name=\"milestones-wed-like-to-achieve-6\" class=\"anchor\" href=\"https://discuss.octant.app#milestones-wed-like-to-achieve-6\"></a>Milestones we’d like to achieve</h3>\n<p>(i) Month 1. Planning and Design: Define library objectives, use cases, and key abstractions. Design the architecture incorporating the required design patterns.</p>\n<p>(ii) Month 2. Development: Implement the Abstract Factory for creating blockchain clients. Develop Factory Methods for different network clients. Implement Singleton for client instances. Use Composite for complex blockchain objects. Integrate Observer for event handling and notifications. Define TypeScript interfaces and types for clarity and safety.</p>\n<p>(iii) Month 3. Testing and Optimization: Conduct unit and integration tests for each component. Optimize performance and memory usage.</p>\n<p>(iv) Month 4. Documentation: Create thorough documentation including code examples, usage guidelines, and API references.</p>\n<p>(v) Month 5. Release and Maintenance: Release the library with versioning and changelogs. Monitor user feedback and make continuous improvements. Maintain compatibility with new blockchain protocols and updates.</p>\n<h3><a name=\"funding-goal-and-budget-7\" class=\"anchor\" href=\"https://discuss.octant.app#funding-goal-and-budget-7\"></a>Funding goal and budget</h3>\n<p>A total of $11k to improve the current AbakhusJS (<a href=\"https://github.com/Abakhus/AbakhusJS\" class=\"inline-onebox\" rel=\"noopener nofollow ugc\">GitHub - Abakhus/AbakhusJS: A typescript library to interact with several blockchain networks</a>) version to support EVM and especially Golem Network</p>\n<p>The Grant will be used to hire 2 junior devs for a total of 5 months to help us to achieve the 5 proposed milestones.</p>\n<h3><a name=\"team-8\" class=\"anchor\" href=\"https://discuss.octant.app#team-8\"></a>Team</h3>\n<p>Alberto Dávila<br>\nLinkedin: <a href=\"https://www.linkedin.com/in/amrdavila\" rel=\"noopener nofollow ugc\">https://www.linkedin.com/in/amrdavila</a> SourceForge: <a href=\"https://sourceforge.net/u/amrdavila/profile/\" class=\"inline-onebox\" rel=\"noopener nofollow ugc\">amrdavila / Profile</a></p>\n<p>Alberto has a Biological Science diploma and a PhD on Celullar and Molecular Biology. He has 20 years of experience in data analysis, especially biological data in the bioinformatics/genomics field and is the co-founder of IberoAm and DeSci Rio blockchain initiatives. Alberto co-led Abakhus development and is also the Rio de Janeiro Polygon Guild Mage (equivalent to a Polygon Community Manager), OP Delegate and the co-founder of the Blockchain Innovation Hub (the first of its kind in Brazil): <a href=\"https://x.com/abakhus/status/1763547619454837040\" class=\"inline-onebox\" rel=\"noopener nofollow ugc\">x.com</a></p>\n<p>Rodrigo Jardim<br>\nLinkedin: <a href=\"https://www.linkedin.com/in/rodrigo-jardim-653a7050/\" rel=\"noopener nofollow ugc\">https://www.linkedin.com/in/rodrigo-jardim-653a7050/</a></p>\n<p>Rodrigo has a Computer Science diploma and a PhD on Computational and System Biology. He has more than 25 years of coding experience in the life science field, he led the Abakhus development and is the co-founder of IberoAm and DeSci Rio blockchain initiatives and the co-founder of the Blockchain Innovation Hub: <a href=\"https://x.com/abakhus/status/1763547619454837040\" class=\"inline-onebox\" rel=\"noopener nofollow ugc\">x.com</a></p>\n<h3><a name=\"team-experience-9\" class=\"anchor\" href=\"https://discuss.octant.app#team-experience-9\"></a>Team experience</h3>\n<p>Lumeeira startup: <a href=\"https://lumeeira.io\" rel=\"noopener nofollow ugc\">https://lumeeira.io</a> (focused on Data Science and Blockchain)<br>\nDeSci Rio: <a href=\"https://lu.ma/descirio2024\" class=\"inline-onebox\" rel=\"noopener nofollow ugc\">DeSci Rio 2024: Inovação e Impacto · Luma</a><br>\nIberoAm: <a href=\"https://linktr.ee/iberoam\" class=\"inline-onebox\" rel=\"noopener nofollow ugc\">iberoam | Instagram | Linktree</a> <a href=\"https://www.youtube.com/@iberoamerica6121/streams\" rel=\"noopener nofollow ugc\">https://www.youtube.com/@iberoamerica6121/streams</a><br>\nBlockchain Innovation Hub: <a href=\"https://www.linkedin.com/posts/amrdavila_after-several-weeks-of-discussions-and-adjustments-activity-7169113846912016385-xV81\" class=\"inline-onebox\" rel=\"noopener nofollow ugc\">[Video] Alberto D. on LinkedIn: After several weeks of discussions and adjustments, we (together with… | 12 comments</a> <a href=\"https://x.com/iberoam_xyz/status/1770246018006761505\" class=\"inline-onebox\" rel=\"noopener nofollow ugc\">x.com</a><br>\nMeeting: “From Genomes and Privacy to Social Impact using Blockchain” hosted at the Technological Park of the Rio de Janeiro Federal University <a href=\"https://www.youtube.com/watch?v=FxnJ-pJgRsU\" rel=\"noopener nofollow ugc\">https://www.youtube.com/watch?v=FxnJ-pJgRsU</a><br>\nOngoing first Hacker House edition (2024-1), with 6 projects selected: <a href=\"https://github.com/iberoam/hacker-house\" class=\"inline-onebox\" rel=\"noopener nofollow ugc\">GitHub - iberoam/hacker-house: A Hacker House promoted by the Blockchain Innovation Hub</a><br>\nOptimism Grant approved: “Optimism at Rio de Janeiro Federal Universities: a collaboration with the Blockchain Innovation Hub”: <a href=\"https://www.linkedin.com/feed/update/urn:li:activity:7194315240723927040\" rel=\"noopener nofollow ugc\">https://www.linkedin.com/feed/update/urn:li:activity:7194315240723927040</a></p>\n<h3><a name=\"social-credibility-10\" class=\"anchor\" href=\"https://discuss.octant.app#social-credibility-10\"></a>Social credibility</h3>\n<p>Project social media handlers and links (including Gitcoin and Giveth QF rounds participation) are all listed here:</p><aside class=\"onebox allowlistedgeneric\" data-onebox-src=\"https://linktr.ee/iberoam\">\n  <header class=\"source\">\n      <img src=\"https://europe1.discourse-cdn.com/standard21/uploads/octant/original/1X/67c63ca1920efe896ca6a10c9250d1e56349eabf.png\" class=\"site-icon\" data-dominant-color=\"43E660\" width=\"16\" height=\"16\">\n\n      <a href=\"https://linktr.ee/iberoam\" target=\"_blank\" rel=\"noopener nofollow ugc\">Linktree</a>\n  </header>\n\n  <article class=\"onebox-body\">\n    <img width=\"500\" height=\"500\" src=\"https://europe1.discourse-cdn.com/standard21/uploads/octant/optimized/1X/2bcbd2282b839f5f77dc4e06daa7800602defe4d_2_500x500.jpeg\" class=\"thumbnail onebox-avatar\" data-dominant-color=\"4D077F\">\n\n<h3><a href=\"https://linktr.ee/iberoam\" target=\"_blank\" rel=\"noopener nofollow ugc\">iberoam | Instagram | Linktree</a></h3>\n\n  <p>Blockchain and decentralization for Iberoamerica</p>\n\n\n  </article>\n\n  <div class=\"onebox-metadata\">\n    \n    \n  </div>\n\n  <div style=\"clear: both\"></div>\n</aside>\n<p>\nGiveth: <a href=\"https://giveth.io/project/iberoam\" class=\"inline-onebox\" rel=\"noopener nofollow ugc\">IberoAm |&lt;!-- --&gt; Giveth</a><br>\nGitcoin: <a href=\"https://explorer.gitcoin.co/#/round/42161/39/13\" class=\"inline-onebox\" rel=\"noopener nofollow ugc\">Gitcoin | Explorer</a><br>\nBlockchain Innovation Hub:<br>\n<a href=\"https://github.com/iberoam/blockchain-innovation-hub\" class=\"inline-onebox\" rel=\"noopener nofollow ugc\">GitHub - iberoam/blockchain-innovation-hub: Blockchain Innovation Hub initiative</a><br>\nAbakhus on X:<br>\n<a href=\"https://x.com/abakhus\" class=\"inline-onebox\" rel=\"noopener nofollow ugc\">x.com</a></p>\n<h3><a name=\"whys-our-project-important-11\" class=\"anchor\" href=\"https://discuss.octant.app#whys-our-project-important-11\"></a>Why’s our project important?</h3>\n<p>Because privacy is badly needed in many Web3 projects/dApps and especially in new projects using AI as it is the case in Golem Network that is just offering GPU infra-structure for AI-based experiments.</p>\n            <p><small>1 post - 1 participant</small></p>\n            <p><a href=\"https://discuss.octant.app/t/blockchain-innovation-hub-abakhus-protocol-to-bring-privacy-to-golem-network/312\">Read full topic</a></p>","link":"https://discuss.octant.app/t/blockchain-innovation-hub-abakhus-protocol-to-bring-privacy-to-golem-network/312","pubDate":"Sun, 02 Jun 2024 22:38:42 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"discuss.octant.app-topic-312"},"source":{"@url":"https://discuss.octant.app/t/blockchain-innovation-hub-abakhus-protocol-to-bring-privacy-to-golem-network/312.rss","#text":"Blockchain Innovation Hub: Abakhus Protocol to bring privacy to Golem Network"}},{"title":"Synpress - e2e testing framework for dApps","dc:creator":"drptbl","category":"Public Good Projects Discussion","description":"<p><strong>Project Name:</strong> Synpress</p>\n<p><strong>Project Description:</strong></p>\n<p>Synpress is a free and open-source end-to-end (E2E) testing library designed specifically for Web3 decentralized applications (dApps). It empowers developers to build robust, reliable, and secure dapps by simplifying complex testing scenarios involving:</p>\n<ul>\n<li><strong>Wallet Integrations:</strong> Seamlessly test interactions with popular Web3 wallets like MetaMask, ensuring smooth user experiences.</li>\n<li><strong>Smart Contract Interactions:</strong>  Validate dApp interactions with smart contracts directly, verifying correct functionality and preventing costly errors.</li>\n<li><strong>Blockchain Events:</strong> Test how dApps respond to events on the blockchain, such as transaction confirmations or state changes.</li>\n</ul>\n<p><strong>Synpress as a Public Good:</strong></p>\n<p>Synpress aligns with the principles of a public good through its:</p>\n<ul>\n<li><strong>Open-Source Nature:</strong>  Synpress is 100% open-source, making it freely accessible to everyone.</li>\n<li><strong>Focus on dApp Quality:</strong> By simplifying E2E testing, Synpress contributes to the creation of higher-quality dApps - that are more resistant to bugs, security vulnerabilities, and usability issues, ultimately benefiting the entire Web3 ecosystem.</li>\n<li><strong>Empowerment of Developers:</strong>  Synpress removes complexities from dApp testing, making it accessible to a wider range of developers and QA Engineers.</li>\n</ul>\n<p><strong>Main Project Funding Sources:</strong></p>\n<p>Synpress primary (<em>and only</em>) funding source is grants. It has never received any other type of funding.</p>\n<p><strong>Grant Funding:</strong></p>\n<ul>\n<li>Synpress has received approximately 90,000 OP tokens from both RetroPGF <span class=\"hashtag-raw\">#2</span> and RetroPGF <span class=\"hashtag-raw\">#3</span>.</li>\n</ul>\n<p><strong>Project Roadmap:</strong></p>\n<ul>\n<li><a href=\"https://lindie.app/share/5ffb9e1d3e4b69c05fbdb11b7fb56e6c6f301183\" class=\"inline-onebox\" rel=\"noopener nofollow ugc\">Roadmap</a></li>\n<li><a href=\"https://github.com/orgs/Synthetixio/projects/14\" class=\"inline-onebox\" rel=\"noopener nofollow ugc\">Synpress · GitHub</a></li>\n</ul>\n<p><strong>Milestones Achieved:</strong></p>\n<ul>\n<li><strong>Full Playwright Integration:</strong>  Synpress is deeply integrated with Playwright, a leading modern E2E testing framework, leveraging its power while adding Web3-specific capabilities.</li>\n<li><strong>Extensive MetaMask Support:</strong>  A robust API enables testing a wide range of MetaMask interactions, from wallet importing and network additions to transaction confirmations and message signing.</li>\n<li><strong>Mocked Wallet Functionality (EthereumWalletMock):</strong> Allows for testing dApp logic without a real wallet, speeding up tests and improving isolation.</li>\n<li><strong>Wallet Cache:</strong>  Caches pre-configured browser contexts with different wallet states for faster test execution.</li>\n<li><strong>Anvil Integration:</strong>  Built-in support for Anvil, a local Ethereum testing environment, simplifies testing against a test blockchain.</li>\n<li><strong>TypeScript Support:</strong>  Synpress is written in TypeScript, providing a strongly typed API and enhanced developer experience.</li>\n</ul>\n<p><strong>Future Milestones:</strong></p>\n<ul>\n<li><strong>Broader Framework Support:</strong>  Integrate with Cypress and potentially other testing frameworks (TestCafe, <a href=\"http://webdriver.io\" rel=\"noopener nofollow ugc\">webdriver.io</a>).</li>\n<li><strong>Enhanced Wallet Interactions:</strong>  Support additional wallets (Phantom, Keplr, Coinbase Wallet, etc.) and explore deeper wallet API integrations for more comprehensive testing scenarios.</li>\n<li><strong>Improved Developer Experience:</strong>  Simplify wallet setup, enhance debugging tools, and provide more real-world examples and tutorials.</li>\n<li><strong>Staying Ahead of the Curve:</strong>  Support both EVM and non-EVM blockchains and adapt to new Web3 standards and technologies.</li>\n<li><strong>Community Building:</strong>  Grow the contributor base and foster a thriving Synpress community.</li>\n</ul>\n<p><strong>Funding Goal:</strong></p>\n<p>Synpress is seeking funding to achieve its goals of becoming the leading Web3 dApp testing solution. The funds will be used to support the development of the milestones described above.</p>\n<p><strong>Team:</strong></p>\n<ul>\n<li><strong>Jakub:</strong>  Project manager and core developer, active in Web3 since 2020, full-stack engineer at Nash, core contributor at Synthetix (<a href=\"https://github.com/drptbl\" rel=\"noopener nofollow ugc\">GitHub profile</a>, <a href=\"https://twitter.com/DRPTBL\" rel=\"noopener nofollow ugc\">Twitter</a>)</li>\n<li><strong>Mateusz:</strong>  Core developer, active in Web3 since 2022, full-stack engineer at Spectra (<a href=\"https://github.com/matstyler\" rel=\"noopener nofollow ugc\">GitHub profile</a>)</li>\n<li><strong>Sero:</strong>  Core developer, active in Web3 since 2022, full-stack engineer, contractor across various Web3 projects (<a href=\"https://github.com/Seroxdesign\" rel=\"noopener nofollow ugc\">GitHub profile</a>, <a href=\"https://x.com/0x_Sero\" rel=\"noopener nofollow ugc\">Twitter</a>)</li>\n</ul>\n<p><strong>Social Credibility:</strong></p>\n<ul>\n<li><a href=\"https://round3.optimism.io/projects/0x7992f31ac0db3aad3dc7edead1a3670a6be071703212129f3a396c043cb23e84\" rel=\"noopener nofollow ugc\">RetroPGF Round 3 project page</a></li>\n<li><a href=\"https://www.npmjs.com/package/@synthetixio/synpress\" rel=\"noopener nofollow ugc\">NPM package page</a></li>\n<li><a href=\"https://github.com/Synthetixio/synpress/network/dependents?package_id=UGFja2FnZS0xNjIwNjMzMjE1\" rel=\"noopener nofollow ugc\">GitHub dependents</a></li>\n</ul>\n<p><strong>Project Links:</strong></p>\n<ul>\n<li><strong>Twitter:</strong> <a href=\"https://twitter.com/Synpress_\" rel=\"noopener nofollow ugc\">Synpress_</a></li>\n<li><strong>GitHub:</strong> <a href=\"https://github.com/Synthetixio/synpress\" rel=\"noopener nofollow ugc\">https://github.com/Synthetixio/synpress</a></li>\n<li><strong>Discord:</strong> <a href=\"https://discord.com/invite/XhZKSRGtWc\" rel=\"noopener nofollow ugc\">https://discord.com/invite/XhZKSRGtWc</a></li>\n<li><strong>Website:</strong> <a href=\"https://synpress.io/\" rel=\"noopener nofollow ugc\">https://synpress.io/</a></li>\n</ul>\n<p><strong>Contact Information:</strong></p>\n<ul>\n<li><strong>Discord:</strong> jakubsynthetix</li>\n<li><strong>Telegram:</strong> DRPTBL</li>\n</ul>\n            <p><small>1 post - 1 participant</small></p>\n            <p><a href=\"https://discuss.octant.app/t/synpress-e2e-testing-framework-for-dapps/310\">Read full topic</a></p>","link":"https://discuss.octant.app/t/synpress-e2e-testing-framework-for-dapps/310","pubDate":"Sun, 02 Jun 2024 12:06:45 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"discuss.octant.app-topic-310"},"source":{"@url":"https://discuss.octant.app/t/synpress-e2e-testing-framework-for-dapps/310.rss","#text":"Synpress - e2e testing framework for dApps"}},{"title":"TogetherCrew: Grow your Farcaster Community,","dc:creator":"katerina","category":"Public Good Projects Discussion","description":"<h2><a name=\"project-name-1\" class=\"anchor\" href=\"https://discuss.octant.app#project-name-1\"></a>Project name</h2>\n<p>TogetherCrew</p>\n<h2><a name=\"project-description-and-why-its-classified-as-a-public-good-2\" class=\"anchor\" href=\"https://discuss.octant.app#project-description-and-why-its-classified-as-a-public-good-2\"></a>Project Description and why it’s classified as a Public Good</h2>\n<p>TogetherCrew is a community success tool supporting community builders in their day-to-day tasks with insights and automations. We contribute to a sustainable growth of communities without burning out community builders.</p>\n<p>We offer two sets of features: Analytics (View your data) and Actions (take actions based on your data). For example, with our dashboard, community builders quickly know who the active members are and spot trends. To bridge the gap between data and impact, we offer several features that build on top of our analytics: smart announcements, reputation NFT, Hivemind (Q&amp;A-bot).</p>\n<p>We kicked off our project in May 2022 with a deep dive into community science. This was funded by Aragon. Since then we have continued to fund our efforts through grants (e.g., Aave, MetaCartel, Optimism, Web3 foundation, SingularityNet). Summer 2023 we launched our app, providing analytics to communities on Discord. Since then we have further developed our backend, increasing the efficacy of data ingestion and computation, and added new metrics to our dashboard. We are currently completing a grant by SingularityNet for developing an LLM bot (HiveMind), and another grant by Arbitrum for developing an off-chain reputation score that is displayed onchain (dynamic NFT). As part of these grants we are integrating data from other community platforms (Discourse, Telegram).</p>\n<p>We are building TogetherCrew as an open source project, including our metrics. As PhDs and scientists, we know that the data that feeds our algorithm isn’t ours, but is owned by the community. Our vision is to enable communities to build their own mini-apps powered by their own data. To enable this, we are indexing and structuring the conversations that are happening on various communication platforms. In addition to this, our community engagement metrics adopt a human approach, by considering activity over a longer timespan. For example, members do not need to post every day to be considered active. We know that live happens outside of community platforms.</p>\n<h2><a name=\"main-project-funding-sources-3\" class=\"anchor\" href=\"https://discuss.octant.app#main-project-funding-sources-3\"></a>Main Project Funding Sources</h2>\n<p>We have received grants and completed work for</p>\n<ul>\n<li><a href=\"https://aavegrants.org/check-out-our-grantees-wip/untitled/community-health-analytics\" rel=\"noopener nofollow ugc\">Aave</a></li>\n<li><a href=\"https://forum.aragon.org/t/real-time-community-health-analytics/3472\" rel=\"noopener nofollow ugc\">Aragon</a></li>\n<li><a href=\"https://mirror.xyz/prezenti.eth/lQi3cg5CwTXVFeOGODSB3JYUPNAxRzNufPo20D-khfw\" rel=\"noopener nofollow ugc\">Celo</a></li>\n<li><a href=\"https://forum.metacartel.org/t/grant-request-community-health-a-project-by-rndao/2354\" rel=\"noopener nofollow ugc\">MetaCartel</a></li>\n<li><a href=\"https://forum.pokt.network/t/allocated-priority-pocket-network-ecosystem-metrics-dashboard/4594/10\" rel=\"noopener nofollow ugc\">Pokt</a></li>\n<li><a href=\"https://github.com/w3f/Grants-Program/blob/master/applications/community-health-check.md\" rel=\"noopener nofollow ugc\">Web3Foundation</a></li>\n<li>Near (no online link available)</li>\n<li><a href=\"https://deepfunding.ai/proposal/hivemind-augmented-qa-bot-and-p2p-knowledge-base/\" rel=\"noopener nofollow ugc\">SingularityNet</a> - work in progress</li>\n<li><a href=\"https://github.com/ethereum-optimism/ecosystem-contributions/issues/2\" rel=\"noopener nofollow ugc\">Optimism</a> - work in progress</li>\n<li><a href=\"https://new.questbook.app/dashboard/?grantId=0x4494cf7375aa61c9a483259737c14b3dba6c04e6&amp;chainId=10&amp;role=builder&amp;proposalId=0x62b\" rel=\"noopener nofollow ugc\">Arbitrum</a> - work in progress</li>\n</ul>\n<h2><a name=\"project-funding-4\" class=\"anchor\" href=\"https://discuss.octant.app#project-funding-4\"></a>Project Funding</h2>\n<p>We are seeking project-specific funding to support the development of a Farcaster pipeline and features. We have two features in mind:</p>\n<h3><a name=\"know-your-community-5\" class=\"anchor\" href=\"https://discuss.octant.app#know-your-community-5\"></a>Know your community</h3>\n<p>This feature is community-leader centric. The admin of the community can turn on this feature, and decides who has access to it. It allows them to</p>\n<ol>\n<li>Receive a quick update on what happened while they were away</li>\n<li>Get more familiar with members by knowing their interests</li>\n</ol>\n<p>This information can be used to develop better resources for the community (content, events etc), spot collaboration opportunities etc.</p>\n<p><em>How we will do this:</em>* We will summarize conversations using the expertise we already developed thanks to HiveMind. These summaries will be send to the user via direct message. The user will decide the timeframe for these summaries, data source (e.g., channel data, channel follower casts, token holder casts), and when the summary should be received. Only admins of the TogetherCrew app will be able to decide the content of the summary and who should receive it.</p>\n<h3><a name=\"friendrecommender-6\" class=\"anchor\" href=\"https://discuss.octant.app#friendrecommender-6\"></a>FriendRecommender</h3>\n<p>This feature is community-member centric. It will be available to everyone on Farcaster, but only use data from communities who use TogetherCrew. This is in line with our principle that a user’s data should not be used without their consent.</p>\n<p>We will create a frame. This frame provides users with a recommendation with whom to connect with. This recommendation is based on previous casts, and matches users based on their similarity of casts. 6</p>\n<h2><a name=\"roadmap-and-milestones-7\" class=\"anchor\" href=\"https://discuss.octant.app#roadmap-and-milestones-7\"></a>Roadmap and Milestones</h2>\n<p>We’re looking for ETH 3 to ETH 5 (USD 18k) in funding to support this development.</p>\n<p><strong>Milestone 1</strong>: Infrastructure Setup<br>\nThe pipeline integrates Neynar webhooks, listening to real-time Farcaster events and storing them in a graph database.</p>\n<p><strong>Milestone 2</strong>: Farcaster Analyzer Pipeline<br>\nThe pipeline transforms Farcaster data into a data format compatible with the TogetherCrew analyzer.</p>\n<p><strong>Milestone 3</strong>: Farcaster LLM Pipeline<br>\nThe pipeline transforms Farcaster data into a data format compatible with the TogetherCrew LLM.</p>\n<p><strong>Milestone 4</strong>: Community summaries<br>\nDesign message scheduler and message parameters build bot that sends DC Test bot Deploy bot</p>\n<p><strong>Milestone 5</strong>: FriendRecommender<br>\nDesign frame flow + parameters + growth/usage strategy</p>\n<h2><a name=\"team-information-8\" class=\"anchor\" href=\"https://discuss.octant.app#team-information-8\"></a>Team Information</h2>\n<p>For this project, the following team members will be core:</p>\n<ul>\n<li><a href=\"https://github.com/amindadgar\" rel=\"noopener nofollow ugc\">Amin</a> will be responsible for the data analytics and LLM work.</li>\n<li><a href=\"https://github.com/Behzad-rabiei\" rel=\"noopener nofollow ugc\">Behzad</a> will be responsible for creating the data pipeline: Backend Engineer with over 5 years of expertise spanning IoT, streaming services, and financial social networks.</li>\n<li>I (Katerina, contact person) and Daniel will be responsible for product development (user experience, research). Cyrille is the tech lead with an eye on making features not overly complex and staying within scope</li>\n</ul>\n<p>Our team also consists of a front-end engineer (Nima), marketing lead (Ashish). We are operating permissionless and regularly use bounty hunters for smaller tasks. This has served us well to overcome bottlenecks and onboard new core contributors.</p>\n<p><strong>Key team members for this project</strong><br>\n<em>Katerina</em> (contact person) - Co-lead TogetherCrew. Ph.D. using social network analysis. Since 2016 she is co-instructing a graduate course on data analytics for HR at Northwestern University. She has also co-organized the Learning in Networks sessions at the International Conference of Social Network Analysis (2018 - 2020), and previously advised a people analytics company on social network metrics. Twitter: <a href=\"http://twitter.com/katerinabohlec\" rel=\"noopener nofollow ugc\">twitter.com/katerinabohlec</a> Linkedin: <a href=\"http://linkedin.com/in/katerinab\" rel=\"noopener nofollow ugc\">linkedin.com/in/katerinab</a></p>\n<p>Github: <a href=\"https://github.com/katerinabc\" class=\"inline-onebox\" rel=\"noopener nofollow ugc\">katerinabc · GitHub</a></p>\n<p><em>Danielo</em> (product lead) - Instigator at RnDAO and CoLead at TogetherCrew. Previously, Head of Governance at Aragon, 8 years experience in Organization Design consulting (clients include Google, BCG, Daymler, The UN, and multiple startups), and visiting lecturer at Oxford University. Twitter: <a href=\"https://twitter.com/_Daniel_Ospina\" class=\"inline-onebox\" rel=\"noopener nofollow ugc\">x.com</a> LinkedIn: <a href=\"https://www.linkedin.com/in/conductal/\" rel=\"noopener nofollow ugc\">https://www.linkedin.com/in/conductal/</a></p>\n<p><em>Cyrille Derché</em> - Tech lead at TogetherCrew. Bsc. Computer Science. Ex-Accenture, Co-founder and CTO of SaaS company helping medical device manufacturers deliver product data + documentation to healthcare professionals (handling of sensitive data). Builder of products, processes, and teams.</p>\n<h2><a name=\"social-credibility-9\" class=\"anchor\" href=\"https://discuss.octant.app#social-credibility-9\"></a>Social Credibility</h2>\n<p>We have an active <a href=\"https://twitter.com/together_crew\" rel=\"noopener nofollow ugc\">Twitter</a> presence with bi-monthly Twitter Spaces. I’m also active on <a href=\"https://warpcast.com/kbc\" rel=\"noopener nofollow ugc\">Farcaster</a>, beginning to build our community on it. On <a href=\"https://medium.com/@togethercrew\" rel=\"noopener nofollow ugc\">Medium</a> we post articles to help community builders, and discuss new features.</p>\n<p>Our app is available via <a href=\"https://www.togethercrew.com\" rel=\"noopener nofollow ugc\">www.togethercrew.com</a><br>\nOur code is open-sourced on <a href=\"https://github.com/TogetherCrew\" rel=\"noopener nofollow ugc\">GitHub</a>.</p>\n<h2><a name=\"discord-contact-10\" class=\"anchor\" href=\"https://discuss.octant.app#discord-contact-10\"></a>Discord contact</h2>\n<p>Katerina (<span class=\"mention\">@kbc</span>)</p>\n            <p><small>2 posts - 2 participants</small></p>\n            <p><a href=\"https://discuss.octant.app/t/togethercrew-grow-your-farcaster-community/308\">Read full topic</a></p>","link":"https://discuss.octant.app/t/togethercrew-grow-your-farcaster-community/308","pubDate":"Sun, 02 Jun 2024 10:37:57 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"discuss.octant.app-topic-308"},"source":{"@url":"https://discuss.octant.app/t/togethercrew-grow-your-farcaster-community/308.rss","#text":"TogetherCrew: Grow your Farcaster Community,"}},{"title":"Proposal for Octant x Gitcoin QF Round","dc:creator":"Sov","category":"Public Good Projects Discussion","description":"<p>Hi all!  We just dropped our application for the <strong><a href=\"https://app.charmverse.io/octant-community-fund/proposals/new?template=ebf3e8c3-5012-4c3a-96ad-d4a5a9b8113f\" rel=\"noopener nofollow ugc\">Public Goods Ecosystem Collaboration Proposal</a></strong> and we are excited at the possibility to collaborate on running a round for our shared communities.</p>\n<p>I am including here an outline of our application for the community to see. I am happy to help with any questions or comments.</p>\n<p>Thanks for your consideration!</p>\n<p>-=-</p>\n<p><strong>1. Introduction and Background:</strong><br>\nGitcoin, a pioneer in supporting open-source projects and decentralized communities, proposes a strategic partnership with Octant to implement a Quadratic Funding (QF) round. This initiative targets teams funded by both Octant and Gitcoin, focusing on developer tooling and Web3 infrastructure projects from the recent GG20 round.</p>\n<p><strong>2. Problem Statement:</strong><br>\nThere is a need for sustained support of impactful projects in the web3 space. Many innovative projects struggle with ongoing funding and community support, hindering their development and impact.</p>\n<p><strong>3. Goals and Objectives:</strong></p>\n<ul>\n<li><strong>Primary Goal:</strong> To foster innovation and growth in the web3 ecosystem by funding impactful projects.</li>\n<li><strong>Specific Objectives:</strong>\n<ul>\n<li>Support projects that have shown significant contributions to the web3 ecosystem.</li>\n<li>Encourage community engagement and support through a matching funding mechanism.</li>\n<li>Strengthen the collaboration between Octant and Gitcoin.</li>\n</ul>\n</li>\n</ul>\n<p><strong>4. Project Plan:</strong></p>\n<ul>\n<li><strong>Funding Overview:</strong>\n<ul>\n<li>Gitcoin will match 1 ETH for every 1 ETH contributed by Octant, up to 15 ETH.</li>\n</ul>\n</li>\n<li><strong>QF Mechanism:</strong>\n<ul>\n<li><strong>Description:</strong> Quadratic Funding democratizes financial support, empowering the community to back the projects they believe in. This approach emphasizes the importance of broad community support, making it a highly inclusive funding model.<br>\nImplementation:** Run a QF round to select projects aligning with Octant and Gitcoin’s objectives, amplifying community contributions through a matching mechanism.</li>\n</ul>\n</li>\n<li><strong>Project Selection:</strong><br>\nCriteria:** Projects must be previous Octant and Gitcoin grantees and focus on developer tooling and/or Web3 infrastructure.\n<ul>\n<li><strong>Application Process:</strong> Transparent and detailed application process to ensure fairness in project selection.</li>\n</ul>\n</li>\n<li><strong>Community Involvement:</strong>\n<ul>\n<li><strong>Engagement:</strong> Encourage community participation in the funding process.</li>\n<li><strong>Voting:</strong> Community contributions will determine fund distribution using the quadratic funding formula.</li>\n</ul>\n</li>\n<li><strong>Timeline and Milestones:</strong>\n<ul>\n<li>Detailed timeline for application, selection, funding distribution, and project reporting phases.</li>\n</ul>\n</li>\n</ul>\n<p><strong>5. Budget and Financial Plan:</strong></p>\n<ul>\n<li><strong>Total Matching Pool:</strong> Up to 15 ETH from Gitcoin, with Octant contributing at least 1 ETH for each matched ETH.</li>\n<li><strong>Breakdown of Funding Allocation:</strong>\n<ul>\n<li>QF matching pool distribution based on community voting and project impact.</li>\n</ul>\n</li>\n</ul>\n<p><strong>6. Evaluation and Metrics:</strong></p>\n<ul>\n<li><strong>Impact Measurement:</strong>\n<ul>\n<li>Number of projects supported.</li>\n<li>Community engagement metrics.</li>\n<li>Long-term benefits and sustainability of funded projects.</li>\n</ul>\n</li>\n<li><strong>Criteria for Success:</strong>\n<ul>\n<li>Demonstrated community benefits and impact.</li>\n<li>Achievement of project milestones.</li>\n<li>Positive feedback from the community and stakeholders.</li>\n</ul>\n</li>\n</ul>\n<p><strong>7. Sustainability and Future Plans:</strong></p>\n<ul>\n<li><strong>Long-Term Viability:</strong>\n<ul>\n<li>Ongoing monitoring and support for funded projects.</li>\n<li>Strategies for ensuring projects continue to deliver value to the community.</li>\n</ul>\n</li>\n<li><strong>Future Collaboration:</strong>\n<ul>\n<li>Plans for future QF rounds and other collaborative initiatives between Octant and Gitcoin to further support the Web3 ecosystem.</li>\n</ul>\n</li>\n</ul>\n<h3><a name=\"action-items-1\" class=\"anchor\" href=\"https://discuss.octant.app#action-items-1\"></a>Action Items:</h3>\n<ol>\n<li><strong>Approval:</strong> Seek Octant’s approval for the QF matching proposal.</li>\n<li><strong>Planning:</strong> Collaboratively define the criteria, application process, and timeline.</li>\n<li><strong>Execution:</strong> Launch the QF round with transparent management and oversight.</li>\n</ol>\n            <p><small>1 post - 1 participant</small></p>\n            <p><a href=\"https://discuss.octant.app/t/proposal-for-octant-x-gitcoin-qf-round/303\">Read full topic</a></p>","link":"https://discuss.octant.app/t/proposal-for-octant-x-gitcoin-qf-round/303","pubDate":"Mon, 27 May 2024 17:35:12 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"discuss.octant.app-topic-303"},"source":{"@url":"https://discuss.octant.app/t/proposal-for-octant-x-gitcoin-qf-round/303.rss","#text":"Proposal for Octant x Gitcoin QF Round"}},{"title":"Proposing Gitcoin Tools for Enhanced Funding Mechanisms in the Octant Community Fund","dc:creator":"Sov","category":"Mechanism Design","description":"<p>Hello Octant Community,</p>\n<p>We are thrilled to see the recent announcement regarding the Octant Community Fund and the availability of 50 ETH in grants across various categories. The commitment to continued growth in our ecosystem and supporting public goods is truly inspiring.</p>\n<p>As we look forward to this exciting opportunity, I propose further integrating the advanced funding tools provided by Gitcoin to enhance our grant allocation processes. Specifically, we encourage you to consider Gitcoin’s Quadratic Funding (QF) and EasyRetroPGF for upcoming community fund rounds.</p>\n<p>These tools complement the existing direct grants via Charmverse, introducing innovative funding mechanisms that could significantly benefit the community.</p>\n<p><strong>Why Quadratic Funding?</strong></p>\n<p>Quadratic Funding (QF) is a powerful democratic funding mechanism that allocates resources more equitably. It amplifies the community’s voice, allowing the collective preference to drive funding decisions. This method offers several advantages:</p>\n<ul>\n<li>\n<p><strong>Increased Community Engagement:</strong> Encourages active participation from the community, making everyone’s contributions count.</p>\n</li>\n<li>\n<p><strong>Fair Distribution of Funds:</strong> Ensures a balanced allocation, favoring projects with broad community support.</p>\n</li>\n<li>\n<p><strong>Support for Diverse Projects:</strong> Enables funding for many initiatives, including smaller, impactful projects.</p>\n</li>\n</ul>\n<p><strong>Why EasyRetroPGF?</strong></p>\n<p>EasyRetroPGF (Easy Retro Public Goods Funding) simplifies the process of retroactive funding, focusing on rewarding projects that have already delivered value to the community. This approach can:</p>\n<ul>\n<li>\n<p><strong>Incentivize Successful Projects:</strong> Recognizes and supports projects with significant impact.</p>\n</li>\n<li>\n<p><strong>Encourage Continuous Contribution:</strong> Motivates ongoing efforts and contributions to the ecosystem.</p>\n</li>\n<li>\n<p><strong>Streamline Funding Processes:</strong> Provides clear criteria for funding based on past performance and outcomes.</p>\n</li>\n</ul>\n<p><strong>Proven Partnership and Track Record</strong></p>\n<p>Our previous collaboration with Octant has been immensely fruitful. As detailed in <a href=\"https://discuss.octant.app/t/gitcoin-continuing-to-fund-what-matters/234\">Gitcoin: Continuing to Fund What Matters</a>, we have successfully directed funds from Octant Epochs to shared Public Goods Initiatives. This partnership has leveraged our experience and tools to support impactful projects, showcasing the potential for even greater achievements through these novel funding mechanisms.</p>\n<p><strong>Next Steps</strong></p>\n<p>I encourage the Octant community to explore these tools further and consider a pilot implementation in the next funding round. Together, we can drive innovation and ensure our community fund achieves its full potential.</p>\n<p>Feedback and comments are welcome and encouraged!</p>\n<p>Best,</p>\n<p>Sov</p>\n            <p><small>3 posts - 2 participants</small></p>\n            <p><a href=\"https://discuss.octant.app/t/proposing-gitcoin-tools-for-enhanced-funding-mechanisms-in-the-octant-community-fund/302\">Read full topic</a></p>","link":"https://discuss.octant.app/t/proposing-gitcoin-tools-for-enhanced-funding-mechanisms-in-the-octant-community-fund/302","pubDate":"Wed, 22 May 2024 19:33:21 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"discuss.octant.app-topic-302"},"source":{"@url":"https://discuss.octant.app/t/proposing-gitcoin-tools-for-enhanced-funding-mechanisms-in-the-octant-community-fund/302.rss","#text":"Proposing Gitcoin Tools for Enhanced Funding Mechanisms in the Octant Community Fund"}},{"title":"Impactvoice.xyz is the foundation of impact measurement(Voice what matters to fund what matters from the ground up)","dc:creator":"decentralizedceo","category":"Public Good Projects Discussion","description":"<p><strong>Summary</strong></p>\n<p>We are embarking on a journey to identify the true needs of communities, focusing initially on Africa. We use on-chain metrics to assess and select stable and valuable public goods projects in emerging markets. Our approach balances grassroots community needs with the top-down availability of resources, aiming to achieve sustainable project funding. Our scalable methodology in resource allocation serves as a foundation for measuring impact. A pilot program will begin in West Africa on April 10th, setting a benchmark for subsequent initiatives in other regions.</p>\n<p>We seek to collaborate with the Octant community on this initiative. This partnership will not only enhance brand visibility in emerging markets but also position Octant as a symbol of hope. Together, we can support communities in prioritizing and addressing critical areas.</p>\n<p><strong>Problem</strong></p>\n<p>There exists a global gap in resource coordination. Contributors are often unclear about how to effectively support emerging markets or assess the impact of their contributions. Simultaneously, communities from emerging markets struggle to communicate their needs in a measurable way, leading to a cycle of poor coordination and wasteful resource allocation.</p>\n<p><strong>Solution</strong></p>\n<p>Our solution involves directly identifying community problems through engagement with the communities themselves. We will identify widespread issues, address them, and transparently monitor progress. Starting with an understanding of local conditions, we will enable communities to propose their own solutions.</p>\n<p><strong>Experiment Resources:</strong></p>\n<ul>\n<li>Regional project manager</li>\n<li>Sample community</li>\n<li>App for creating viable proposals</li>\n<li>Budget for community proposals post-voting</li>\n<li>Budget for assessing experiment viability</li>\n</ul>\n<p><strong>Steps to Implementation:</strong></p>\n<ol>\n<li>Assign a local project manager familiar with the region’s language and culture to lead the experiment.</li>\n<li>The project manager will organize in-person meetings to explain the process and guide community members in using the <a href=\"https://impactvoice.xyz\" rel=\"noopener nofollow ugc\">Impactvoice.xyz</a> app to generate solution-oriented proposals. These meetings will occur in various locations within the target country.</li>\n<li>Conduct a voting period of approximately one month to select preferred community projects.</li>\n<li>Partner with the Open Source Observer to perform a feasibility analysis of the chosen projects.</li>\n<li>Implement a direct grant round using the alloy protocol, dependent on the projects’ viability and available budget.</li>\n</ol>\n<p><strong>Treasury Implementation:</strong></p>\n<p>As part of this experimental approach, we encourage the Octant community to vote on resource allocation from the treasury to the top-ranked projects. This could be implemented via platforms like Tally or Jokerace:</p>\n<ol>\n<li>Direct funding from Octant community funds to Impact Voice, allowing projects to receive full funding upon achieving their initial milestones. This raises questions about the sustainability of Impact Voice without additional funding.</li>\n<li>After the initial funding disbursement, the remaining funds in the Impact Voice Treasury could be staked to generate additional resources for future rounds after final milestone completion.</li>\n</ol>\n<p><strong>Scalability:</strong></p>\n<p>We are prepared to expand this initiative globally through the Greenpill Network Chapters. Potential next regions include Brazil, Kenya, Ivory Coast, and Uganda. These areas could serve as prototypes or benchmarks for other network states to engage with on-the-ground communities with identified needs.</p>\n            <p><small>1 post - 1 participant</small></p>\n            <p><a href=\"https://discuss.octant.app/t/impactvoice-xyz-is-the-foundation-of-impact-measurement-voice-what-matters-to-fund-what-matters-from-the-ground-up/296\">Read full topic</a></p>","link":"https://discuss.octant.app/t/impactvoice-xyz-is-the-foundation-of-impact-measurement-voice-what-matters-to-fund-what-matters-from-the-ground-up/296","pubDate":"Sun, 21 Apr 2024 09:27:05 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"discuss.octant.app-topic-296"},"source":{"@url":"https://discuss.octant.app/t/impactvoice-xyz-is-the-foundation-of-impact-measurement-voice-what-matters-to-fund-what-matters-from-the-ground-up/296.rss","#text":"Impactvoice.xyz is the foundation of impact measurement(Voice what matters to fund what matters from the ground up)"}},{"title":"Why you should vote for B<>rder/ess in the Epoch 3 snapshot","dc:creator":"_karlagod","category":"General","description":"<p></p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://europe1.discourse-cdn.com/standard21/uploads/octant/original/1X/9d7040622d4b6652a6ac5c11bba721b2764b264b.jpeg\" data-download-href=\"/uploads/short-url/msLsyuwvIcWwEiGzpSd1KcNRvon.jpeg?dl=1\" title=\"photo_2024-03-20_07-04-49\" rel=\"noopener nofollow ugc\"><img src=\"https://europe1.discourse-cdn.com/standard21/uploads/octant/optimized/1X/9d7040622d4b6652a6ac5c11bba721b2764b264b_2_690x346.jpeg\" alt=\"photo_2024-03-20_07-04-49\" data-base62-sha1=\"msLsyuwvIcWwEiGzpSd1KcNRvon\" width=\"690\" height=\"346\" srcset=\"https://europe1.discourse-cdn.com/standard21/uploads/octant/optimized/1X/9d7040622d4b6652a6ac5c11bba721b2764b264b_2_690x346.jpeg, https://europe1.discourse-cdn.com/standard21/uploads/octant/optimized/1X/9d7040622d4b6652a6ac5c11bba721b2764b264b_2_1035x519.jpeg 1.5x, https://europe1.discourse-cdn.com/standard21/uploads/octant/original/1X/9d7040622d4b6652a6ac5c11bba721b2764b264b.jpeg 2x\" data-dominant-color=\"4E586E\"></a></div><p></p>\n<p>DevTools, Infra, and products outnumber web 3 dev education platforms 9 to 1.</p>\n<p>Most web3 Developer programs available today are either not free or are pre-recorded sessions requiring constant updates to keep up with the upgrades in program language infrastructures for writing contracts.</p>\n<p><em>You can take a look at this article and see that <a href=\"https://www.alchemy.com/overviews/solidity-bootcamp\" rel=\"noopener nofollow ugc\">only 2 on this list are free</a></em></p>\n<p>Some developer programs don’t have community learning support structures, mentorship programs, hackathons, or physical touch points like web3 hubs.</p>\n<p><strong>Our Solution</strong><br>\nSince June 2022, B&lt;&gt;rder/ess has provided in-person web3 developers’ education <a href=\"https://borderless.cryptosmartnow.io/sac\" rel=\"noopener nofollow ugc\">to youngsters in Universities</a> to learn to write smart contracts and build with different blockchain infrastructures, we’ve taught:</p>\n<ol>\n<li>Solidity</li>\n<li>JavaScript</li>\n<li>Python</li>\n<li>Tealscript.</li>\n<li>Cairo</li>\n</ol>\n<p>And more</p>\n<p>We’ve provided in-person physical and virtual training on Blockchain Technology to students in over 8 Universities in Africa through our <a href=\"https://borderless.cryptosmartnow.io/techclubs\" rel=\"noopener nofollow ugc\">Web3 Tech Clubs strategy.</a></p>\n<p>In 2022 we got a grant from the Algorand Foundation which enabled us to open and equip a <a href=\"https://borderless.cryptosmartnow.io/hubs\" rel=\"noopener nofollow ugc\">web3 tech hub in Port-Harcourt Nigeria.</a></p>\n<p>This hub has since provided a base point for 6 Cipher Sessions, 300+ dev intakes, and 30+ dev beneficiaries and graduands.</p>\n<p>I was on <a href=\"https://youtu.be/C61_9kQ1sCM?si=E6oxRvSUdiHBCfeh\" rel=\"noopener nofollow ugc\">National TV in September 2023</a> to talk about B&lt;&gt;rder/ess’ work with raising developers for Free and that gave us substantial exposure to have both Private and Public Universities seek collaboration to add Blockchain as a curriculum in the Computer Science departments.</p>\n<p>Our goal is to institutionalize Blockchain education in our Universities, and our strategy is simple:</p>\n<ol>\n<li>\n<p>Establish web3/tech Clubs in the university and run virtual cipher sessions.</p>\n</li>\n<li>\n<p>Host web3 events, bootcamps, campaigns, hacks etc.</p>\n</li>\n<li>\n<p>Establish a physical Hub in the university and run weekly IRL trainings, hackathons, and accelerator programs for projects and teams that come out successful.</p>\n</li>\n</ol>\n<p>Do this for free, and you’d have students who came to do their BSC education for 4 years, graduating with either:</p>\n<ul>\n<li>3 years experience with building in web3</li>\n<li>an on-chain product with users and teams</li>\n<li>an innovation like new dev tools, infra or meaningful contributions to OSS</li>\n</ul>\n<p>This is why you should vote for B&lt;&gt;rder/ess to be one of the shortlisted 11 projects for funding,<br>\n<strong>because we’re building the next generation of Dev Toolers, OSS builders, Infra contributors, and Founders.</strong></p>\n<p><a href=\"https://snapshot.org/#/octantapp.eth/proposal/0xe120c3ca574c06b9cfef5546da70d069ccc43521647b9b74cd9ccb6e3231aefe\" class=\"onebox\" target=\"_blank\" rel=\"noopener nofollow ugc\">https://snapshot.org/#/octantapp.eth/proposal/0xe120c3ca574c06b9cfef5546da70d069ccc43521647b9b74cd9ccb6e3231aefe</a></p>\n<p>Thank you <img src=\"https://emoji.discourse-cdn.com/twitter/blush.png?v=12\" title=\":blush:\" class=\"emoji\" alt=\":blush:\" loading=\"lazy\" width=\"20\" height=\"20\"></p>\n            <p><small>1 post - 1 participant</small></p>\n            <p><a href=\"https://discuss.octant.app/t/why-you-should-vote-for-b-rder-ess-in-the-epoch-3-snapshot/284\">Read full topic</a></p>","link":"https://discuss.octant.app/t/why-you-should-vote-for-b-rder-ess-in-the-epoch-3-snapshot/284","pubDate":"Wed, 20 Mar 2024 06:41:25 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"discuss.octant.app-topic-284"},"source":{"@url":"https://discuss.octant.app/t/why-you-should-vote-for-b-rder-ess-in-the-epoch-3-snapshot/284.rss","#text":"Why you should vote for B<>rder/ess in the Epoch 3 snapshot"}},{"title":"Drips: Continuous Dependency Funding","dc:creator":"lukef5905","category":"Public Good Projects Discussion","description":"<p>Drips is a protocol (and app), built on Ethereum, that enables organizations and individuals to directly and publicly provide funding to the free and open-source software projects they depend on the most.</p>\n<p>At the core of the Drips user experience is the Drip List. This is a collection of Ethereum addresses, ENS names, and Git repositories curated by an individual or organization and packaged together under one title. This list is accompanied by a percentage (of funds to be received) allocated to each item on the list. These lists are publicly available and shareable on the web with the ability to be either editable or immutable.</p>\n<p><strong>Achievements since the last Octant Epoch</strong></p>\n<ol>\n<li>Launch of cdf.works <a href=\"https://twitter.com/JonasSFT/status/1752733511377641815\" rel=\"noopener nofollow ugc\">(Continuous Dependency Funding)</a></li>\n<li>Almost <a href=\"https://etherscan.io/address/0xd0Dd053392db676D57317CD4fe96Fc2cCf42D0b4\" rel=\"noopener nofollow ugc\">$2M are flowing through Drips</a>, funding FOSS dependencies.</li>\n<li>The Drips team spoke at multiple conferences, including the <a href=\"https://twitter.com/sonyasunkim/status/1765435026911441170\" rel=\"noopener nofollow ugc\">Filecoin</a> Event at <a href=\"https://twitter.com/dripsnetwork/status/1763730046403907770\" rel=\"noopener nofollow ugc\">ETH Denver, Edge Cities,</a> FTC Taipei &amp; more</li>\n<li>Octant Drip List went Viral through <a href=\"https://twitter.com/wevm_dev/status/1752132002952741018\" rel=\"noopener nofollow ugc\">WAGMI</a> and <a href=\"https://twitter.com/austingriffith/status/1752140687015920109\" rel=\"noopener nofollow ugc\">Austin Griff</a>.</li>\n<li>Reputable Projects and Maintainers are funding their dependencies:<br>\n1. <a href=\"https://www.drips.network/app/projects/github/OpenZeppelin/openzeppelin-contracts\" rel=\"noopener nofollow ugc\">OpenZeppelin</a><br>\n2. <a href=\"https://www.drips.network/app/projects/github/graphprotocol/graph-node?exact\" rel=\"noopener nofollow ugc\">TheGraph</a><br>\n3. <a href=\"https://www.drips.network/app/projects/github/Arachnid/deterministic-deployment-proxy\" rel=\"noopener nofollow ugc\">ENS Founder Nick.eth</a><br>\n4. <a href=\"https://www.drips.network/app/projects/github/ethers-io/ethers.js\" rel=\"noopener nofollow ugc\">Ethers.Js</a> - RicMoo<br>\n5. <a href=\"https://www.drips.network/app/projects/github/wevm/wagmi\" rel=\"noopener nofollow ugc\">WAGMI</a><br>\n6. <a href=\"https://www.drips.network/app/projects/github/snapshot-labs/snapshot?exact\" rel=\"noopener nofollow ugc\">Snapshot</a><br>\n7. <a href=\"https://twitter.com/dripsnetwork/status/1753439201603826031\" rel=\"noopener nofollow ugc\">Starknet</a><br>\n8. <a href=\"https://www.drips.network/app/drip-lists/36167722434539895740687283110259945938004377627588501179309095983175\" rel=\"noopener nofollow ugc\">FundingTheCommons</a><br>\n9. and <a href=\"https://www.drips.network/app/projects/all\" rel=\"noopener nofollow ugc\">more</a></li>\n</ol>\n<p><strong>Upcoming milestones on your project roadmap:</strong></p>\n<ul>\n<li>\n<p>We are currently building “Collaborative Drip-Lists,” an experience that will enable multiple peers to collaboratively design and vote on any PGF mechanism within Drips, leveraging the existing Drips graph and primitives. This is the first step towards bringing many more PGF mechanisms, voting schemes, and a lot of extensibility within the Drips system.</p>\n</li>\n<li>\n<p>As for our roadmap, you can learn more by reviewing the <a href=\"https://community.radworks.org/t/discussion-rgp-19-drips-org-proposal-2024/3409\" rel=\"noopener nofollow ugc\">[Drips Team’s org proposal to the Radworks DAO for 2024 1]</a> which was passed on 12/1/2023 and which contains a more detailed description of the project’s progress this year and our plans for 2024.</p>\n</li>\n</ul>\n<p><strong>How funds from the previous Epoch were utilized and plans for any funds raised from Epoch Two</strong></p>\n<ul>\n<li>The Drips team has used 100% of the raised funds to fund <a href=\"https://www.drips.network/app/drip-lists/30178668158349445547603108732480118476541651095408979232800331391215\" rel=\"noopener nofollow ugc\">Octant’s most critical Dependencies from Epoch Zero, One and Two</a></li>\n<li>Our current intention is to continue to re-donate all funds received from any future Octant rounds to the same cause of directly supporting the FOSS projects Octant depends on.</li>\n</ul>\n<p><strong>Did Drips receive any other sources of grant funding since the previous Octant Epoch?</strong></p>\n<ul>\n<li>This question may be less relevant for Drips, since as described above, 100% of any funds we receive from Octant will be directly re-donated to fund the FOSS projects Octant depends on. In other words, the Drips team itself will not receive any of the funds awarded to it in this Octant round. However, for the sake of transparency, the Drips team did receive a large grant from the Radworks DAO on 12/1/2023, which is intended to fund our team’s work continuing to build open solutions for funding FOSS in 2024. You can learn more <a href=\"https://community.radworks.org/t/submission-rgp-19-drips-org-proposal-2024/3429\" rel=\"noopener nofollow ugc\">here</a>.</li>\n</ul>\n<p><strong>Did Drips receive sources of non-grant funding since the previous Epoch?</strong> (including user payments and donations, staking or LP providing treasury funds, VC funding, or others)</p>\n<ul>\n<li>No</li>\n</ul>\n            <p><small>1 post - 1 participant</small></p>\n            <p><a href=\"https://discuss.octant.app/t/drips-continuous-dependency-funding/278\">Read full topic</a></p>","link":"https://discuss.octant.app/t/drips-continuous-dependency-funding/278","pubDate":"Mon, 18 Mar 2024 15:12:41 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"discuss.octant.app-topic-278"},"source":{"@url":"https://discuss.octant.app/t/drips-continuous-dependency-funding/278.rss","#text":"Drips: Continuous Dependency Funding"}},{"title":"Blockhead: universal browser interface for crypto/DeFi/web3","dc:creator":"blockhead","category":"Public Good Projects Discussion","description":"<p><strong>Blockhead</strong> (<a href=\"https://blockhead.info\" rel=\"noopener nofollow ugc\">blockhead.info</a>) is a universal interface for the decentralized web. Track, visualize and explore EVM chains, onchain accounts, smart contracts, blocks, transactions, DeFi apps and web3 protocols (IPFS, ENS, Farcaster and more), all in one place!</p>\n<p>It’s designed as a <strong>local-first, client-side web app</strong> that connects to <strong>dozens of existing data sources</strong> (including RPC nodes, public datasets, APIs, indexing services and more), which users can swap out on the fly.</p>\n<p>While many existing web3 frontends and data explorers rely on one or a small handful of centralized infrastructure providers, Blockhead offers an <strong>alternative frontend for existing decentralized apps and protocols</strong> that is seamlessly interoperable, easy to interpret, and showcases unique crypto-enabled features such as composability and data provenance.</p>\n<p>Blockhead started as a hackathon project at ETHGlobal’s ETHOnline 2020, and has been continuously maintained as a public good open source project for the past four years.</p>\n<h2><a name=\"features-1\" class=\"anchor\" href=\"https://discuss.octant.app#features-1\"></a>Features</h2>\n<p>Learn more about Blockhead’s current features on the <a href=\"https://github.com/darrylyeo/blockhead\" rel=\"noopener nofollow ugc\">GitHub repository</a>.</p>\n<h2><a name=\"milestones-2\" class=\"anchor\" href=\"https://discuss.octant.app#milestones-2\"></a>Milestones</h2>\n<ul>\n<li>\n<p>30+ data providers integrated (Airstack, Alchemy, Chainbase, Chainlink, Cloudflare, Covalent, Decommas, ENS, Etherscan, Figment, Gateway.fm, GetBlock, The Graph, IPFS, Infura, Lens, Liquality, LlamaNodes, Mod Protocol, Moralis, Nexandria, Neynar, NFTPort, Pinata, Pocket Network, Push, QuickNode, Sourcify, Tenderly, Zapper, Zerion and more)</p>\n</li>\n<li>\n<p>~400 average monthly visitors</p>\n</li>\n<li>\n<p>100+ stars on GitHub</p>\n</li>\n</ul>\n<h2><a name=\"coming-soon-3\" class=\"anchor\" href=\"https://discuss.octant.app#coming-soon-3\"></a>Coming Soon</h2>\n<p><strong>More data sources</strong> – integrate with more data providers and indexing solutions for maximum flexibility, redundancy, and transparency</p>\n<ul>\n<li>\n<p>Tokens</p>\n</li>\n<li>\n<p>Prices</p>\n</li>\n<li>\n<p>DeFi</p>\n</li>\n<li>\n<p>NFTs</p>\n</li>\n<li>\n<p>Chains</p>\n</li>\n<li>\n<p>Transactions</p>\n</li>\n<li>\n<p>Verified smart contract repositories</p>\n</li>\n<li>\n<p>RPC providers</p>\n</li>\n<li>\n<p>Event signatures</p>\n</li>\n</ul>\n<p><strong>More robust/accurate portfolio tracking:</strong></p>\n<ul>\n<li>\n<p>Token whitelists/blacklists</p>\n</li>\n<li>\n<p>Auto-detect networks for a given address based on activity</p>\n</li>\n<li>\n<p>Transactions feed</p>\n</li>\n<li>\n<p>Improved transaction descriptions</p>\n</li>\n<li>\n<p>Table views with CSV/JSON export</p>\n</li>\n<li>\n<p>NFT gallery view with rich multimedia support</p>\n</li>\n<li>\n<p>Dynamic visualizations for token balances, DeFi positions, transaction history and more</p>\n</li>\n</ul>\n<p><strong>Improved Explorer view:</strong></p>\n<ul>\n<li>\n<p>Visualizations and human-readable descriptions for common dapp/smart contract interactions: transfers, swaps, deposits, withdrawals, staking, yield farming, minting, burning, governance voting and more</p>\n</li>\n<li>\n<p>Image previews when sharing links on Twitter/social media</p>\n</li>\n<li>\n<p>Interactive Farcaster Frames/Open Frames view</p>\n</li>\n<li>\n<p>Add syntax highlighting for Solidity, Vyper, Yul, Huff and more</p>\n</li>\n<li>\n<p>Interact directly with smart contract methods via ABI</p>\n</li>\n<li>\n<p>Distinguish externally-owned accounts from smart contracts, smart wallet accounts, Safes, proxies</p>\n</li>\n<li>\n<p>Browse transaction traces</p>\n</li>\n<li>\n<p>Browse EVM storage</p>\n</li>\n<li>\n<p>Browse Ethereum Beacon chain data</p>\n</li>\n<li>\n<p>Browse EIP-4844 blob storage</p>\n</li>\n<li>\n<p>Add graph visualizations for token flows and asset transfers</p>\n</li>\n<li>\n<p>Show token stats/market data for ERC-20 smart contracts</p>\n</li>\n<li>\n<p>Browse individual NFTs</p>\n</li>\n<li>\n<p>“Add to Portfolio” button</p>\n</li>\n<li>\n<p>Highlight addresses found in your portfolio</p>\n</li>\n<li>\n<p>Bookmark transactions</p>\n</li>\n<li>\n<p>Add real-time visualizations for blocks, mempool transactions, cross-chain messages, token transfers, and more</p>\n</li>\n<li>\n<p>“Time-travel mode” to visualize state changes and historical data over time</p>\n</li>\n</ul>\n<p><strong>Improved Apps view:</strong></p>\n<ul>\n<li>\n<p>Custom interactive UI flows for DeFi actions/protocols: exchanges, vaults, liquidity pools, bridges, and more</p>\n</li>\n<li>\n<p>Generalize the ENS explorer to work with any subgraph from The Graph</p>\n</li>\n<li>\n<p>Explorer for on-chain and off-chain DAO governance activity</p>\n</li>\n<li>\n<p>Lens client: browse, collect and publish posts</p>\n</li>\n<li>\n<p>Farcaster client: browse and publish casts</p>\n</li>\n</ul>\n<p><strong>Accounts, wallets, web3-native authentication, and data portability:</strong></p>\n<ul>\n<li>\n<p>Support for Safe, smart contract wallets, EIP-4337 accounts and more</p>\n</li>\n<li>\n<p>Robust support for all common wallet connection protocols: injected EIP-1193, WalletConnect, Coinbase Wallet SDK, hardware wallets, EIP-6963 provider discovery</p>\n</li>\n<li>\n<p>Authentication/web3 social login schemes: Sign in with Ethereum, Lens, Farcaster</p>\n</li>\n<li>\n<p>Sync data + preferences peer-to-peer across multiple device/clients running Blockhead instances</p>\n</li>\n</ul>\n<p><strong>Granular preferences and data transparency:</strong></p>\n<ul>\n<li>\n<p>Choose different/multiple/user-added RPC endpoints and data providers for each chain</p>\n</li>\n<li>\n<p>Networking introspection with data flow diagrams</p>\n</li>\n<li>\n<p>Tag data sources and dapps based on their degree of centralization/decentralization, whether on-chain or off-chain</p>\n</li>\n</ul>\n<p><strong>UI/UX enhancements:</strong></p>\n<ul>\n<li>\n<p>Context menus</p>\n</li>\n<li>\n<p>WAI-ARIA compliant components</p>\n</li>\n<li>\n<p>Global Command+K menu</p>\n</li>\n<li>\n<p>AI-enhanced search</p>\n</li>\n<li>\n<p>Drag and drop entities seamlessly across columns and windows to fill form fields and initiate transfers or other interactions</p>\n</li>\n<li>\n<p>Multi-column views to show multiple feeds on screen (similar to Tweetdeck)</p>\n</li>\n</ul>\n<p><strong>Experience Blockhead in more places:</strong></p>\n<ul>\n<li>\n<p>Progressive web app support</p>\n</li>\n<li>\n<p>Native iOS, Android, macOS, Windows and Linux apps using Tauri</p>\n</li>\n<li>\n<p>Decentralized frontend hosting/content storage networks: ENS, IPNS, Handshake, Arweave, Akash, Internet Computer</p>\n</li>\n<li>\n<p>Distribution via decentralized app stores, registries, self-hosted platforms and discovery networks: DAppNode, Umbrel, Urbit</p>\n</li>\n</ul>\n<p><strong>Support for more blockchains and digital asset networks:</strong></p>\n<ul>\n<li>\n<p>EVM-based blockchains/layer-2s/layer-3s</p>\n</li>\n<li>\n<p>Other blockchain/web3 ecosystems: Cosmos, Solana, Arweave, Polkadot/Substrate, Bitcoin, Filecoin and more</p>\n</li>\n</ul>\n<h2><a name=\"funding-4\" class=\"anchor\" href=\"https://discuss.octant.app#funding-4\"></a>Funding</h2>\n<p>Blockhead is an open source project currently supported by Gitcoin Grants, Optimism RetroPGF and BuidlGuidl.</p>\n<p>Funds raised on Octant will go toward hosting costs, data provider integrations, feature development and maintainer compensation.</p>\n<p><strong>THANK YOU</strong> for supporting <strong>open source software</strong>, <strong>public goods</strong>, <strong>decentralized apps</strong>, <strong>delightful UI/UX</strong>, and <strong>resilient financial &amp; internet infrastructure</strong> to last for generations to come! <img src=\"https://emoji.discourse-cdn.com/twitter/sparkles.png?v=12\" title=\":sparkles:\" class=\"emoji\" alt=\":sparkles:\" loading=\"lazy\" width=\"20\" height=\"20\"></p>\n<h2><a name=\"follow-blockhead-5\" class=\"anchor\" href=\"https://discuss.octant.app#follow-blockhead-5\"></a>Follow Blockhead</h2>\n<ul>\n<li>\n<p><a href=\"https://blockhead.info\" rel=\"noopener nofollow ugc\">Website (blockhead.info)</a></p>\n</li>\n<li>\n<p><a href=\"https://github.com/darrylyeo/blockhead\" rel=\"noopener nofollow ugc\">GitHub</a></p>\n</li>\n<li>\n<p><a href=\"https://warpcast.com/~/channel/blockhead\" rel=\"noopener nofollow ugc\">Warpcast (/blockhead channel)</a></p>\n</li>\n<li>\n<p><a href=\"https://warpcast.com/blockhead\" rel=\"noopener nofollow ugc\">Warpcast (@blockhead)</a></p>\n</li>\n<li>\n<p><a href=\"https://warpcast.com/darrylyeo\" rel=\"noopener nofollow ugc\">Warpcast (@darrylyeo)</a></p>\n</li>\n<li>\n<p><a href=\"https://twitter.com/0xBlockhead\" rel=\"noopener nofollow ugc\">Twitter (@0xBlockhead)</a></p>\n</li>\n<li>\n<p><a href=\"https://twitter.com/darryl__yeo\" rel=\"noopener nofollow ugc\">Twitter (@darryl__yeo)</a></p>\n</li>\n</ul>\n            <p><small>1 post - 1 participant</small></p>\n            <p><a href=\"https://discuss.octant.app/t/blockhead-universal-browser-interface-for-crypto-defi-web3/277\">Read full topic</a></p>","link":"https://discuss.octant.app/t/blockhead-universal-browser-interface-for-crypto-defi-web3/277","pubDate":"Mon, 18 Mar 2024 06:28:00 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"discuss.octant.app-topic-277"},"source":{"@url":"https://discuss.octant.app/t/blockhead-universal-browser-interface-for-crypto-defi-web3/277.rss","#text":"Blockhead: universal browser interface for crypto/DeFi/web3"}},{"title":"POTLOCK: composable funding & impact tracking stack for public goods","dc:creator":"plug","category":"Public Good Projects Discussion","description":"<p></p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://europe1.discourse-cdn.com/standard21/uploads/octant/original/1X/499d64835eab9f70ef2eb3420643c8efe5fc0d61.png\" data-download-href=\"/uploads/short-url/ave4bsh5LTWxCqdVeCjVazq2ZSF.png?dl=1\" title=\"\" rel=\"noopener nofollow ugc\"><img src=\"https://europe1.discourse-cdn.com/standard21/uploads/octant/optimized/1X/499d64835eab9f70ef2eb3420643c8efe5fc0d61_2_211x211.png\" alt=\"\" data-base62-sha1=\"ave4bsh5LTWxCqdVeCjVazq2ZSF\" width=\"211\" height=\"211\" role=\"presentation\" srcset=\"https://europe1.discourse-cdn.com/standard21/uploads/octant/optimized/1X/499d64835eab9f70ef2eb3420643c8efe5fc0d61_2_211x211.png, https://europe1.discourse-cdn.com/standard21/uploads/octant/optimized/1X/499d64835eab9f70ef2eb3420643c8efe5fc0d61_2_316x316.png 1.5x, https://europe1.discourse-cdn.com/standard21/uploads/octant/optimized/1X/499d64835eab9f70ef2eb3420643c8efe5fc0d61_2_422x422.png 2x\" data-dominant-color=\"E9D1C8\"></a></div><p></p>\n<p>Potlock, a composable public goods funding and impact tracking stack, built on Web3 social, DAOs, &amp; decentralized frontends.</p>\n<p>Since we first started building in October we have deployed multiple funding strategies with composability and decentralization in mind and a quarter million USD flowing through our platform. Already accessible through 50 gateways through the BOS framework. Our main priority this year is to not only build the building blocks to new funding mechanisms, but build a smooth experience to onboard the masses as well as a developer friendly stack so others can build their own public goods funding experiences for their own use case.</p>\n<h1><a name=\"important-links-1\" class=\"anchor\" href=\"https://discuss.octant.app#important-links-1\"></a>Important Links</h1>\n<p>Important Links: <a href=\"http://github.com/potlock\" rel=\"noopener nofollow ugc\">github.com/potlock</a></p>\n<p>Twitter https:<a href=\"http://x.com/potlock_\" rel=\"noopener nofollow ugc\">x.com/potlock_</a></p>\n<p>Docs <a href=\"https://docs.potlock.io\" rel=\"noopener nofollow ugc\">https://docs.potlock.io</a></p>\n<p>Tutorial <a href=\"https://potlock.org/tutorials\" class=\"inline-onebox\" rel=\"noopener nofollow ugc\">PotLock</a></p>\n<p>App <a href=\"https://app.potlock.org\" rel=\"noopener nofollow ugc\">https://app.potlock.org</a></p>\n<h1><a name=\"why-are-a-public-good-2\" class=\"anchor\" href=\"https://discuss.octant.app#why-are-a-public-good-2\"></a>Why Are A Public Good</h1>\n<p>We are a meta public good. A public goods that directly supports other public goods, regardless of blockchain or onboarding to Web3. We build everything in public, everything is open source (under MIT <a href=\"https://potlock.org/license\" rel=\"noopener nofollow ugc\">license</a>) and composable. We are building an open source ecosystem around non-evm public goods funding and impact tracking and looking to merge this with chain abstraction to the EVM ecosystem. More on our <a href=\"https://potlock.org/endgame\" rel=\"noopener nofollow ugc\">end game vision</a> (WIP)</p>\n<p>Everything we build in public in a composable way that has fees for all stakeholders which are optional. Our front end code is saved on chain and integrated into Web3 social. Follow our <a href=\"http://github.com/potlock\" rel=\"noopener nofollow ugc\">github</a> for updates or subscribe to our <a href=\"https://subscribe.potlock.org\" rel=\"noopener nofollow ugc\">newsletter</a>.</p>\n<p>In October we started from a team of 2, now we have grown and hare greenpilling the entire NEAR Ecosystem, and have a robust group of contributors. We have launched our own identity protocol that integrates 3rd party providers and cross chain functionality, direct donations with on chain referrals, quadratic funding with more primitives to come, built on Web3 social and integrated with DAO support.</p>\n<p>Why Project Important</p>\n<p>Decentralized point of failure for funding mechanisms and silo’d experience for public goods funding. A separation of impact tracking, project profiles, social graph, and different funding strategies. We are combining all of these experiences and bringing true composability to the public goods funding space onto ecosystems that previously didn’t consider it. For public goods to gain true adoption we believe that we not only have to target existing ecosystems, but expand and bridge public goods funding to ecosystems that often overlook it from very early on.</p>\n<h1><a name=\"current-traction-3\" class=\"anchor\" href=\"https://discuss.octant.app#current-traction-3\"></a>Current traction</h1>\n<ul>\n<li>Direct Donations Launched in November $30,000 in direct donations</li>\n<li>Quadratic Funding Launched in February $200,000</li>\n<li>150 projects + on registry</li>\n<li>800 unique donors</li>\n<li>Beginning to build an <a href=\"https://ecosystem.potlock.org\" rel=\"noopener nofollow ugc\">ecosystem</a></li>\n<li>Regular public goods <a href=\"https://subcribe.potlock.org\" rel=\"noopener nofollow ugc\">updates</a> (turning to video series for public goods eco updates)</li>\n<li>Built Identity Solution <a href=\"https://www.nada.bot/\" rel=\"noopener nofollow ugc\">nada.bot</a> with 9 Stamps (Holonym, Farcaster, Lens, Twitter, etc verification) and more to come with 600+ checks verified on chain</li>\n</ul>\n<p>By end of year target</p>\n<ul>\n<li>1,000 public goods on registry</li>\n<li>10 quadratic funding rounds</li>\n<li>5,000 verified humans and donors</li>\n<li>$1,000,000 through that platform</li>\n</ul>\n<p>Live Data</p>\n<ul>\n<li><a href=\"https://dappradar.com/dapp/potlock\" rel=\"noopener nofollow ugc\">https://dappradar.com/dapp/potlock</a></li>\n<li>Stats <a href=\"https://flipsidecrypto.xyz/Lordking/potlock-UD3Flm\" class=\"inline-onebox\" rel=\"noopener nofollow ugc\">PotLock | Lordking | Flipside</a></li>\n<li><a href=\"https://potlock.org/donors\" class=\"inline-onebox\" rel=\"noopener nofollow ugc\">PotLock</a></li>\n<li>Data Repo <a href=\"https://potlock/data-repo\" rel=\"noopener nofollow ugc\">https://potlock/data-repo</a></li>\n<li>Nada Bot on Dapp Radar <a href=\"https://dappradar.com/dapp/nada-bot\" rel=\"noopener nofollow ugc\">https://dappradar.com/dapp/nada-bot</a></li>\n</ul>\n<h1><a name=\"use-of-funds-4\" class=\"anchor\" href=\"https://discuss.octant.app#use-of-funds-4\"></a>Use of Funds:</h1>\n<p>None of this will be used to cover engineering or core team costs. Rather this is to facilitate funding rounds around open source projects. We are asking for $100,000 Use funds for quadratic funding rounds from May to July on our platform.</p>\n<p>Target goal for rounds</p>\n<ul>\n<li>$10,000 raised through external donations + sponsorships</li>\n<li>1000 unique humans verified and 1000 donors</li>\n<li>60 new projects onboarded unto platform</li>\n<li>Ability to track funding for all these projects and begin tracking impact</li>\n</ul>\n<p>Soft goals</p>\n<ul>\n<li>Drive more tractional across Web3 ecosystem regarding Octant rounds</li>\n</ul>\n<p>Top Funding Rounds options</p>\n<p>We want to choose the top rounds based on what is most aligned with the Octant ecosystem. We’d appreciate people reply to what top 2 rounds they prefer.</p>\n<ul>\n<li>Chain Abstraction: open source technology focusing on account abstraction and chain abstraction</li>\n<li>New Funding Mechanisms: those building open source novel ways to fund public goods and build a plural funding ecosystem</li>\n<li>Network States: build open source network state technology</li>\n<li>Privacy technology: build privacy on chain</li>\n<li>Open Source: general open source technology</li>\n<li>Impact Tracking: open source technology for tracking impact on-chain</li>\n</ul>\n<p>During this time (upcoming quarter) we will building more solutions</p>\n<ul>\n<li>Open API for multichain impact tracking. Solutions integratable with Open Source observer to track open source activity, multichain impact, and self served attestations</li>\n<li>Additional composable decentralized gateways. Able to whitelabel you own funding experience with use case</li>\n<li>Robust identity solution with custom rules and the ability to set custom config for individual use cases</li>\n<li>Start development of campaigns fundraising primitive to raise target campaigns on behalf of organization</li>\n<li>Create curated lists that can plug into other funding strategies and primitives.</li>\n</ul>\n<h1><a name=\"our-team-5\" class=\"anchor\" href=\"https://discuss.octant.app#our-team-5\"></a>Our Team</h1>\n<p>Our team consists of mostly full time engineers native to Web3, DAOs, and DAOs across the world. Between all of us we have decades of engineering experience. We also have different entities contributing to the overall ecosystem at this point allocating resources to make the vision of composable public goods come true. Here is a <a href=\"https://potlock.org/orgs\" rel=\"noopener nofollow ugc\">miro outlining that</a></p>\n<p>Core FTE</p>\n<p><a href=\"https://x.com/plugrel\" rel=\"noopener nofollow ugc\">Plug Rel</a> - President of <a href=\"https://www.minorityprogrammers.com/\" rel=\"noopener nofollow ugc\">Minority Programmers</a>, Head of Decentralization at <a href=\"https://www.banyan.gg/\" rel=\"noopener nofollow ugc\">Banyan Collective</a>.</p>\n<ul>\n<li>Experience working across many L1 ecosystem, DevRel, building NFT and DAO Infra</li>\n</ul>\n<p><a href=\"https://www.linkedin.com/in/wenderson-pires-silva/?locale=en_US\" rel=\"noopener nofollow ugc\">Wenderson Silva</a> - Senior Full Stack Engineer, former Senior Software Engineer at Satori and NEAR Tasks</p>\n<p><a href=\"https://www.linkedin.com/in/lachlan-glen/\" rel=\"noopener nofollow ugc\">Lachlan Glen</a>- Head of Engineering, former Senior Software Engineer at Few n’ Far</p>\n<p>Minority Programmers Full Time</p>\n<p><a href=\"https://github.com/m-rb3\" rel=\"noopener nofollow ugc\">Mohamed E</a>, Front End Engineer from Minority Programmers</p>\n<p><a href=\"https://github.com/Prometheo/\" rel=\"noopener nofollow ugc\">Prometheus</a> - Smart Contract Engineers at Minority Programmers</p>\n<p>Part Time Contributors</p>\n<p>Earnest - Social Media Management for Nada bot, , Founder of NEAR Africa, Study Masters in Architecture</p>\n<p>Ledum Peter - Social Media Management &amp; Graphic Designer</p>\n<p>Isaac Williams - Social Media Management &amp; Graphic Design</p>\n<p>Kritik - UI/UX Designer</p>\n<p>Emmanuel - UI/UX Designer</p>\n<p><a href=\"https://nearbuilders.org\" rel=\"noopener nofollow ugc\">Build DAO</a></p>\n<ul>\n<li><a href=\"https://twitter.com/flow_science\" rel=\"noopener nofollow ugc\">Elijah</a> - <a href=\"https://github.com/flowscience/hyperfiles\" rel=\"noopener nofollow ugc\">Hyperfiles</a> at Build DAO</li>\n<li><a href=\"https://twitter.com/elliot_braem\" rel=\"noopener nofollow ugc\">Elliot</a>, Founder of <a href=\"https://everything.dev/\" rel=\"noopener nofollow ugc\">Everything.dev</a> and Council at Build DAO</li>\n<li>Lordking - Data Analytics</li>\n<li>Matt B - Senior Software Engineer, and Build DAO Contributor</li>\n</ul>\n<p>Community Members</p>\n<ul>\n<li><a href=\"https://twitter.com/RussLive215\" rel=\"noopener nofollow ugc\">Russell Ballard</a>, Community &amp; Events, Founder of Proof of Vibes, Co-Founder of 40Acres DAO, Former</li>\n<li><a href=\"https://www.skalata.co/profile/shahirah-gardner\" rel=\"noopener nofollow ugc\">Shah</a>, Venture Research, Venture Partner at Skalata, Former Board Member and Head of PR at Girl In Tech Australia, Startup Mentor</li>\n</ul>\n<h1><a name=\"funding-raised-6\" class=\"anchor\" href=\"https://discuss.octant.app#funding-raised-6\"></a>Funding Raised</h1>\n<p>Directly for our team we have received</p>\n<ul>\n<li>$<a href=\"https://bos.potlock.org/?tab=project&amp;projectId=potlock.near\" rel=\"noopener nofollow ugc\">4,000</a> + in donations through Potlock to potlock.near,</li>\n<li>$1,000 in optional protocol fees to the DAO from donations</li>\n<li>$338,000 convertible grant from the NEAR Foundation for our H1 runway to include audits, external bounties, and our staff. This does not include dedicated marketing, program managers or BD leads.</li>\n<li>$<a href=\"https://explorer.gitcoin.co/#/round/424/0xd4cc0dd193c7dc1d665ae244ce12d7fab337a008/0xd4cc0dd193c7dc1d665ae244ce12d7fab337a008-148\" rel=\"noopener nofollow ugc\">200</a> in Open Source Software Round in GG19</li>\n</ul>\n<p>Other organizations have also received grants to do related events outside of the core team and bounties to continue our stack. We are asking for funding not for operational cost but rather to fund more quadratic funding rounds.</p>\n<h1><a name=\"social-credibility-7\" class=\"anchor\" href=\"https://discuss.octant.app#social-credibility-7\"></a>Social Credibility</h1>\n<ul>\n<li>NEARWEEK Coverage <a href=\"https://nearweek.com/newsletters/edition-151\" class=\"inline-onebox\" rel=\"noopener nofollow ugc\">Edition #151</a></li>\n<li>Web3ForGood Project Highlight <a href=\"https://web3forgood.substack.com/p/this-week-in-web3forgood-be3\" class=\"inline-onebox\" rel=\"noopener nofollow ugc\">🌍 This Week in Web3forGood - 🌍 This Week in Web3forGood</a></li>\n<li>Github Twitter Bot <a href=\"https://x.com/potlock_bot\" rel=\"noopener nofollow ugc\">https://x.com/potlock_bot</a></li>\n<li>Github BOS App <a href=\"https://github.com/PotLock/bos-app\" class=\"inline-onebox\" rel=\"noopener nofollow ugc\">GitHub - PotLock/bos-app: PotLock BOS (blockchain operating system - decentralized front ends) App</a></li>\n<li>NEAR TownHall <a href=\"https://www.youtube.com/live/sacTPe0vtSo?si=qOuHagva1EefHABc&amp;t=3475\" rel=\"noopener nofollow ugc\">https://www.youtube.com/live/sacTPe0vtSo?si=qOuHagva1EefHABc&amp;t=3475</a></li>\n<li>NEAR Foundation Support <a href=\"https://twitter.com/NEARProtocol/status/1766131417447096776\" rel=\"noopener nofollow ugc\">https://twitter.com/NEARProtocol/status/1766131417447096776</a></li>\n<li>Ottersec Audits <a href=\"https://blog.potlock.org/potlock-gets-second-audit-from-ottersec-99e3e802617a\" class=\"inline-onebox\" rel=\"noopener nofollow ugc\">Potlock Gets Second Audit from Ottersec | by PlugRel | Feb, 2024 | PotLock</a></li>\n</ul>\n<h1><a name=\"submission-proof-8\" class=\"anchor\" href=\"https://discuss.octant.app#submission-proof-8\"></a>Submission Proof</h1>\n<p>potlock.eth</p>\n<p><a href=\"https://signer.is/verify/JTdCJTIyY2xhaW1lZF9tZXNzYWdlJTIyJTNBJTIyT2N0YW50JTIyJTJDJTIyc2lnbmVkX21lc3NhZ2UlMjIlM0ElMjIweDUwYTQ4OTdhNzU2NTcwM2JjODY1ZjMzMWMxNGRmMGIzOTQyYmFlNWNlZTkwMmZmNjMzMmMxMTRlM2E3NTU3ZTY3NzhkODIwN2EyNDY5MWE2OTg1MTQ0YjVjYzU4YjYxYmJjMzA2ZTRiZTYyOTVmZTM0MGI2NWJiNmVmNDRiN2Q0MWMlMjIlMkMlMjJjbGFpbWVkX3NpZ25hdG9yeSUyMiUzQSUyMjB4ODhCOTNkNEQ0NDAxNTU0NDhmYkIzQ2YyNjAyMDhiNzVGQzAxMTdDMCUyMiU3RA==\" class=\"onebox\" target=\"_blank\" rel=\"noopener nofollow ugc\">https://signer.is/verify/JTdCJTIyY2xhaW1lZF9tZXNzYWdlJTIyJTNBJTIyT2N0YW50JTIyJTJDJTIyc2lnbmVkX21lc3NhZ2UlMjIlM0ElMjIweDUwYTQ4OTdhNzU2NTcwM2JjODY1ZjMzMWMxNGRmMGIzOTQyYmFlNWNlZTkwMmZmNjMzMmMxMTRlM2E3NTU3ZTY3NzhkODIwN2EyNDY5MWE2OTg1MTQ0YjVjYzU4YjYxYmJjMzA2ZTRiZTYyOTVmZTM0MGI2NWJiNmVmNDRiN2Q0MWMlMjIlMkMlMjJjbGFpbWVkX3NpZ25hdG9yeSUyMiUzQSUyMjB4ODhCOTNkNEQ0NDAxNTU0NDhmYkIzQ2YyNjAyMDhiNzVGQzAxMTdDMCUyMiU3RA==</a></p>\n            <p><small>3 posts - 3 participants</small></p>\n            <p><a href=\"https://discuss.octant.app/t/potlock-composable-funding-impact-tracking-stack-for-public-goods/275\">Read full topic</a></p>","link":"https://discuss.octant.app/t/potlock-composable-funding-impact-tracking-stack-for-public-goods/275","pubDate":"Mon, 18 Mar 2024 04:00:27 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"discuss.octant.app-topic-275"},"source":{"@url":"https://discuss.octant.app/t/potlock-composable-funding-impact-tracking-stack-for-public-goods/275.rss","#text":"POTLOCK: composable funding & impact tracking stack for public goods"}},{"title":"🔵 ReFi DAO - A Network Society to Regenerate the Earth","dc:creator":"montymerlin","category":"Public Good Projects Discussion","description":"<p></p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://europe1.discourse-cdn.com/standard21/uploads/octant/original/1X/4ff7c59317fb5df1ea1942f90ed88aff70db7609.jpeg\" data-download-href=\"/uploads/short-url/bpqzggguZnbZoR3cfbTgJUADyxX.jpeg?dl=1\" title=\"image\" rel=\"noopener nofollow ugc\"><img src=\"https://europe1.discourse-cdn.com/standard21/uploads/octant/optimized/1X/4ff7c59317fb5df1ea1942f90ed88aff70db7609_2_690x387.jpeg\" alt=\"image\" data-base62-sha1=\"bpqzggguZnbZoR3cfbTgJUADyxX\" width=\"690\" height=\"387\" srcset=\"https://europe1.discourse-cdn.com/standard21/uploads/octant/optimized/1X/4ff7c59317fb5df1ea1942f90ed88aff70db7609_2_690x387.jpeg, https://europe1.discourse-cdn.com/standard21/uploads/octant/optimized/1X/4ff7c59317fb5df1ea1942f90ed88aff70db7609_2_1035x580.jpeg 1.5x, https://europe1.discourse-cdn.com/standard21/uploads/octant/optimized/1X/4ff7c59317fb5df1ea1942f90ed88aff70db7609_2_1380x774.jpeg 2x\" data-dominant-color=\"264857\"></a></div><p></p>\n<h1><a name=\"overview-1\" class=\"anchor\" href=\"https://discuss.octant.app#overview-1\"></a>Overview</h1>\n<p>ReFi DAO is at the forefront of the Regenerative Finance (ReFi) movement, a pioneering force dedicated to leveraging Web3 technologies to regenerate the Earth’s ecosystems and foster economic systems that prioritize ecological and social well-being. By fostering a global network of regenerative founders, investors, builders, and enthusiasts, and embodying the principles of open-source technology, transparency, and decentralization, ReFi DAO acts as a catalyst for change, driving the Web3 movement towards creating sustainable, inclusive, and equitable economic systems.</p>\n<h1><a name=\"our-mission-and-contribution-to-public-goods-2\" class=\"anchor\" href=\"https://discuss.octant.app#our-mission-and-contribution-to-public-goods-2\"></a><strong>Our Mission and Contribution to Public Goods</strong></h1>\n<p>ReFi DAO is dedicated to regenerating the Earth and revolutionizing how communities interact with finance and technology. Our core mission revolves around developing public goods for the ReFi ecosystem—tools, knowledge resources, and community networks—that facilitate the growth of ReFi and regenerative practices across the globe. These resources are designed not only to support the ReFi ecosystem’s immediate needs but also to ensure long-term sustainability and resilience.</p>\n<p><strong>A Global Network:</strong> Since inception in January 2021, ReFi DAO has rapidly evolved into a global community, with over 80,000 downloads of the <a href=\"https://open.spotify.com/show/5RTHF6JVgQL1cgaVfvi7cv\" rel=\"noopener nofollow ugc\">ReFi Podcast</a> across various media platforms, more than 100 events hosted in 58 cities, and a substantial online following. By consistently publishing informative content on the <a href=\"https://blog.refidao.com/\" rel=\"noopener nofollow ugc\">ReFi DAO Blog</a>, we continue to educate and inspire both global and local ReFi communities. Our media network is a key public good for the ReFi ecosystem by facilitating knowledge exchange, collaboration, and innovation across diverse geographies and cultures.</p>\n<p><strong>Empowering Localized Impact through ReFi Local Nodes</strong>: A cornerstone of ReFi DAO is the establishment of ReFi Local Nodes. These nodes are vibrant, community-driven platforms that empower localized environmental and social regeneration projects. By providing tools, funding, and support, we empower communities to implement solutions tailored to their unique contexts, driving meaningful change from the ground up.</p>\n<p>So far, we’ve allocated over $55,000 to ReFi local nodes, particularly in marginalised and underserved areas. You can check out the funding allocation results here: <a href=\"https://blog.refidao.com/refi-local-nodes-on-gitcoin/\" class=\"inline-onebox\" rel=\"noopener nofollow ugc\">ReFi Local Nodes 2023 - Round Results &amp; What's Coming Next?</a> This investment has enabled the launch of 30+ local nodes that are directly impacting thousands of people across the globe with improved economic opportunities and access to sustainable resources. Check out the full impact report of Local Nodes in 2023 here: <a href=\"https://mirror.xyz/refidao.eth/pzwS5ape0Zqu5mnqKM60eIqMfBtLjQ18UEy1jiDeAHU?ref=blog.refidao.com\" rel=\"noopener nofollow ugc\">Regenerative Journeys: ReFi Local Nodes 2023 Roundup</a>.</p>\n<p></p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://europe1.discourse-cdn.com/standard21/uploads/octant/original/1X/039e0f929212ec4b2cb988e70aba19cac793d5b9.jpeg\" data-download-href=\"/uploads/short-url/w04IPqzcOTWQu1AePYR34n98nv.jpeg?dl=1\" title=\"image\" rel=\"noopener nofollow ugc\"><img src=\"https://europe1.discourse-cdn.com/standard21/uploads/octant/optimized/1X/039e0f929212ec4b2cb988e70aba19cac793d5b9_2_690x379.jpeg\" alt=\"image\" data-base62-sha1=\"w04IPqzcOTWQu1AePYR34n98nv\" width=\"690\" height=\"379\" srcset=\"https://europe1.discourse-cdn.com/standard21/uploads/octant/optimized/1X/039e0f929212ec4b2cb988e70aba19cac793d5b9_2_690x379.jpeg, https://europe1.discourse-cdn.com/standard21/uploads/octant/optimized/1X/039e0f929212ec4b2cb988e70aba19cac793d5b9_2_1035x568.jpeg 1.5x, https://europe1.discourse-cdn.com/standard21/uploads/octant/optimized/1X/039e0f929212ec4b2cb988e70aba19cac793d5b9_2_1380x758.jpeg 2x\" data-dominant-color=\"2A4153\"></a></div><p></p>\n<h1><a name=\"h-2024-objectives-3\" class=\"anchor\" href=\"https://discuss.octant.app#h-2024-objectives-3\"></a>2024 Objectives</h1>\n<p>In 2024, ReFi DAO is recirculating around 3 key objectives, as follows:</p>\n<h3><a name=\"key-objective-1-empower-and-expand-the-global-network-of-refi-dao-local-nodes-4\" class=\"anchor\" href=\"https://discuss.octant.app#key-objective-1-empower-and-expand-the-global-network-of-refi-dao-local-nodes-4\"></a><strong>Key Objective 1: Empower and Expand the Global Network of ReFi DAO Local Nodes</strong></h3>\n<p><strong>Key Results:</strong></p>\n<ol>\n<li>Successfully conclude our Local Node Beta Incubator program by Q2 2024, aiming to support the launch and development of new local nodes focused on specific environmental or social impact goals. See here: <a href=\"https://blog.refidao.com/local-node-beta-incubator/\" class=\"inline-onebox\" rel=\"noopener nofollow ugc\">Welcome to the Local Node Beta Incubator! 🌱</a></li>\n<li>Formally establish and onboard 50+ local nodes with tailored support agreements by Q4 2024, enhancing global outreach and impact.</li>\n<li>Collaborate with partners such as <a href=\"https://celopg.eco/\" rel=\"noopener nofollow ugc\">Celo Public Goods</a>, <a href=\"https://greenpill.network/\" rel=\"noopener nofollow ugc\">GreenPill Network</a>, <a href=\"https://spark.eco/\" rel=\"noopener nofollow ugc\">Spark Eco/Deresy</a>, and others, to develop and deploy a custom hypercert minter tool by Q4 2024. This tool should improve user experience (UX) and streamline the process for minting hypercerts across all Local Nodes, enabling a decentralized and transparent approach to contribution and impact tracking of Local Nodes.</li>\n</ol>\n<h3><a name=\"key-objective-2-enhance-refi-daos-governance-legal-framework-and-operations-5\" class=\"anchor\" href=\"https://discuss.octant.app#key-objective-2-enhance-refi-daos-governance-legal-framework-and-operations-5\"></a><strong>Key Objective 2: Enhance ReFi DAO’s Governance, Legal Framework, and Operations</strong></h3>\n<p><strong>Key Results:</strong></p>\n<ol>\n<li>Draft, finalize, and ratify the ReFi DAO 2024 constitution with at least 80% community approval by Q3, laying the groundwork for formalized, transparent and inclusive DAO governance.</li>\n<li>Complete partnership between <a href=\"https://trustedseed.org/\" rel=\"noopener nofollow ugc\">Trusted Seed </a> and their <a href=\"https://regenscore.io/\" rel=\"noopener nofollow ugc\">Regen Score</a> product to develop and implement a robust Reputation Points system that enhances reputation, governance, contribution accounting, and incentive dynamics across the global ReFi DAO network by Q3 2024. Also including integration with tools such as Hats Protocol, Coordinape, and Ethereum Attestations to effectively manage the points-scoring process at scale.</li>\n<li>Formalize legal arrangements for ReFi DAO and align the technical strategy for DAO operations &amp; governance with best practices, ensuring compliance and scalability.</li>\n</ol>\n<h3><a name=\"key-objective-3-deploy-mvp-of-the-refi-passport-6\" class=\"anchor\" href=\"https://discuss.octant.app#key-objective-3-deploy-mvp-of-the-refi-passport-6\"></a><strong>Key Objective 3: Deploy MVP of the ReFi Passport</strong></h3>\n<p>Launch a ReFi Passport MVP this year. Our vision is to become the daily habit for regeneration in web3. This dApp will aggregate key behaviours across keystone ReFi projects into a single interface. Users can collect stamps, gain perks, earn rewards and get access to exclusive in-person and online events. With a mobile-passport solution, we want to enable Local Nodes to launch membership programs to create decentralized regenerative societies in startup cities around the world. Like CabinDAO but for regenerative experiences, we want to enable urban leaders across public, private and third sector to experience the power of regeneration first-hand through a mobile experience that draws them deeper into the ReFi &amp; Web3 ecosystem with every daily interaction.</p>\n<p><strong>Key Result</strong>: Build on-top of existing technologies and solutions to deploy a ReFi Passport MVP to to test, learn and demonstrate initial traction. In partnership with Trusted Seed, we can create a dataset of on-chain ReFi actions that can appear on a custom Regen Score dashboard designed specifically for this purpose.</p>\n<h2><a name=\"funding-goal-7\" class=\"anchor\" href=\"https://discuss.octant.app#funding-goal-7\"></a><strong>Funding Goal</strong></h2>\n<p>We are aiming to raise a minimum of $50,000 this year to reach the above milestones and objectives in 2024.  Funding from Octant would allow us to build on ReFi DAO’s strong foundations and realize our vision of a global network society to regenerate the earth.</p>\n<h1><a name=\"team-8\" class=\"anchor\" href=\"https://discuss.octant.app#team-8\"></a><strong>Team</strong></h1>\n<p>Our core team currently consists of four key people (Monty, Anna, Scott, Luiz) but is also supported by a global network of contributors from around the world.</p>\n<p><strong>Monty (Merlin) Bryant</strong> (<a href=\"https://linktr.ee/montybryant\" rel=\"noopener nofollow ugc\">Linktree</a>) - Founder at ReFi DAO, board member at <a href=\"https://trustedseed.org/\" rel=\"noopener nofollow ugc\">Trusted Seed </a>, steward at <a href=\"https://celopg.eco/\" rel=\"noopener nofollow ugc\">Celo Public Goods </a>. TEDx speaker ‘<a href=\"https://www.youtube.com/watch?v=9-4HW3iPtfo&amp;ab_channel=TEDxTalks\" rel=\"noopener nofollow ugc\">Can Crypto Regenerate the World</a>’.</p>\n<p><strong>Anna Kaić</strong> (<a href=\"https://twitter.com/KaicAnna\" rel=\"noopener nofollow ugc\">Twitter </a>, <a href=\"https://www.linkedin.com/in/anna-kaic\" rel=\"noopener nofollow ugc\">LinkedIn</a>) - ReFi DAO marketing manager and currently leading the <a href=\"https://blog.refidao.com/local-node-beta-incubator/\" rel=\"noopener nofollow ugc\">Local Node Beta Cohort &amp; Incubator Program</a>. She has been in the blockchain-for-good space since 2021, working on marketing and communications for projects like Proof of Humanity, the Crypto Commons Association, MetaGame and Urbánika. She is currently a scholar of SheFi Season 10.</p>\n<p><strong>Scott Morris</strong> (<a href=\"https://www.linkedin.com/in/cscottmorris/\" rel=\"noopener nofollow ugc\">LinkedIn</a>) - Currently co-leading the Local Node Beta Cohort, Scott is a political economist and economics systems engineer operating at the intersection of capital, currency, and collective consciousness. He utilizes an interdisciplinary, systems approach which focuses on stakeholders and structural incentives relative to behaviors and outcomes, and draws on deeply specialized knowledge in regenerative finance and complementary currencies.</p>\n<p><strong>Luiz Fernando</strong> (<a href=\"https://twitter.com/louizfe\" rel=\"noopener nofollow ugc\">Twitter</a>) - Founder &amp; lead of <a href=\"https://publish.obsidian.md/refi-barcelona\" rel=\"noopener nofollow ugc\">ReFi Barcelona</a>, steward at <a href=\"https://trustedseed.org/\" rel=\"noopener nofollow ugc\">Trusted Seed</a>, operations lead at ReFi DAO.</p>\n<h1><a name=\"why-is-this-project-important-9\" class=\"anchor\" href=\"https://discuss.octant.app#why-is-this-project-important-9\"></a><strong>Why is this project important?</strong></h1>\n<p>ReFi DAO stands at the intersection of technology, finance, and ecological sustainability, driving forward the mission to regenerate the Earth while fostering a fair and inclusive economic system. Our project is important for several reasons:</p>\n<ol>\n<li><strong>Addressing Environmental Challenges:</strong> In the face of escalating environmental crises, including climate change, biodiversity loss, and pollution, ReFi DAO supports tangible solutions through regenerative finance. By leveraging blockchain technology, we facilitate investments in projects that have a direct positive impact on the environment, encouraging practices that restore rather than deplete natural resources.</li>\n<li><strong>Promoting Economic Inclusivity:</strong> Traditional financial systems often exclude marginalized communities, limiting access to funding for projects that could benefit both the environment and the community. ReFi DAO breaks down these barriers, offering a decentralized alternative that empowers individuals and communities worldwide to participate in the financing of projects that align with their values and needs.</li>\n<li><strong>Innovating for Sustainable Development:</strong> Our commitment to developing public goods and supporting the ReFi ecosystem with tools and resources underscores our role in innovating for sustainable development. ReFi DAO’s initiatives, such as the ReFi Passport and the support of Local Nodes, provide the infrastructure and network necessary for the widespread adoption of regenerative practices.</li>\n<li><strong>Fostering Community Empowerment:</strong> By building a global network of ReFi Local Nodes, we enable localized action and decision-making, ensuring that solutions are tailored to the specific needs and contexts of communities. This grassroots approach not only amplifies impact but also strengthens community cohesion and resilience against environmental and economic challenges.</li>\n<li><strong>Leading a Cultural Shift:</strong> ReFi DAO is at the vanguard of a cultural shift towards sustainability, regeneration, and decentralization. By championing regenerative finance, we advocate for a future where economic activities contribute to the healing of the planet and the well-being of its inhabitants. Our work inspires and mobilizes a growing community of individuals and organizations committed to making this vision a reality.</li>\n</ol>\n<h2><a name=\"project-links-resources-10\" class=\"anchor\" href=\"https://discuss.octant.app#project-links-resources-10\"></a><strong>Project Links &amp; Resources</strong></h2>\n<p><a href=\"https://twitter.com/refidaoist\" rel=\"noopener nofollow ugc\">Twitter</a>, <a href=\"https://www.linkedin.com/company/refi-dao/\" rel=\"noopener nofollow ugc\">LinkedIn</a>, <a href=\"https://www.youtube.com/@refidao\" rel=\"noopener nofollow ugc\">Youtube</a>, <a href=\"https://blog.refidao.com/#/portal/signup\" rel=\"noopener nofollow ugc\">Blog</a>, <a href=\"https://twitter.com/ReFiPodcast\" rel=\"noopener nofollow ugc\">ReFi Podcast</a></p>\n            <p><small>4 posts - 1 participant</small></p>\n            <p><a href=\"https://discuss.octant.app/t/refi-dao-a-network-society-to-regenerate-the-earth/273\">Read full topic</a></p>","link":"https://discuss.octant.app/t/refi-dao-a-network-society-to-regenerate-the-earth/273","pubDate":"Sun, 17 Mar 2024 16:44:03 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"discuss.octant.app-topic-273"},"source":{"@url":"https://discuss.octant.app/t/refi-dao-a-network-society-to-regenerate-the-earth/273.rss","#text":"🔵 ReFi DAO - A Network Society to Regenerate the Earth"}},{"title":"LexDAO: law is a public good","dc:creator":"bestape","category":"Public Good Projects Discussion","description":"<p>List defined <a href=\"https://docs.octant.app/submission-process.html#project-information-submission\" rel=\"noopener nofollow ugc\">here</a>:</p>\n<ol>\n<li>the “contributions” and “impact” paragraphs below:</li>\n</ol>\n<h2><a name=\"contributions-1\" class=\"anchor\" href=\"https://discuss.octant.app#contributions-1\"></a>contributions</h2>\n<p>LexDAO is a club of legal engineering professionals united to bring the traditional legal settlement layer to code and coded agreements to the masses. We believe that everyone deserves access to justice in a quick and efficient manner. If legal services were easier to use, verify and enforce, we could live in a fairer world.</p>\n<p>LexDAO organizes sophisticated conversations and educational materials to help orient people around how to build in the new and evolving space. LexDAO focuses on Code is Law applications where practical legal theory is embedded into smart contracts, applications and networks. The efforts we undertake are all in the spirit of public goods and services. Many of our projects spin out into standalone tools or services; some examples include KaliDAO and Smart Invoice.</p>\n<h2><a name=\"impact-2\" class=\"anchor\" href=\"https://discuss.octant.app#impact-2\"></a>impact</h2>\n<p>We’ve done many projects over the years, and recently got a grant big enough to start publishing comprehensive annual reports!</p>\n<p>Examples of high-impact are Real World Asset “RWA” offshoot projects like <a href=\"https://twitter.com/TaterDao\" rel=\"noopener nofollow ugc\">Tater</a> and <a href=\"https://twitter.com/CougarDao\" rel=\"noopener nofollow ugc\">Cougar</a>, using our offshoot project Kali for the DAO OS. These Kali RWA project are making important strides in web3 real estate. Like many other on-chain DAO deployers, Kali is the culmination of LexDAO Projects related to onchain governance, arbitration and corporate structures. The smart contract code is greatly simplified which makes it easier to read and secure assets on-chain.</p>\n<p>Another example is <a href=\"https://app.smartinvoice.xyz/\" rel=\"noopener nofollow ugc\">Smart Invoice</a>, a tool by a 3rd party built on LexDAO’s public-good lawtech <a href=\"https://github.com/lexdao/lexlockerv2\" rel=\"noopener nofollow ugc\">LexLocker</a> that is designed to provide web3 workers with cryptocurrency invoicing, escrow and arbitration capabilities. As with most LexDAO affiliated solutions, Smart Invoice is built in an open source framework so that other developers can build on top of its code. It is designed for clients and contractors to make the facilitation of crypto-payments easier to use and safer for both parties involved.</p>\n<p>Community members don’t strictly need to pay to join, since LexDAO has both paid subscriptions and also contribution. More about that at <a href=\"https://lexdao.org/membership/\" class=\"inline-onebox\" rel=\"noopener nofollow ugc\">Membership | LexDAO Legal Engineering Guild</a> .</p>\n<ol start=\"2\">\n<li>“Law is a public good. If law isn’t a public good, all public goods are in threat.”</li>\n</ol>\n<p>A more visceral ‘NSFW’ video by one of our core members <a href=\"https://twitter.com/KylerW56/status/1762839012765532178\" rel=\"noopener nofollow ugc\">here</a>.</p>\n<ol start=\"3\">\n<li>\n<p>SVG logo <a href=\"https://picsvg.com/svg/TWRjR301.svg\" rel=\"noopener nofollow ugc\">here</a>.</p>\n</li>\n<li>\n<p><a href=\"http://lexdao.org\" rel=\"noopener nofollow ugc\">lexdao.org</a> , <a href=\"http://x.com/lex_dao\" rel=\"noopener nofollow ugc\">x.com/lex_dao</a> , <a href=\"http://lexdao.substack.com\" rel=\"noopener nofollow ugc\">lexdao.substack.com</a></p>\n</li>\n<li>\n<p><a href=\"https://signer.is/sign\" class=\"inline-onebox\" rel=\"noopener nofollow ugc\">Signer.is - sign messages with your crypto wallet</a> wallet: 0x966a4b9d5D2E01799170a0865C2D1cBBc1904163</p>\n</li>\n</ol>\n<h1><a name=\"epoch-3-application-form-sumission-with-minor-changes-3\" class=\"anchor\" href=\"https://discuss.octant.app#epoch-3-application-form-sumission-with-minor-changes-3\"></a>Epoch 3 application form sumission with minor changes</h1>\n<h2><a name=\"what-are-your-main-project-funding-sources-4\" class=\"anchor\" href=\"https://discuss.octant.app#what-are-your-main-project-funding-sources-4\"></a>what are your main project funding sources?</h2>\n<p>Grants funding, user donations, other.</p>\n<h2><a name=\"how-much-have-you-raised-for-each-of-your-funding-sources-and-from-who-5\" class=\"anchor\" href=\"https://discuss.octant.app#how-much-have-you-raised-for-each-of-your-funding-sources-and-from-who-5\"></a>how much have you raised for each of your funding sources and from who?</h2>\n<p>~79,500 OP from RetroPGF3, ~$70,000 from Gitcoin rounds, <a href=\"https://giveth.io/project/lexdao\" rel=\"noopener nofollow ugc\">~$710 from Giveth</a></p>\n<h2><a name=\"are-you-seeking-6\" class=\"anchor\" href=\"https://discuss.octant.app#are-you-seeking-6\"></a>are you seeking</h2>\n<p>Project-specific funding, funding for general operations</p>\n<h2><a name=\"has-your-project-launced-or-planning-to-launch-a-token-7\" class=\"anchor\" href=\"https://discuss.octant.app#has-your-project-launced-or-planning-to-launch-a-token-7\"></a>has your project launced or planning to launch a token?</h2>\n<p>No</p>\n<h2><a name=\"share-your-project-rodemap-8\" class=\"anchor\" href=\"https://discuss.octant.app#share-your-project-rodemap-8\"></a>share your project rodemap:</h2>\n<p>Finalizing now, because of the RetroPGF3 grant we’ve been able to switch from keeping the lights on to getting back to initiatives</p>\n<h2><a name=\"what-milestones-have-you-achieved-9\" class=\"anchor\" href=\"https://discuss.octant.app#what-milestones-have-you-achieved-9\"></a>what milestones have you achieved?</h2>\n<p>Cryptolawer directory, newsletter, weekly study group, ETHDenver events, multiple services and products offshoots such as <a href=\"https://twitter.com/cougardao\" rel=\"noopener nofollow ugc\">https://twitter.com/cougardao</a> , <a href=\"https://twitter.com/taterdao\" rel=\"noopener nofollow ugc\">https://twitter.com/taterdao</a> , <a href=\"https://doc.lex.clinic\" rel=\"noopener nofollow ugc\">https://doc.lex.clinic</a> (running Creative Commons working group on NFTs), <a href=\"https://lexblock.xyz\" rel=\"noopener nofollow ugc\">https://lexblock.xyz</a> , <a href=\"https://twitter.com/kali__gg\" rel=\"noopener nofollow ugc\">https://twitter.com/kali__gg</a> , <a href=\"https://twitter.com/ixiantech\" rel=\"noopener nofollow ugc\">https://twitter.com/ixiantech</a> , <a href=\"https://www.daocoalition.org\" rel=\"noopener nofollow ugc\">https://www.daocoalition.org</a> , <a href=\"https://x.com/web3coalition\" rel=\"noopener nofollow ugc\">https://x.com/web3coalition</a> (got <a href=\"http://DDEX.net\" rel=\"noopener nofollow ugc\">DDEX.net</a> to create an NFT working group with a web3 leader as co-chair, Open Source Orchestra collab bull-revival plans for this year’s Music Biz conference), <a href=\"https://folk.gg\" rel=\"noopener nofollow ugc\">https://folk.gg</a> (experiments in web3 permissionless-copyright), helped Hats Protocol integrate <a href=\"http://Snapshot.org\" rel=\"noopener nofollow ugc\">Snapshot.org</a> and Gitcoin Passport</p>\n<h2><a name=\"tell-us-more-about-milestones-youd-like-to-achieve-10\" class=\"anchor\" href=\"https://discuss.octant.app#tell-us-more-about-milestones-youd-like-to-achieve-10\"></a>tell us more about milestones you’d like to achieve</h2>\n<p>During the bear market, we were focued on keeping the lights on. Now that we have funds again we plan to have a dedicated General Counsel who can produce public good templates for the web3 community, spin up the Journal of Legal Engineering with <a href=\"https://descier.science\" rel=\"noopener nofollow ugc\">https://descier.science</a> , attend and host events at multiple conferences as we did with ETHDenver 2024, turn grants-out back on including retroactive funding for groups like <a href=\"https://coala.global\" rel=\"noopener nofollow ugc\">https://coala.global</a> , improve our legal dicrectory, turn weekly legal hacks back on (we already turned weekly study group back on), switch to <a href=\"https://www.hatsprotocol.xyz\" rel=\"noopener nofollow ugc\">https://www.hatsprotocol.xyz</a> governance, complete the web3-GAAP tools proto-described at <a href=\"https://ape.mirror.xyz\" rel=\"noopener nofollow ugc\">https://ape.mirror.xyz</a> as iNFTs and legal seals and likely other initiatives by our members as we open our roadmap up to DAO-wide planning this month.</p>\n<h2><a name=\"funding-goal-and-budget-11\" class=\"anchor\" href=\"https://discuss.octant.app#funding-goal-and-budget-11\"></a>funding goal and budget</h2>\n<p>$300,000 to fund the remainder of 2024 as we plan to spend the ~$300,000 RetroPGF3 grant within 6 months. Legal and automating law is expensive so we could definitely make a major impact if we had a million-dollar a year budget. However, as a DAO with a powerful self-evident idea as our mission – <strong>law is a public good</strong> – we can survive with no budget.</p>\n<h2><a name=\"tell-us-more-about-your-team-12\" class=\"anchor\" href=\"https://discuss.octant.app#tell-us-more-about-your-team-12\"></a>tell us more about your team</h2>\n<p>Some of the top legal engineers and cyptolawyers are members of LexDAO. Here is a list of some of our members: <a href=\"https://twitter.com/search?q=lexdao&amp;src=typed_query&amp;f=user\" rel=\"noopener nofollow ugc\">https://twitter.com/search?q=lexdao&amp;src=typed_query&amp;f=user</a> <a href=\"https://twitter.com/search?q=lex_dao&amp;src=typed_query&amp;f=user\" rel=\"noopener nofollow ugc\">https://twitter.com/search?q=lex_dao&amp;src=typed_query&amp;f=user</a></p>\n<p>Our event at the Gitcoin House this ETHDenver had x3 the capacity sign up to attend: <a href=\"https://twitter.com/lex_DAO/status/1762904086633177247\" rel=\"noopener nofollow ugc\">https://twitter.com/lex_DAO/status/1762904086633177247</a></p>\n<h2><a name=\"social-credibility-development-progress-awards-notable-github-commits-referrals-13\" class=\"anchor\" href=\"https://discuss.octant.app#social-credibility-development-progress-awards-notable-github-commits-referrals-13\"></a>social credibility (development progress, awards, notable GitHub commits, referrals)</h2>\n<p><a href=\"https://optimistic.etherscan.io/address/0x581b5e51ffbb742f92e818fb177cad8a30e43f3e\" class=\"inline-onebox\" rel=\"noopener nofollow ugc\">KaliCoRicardianLLC | Address 0x581b5e51ffbb742f92e818fb177cad8a30e43f3e | OP Mainnet</a> , <a href=\"https://github.com/lexdao/ricardian\" class=\"inline-onebox\" rel=\"noopener nofollow ugc\">GitHub - lexDAO/Ricardian</a> , <a href=\"https://github.com/lexdao/lexlockerv2\" class=\"inline-onebox\" rel=\"noopener nofollow ugc\">GitHub - lexDAO/LexLockerV2: Simple, multi-purpose escrow system for business on evm-compatible chains</a> , <a href=\"https://github.com/lexdao/kali\" class=\"inline-onebox\" rel=\"noopener nofollow ugc\">GitHub - lexDAO/Kali: Optimized DAC Protocol</a> , <a href=\"https://github.com/kalidao/wrappr\" class=\"inline-onebox\" rel=\"noopener nofollow ugc\">GitHub - kalidao/wrappr</a> , <a href=\"https://github.com/kalidao/keep\" class=\"inline-onebox\" rel=\"noopener nofollow ugc\">GitHub - kalidao/keep: Tokenized multisig wallet.</a> , <a href=\"https://lexdao.substack.com/s/lexnews-weekly\" class=\"inline-onebox\" rel=\"noopener nofollow ugc\">LexNews+ Weekly | ⚔️ LexNews+ ⚖️ | LexDAO | Substack</a> , <a href=\"https://lexdao.substack.com/\" rel=\"noopener nofollow ugc\">https://lexdao.substack.com/</a> , <a href=\"https://ie.nani.ooo/\" rel=\"noopener nofollow ugc\">https://ie.nani.ooo/</a> , <a href=\"https://github.com/lexDAO/hackmd\" class=\"inline-onebox\" rel=\"noopener nofollow ugc\">GitHub - lexDAO/hackmd: https://hackmd.io/team/lex-dao</a></p>\n<h2><a name=\"whys-your-project-important-14\" class=\"anchor\" href=\"https://discuss.octant.app#whys-your-project-important-14\"></a>why’s your project important?</h2>\n<p>Law affects so many parts of our lives. Lowering the cost of law has an exponential impact on human collaboration. Legal automation offers amazing opportunities to lower costs, but not all law can be automated. As such, LexDAO works in deterministic law (very automatable) and discretionary law (high-level reasons). Most importantly, we do this work as open source for the public good. Too few organizations offer pro-bono web3 legal services, and there ais more demand than LexDAO can currently offer; an Octant grant will help us scale to meet demand.</p>\n<h2><a name=\"whats-your-projects-twitter-handle-15\" class=\"anchor\" href=\"https://discuss.octant.app#whats-your-projects-twitter-handle-15\"></a>what’s your project’s Twitter handle?</h2>\n<p><span class=\"mention\">@lex_dao</span></p>\n<h2><a name=\"github-link-16\" class=\"anchor\" href=\"https://discuss.octant.app#github-link-16\"></a>GitHub link</h2>\n<aside class=\"onebox allowlistedgeneric\" data-onebox-src=\"https://github.com/lexdao\">\n  <header class=\"source\">\n      <img src=\"https://github.githubassets.com/favicons/favicon.svg\" class=\"site-icon\" width=\"32\" height=\"32\">\n\n      <a href=\"https://github.com/lexdao\" target=\"_blank\" rel=\"noopener nofollow ugc\">GitHub</a>\n  </header>\n\n  <article class=\"onebox-body\">\n    <img width=\"280\" height=\"280\" src=\"https://europe1.discourse-cdn.com/standard21/uploads/octant/original/1X/3453e5760f5ee563d092f2c9fc8b1e8e4ff364df.jpeg\" class=\"thumbnail onebox-avatar\" data-dominant-color=\"41203D\">\n\n<h3><a href=\"https://github.com/lexdao\" target=\"_blank\" rel=\"noopener nofollow ugc\">LexDAO</a></h3>\n\n  <p>Web3 Legal Engineering Guild. LexDAO has 114 repositories available. Follow their code on GitHub.</p>\n\n\n  </article>\n\n  <div class=\"onebox-metadata\">\n    \n    \n  </div>\n\n  <div style=\"clear: both\"></div>\n</aside>\n\n<h2><a name=\"project-discord-link-17\" class=\"anchor\" href=\"https://discuss.octant.app#project-discord-link-17\"></a>project Discord link</h2>\n<p><a href=\"https://discord.gg/dAySQQPPsD\" rel=\"noopener nofollow ugc\">http://</a></p>\n<h2><a name=\"discord-contact-18\" class=\"anchor\" href=\"https://discuss.octant.app#discord-contact-18\"></a>Discord contact:</h2>\n<p><a class=\"mention\" href=\"https://discuss.octant.app/u/bestape\">@bestape</a></p>\n<h2><a name=\"telegram-contact-19\" class=\"anchor\" href=\"https://discuss.octant.app#telegram-contact-19\"></a>Telegram contact:</h2>\n<p><a class=\"mention\" href=\"https://discuss.octant.app/u/bestape\">@bestape</a></p>\n<h2><a name=\"wallet-address-20\" class=\"anchor\" href=\"https://discuss.octant.app#wallet-address-20\"></a>wallet address:</h2>\n<p>0x966a4b9d5D2E01799170a0865C2D1cBBc1904163</p>\n<h2><a name=\"anything-else-youd-like-us-to-know-21\" class=\"anchor\" href=\"https://discuss.octant.app#anything-else-youd-like-us-to-know-21\"></a>anything else you’d like us to know?</h2>\n<p>We’d love to chat with you if you’d like to learn more about LexDAO. We’re a DAO with a complex legacy, so it migth make sense to interview our core and OG members. Feel free to reach out to me on Telegram if you’re interested.</p>\n<p>We have a grants call every Friday in our server at 8AM PST open to the public.</p>\n<h2><a name=\"what-can-the-octant-team-help-you-with-22\" class=\"anchor\" href=\"https://discuss.octant.app#what-can-the-octant-team-help-you-with-22\"></a>what can the Octant team help you with?</h2>\n<p>Help us revive our legal hacks call by coding with us! Would you like legal help? Prease reach out to us!</p>\n<h2><a name=\"how-do-you-define-impact-for-your-project-what-metrics-are-you-tracking-23\" class=\"anchor\" href=\"https://discuss.octant.app#how-do-you-define-impact-for-your-project-what-metrics-are-you-tracking-23\"></a>how do you define impact for your project? what metrics are you tracking?</h2>\n<p>We hope to spend our funds on better capturing metrics. Too much of our impact goes unquantified. Important metrics we are caputing include: number of active members, growth of our newsletter, attendees at our IRL vents, how many offshoots have spun out of our DAO, how many people looking for legal services awe connect with cryptolawyers.</p>\n<h2><a name=\"share-your-project-impact-metrics-and-results-24\" class=\"anchor\" href=\"https://discuss.octant.app#share-your-project-impact-metrics-and-results-24\"></a>share your project impact metrics and results</h2>\n<p>We would love to work with you and other professionals to help us better capture metrics, plan a portion of our OP RetroPGF3 to create an anual impact report. We’ve already reached out to <a href=\"https://twitter.com/carl_cervone\" rel=\"noopener nofollow ugc\">https://twitter.com/carl_cervone</a> and General Magic for assistance and might begin this process as early as April 2024 circa during Stanford’s CodeX futurelaw conference.</p>\n<p>Some thoughts about better metrics reporting: how many offshoots (e.g. Kali, TaterDAO, Clinic)? what impact do those offshoots have? how many members? how many people we help find lawyers? how many questions we answer in our Discord? how many study groups we have and how many people attend? how many IRL life events we have and how many attendees? how many people subscribe to our newsletter? for our offshoots that publish smart contracts how often those contracts are used and in what way? when we start grants-out again how do we capture metrics there?</p>\n            <p><small>6 posts - 2 participants</small></p>\n            <p><a href=\"https://discuss.octant.app/t/lexdao-law-is-a-public-good/271\">Read full topic</a></p>","link":"https://discuss.octant.app/t/lexdao-law-is-a-public-good/271","pubDate":"Sun, 17 Mar 2024 05:46:02 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"discuss.octant.app-topic-271"},"source":{"@url":"https://discuss.octant.app/t/lexdao-law-is-a-public-good/271.rss","#text":"LexDAO: law is a public good"}},{"title":"Kairos Research - Project Minga a landscape of web3 latam projects","dc:creator":"ariiellus","category":"Public Good Projects Discussion","description":"<h1><a name=\"what-is-kairos-research-and-why-we-are-a-public-good-1\" class=\"anchor\" href=\"https://discuss.octant.app#what-is-kairos-research-and-why-we-are-a-public-good-1\"></a>What is Kairos Research and why we are a public good?</h1>\n<p>We are developing a data and research platform focused on web3 technology analysis. Our main priority is to provide high quality resources to the Spanish-speaking community in order to allow latam people get aware of the latests opportunities in the industry.</p>\n<p>In greek Kairos mean <em>moments of opportune action</em> and that is what we want to provide to our mates across latam. The ultimate source of opportunities to them.</p>\n<h2><a name=\"the-goal-2\" class=\"anchor\" href=\"https://discuss.octant.app#the-goal-2\"></a>THE GOAL</h2>\n<p>This application serves the purpose of conducting research on the landscape of web3 projects across Latin America, with the aim of creating a comprehensive public database for each country. By establishing a publicly accessible database encompassing the entire Latin American ecosystem, newcomers will find it easier to engage with projects and become part of the different communities.</p>\n<h2><a name=\"why-this-is-important-3\" class=\"anchor\" href=\"https://discuss.octant.app#why-this-is-important-3\"></a>Why this is important?</h2>\n<p>Our role is pivotal in bridging information gaps, shining a spotlight on projects and communities throughout Latin America, fostering innovation, and nurturing collaboration within the web3 ecosystem. Our initiative serves as a valuable resource poised to catalyze positive change and further the expansion of web3 in the region. Currently, there’s a notable absence of comprehensive mapping showcasing all active projects and communities in Latin America, highlighting the urgency and necessity of our endeavor.</p>\n<ol>\n<li><strong>Bridging Information Gaps:</strong> Our proposal aims to bridge the information gap by conducting extensive research on web3 projects across Latin America. We will curate this information into an intuitive interactive map, ensuring easy access to valuable resources for both newcomers and seasoned professionals in the web3 sphere.</li>\n<li><strong>Fostering Community Collaboration:</strong> Our focus on Latin American communities will foster collaboration and engagement with web3 technology. This initiative will serve as a platform for all Latin American countries to come together, share knowledge, and collaborate on web3 projects, fostering a cohesive regional ecosystem.</li>\n<li><strong>Empowering Innovation:</strong> Through the creation of a publicly accessible database and interactive map, we aim to empower innovation in Latin America’s web3 landscape. This platform will showcase existing projects, facilitate networking opportunities, and potentially attract investments and partnerships. Ultimately, it will drive innovation and growth within the region’s web3 sector.</li>\n</ol>\n<h1><a name=\"the-team-4\" class=\"anchor\" href=\"https://discuss.octant.app#the-team-4\"></a>The Team</h1>\n<p><strong>Ariel Cardenas</strong></p>\n<ul>\n<li><a href=\"https://twitter.com/Ariiellus\" rel=\"noopener nofollow ugc\">Twitter</a></li>\n<li><a href=\"https://www.linkedin.com/in/ariiellus/\" rel=\"noopener nofollow ugc\">LinkedIn</a></li>\n</ul>\n<p>Mechanical Engineer Bachelor by Benemérita Universidad Autónoma de Puebla, Project Management Specialist by Platzi, Token Engineer by Token Engineering Academy, currently coursing Game Theory courses by Stanford University on Coursera. Kairos Research cofounder, Ethereum Mexico cofounder, ex contributor of BanklessDAO, Cryptoversidad &amp; Arch finance.</p>\n<p><strong>Jorge Magni</strong></p>\n<ul>\n<li><a href=\"https://x.com/jorge_magni\" rel=\"noopener nofollow ugc\">Twitter</a></li>\n<li><a href=\"https://www.linkedin.com/in/jorge-magni\" rel=\"noopener nofollow ugc\">LinkedIn</a></li>\n</ul>\n<p>Finance Bachelor by Benemérita Universidad Autónoma de Puebla, Token Engineer by Token Engineering Academy, currently coursing Data Analyst certification by Data Camp. Kairos Research cofounder, ex researcher of Entorno Blockchain.</p>\n<p><strong>Alejandro Ramos</strong></p>\n<ul>\n<li><a href=\"https://twitter.com/AleRaMo30\" rel=\"noopener nofollow ugc\">Twitter</a></li>\n<li><a href=\"https://www.linkedin.com/in/alejandroramosmorales/\" rel=\"noopener nofollow ugc\">LinkedIn</a></li>\n</ul>\n<p>Audiovisual producer graduated in cinematography and audiovisual media, collaborator in more than 20 film productions at a professional level, Producer and Director of 2 short films with international nominations, writer of film analysis for 2 film magazines in Mexico. Prev. Audiovisual producer in a NFTs Marketplace project, leader of the commercial area of Satellit Studio, winner in Eth Global hackathon, Scrum specialist, I have covered events for several web 3 events in Mexico as Media Partner. Kairos Research cofounder.</p>\n<p>Here are some of our achievements:</p>\n<ul>\n<li>Celo Incubator Program.</li>\n<li>Funded through Gitcoin Grants Rounds (Beta, Citizen, 18 &amp; 19).</li>\n<li>Team members have been speakers in more than 10 IRL meetups in the last year.</li>\n<li><a href=\"https://twitter.com/carlosjmelgar/status/1687470038998036480\" rel=\"noopener nofollow ugc\">Honorable Mention</a> by Carlos Melgar, Head of Memepact at Gitcoin</li>\n<li><a href=\"https://twitter.com/brichis_/status/1687467852066942976\" rel=\"noopener nofollow ugc\">Honorable Mention</a> by Brichis, delegate of Optimism.</li>\n<li><a href=\"https://www.notion.so/Honorable-Mention-by-Bryce-Patric-from-the-EAS-team-090bcf92ffef4ae6869014c37095d5f5?pvs=21\" rel=\"noopener nofollow ugc\">Honorable Mention</a> by Bryce Patric from the EAS team.</li>\n<li>Approved to receive <a href=\"https://round3.optimism.io/projects/0xb4e6f65da9c95c3bf4e2113fdb1faf843d024f558734e882fcf4c64c95c043fa\" rel=\"noopener nofollow ugc\">RetroPGF 3</a>.</li>\n<li>Partner with <a href=\"https://twitter.com/makers_fellow/status/1731760939983085966\" rel=\"noopener nofollow ugc\">Makers Felloswhip</a> to be mentors in their next batch for new web3 builders.</li>\n<li>Partner with Meta Pool to release a <a href=\"https://blog.metapool.app/2023/12/01/mpdao-grants-5-results-and-governance-updates/\" rel=\"noopener nofollow ugc\">Deep Dive research for Meta Pool</a> and an <a href=\"https://flipsidecrypto.xyz/pabs/metapool-wFfjux\" rel=\"noopener nofollow ugc\">analytics dashboard</a>.</li>\n<li>Currently we are working on a project with <a href=\"https://pbsfoundation.notion.site/\" rel=\"noopener nofollow ugc\">PBS Foundation</a> to educate people about MEV and PBS across Latam.</li>\n</ul>\n<h1><a name=\"roadmap-5\" class=\"anchor\" href=\"https://discuss.octant.app#roadmap-5\"></a>Roadmap</h1>\n<p>This application has the purpose to make a research on the landscape of web3 projects across latam.</p>\n<ol>\n<li><strong>Project Planning (February 2024):</strong>\n<ul>\n<li>Define project scope, objectives, and key milestones.</li>\n<li>Establish team roles and responsibilities.</li>\n<li>Develop a detailed project plan.</li>\n</ul>\n</li>\n<li><strong>Information Gathering Phase (March 13, 2024 onwards):</strong>\n<ul>\n<li>Kick off data collection process during ETHLatam event.</li>\n<li>Utilize various sources to gather comprehensive information on web3 projects across Latin America.</li>\n</ul>\n</li>\n<li><strong>Design Phase (April 1, 2024):</strong>\n<ul>\n<li>Begin designing the user interface and experience of the interactive map.</li>\n<li>Incorporate feedback from stakeholders to ensure usability and accessibility.</li>\n</ul>\n</li>\n<li><strong>Research Phase (April - August 2024):</strong>\n<ul>\n<li>Conduct in-depth analysis and research on the landscape of web3 projects across Latin America.</li>\n<li>Compile and organize data into a structured format for the database.</li>\n</ul>\n</li>\n<li><strong>V1 Presentation (September 2024):</strong>\n<ul>\n<li>Present the initial version of the data</li>\n<li>Demonstrate the information to different projects and users.</li>\n</ul>\n</li>\n<li><strong>Feedback and Improvements (September - October 2024):</strong>\n<ul>\n<li>Gather feedback from users and projects on the V1 presentation.</li>\n<li>Implement necessary improvements and enhancements based on feedback received.</li>\n</ul>\n</li>\n<li><strong>Final Version (November 2024):</strong>\n<ul>\n<li>Finalize the development of the interactive map.</li>\n<li>Conduct thorough testing to ensure quality and reliability.</li>\n<li>Prepare for the release of the final version to the public.</li>\n</ul>\n</li>\n</ol>\n<p>We have completed the project planning phase and are now progressing towards gathering information. We already make an official announcement during ETHLatam and commenced gathering information at the booth we had at that event.</p>\n<p>Design phase has also begun, members in our team are already brainstorming ideas of the final version of this map.</p>\n<h2><a name=\"milestones-6\" class=\"anchor\" href=\"https://discuss.octant.app#milestones-6\"></a>Milestones</h2>\n<p>The idea to bring <em><strong>a full updated version</strong></em> (<a href=\"https://twitter.com/jaka_labs/status/1600248845589393408\" rel=\"noopener nofollow ugc\">v2022</a>, <a href=\"https://sites.google.com/view/ladreammachine-ashoka/destacados?authuser=0\" rel=\"noopener nofollow ugc\">v2023a</a>, <a href=\"https://www.notion.so/Proyectos-y-Comunidades-hispanohablantes-127a2a0872cc4d8fb7135aae42dc15fb?pvs=21\" rel=\"noopener nofollow ugc\">v2023b</a>) of the landscape of protocols that have been building in latam comes a couple of weeks ago when some people asked us about how many specific projects are in latam. We found that the latest versions available despite to gather and provide value information they are not complete.</p>\n<ol>\n<li><strong>Comprehensive Data Collection:</strong>\n<ul>\n<li>Gather detailed information on web3 projects across Latin America, focusing on key countries like Mexico, Colombia, Honduras, Peru, Argentina, and indirectly covering the remaining countries in the region.</li>\n<li>Ensure the accuracy and completeness of the gathered data to provide valuable insights to users.</li>\n</ul>\n</li>\n<li><strong>Interactive Map Development:</strong>\n<ul>\n<li>Develop an interactive map using Figma to visualize the landscape of web3 projects in Latin America.</li>\n<li>Ensure the map is user-friendly and intuitive, allowing users to explore and interact with the data effectively.</li>\n</ul>\n</li>\n<li><strong>Presentation at Ethereum Mexico 2024</strong>\n<ul>\n<li>Present the initial version of the interactive map at a prominent event within the blockchain community.</li>\n</ul>\n</li>\n<li><strong>Open Source Release:</strong>\n<ul>\n<li>Finalize the development of the interactive map and prepare it for open-source release.</li>\n<li>Publish the editable encourage collaboration and contributions from the community.</li>\n</ul>\n</li>\n<li><strong>Community Engagement and Feedback:</strong>\n<ul>\n<li>Engage with the Spanish-speaking community and gather feedback on the interactive map’s usability and features.</li>\n<li>Incorporate community feedback to continuously improve and enhance the nteractive map’s functionality.</li>\n</ul>\n</li>\n</ol>\n<p>We have completed the project planning phase and are now progressing towards gathering information. We already made an official announcement during <a href=\"https://ethlatam.org/\" rel=\"noopener nofollow ugc\">ETHLatam</a> and commenced gathering information at the booth we had at that event.</p>\n<p>Design phase has also begun, member in our team are already brainstorming ideas of the final version of this map.</p>\n<p>A nice to have for this project would be present our discovers during a side event or main event during Devcon VII</p>\n<h1><a name=\"impact-measurement-7\" class=\"anchor\" href=\"https://discuss.octant.app#impact-measurement-7\"></a>Impact Measurement</h1>\n<p>For our project, impact revolves around our ability to provide insightful analysis of Web3 projects tailored specifically for the Spanish-speaking community. <a href=\"https://www.notion.so/researchkairos/M-tricas-Alcance-An-lisis-ea7af6e7477f47059d4c244e415f7f26\" rel=\"noopener nofollow ugc\">We track metrics</a> such as the reach and engagement of our analysis, the number of projects covered, and the depth of understanding fostered among our readers. By consistently delivering high-quality analysis we aim to empower individuals to make informed decisions and actively participate in the Web3 space.</p>\n<h1><a name=\"funding-8\" class=\"anchor\" href=\"https://discuss.octant.app#funding-8\"></a>Funding</h1>\n<p>In the past we have received funding through grants and donations:</p>\n<ul>\n<li>$8,200 USD during Gitcoin Rounds &amp; a grant provided by <a href=\"https://www.metapool.app/\" rel=\"noopener nofollow ugc\">Meta Pool</a></li>\n<li>17,333 OP in <a href=\"https://twitter.com/Research_Kairos/status/1745495880080273780\" rel=\"noopener nofollow ugc\">RetroPGF3</a></li>\n<li>$8,000 by <a href=\"https://pbsfoundation.notion.site/Launching-the-PBS-Foundation-Working-Together-to-Keep-Ethereum-s-Consensus-Layer-Decentralized-4cd7cb83907248b5ae8962d10eef0b70\" rel=\"noopener nofollow ugc\">PBS Foundation</a> (to be received)</li>\n</ul>\n<p>For this round we are looking for a project-specific funding. Our project requires a total funding amount of $16,000 USD to ensure its successful execution and completion. This budget will be allocated towards covering operational expenses over the 8-month duration of the project, including:</p>\n<ol>\n<li><strong>Research and Data Collection:</strong> Funding will be utilized to facilitate the thorough research and data collection process across Latin America, ensuring comprehensive coverage of web3 projects in the region.</li>\n<li><strong>Interactive Map Development and Design:</strong> A portion of the budget will be allocated towards the development and design of the interactive map, including user interface design, backend development, and integration of interactive features.</li>\n<li><strong>Event Participation and Promotion:</strong> Funds will support our participation in key events such as Ethereum Mexico 2024 and Devcon 2024, where we will present the project to a wider audience, fostering community engagement and support.</li>\n<li><strong>Operational Expenses:</strong> Budget allocation will cover various operational expenses, including software subscriptions, hosting fees, marketing materials, and other miscellaneous costs associated with project management and execution.</li>\n</ol>\n<p>By securing the necessary funding, we aim to ensure the successful implementation of our project, enabling us to deliver a valuable resource to the Spanish-speaking community and contribute to the advancement of web3 technology in Latin America.</p>\n<h1><a name=\"contact-information-9\" class=\"anchor\" href=\"https://discuss.octant.app#contact-information-9\"></a>Contact Information</h1>\n<ul>\n<li>Twitter: <a href=\"https://twitter.com/Research_Kairos\" rel=\"noopener nofollow ugc\">@Research_Kairos</a></li>\n<li>Project Website: <a href=\"https://www.kairosresearch.xyz/\" rel=\"noopener nofollow ugc\">https://www.kairosresearch.xyz/</a></li>\n<li>Discord Contact: Ariiellus</li>\n<li>Telegram Contact: Ariiellus</li>\n</ul>\n            <p><small>1 post - 1 participant</small></p>\n            <p><a href=\"https://discuss.octant.app/t/kairos-research-project-minga-a-landscape-of-web3-latam-projects/270\">Read full topic</a></p>","link":"https://discuss.octant.app/t/kairos-research-project-minga-a-landscape-of-web3-latam-projects/270","pubDate":"Sun, 17 Mar 2024 00:35:12 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"discuss.octant.app-topic-270"},"source":{"@url":"https://discuss.octant.app/t/kairos-research-project-minga-a-landscape-of-web3-latam-projects/270.rss","#text":"Kairos Research - Project Minga a landscape of web3 latam projects"}},{"title":"DefiLlama: DeFi data","dc:creator":"0xngmi","category":"Public Good Projects Discussion","description":"<p>Project description and why we classify as a public good: We track defi metrics of 4k protocols, our code is open source and we provide free access to TVL data</p>\n<p>Main funding sources:</p>\n<ul>\n<li>By size, Optimism RPGF would be the largest funding source</li>\n<li>Direct donations (mostly through gitcoin)</li>\n<li>Some protocol grants</li>\n<li>Rev-share programs from our meta-aggregator</li>\n<li>We have not raised any money from investors</li>\n</ul>\n<p>Project roadmap:<br>\nMaintain data correctness (this takes a lot of time/effort since defi protocols are constantly evolving), expand our API offerings and cover more data types are our main goals. We also plan to launch some other companion products such as llamasearch (an extension to avoid hacks by using our database of websites) but most of our time is spent on data.</p>\n<p>Impact:<br>\nWe are the main source for defi data, with over 1 million monthly users.</p>\n<p>How will money be spent:<br>\nIt’ll be spent covering salaries and server costs. We commit to not spend any money received from octant for development of our meta-aggregator, instead it’ll be spent on other initiatives like our data work.</p>\n<p>Team:<br>\nOur team is currently ~10 people, most of which is comprised by devs. I’m <a href=\"https://twitter.com/0xngmi\" rel=\"noopener nofollow ugc\">https://twitter.com/0xngmi</a></p>\n<p>Links:</p>\n<ul>\n<li><a href=\"https://defillama.com/\" rel=\"noopener nofollow ugc\">https://defillama.com/</a></li>\n<li><a href=\"https://github.com/DefiLlama\" class=\"inline-onebox\" rel=\"noopener nofollow ugc\">DefiLlama · GitHub</a></li>\n<li><a href=\"https://twitter.com/defillama\" rel=\"noopener nofollow ugc\">https://twitter.com/defillama</a></li>\n</ul>\n            <p><small>1 post - 1 participant</small></p>\n            <p><a href=\"https://discuss.octant.app/t/defillama-defi-data/267\">Read full topic</a></p>","link":"https://discuss.octant.app/t/defillama-defi-data/267","pubDate":"Sat, 16 Mar 2024 18:25:14 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"discuss.octant.app-topic-267"},"source":{"@url":"https://discuss.octant.app/t/defillama-defi-data/267.rss","#text":"DefiLlama: DeFi data"}},{"title":"StateOfEth: A dashboard to monitor the state of Ethereum and to promote positive change","dc:creator":"hanniabu","category":"Public Good Projects Discussion","description":"<h1><a name=\"what-is-stateofeth-and-how-is-it-a-public-good-1\" class=\"anchor\" href=\"https://discuss.octant.app#what-is-stateofeth-and-how-is-it-a-public-good-1\"></a>What is StateOfEth and how is it a public good?</h1>\n<p>Ethereum has many centralization vectors and 2nd order attack vectors. It’s our job as a community to protect the network, but it’s impossible to improve or defend against what you aren’t monitoring or aware of.</p>\n<p><a href=\"http://StateOfEth.com\" rel=\"noopener nofollow ugc\">StateOfEth.com</a> aims to monitor attack vectors and bridge the gap between data and education. It will also serve as a rallying point for the social layer to promote positive change within the Ethereum ecosystem.</p>\n<p>The website will be open source, free to use, and provide a free data API for others to consume.</p>\n<hr>\n<h1><a name=\"the-team-2\" class=\"anchor\" href=\"https://discuss.octant.app#the-team-2\"></a>The Team</h1>\n<p>This projects is being developed by <a href=\"https://etheralpha.org/\" rel=\"noopener nofollow ugc\">Ether Alpha</a>. Working under the pseudonym Ether Alpha, hanniabu <a href=\"https://ethstaker.cc/about#stewards\" rel=\"noopener nofollow ugc\">EthStaker steward</a> has a history of developing open source tools and resources. Some notable projects include:</p>\n<ul>\n<li><a href=\"http://ClientDiversity.org\" rel=\"noopener nofollow ugc\">ClientDiversity.org</a></li>\n<li><a href=\"http://ValidatorQueue.com\" rel=\"noopener nofollow ugc\">ValidatorQueue.com</a></li>\n<li><a href=\"http://RescueNode.com\" rel=\"noopener nofollow ugc\">RescueNode.com</a> (UI)</li>\n<li><a href=\"http://DailyDoots.com\" rel=\"noopener nofollow ugc\">DailyDoots.com</a></li>\n<li><a href=\"https://rocketpool.support/\" rel=\"noopener nofollow ugc\">RocketPool.support</a></li>\n<li><a href=\"https://ethstaker.cc/\" rel=\"noopener nofollow ugc\">EthStaker.cc</a></li>\n</ul>\n<p>Social recognition: <a href=\"https://github.com/etheralpha/references\" class=\"inline-onebox\" rel=\"noopener nofollow ugc\">GitHub - etheralpha/references: A list of public references to Ether Alpha projects</a></p>\n<hr>\n<h1><a name=\"roadmap-3\" class=\"anchor\" href=\"https://discuss.octant.app#roadmap-3\"></a>Roadmap</h1>\n<p>There will be an overview dashboard that provides a bird’s eye view of the health of the network with ~50 different metrics.</p>\n<p>Each metric will have a dedicated page with the following info:</p>\n<ul>\n<li>Metric description</li>\n<li>Metric value</li>\n<li>How the metric is calculated</li>\n<li>Metric danger/goal levels (if applicable)</li>\n<li>Metric data breakdown</li>\n<li>Historical data</li>\n<li>Data source (multiple if available)</li>\n<li>Data source methodology</li>\n<li>Why is this metric important and what are the potential impacts of bad value</li>\n<li>How to help improve the metric (if available)</li>\n<li>Additional data/info/tools (if available)</li>\n<li>Resources (research, tools, other dashboards, etc)</li>\n</ul>\n<p>So far I have the following metrics integrated:</p>\n<ul>\n<li>Node Consensus Client Diversity</li>\n<li>Validator Consensus Client Diversity</li>\n<li>Consensus Client Language Diversity</li>\n<li>Node Execution Client Diversity</li>\n<li>Validator Execution Client Diversity</li>\n<li>Execution Client Language Diversity</li>\n<li>Entity Staking Diversity</li>\n<li>LST Diversity</li>\n</ul>\n<p>In addition to these metric pages, I will also have “initiative pages” to address concerns such as Geth and Lido marketshare. This is what I’ll be working on next before moving on to the following metrics:</p>\n<ul>\n<li>Solo Staking Marketshare</li>\n<li>Home Staking Marketshare</li>\n<li>Hosted Staking Diversity</li>\n<li>Node OS Diversity</li>\n<li>Node Count</li>\n<li>Node Geographic Diversity</li>\n<li>Validator Geographic Diversity</li>\n<li>Relay Diversity</li>\n<li>Block Builder Diversity</li>\n<li>Non-Relay Builder Marketshare</li>\n<li>Vanilla Builder Marketshare</li>\n<li>Inclusion Delay</li>\n<li>Reorg Occurances</li>\n<li>Stablecoin Diversity</li>\n<li>Oracle Diversity</li>\n<li>Bridge Diversity</li>\n<li>And many more…</li>\n</ul>\n<hr>\n<h1><a name=\"impact-measurement-4\" class=\"anchor\" href=\"https://discuss.octant.app#impact-measurement-4\"></a>Impact Measurement</h1>\n<p>The impact can be measured through site traffic and improvements in network health.</p>\n<p>While <a href=\"http://StateOfEth.com\" rel=\"noopener nofollow ugc\">StateOfEth.com</a> is not live yet, <a href=\"http://ClientDiversity.org\" rel=\"noopener nofollow ugc\">ClientDiversity.org</a> has 7.3k unique users the past 90 days and Prysm marketshare dropped from &gt;60% to &lt;40% over the past 2 years.</p>\n<p>There’s many other metrics that deserve the same level of attention, but there isn’t a similar resource available to rally around. <a href=\"http://StateOfEth.com\" rel=\"noopener nofollow ugc\">StateOfEth.com</a> aims to provide that.</p>\n<hr>\n<h1><a name=\"funding-5\" class=\"anchor\" href=\"https://discuss.octant.app#funding-5\"></a>Funding</h1>\n<p>Funding will be primarily used for my time in developing and maintaining <a href=\"http://StateOfEth.com\" rel=\"noopener nofollow ugc\">StateOfEth.com</a>. A small portion (&lt;$100) will go towards overhead.</p>\n<p>Previous funding:</p>\n<ul>\n<li>GG18: $386.16</li>\n<li>CLR Fund: $456.85</li>\n<li>Donations: ~$50</li>\n</ul>\n<p>Total: $893.01</p>\n<hr>\n<p><strong>Ask any questions in this discussion forum to learn more</strong></p>\n<ul>\n<li><a href=\"https://stateofeth.com\" rel=\"noopener nofollow ugc\">Website</a> (soon™)</li>\n<li><a href=\"https://github.com/etheralpha\" rel=\"noopener nofollow ugc\">Github</a></li>\n<li><a href=\"https://twitter.com/hanni_abu\" rel=\"noopener nofollow ugc\">Twitter</a></li>\n</ul>\n            <p><small>2 posts - 2 participants</small></p>\n            <p><a href=\"https://discuss.octant.app/t/stateofeth-a-dashboard-to-monitor-the-state-of-ethereum-and-to-promote-positive-change/264\">Read full topic</a></p>","link":"https://discuss.octant.app/t/stateofeth-a-dashboard-to-monitor-the-state-of-ethereum-and-to-promote-positive-change/264","pubDate":"Fri, 15 Mar 2024 18:35:47 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"discuss.octant.app-topic-264"},"source":{"@url":"https://discuss.octant.app/t/stateofeth-a-dashboard-to-monitor-the-state-of-ethereum-and-to-promote-positive-change/264.rss","#text":"StateOfEth: A dashboard to monitor the state of Ethereum and to promote positive change"}}]}}}