{"rss":{"@version":"2.0","@xmlns:discourse":"http://www.discourse.org/","@xmlns:atom":"http://www.w3.org/2005/Atom","@xmlns:dc":"http://purl.org/dc/elements/1.1/","channel":{"title":"Optimism Collective - Latest topics","link":"https://gov.optimism.io/latest","description":"Latest topics","lastBuildDate":"Sun, 02 Jun 2024 10:05:37 +0000","atom:link":{"@href":"https://gov.optimism.io/latest.rss","@rel":"self","@type":"application/rss+xml"},"item":[{"title":"Reclaim Protocol: Verified HTTPS Traffic for Privacy-Preserving Proofs","dc:creator":"adiiHQ","category":"✨ General","description":"<p>Hello Optimism Community,</p>\n<p>We are excited to announce the launch of the Reclaim Protocol, a robust solution for creating verifiable claims while preserving user privacy. Here’s a detailed and technical overview of how it works and why it matters.</p>\n<p><strong>What is Reclaim Protocol?</strong></p>\n<p>Reclaim Protocol (YC W21) leverages HTTPS session keys to generate zero-knowledge proofs (zkproofs) of users’ profile information. It creates digital signatures, known as zk proofs, of users’ identity and reputation on any website. These digital signatures are computed entirely on the client side, ensuring they are private and secure. When a user shares this proof with any application, one can be certain that its authenticity and integrity haven’t been compromised.</p>\n<ul>\n<li><strong>Website</strong>: <a href=\"https://www.reclaimprotocol.org/\" rel=\"noopener nofollow ugc\">Reclaim Protocol</a></li>\n</ul>\n<p><strong>How Reclaim Protocol Works</strong></p>\n<p>Reclaim Protocol operates through a sophisticated mechanism that ensures the security and privacy of HTTPS traffic. Here’s a detailed technical breakdown of the process:</p>\n<ol>\n<li><strong>User Interaction with HTTPS Proxy Server</strong>:\n<ul>\n<li>When a user logs into a desired website, their HTTPS request and the corresponding response are routed through an HTTPS Proxy Server known as the <strong>Attestor</strong>. The Attestor intercepts and monitors the encrypted packets transferred between the user and the website, ensuring that no private data is exposed during this process.</li>\n</ul>\n</li>\n<li><strong>Key Sharing and Attestation</strong>:\n<ul>\n<li>The user shares session keys that reveal non-private information of the request to the Attestor. The Attestor examines the request, which contains all data in plain text except for private information such as authentication credentials. The Attestor then generates a cryptographic signature to attest that the correct request was made, ensuring the transaction’s integrity without compromising user privacy.</li>\n</ul>\n</li>\n<li><strong>Zero-Knowledge Circuit and Regex Matching</strong>:\n<ul>\n<li>The encrypted response from the website is passed to a <strong>ZK circuit</strong>. This circuit uses a decryption key as a private input to extract a regex match on the encrypted data. The Attestor further attests that the public input to the ZK proof was indeed the encrypted data from the website, ensuring the response’s authenticity.</li>\n</ul>\n</li>\n<li><strong>Verification by Third-Party Applications</strong>:\n<ul>\n<li>With these signatures on the request and the encrypted response, along with the ZK proof itself, any third-party application can verify the existence and authenticity of the data on the user’s profile without compromising privacy. The combination of these cryptographic proofs ensures that data integrity is maintained throughout the verification process.</li>\n</ul>\n</li>\n</ol>\n<p><strong>Security and Efficiency</strong></p>\n<p>An independent third-party research group from Purdue University has formally analyzed the security of proxy-based TLS models. The key result is that the security provided by Reclaim Protocol is equivalent to that established by much more bandwidth-intensive models such as MPC (Multiparty Computation) and garbled circuits.</p>\n<p>This research confirms that while the proxy model is generally considered insecure for TLS, it is fully secure when used in the context of HTTPS, as implemented by Reclaim Protocol. The study explores potential attacks and mitigations, many of which are already implemented in Reclaim Protocol. Therefore, when questions about the security of Reclaim Protocol arise, we can confidently reference this formal definition of security.</p>\n<p>The paper highlights that Reclaim Protocol’s approach is not only secure but also significantly more efficient than other industry approaches like Deco, TLSNotary, ZkPass, Pado, and Opacity, which rely on MPC. With this formal proof published in a respected publication, we have the external validation that solidifies our position as leaders in the industry.</p>\n<p>A bonus is that Reclaim Protocol’s whitepaper has been cited in this research paper, marking our first citation. This recognition affirms the robustness and efficiency of our protocol.</p>\n<p><strong>Get Involved</strong></p>\n<p>We are committed to fostering an inclusive and transparent environment where all contributors have the opportunity to thrive. Whether you’re a seasoned developer, a budding entrepreneur, or simply passionate about the future of decentralized technology, we encourage you to explore and integrate Reclaim Protocol into your projects.</p>\n<p>To learn more about Reclaim Protocol and how it can enhance your projects, please refer to our website linked above.</p>\n<p>Join the conversation and connect with us on Telegram: <a href=\"https://t.me/reclaimprotocol\" rel=\"noopener nofollow ugc\">Reclaim Protocol Telegram</a></p>\n<p>We look forward to your thoughts, feedback, and any questions you may have. Join us in this exciting journey to enhance user privacy and data security!</p>\n<p>Best regards,<br>\nAdithya Dinesh<br>\nCommunity &amp; Growth, Reclaim Protocol</p>\n            <p><small>1 post - 1 participant</small></p>\n            <p><a href=\"https://gov.optimism.io/t/reclaim-protocol-verified-https-traffic-for-privacy-preserving-proofs/8247\">Read full topic</a></p>","link":"https://gov.optimism.io/t/reclaim-protocol-verified-https-traffic-for-privacy-preserving-proofs/8247","pubDate":"Sun, 02 Jun 2024 10:05:37 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"gov.optimism.io-topic-8247"},"source":{"@url":"https://gov.optimism.io/t/reclaim-protocol-verified-https-traffic-for-privacy-preserving-proofs/8247.rss","#text":"Reclaim Protocol: Verified HTTPS Traffic for Privacy-Preserving Proofs"}},{"title":"Linda Xie - Delegate Communication Thread","dc:creator":"linda","category":"Delegate Updates","description":"<p>After 2 years as an Optimism delegate, I’m stepping down on the Token House side. My initial goal was to support Optimism governance during the earliest years and I’m grateful to have been a small part of it. My focus is on building <a href=\"https://www.bountycaster.xyz/\" rel=\"noopener nofollow ugc\">Bountycaster</a> which is built on top of Farcaster so I’ll be contributing full-time to the Optimism ecosystem in a different role. I’ll also remain a badgeholder on the Citizens’ House side until my 2 year mark (in Feb 2025).</p>\n<p>I really appreciate all of the wonderful people I’ve met and how much I’ve learned through this entire process. I’ve admired how Optimism governance continued to get better every season with the Collective’s effort and paved the way for a lot of innovative governance systems in the crypto space.</p>\n<p>Thank you to everyone that delegated to me over the past 2 years. To continue to support Optimism governance, I ask that you please redelegate your tokens to another delegate here: <a href=\"https://vote.optimism.io/delegates\" class=\"inline-onebox\" rel=\"noopener nofollow ugc\">Voter on Agora</a>.</p>\n<p>100% of all compensation I received as a delegate was donated ($32.6k) and I’ll be donating the most recent season compensation once received.</p>\n<ul>\n<li>$15k (season 1 and 2) to the EFF</li>\n<li>$4.6k (season 3) to the Internet Archive</li>\n<li>$13k (season 4) to UC Berkeley Simons Institute family stipend program</li>\n</ul>\n<p>It’s been a pleasure to be part of the Token House and I’ll continue to see you all around, just in a different capacity!</p>\n<p>cc <a class=\"mention\" href=\"https://gov.optimism.io/u/lavande\">@lavande</a> <a class=\"mention\" href=\"https://gov.optimism.io/u/zcf\">@zcf</a> <a class=\"mention\" href=\"https://gov.optimism.io/u/kent\">@kent</a> <a class=\"mention\" href=\"https://gov.optimism.io/u/yitong\">@yitong</a></p>\n            <p><small>2 posts - 2 participants</small></p>\n            <p><a href=\"https://gov.optimism.io/t/linda-xie-delegate-communication-thread/8246\">Read full topic</a></p>","link":"https://gov.optimism.io/t/linda-xie-delegate-communication-thread/8246","pubDate":"Sat, 01 Jun 2024 15:51:39 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"gov.optimism.io-topic-8246"},"source":{"@url":"https://gov.optimism.io/t/linda-xie-delegate-communication-thread/8246.rss","#text":"Linda Xie - Delegate Communication Thread"}},{"title":"Upgrade Proposal #9: Fjord Network Upgrade","dc:creator":"bayardo","category":"Protocol Upgrade","description":"<h2><a name=\"executive-summary-1\" class=\"anchor\" href=\"https://gov.optimism.io#executive-summary-1\"></a><strong>Executive Summary</strong></h2>\n<p>Hi I’m Roberto, an engineer at Coinbase working on the Base blockchain, and a core developer of the OP Stack. I reviewed this proposal in collaboration with Sebastian Stammler and Dragan Zurzin from the OP labs team.</p>\n<p>Neither Coinbase nor I represent or speak on behalf of the Optimism Foundation.</p>\n<p>This is a proposal for the Fjord network upgrade, which includes the EIP-7212 precompile to reduce gas costs of many smart wallet applications, supports Brotli batch compression for ~5-15% lower data availability costs, and improves the robustness of L1 data pricing. The upgrade also increases and hardcodes the max-sequencer-drift parameter, giving chain operators more time to respond to L1 node issues without facing a potential L2 chain halt.</p>\n<h1><a name=\"specifications-2\" class=\"anchor\" href=\"https://gov.optimism.io#specifications-2\"></a><strong>Specifications</strong></h1>\n<h2><a name=\"technical-specification-3\" class=\"anchor\" href=\"https://gov.optimism.io#technical-specification-3\"></a><strong>Technical Specification</strong></h2>\n<p>We propose the Fjord network upgrade (<a href=\"https://github.com/ethereum-optimism/specs/blob/main/specs/fjord/overview.md\" rel=\"noopener nofollow ugc\">spec overview</a>), which activates:</p>\n<ul>\n<li><a href=\"https://github.com/ethereum/RIPs/blob/master/RIPS/rip-7212.md\" rel=\"noopener nofollow ugc\">RIP-7212</a>: Precompile for secp256r1 Curve Support (<a href=\"https://github.com/ethereum/RIPs/blob/master/RIPS/rip-7212.md\" rel=\"noopener nofollow ugc\">spec</a>)</li>\n<li>Brotli as a channel compression option (<a href=\"https://github.com/ethereum-optimism/specs/blob/main/specs/fjord/derivation.md#brotli-channel-compression\" rel=\"noopener nofollow ugc\">spec</a>)</li>\n<li>FastLZ based L1 data availability cost calculation (<a href=\"https://github.com/ethereum-optimism/specs/blob/main/specs/fjord/exec-engine.md#fees\" rel=\"noopener nofollow ugc\">spec</a>), including an upgraded <code>GasPriceOracle</code> L2 predeploy to compute it (<a href=\"https://github.com/ethereum-optimism/specs/blob/main/specs/fjord/derivation.md#gaspriceoracle-deployment\" rel=\"noopener nofollow ugc\">spec</a>).</li>\n<li>Parameter changes:\n<ul>\n<li>Max sequencer drift becomes a constant with value increased to 1800 seconds (<a href=\"https://github.com/ethereum-optimism/specs/blob/main/specs/fjord/derivation.md#constant-maximum-sequencer-drift\" rel=\"noopener nofollow ugc\">spec</a>)</li>\n<li>Increased values for <code>MAX_RLP_BYTES_PER_CHANNEL</code> and <code>MAX_CHANNEL_BANK_SIZE</code> (<a href=\"https://github.com/ethereum-optimism/specs/blob/main/specs/fjord/derivation.md#increasing-max_rlp_bytes_per_channel-and-max_channel_bank_size\" rel=\"noopener nofollow ugc\">spec</a>)</li>\n</ul>\n</li>\n<li>The Fjord hardfork activation block, which includes several transactions to perform all L2 contract deployments, upgrades, enablements, and proxy updates. (<a href=\"https://github.com/ethereum-optimism/specs/blob/main/specs/fjord/derivation.md#network-upgrade-automation-transactions\" rel=\"noopener nofollow ugc\">spec</a>)</li>\n</ul>\n<p>The upgrade also updates and deprecates:</p>\n<ul>\n<li><code>getL1GasUsed</code> method of the <code>GasPriceOracle</code> contract (<a href=\"https://github.com/ethereum-optimism/specs/blob/main/specs/fjord/predeploys.md#l1-gas-usage-estimation\" rel=\"noopener nofollow ugc\">spec</a>)</li>\n<li><code>L1GasUsed</code> field of the transaction receipt (<a href=\"https://github.com/ethereum-optimism/specs/blob/main/specs/fjord/exec-engine.md#l1-gas-usage-estimation\" rel=\"noopener nofollow ugc\">spec</a>)</li>\n</ul>\n<h2><a name=\"security-considerations-4\" class=\"anchor\" href=\"https://gov.optimism.io#security-considerations-4\"></a><strong>Security Considerations</strong></h2>\n<p>Consistent with the <a href=\"https://gov.optimism.io/t/op-labs-audit-framework-when-to-get-external-security-review-and-how-to-prepare-for-it/6864\">OP Labs Audit Framework</a>, we did not have the contents of Fjord audited; however, Coinbase and OP Labs engineers did perform a security review of these changes.</p>\n<p>The Fjord upgrade’s inclusion of EIP-7212 involves use of the reference implementation that is already live on other blockchains, which we consider low risk.</p>\n<p>Brotli compression is also a low-risk change since it is already used by other L2s and was evaluated for both its runtime performance and compression improvements across four different OP-stack chains. It’s usage is also optional and must be activated by the chain operator after the upgrade in order to be applied.</p>\n<p>The introduction of the new L1 data fee cost function required updates to the GasPriceOracle L2 predeploy, and changes op-geth to compute the fee values. The contract extension allows developers to continue using the GasPriceOracle to compute the data fee, and affects only helper functions that are outside of consensus.  We extensively evaluated the accuracy of this new function compared to multiple variants as well as the previous one across various timeslices of OP mainnet and Base mainnet transactions (<a href=\"https://github.com/roberto-bayardo/compression-analysis\" rel=\"noopener nofollow ugc\">analysis repo</a>). The new function consistently produced significant improvements in mean-squared-error and mean-absolute-error across each, and we were unable to find any instances where the new function could wildly diverge from ground truth. (We computed ground truth by putting the transaction in a simulated batch, compressing the entire batch with Brotli-10, and returning the number of bytes occupied by the transaction in the result.) Bugs in the op-geth computation might still lead to under/over payment for L1 data fees by users. Significant underpayment could result in revenue loss for the chain operator, but the system provides parameters that can be updated quickly via the SystemConfig in order to quickly compensate for such scenarios. Overall we feel this change remains low risk.</p>\n<p>Similar to the previous upgrade, Fjord uses a special upgrade block to perform the contract deployment and activation on the L2. Bugs in this code could lead to an incomplete fork with missing contracts or contract functionality expected by the upgrade, in the worst case leading to chain halt. Since this approach to automating the upgrade has been used successfully in the past, we consider this low risk.</p>\n<p>Security considerations for the parameter changes are discussed in the upgrade specification <a href=\"https://github.com/ethereum-optimism/specs/blob/main/specs/fjord/derivation.md#security-considerations\" rel=\"noopener nofollow ugc\">here</a> and <a href=\"https://github.com/ethereum-optimism/specs/blob/main/specs/fjord/derivation.md#security-considerations\" rel=\"noopener nofollow ugc\">here</a>. These changes are also straightforward and we consider them low risk.</p>\n<h2><a name=\"impact-summary-5\" class=\"anchor\" href=\"https://gov.optimism.io#impact-summary-5\"></a><strong>Impact Summary</strong></h2>\n<p>We do not anticipate any downtime due to this upgrade.</p>\n<p>Bringing EIP-7212 to the OP stack will benefit applications such as smart wallets that want to support many common authentication methods (such as Apple’s FaceID) that would otherwise be too gas intensive.</p>\n<p>We evaluated Brotli compression compared to the previous compression algorithm (zlib) on 4 OP stack chains (OP mainnet, Base, Zora, and Mode) and found compression ratio improvements ranging from 5-15% under Brotli quality level 10. This will directly translate to a 5-15% reduction in L1 data availability costs, so we expect most chains will want to activate this feature immediately following the upgrade.</p>\n<p>The FastLZ based L1 data fee function will more accurately charge for L1 data usage on a per transaction basis. Previously, highly incompressible transactions might be undercharged for L1 data usage, and a large number of such transactions might lead to an inability to recover revenue without the chain operator having to take action by re-tuning fee parameters.  We expect this new function to far more accurately detect the (lack of) compressibility of each individual transaction and reduce the chance of revenue recovery drifting from its intended target.</p>\n<p>The main impact of the parameter changes is that chain operators will have more time to respond to L1 node outage issues before the L2 chain stalls (30 minutes instead of 10 minutes).</p>\n<h1><a name=\"action-plan-for-this-release-6\" class=\"anchor\" href=\"https://gov.optimism.io#action-plan-for-this-release-6\"></a><strong>Action Plan for this release</strong></h1>\n<p>If this vote passes, the Fjord upgrade will be scheduled for execution on July 10th at 16:00:01 UTC. The upgrade will occur automatically for nodes on a release which contains the baked in activation time. Fjord is code complete in the optimism monorepo at commit <code>4a487b8920daa9dc4b496d691d5f283f9bb659b1</code> and op-geth at commit <code>3fbae78d638d1b903e702a14f98644c1103ae1b3</code>. The op-node release v1.7.6 and op-geth release v1.101315.1 contain these changes.</p>\n<p>This upgrade has already been activated on internal devnets and the Sepolia Superchain in coordination with Base and Conduit.</p>\n<h2><a name=\"fault-proofs-update-7\" class=\"anchor\" href=\"https://gov.optimism.io#fault-proofs-update-7\"></a>Fault Proofs Update</h2>\n<p>This is the first protocol upgrade that will activate on mainnet following the launch of Fault Proofs, which has recently been accepted by <a href=\"https://gov.optimism.io/t/final-protocol-upgrade-7-fault-proofs/8161/18\">governance</a>. However, its version of the op-program and Fault Dispute Game doesn’t contain the Fjord mainnet activation yet, so we need to perform an update of the Fault Proofs L1 infrastructure before the Fjord activation on mainnet. This is the first time that we need to perform this exercise.</p>\n<p>This update requires us to create a new release of the <code>op-program</code> that contains the Fjord activation and generate the so-called <em>absolute pre-state</em> for it, which is a commitment to the program and its starting state. We then have to deploy new <code>FaultDisputeGame</code>  and  <code>PerimissionedDisputeGame</code> contracts to L1 Mainnet with the new op-program pre-state hash. These steps will be done while the review period is ongoing, so that the new contracts are deployed to L1 by the time that the voting period starts.</p>\n<p>However, deploying these contracts doesn’t update the actual Fault Proofs system yet to use them. After the veto period has ended, we will ask the Security Council to sign transactions to update the <code>DisputeGameFactory</code> to use the new <code>FaultDisputeGame</code> and  <code>PermissionedDisputeGame</code> implementations that were voted on.</p>\n<p>This transaction has to be executed <em>before</em> the actual Fjord activation to avoid a broken Fault Proofs system after the activation.</p>\n<h2><a name=\"emergency-cancellation-8\" class=\"anchor\" href=\"https://gov.optimism.io#emergency-cancellation-8\"></a>Emergency Cancellation</h2>\n<p>The optimistic mainnet releases will contain a Fjord activation at the above mentioned time. If there is a critical security issue found between approval and rollout, the Optimism Foundation and Security Council will work to coordinate an emergency cancellation.  We have included functionality for node operators to quickly react by using the <code>--override.fjord</code> flag on both op-node &amp; op-geth.</p>\n<h1><a name=\"conclusion-9\" class=\"anchor\" href=\"https://gov.optimism.io#conclusion-9\"></a><strong>Conclusion</strong></h1>\n<p>This proposal outlines the network upgrade after Ecotone titled Fjord. This network upgrade brings reduced execution fees for certain (e.g. smart wallet) applications, lower data availability costs, and more robust L1 data pricing. We expect that this upgrade will not result in any downtime and will occur on Wednesday, July 10 2024 at 16:00:01 UTC.</p>\n            <p><small>7 posts - 6 participants</small></p>\n            <p><a href=\"https://gov.optimism.io/t/upgrade-proposal-9-fjord-network-upgrade/8236\">Read full topic</a></p>","link":"https://gov.optimism.io/t/upgrade-proposal-9-fjord-network-upgrade/8236","pubDate":"Thu, 30 May 2024 21:44:52 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"gov.optimism.io-topic-8236"},"source":{"@url":"https://gov.optimism.io/t/upgrade-proposal-9-fjord-network-upgrade/8236.rss","#text":"Upgrade Proposal #9: Fjord Network Upgrade"}},{"title":"Why im getting error when i try to submit my project","dc:creator":"vrnouns","category":"Retro  Funding 🔴","description":"<p>Hello everyone, i successfully completed all my project details and published onchain successfully.</p>\n<aside class=\"onebox allowlistedgeneric\" data-onebox-src=\"https://optimism.easscan.org/attestation/view/0x631166884c0ad10246a1f7ec83f6d11d0282f06e7dcee75b90268c738a2475dd\">\n  <header class=\"source\">\n      <img src=\"https://global.discourse-cdn.com/business7/uploads/bc41dd/optimized/2X/5/534fea7eebe8003697e99d43f78994e9b049ab39_2_500x500.png\" class=\"site-icon\" data-dominant-color=\"677EC9\" width=\"500\" height=\"500\">\n\n      <a href=\"https://optimism.easscan.org/attestation/view/0x631166884c0ad10246a1f7ec83f6d11d0282f06e7dcee75b90268c738a2475dd\" target=\"_blank\" rel=\"noopener nofollow ugc\">optimism.easscan.org</a>\n  </header>\n\n  <article class=\"onebox-body\">\n    <div class=\"aspect-image\" style=\"--aspect-ratio:690/316;\"><img src=\"https://global.discourse-cdn.com/business7/uploads/bc41dd/optimized/2X/c/cb8663b5d1421763e04408f1fd0f902fd6ceb01f_2_690x316.png\" class=\"thumbnail\" data-dominant-color=\"EFEFF4\" width=\"690\" height=\"316\"></div>\n\n<h3><a href=\"https://optimism.easscan.org/attestation/view/0x631166884c0ad10246a1f7ec83f6d11d0282f06e7dcee75b90268c738a2475dd\" target=\"_blank\" rel=\"noopener nofollow ugc\">Attestation (Schema #472) - 0x6311...475dd</a></h3>\n\n  <p>View attestation details for 0x6311...475dd on EAS - Ethereum Attestation Service.</p>\n\n\n  </article>\n\n  <div class=\"onebox-metadata\">\n    \n    \n  </div>\n\n  <div style=\"clear: both\"></div>\n</aside>\n<p>\nBut when i try to submit im getting this error.<br>\n</p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://global.discourse-cdn.com/business7/uploads/bc41dd/original/2X/2/2931adcd65e448f2bf4671af626fd829d5e5748f.jpeg\" data-download-href=\"/uploads/short-url/5Sq0NuarcPIHjf6bUdSnoZgqXn1.jpeg?dl=1\" title=\"Screenshot 2024-05-30 at 09.50.25\" rel=\"noopener nofollow ugc\"><img src=\"https://global.discourse-cdn.com/business7/uploads/bc41dd/optimized/2X/2/2931adcd65e448f2bf4671af626fd829d5e5748f_2_690x343.jpeg\" alt=\"Screenshot 2024-05-30 at 09.50.25\" data-base62-sha1=\"5Sq0NuarcPIHjf6bUdSnoZgqXn1\" width=\"690\" height=\"343\" srcset=\"https://global.discourse-cdn.com/business7/uploads/bc41dd/optimized/2X/2/2931adcd65e448f2bf4671af626fd829d5e5748f_2_690x343.jpeg, https://global.discourse-cdn.com/business7/uploads/bc41dd/optimized/2X/2/2931adcd65e448f2bf4671af626fd829d5e5748f_2_1035x514.jpeg 1.5x, https://global.discourse-cdn.com/business7/uploads/bc41dd/optimized/2X/2/2931adcd65e448f2bf4671af626fd829d5e5748f_2_1380x686.jpeg 2x\" data-dominant-color=\"F1EEF2\"></a></div><p></p>\n            <p><small>3 posts - 3 participants</small></p>\n            <p><a href=\"https://gov.optimism.io/t/why-im-getting-error-when-i-try-to-submit-my-project/8234\">Read full topic</a></p>","link":"https://gov.optimism.io/t/why-im-getting-error-when-i-try-to-submit-my-project/8234","pubDate":"Thu, 30 May 2024 06:51:24 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"gov.optimism.io-topic-8234"},"source":{"@url":"https://gov.optimism.io/t/why-im-getting-error-when-i-try-to-submit-my-project/8234.rss","#text":"Why im getting error when i try to submit my project"}},{"title":"How is blockchain being appllied in supply chain management and logistics?","dc:creator":"bsetec","category":"✨ General","description":"<p>In supply chain management and logistics, blockchain provides clarity by enabling real-time tracking of goods from production to delivery. It ensures traceability by assigning unique digital identifiers to products, combating counterfeiting, and verifying authenticity. <a href=\"https://www.bsetec.com/blockchain-development-company\" rel=\"noopener nofollow ugc\">Blockchain</a> streamlines processes with smart contracts, automating tasks like payments and compliance checks, and reducing paperwork and errors. Moreover, it improves efficiency by eliminating intermediaries and facilitating faster decision-making through real-time data sharing.</p>\n            <p><small>1 post - 1 participant</small></p>\n            <p><a href=\"https://gov.optimism.io/t/how-is-blockchain-being-appllied-in-supply-chain-management-and-logistics/8232\">Read full topic</a></p>","link":"https://gov.optimism.io/t/how-is-blockchain-being-appllied-in-supply-chain-management-and-logistics/8232","pubDate":"Thu, 30 May 2024 03:06:06 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"gov.optimism.io-topic-8232"},"source":{"@url":"https://gov.optimism.io/t/how-is-blockchain-being-appllied-in-supply-chain-management-and-logistics/8232.rss","#text":"How is blockchain being appllied in supply chain management and logistics?"}},{"title":"Token House Call will be [Tuesday, June 4th @ 11:00PT / 14:00 ET / 18:00 GMT / 19:00 CET]","dc:creator":"Michael","category":"Updates  and Announcements 📢","description":"<p>Hey Everyone!</p>\n<p>We have our token house call coming up Tuesday, June 4th!</p>\n<p>If you’d like to add anything to the agenda, comment below.</p>\n<p>Also, new delegates, if you’d like to introduce yourself to the collective, there will be a time for a quick intro at the start of the call!</p>\n<p>See you there!<br>\nMichael</p>\n<p></p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://global.discourse-cdn.com/business7/uploads/bc41dd/original/2X/d/d8b2c86a2b4a1fd9eb5f7e9f867aefa6317f13b0.jpeg\" data-download-href=\"/uploads/short-url/uV0aNqGwgEwD6YyS5cebhVj3l2E.jpeg?dl=1\" title=\"tk cc s6 m4\"><img src=\"https://global.discourse-cdn.com/business7/uploads/bc41dd/optimized/2X/d/d8b2c86a2b4a1fd9eb5f7e9f867aefa6317f13b0_2_690x388.jpeg\" alt=\"tk cc s6 m4\" data-base62-sha1=\"uV0aNqGwgEwD6YyS5cebhVj3l2E\" width=\"690\" height=\"388\" srcset=\"https://global.discourse-cdn.com/business7/uploads/bc41dd/optimized/2X/d/d8b2c86a2b4a1fd9eb5f7e9f867aefa6317f13b0_2_690x388.jpeg, https://global.discourse-cdn.com/business7/uploads/bc41dd/original/2X/d/d8b2c86a2b4a1fd9eb5f7e9f867aefa6317f13b0.jpeg 1.5x, https://global.discourse-cdn.com/business7/uploads/bc41dd/original/2X/d/d8b2c86a2b4a1fd9eb5f7e9f867aefa6317f13b0.jpeg 2x\" data-dominant-color=\"ECD2DB\"></a></div><p></p>\n            <p><small>1 post - 1 participant</small></p>\n            <p><a href=\"https://gov.optimism.io/t/token-house-call-will-be-tuesday-june-4th-11-00pt-14-00-et-18-00-gmt-19-00-cet/8230\">Read full topic</a></p>","link":"https://gov.optimism.io/t/token-house-call-will-be-tuesday-june-4th-11-00pt-14-00-et-18-00-gmt-19-00-cet/8230","pubDate":"Wed, 29 May 2024 23:28:34 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"gov.optimism.io-topic-8230"},"source":{"@url":"https://gov.optimism.io/t/token-house-call-will-be-tuesday-june-4th-11-00pt-14-00-et-18-00-gmt-19-00-cet/8230.rss","#text":"Token House Call will be [Tuesday, June 4th @ 11:00PT / 14:00 ET / 18:00 GMT / 19:00 CET]"}},{"title":"Jrocki - Delegate Communication Thread","dc:creator":"Jrocki","category":"Delegate Updates","description":"<p>What up Optimism Collective fam! For the last year I have be working at the Optimism Foundation as a contribution manager, mostly leading the Ambassador program.</p>\n<p>I have since left the Foundation and I am excited to begin participating in governance again! You will notice that there is a gap in my governance participation over the last year due to the fact that Optimism Foundation employees are restricted from participating in governance.</p>\n<p>Previous to joining the Foundation I was a delegate as well as the lead of the NFT and Gaming Committee during Season 2 of Optimism governance.</p>\n<p>I will be using this forum to post all my future voting rationale</p>\n            <p><small>2 posts - 1 participant</small></p>\n            <p><a href=\"https://gov.optimism.io/t/jrocki-delegate-communication-thread/8229\">Read full topic</a></p>","link":"https://gov.optimism.io/t/jrocki-delegate-communication-thread/8229","pubDate":"Wed, 29 May 2024 15:14:12 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"gov.optimism.io-topic-8229"},"source":{"@url":"https://gov.optimism.io/t/jrocki-delegate-communication-thread/8229.rss","#text":"Jrocki - Delegate Communication Thread"}},{"title":"Launching the OP Citizen Dashboard | Superchain Eco","dc:creator":"SuperchainEco","category":"Citizens  👥","description":"<p>Hi OP Collective,</p>\n<p>We’re excited to announce the launch of the <a href=\"https://www.superchain.eco/citizens\" rel=\"noopener nofollow ugc\">Citizens Database</a> on the Superchain Eco platform.</p>\n<p>This new platform maps all current OP Citizens, detailing their roles in projects and their retrospective rewards for reviewing RetroPGF3.</p>\n<p>Our analysts will use the created Citizen database to gain relevant insights for improving RPGF and Collective Governance.<br>\n</p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://global.discourse-cdn.com/business7/uploads/bc41dd/original/2X/8/8fe1c074778e17a789cdcd7b44c3a59b73f59d21.png\" data-download-href=\"/uploads/short-url/kwPWQP9x7qfJgfp3ZsknJGGLkxH.png?dl=1\" title=\"OP Citizens\" rel=\"noopener nofollow ugc\"><img src=\"https://global.discourse-cdn.com/business7/uploads/bc41dd/optimized/2X/8/8fe1c074778e17a789cdcd7b44c3a59b73f59d21_2_690x432.png\" alt=\"OP Citizens\" data-base62-sha1=\"kwPWQP9x7qfJgfp3ZsknJGGLkxH\" width=\"690\" height=\"432\" srcset=\"https://global.discourse-cdn.com/business7/uploads/bc41dd/optimized/2X/8/8fe1c074778e17a789cdcd7b44c3a59b73f59d21_2_690x432.png, https://global.discourse-cdn.com/business7/uploads/bc41dd/optimized/2X/8/8fe1c074778e17a789cdcd7b44c3a59b73f59d21_2_1035x648.png 1.5x, https://global.discourse-cdn.com/business7/uploads/bc41dd/original/2X/8/8fe1c074778e17a789cdcd7b44c3a59b73f59d21.png 2x\" data-dominant-color=\"F2F3F6\"></a></div><p></p>\n<p>We would love to hear your feedback and appreciate any help spreading the word about this <a href=\"https://x.com/SuperchainEco\" rel=\"noopener nofollow ugc\">launch.</a></p>\n<p><strong>Next Steps</strong><br>\nWe’re working on applications for the Foundation Mission Requests, focusing on measuring concentration in the collective and voting design tradeoffs for Retro funding. We plan to complete these to further enhance Governance Analytics in the Collective.</p>\n<p>You can follow us on our social media accounts for more updates <img src=\"https://emoji.discourse-cdn.com/twitter/raised_hands.png?v=12\" title=\":raised_hands:\" class=\"emoji\" alt=\":raised_hands:\" loading=\"lazy\" width=\"20\" height=\"20\"><br>\n<img src=\"https://emoji.discourse-cdn.com/twitter/bird.png?v=12\" title=\":bird:\" class=\"emoji\" alt=\":bird:\" loading=\"lazy\" width=\"20\" height=\"20\"> <a href=\"https://x.com/SuperchainEco\" rel=\"noopener nofollow ugc\">X</a><br>\n<img src=\"https://emoji.discourse-cdn.com/twitter/chains.png?v=12\" title=\":chains:\" class=\"emoji\" alt=\":chains:\" loading=\"lazy\" width=\"20\" height=\"20\"> <a href=\"https://warpcast.com/superchaineco\" rel=\"noopener nofollow ugc\">Warpcast</a><br>\n<img src=\"https://emoji.discourse-cdn.com/twitter/globe_with_meridians.png?v=12\" title=\":globe_with_meridians:\" class=\"emoji\" alt=\":globe_with_meridians:\" loading=\"lazy\" width=\"20\" height=\"20\"> <a href=\"https://www.linkedin.com/company/superchain-eco/\" rel=\"noopener nofollow ugc\">LinkedIn</a></p>\n            <p><small>1 post - 1 participant</small></p>\n            <p><a href=\"https://gov.optimism.io/t/launching-the-op-citizen-dashboard-superchain-eco/8228\">Read full topic</a></p>","link":"https://gov.optimism.io/t/launching-the-op-citizen-dashboard-superchain-eco/8228","pubDate":"Wed, 29 May 2024 14:01:30 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"gov.optimism.io-topic-8228"},"source":{"@url":"https://gov.optimism.io/t/launching-the-op-citizen-dashboard-superchain-eco/8228.rss","#text":"Launching the OP Citizen Dashboard | Superchain Eco"}},{"title":"Retro Funding 4: Impact Metrics, a Collective Experiment","dc:creator":"system","category":"Retro  Funding 🔴","description":"<p>Since one of our Collective Values is Iterative Innovation, we are continuing to refine retroactive public goods funding (retro funding) with round 4. The focus here is on collaboratively curating impact metrics, guided by the principle of <a href=\"https://gov.optimism.io/t/upcoming-retro-rounds-and-their-design/7861\">Metrics-based Evaluation</a>. Unlike previous Retro Funding rounds, Retro Funding 4 shifts from voting on individual projects to engaging badgeholders in selecting and weighting metrics that measure various types of impact.</p>\n<p>This following runthrough will showcase the stages of this process—from the initial surveys and workshop insights to post-workshop adjustments—and how we’re integrating your feedback to shape a metrics framework that accurately reflects the impact we aim to reward.</p>\n<h2><a name=\"retro-funding-4s-new-direction-metrics-based-evaluation-1\" class=\"anchor\" href=\"https://gov.optimism.io#retro-funding-4s-new-direction-metrics-based-evaluation-1\"></a>Retro Funding 4’s New Direction: Metrics-based evaluation</h2>\n<p>The core hypothesis of Retro Funding 4 is that by using quantitative metrics, our community can more accurately express preferences for the types of impact they wish to see and reward. This approach marks a significant shift from earlier Retro Funding iterations where badgeholders voted directly on projects. In RF4, the emphasis is on leveraging data to power impact evaluation, ensuring that metrics are robust, verifiable, and truly representative of the community’s values.</p>\n<p>One important thing to keep in mind is that this is one of many experiments that we’ll be running this year and you can find all the details of what’s to come <a href=\"https://gov.optimism.io/t/upcoming-retro-rounds-and-their-design/7861\">right here</a>.</p>\n<h3><a name=\"the-initial-survey-establishing-the-baseline-2\" class=\"anchor\" href=\"https://gov.optimism.io#the-initial-survey-establishing-the-baseline-2\"></a><strong>The Initial Survey:</strong> Establishing the baseline</h3>\n<p>The initial survey we sent out was a means of gauging community perspectives on qualitative and quantitative measurement approaches and gathering input on a potential first draft list of metrics.</p>\n<p>Key findings included:</p>\n<ul>\n<li>\n<p>Balance in metrics: Badgeholders showed a relatively balanced interest in metrics assessing both quantitative growth and qualitative impact, indicating a need for an evaluation framework that incorporates both dimensions.</p>\n</li>\n<li>\n<p>Innovation and Open Source: Metrics related to innovation and open source scored significantly higher, reflecting a community preference for collaborative efforts.</p>\n</li>\n<li>\n<p>Concerns about gaming metrics: A notable concern was the potential for gaming the system, highlighting the need for metrics that are difficult to manipulate and that genuinely reflect impactful contributions.</p>\n</li>\n<li>\n<p>Engagement and a focus on quality: There was a strong preference for metrics that measure sustained engagement and ongoing quality vs one-time actions, highlighting the value placed on long-term impact.</p>\n</li>\n</ul>\n<p></p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://global.discourse-cdn.com/business7/uploads/bc41dd/original/2X/3/319c8b72e08e73c76d0fb4d84ac3daf79c95a48b.png\" data-download-href=\"/uploads/short-url/74SN4NBeF6ISt13Xb96nSKHfYO7.png?dl=1\" title=\"\"><img src=\"https://global.discourse-cdn.com/business7/uploads/bc41dd/optimized/2X/3/319c8b72e08e73c76d0fb4d84ac3daf79c95a48b_2_624x297.png\" alt=\"\" data-base62-sha1=\"74SN4NBeF6ISt13Xb96nSKHfYO7\" width=\"624\" height=\"297\" role=\"presentation\" srcset=\"https://global.discourse-cdn.com/business7/uploads/bc41dd/optimized/2X/3/319c8b72e08e73c76d0fb4d84ac3daf79c95a48b_2_624x297.png, https://global.discourse-cdn.com/business7/uploads/bc41dd/optimized/2X/3/319c8b72e08e73c76d0fb4d84ac3daf79c95a48b_2_936x445.png 1.5x, https://global.discourse-cdn.com/business7/uploads/bc41dd/optimized/2X/3/319c8b72e08e73c76d0fb4d84ac3daf79c95a48b_2_1248x594.png 2x\" data-dominant-color=\"F3F0EF\"></a></div><p></p>\n<h3><a name=\"the-workshop-data-deep-dive-and-refining-metrics-3\" class=\"anchor\" href=\"https://gov.optimism.io#the-workshop-data-deep-dive-and-refining-metrics-3\"></a><strong>The Workshop: Data Deep Dive and Refining Metrics</strong></h3>\n<p>Building on the survey insights, the workshop we ran on May 7th enabled badgeholders to provide more in-depth feedback on the data-driven aspects of the impact metrics system as well as take a pass at selecting the most meaningful metrics grouped around:</p>\n<p><em>Network growth</em></p>\n<p>These are metrics designed to quantify the expansion and scalability of the network. They focus on observable, direct measurements and aim to capture high level activity.</p>\n<p><em>Network quality</em></p>\n<p>This aims to evaluate the trustworthiness and integrity of interactions on the network. They focus on depth and reliability.</p>\n<p><em>User growth</em></p>\n<p>The focus here is on measuring new, active and consistent participation in the network.</p>\n<p><em>User quality</em></p>\n<p>The quality measurements are aimed at assessing the value and consistency of user contributions, not just their numbers.</p>\n<p>For a detailed look at the survey results, key moments and discussions, you can review the <a href=\"https://www.figma.com/file/IISdYrF76LrfTZNn4wURUq/%F0%9F%A7%AA-RF4-Impact-Experiment-%F0%9F%A7%AA?type=whiteboard&amp;node-id=0-1&amp;t=9uOFgusAZrL5l5zx-0\">workshop space here</a>.</p>\n<p></p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://global.discourse-cdn.com/business7/uploads/bc41dd/original/2X/5/576b42fd7b4ec6a01e766fe52277fcb7c7584de4.jpeg\" data-download-href=\"/uploads/short-url/ctllvWpNo1EbqdlxuKGTVtt0sXW.jpeg?dl=1\" title=\"\"><img src=\"https://global.discourse-cdn.com/business7/uploads/bc41dd/optimized/2X/5/576b42fd7b4ec6a01e766fe52277fcb7c7584de4_2_416x225.jpeg\" alt=\"\" data-base62-sha1=\"ctllvWpNo1EbqdlxuKGTVtt0sXW\" width=\"416\" height=\"225\" role=\"presentation\" srcset=\"https://global.discourse-cdn.com/business7/uploads/bc41dd/optimized/2X/5/576b42fd7b4ec6a01e766fe52277fcb7c7584de4_2_416x225.jpeg, https://global.discourse-cdn.com/business7/uploads/bc41dd/optimized/2X/5/576b42fd7b4ec6a01e766fe52277fcb7c7584de4_2_624x337.jpeg 1.5x, https://global.discourse-cdn.com/business7/uploads/bc41dd/optimized/2X/5/576b42fd7b4ec6a01e766fe52277fcb7c7584de4_2_832x450.jpeg 2x\" data-dominant-color=\"E4E8EA\"></a></div><p></p>\n<p>You can also explore <a href=\"https://docs.opensource.observer/blog/impact-metrics-rf4\">this blog post</a> by Open Source Observer that recaps the work they’ve done so far to map up the metrics. OSO is collaborating with the Optimism Collective and its Badgeholder community to develop the impact metrics for assessing projects in RF4.</p>\n<h3><a name=\"post-workshop-survey-refining-metrics-4\" class=\"anchor\" href=\"https://gov.optimism.io#post-workshop-survey-refining-metrics-4\"></a>Post-Workshop Survey: Refining metrics</h3>\n<p>Following the workshop discussions and feedback, and since not all Badgeholders were able to attend, a detailed survey was sent out to get further feedback on refined metrics, divided into the four identified segments:</p>\n<ul>\n<li>\n<p>Network Growth: Feedback suggests a need for simple, intuitive, and directly measurable metrics like gas fees and transaction counts</p>\n</li>\n<li>\n<p>Network Quality: There ia general support for metrics that consider the quality and trustworthiness of transactions, with suggestions to refine how ‘trusted transactions’ are defined and measured</p>\n</li>\n<li>\n<p>User Growth: A preference for metrics that accurately capture genuine user engagement emerged, with calls for clearer definitions of what constitutes an ‘active’ or ‘engaged’ user</p>\n</li>\n<li>\n<p>User Quality: Responses highlighted the challenge of measuring user quality without arbitrary metrics, suggesting a need for ongoing discussion and refinement to develop quality metrics that truly reflect contributions to the ecosystem</p>\n</li>\n</ul>\n<h3><a name=\"refining-and-implementing-feedback-5\" class=\"anchor\" href=\"https://gov.optimism.io#refining-and-implementing-feedback-5\"></a>Refining and implementing feedback</h3>\n<p>The insights from the surveys together with the discussions in the workshop are leading us to the next stage of metrics refinement. A key focus across the workshop and the second survey has been the granularity of the trusted users element so to respond to and integrate the insights, Open Source Observer (OSO) is working on the following:</p>\n<p><strong>Trusted user model</strong><br>\nBased on some good suggestions and ideas for how to improve upon the “trusted user” model coming from the second survey shared, OSO are exploring several additional sources of data for the model.</p>\n<p><em>Important Note:</em> Open Source Observer is only considering sources that leverage existing public datasets (<strong>no new solutions</strong>), are privacy-preserving, and can be applied to a broad set of addresses (&gt;20K).</p>\n<p>Action items:</p>\n<ul>\n<li>Extending the trusted user model: The current model relies on three trust signals (Farcaster IDs, Passport Scores, and EigenTrust by Karma3 Labs). OSO will now move forward with a larger set of potential trust signals such as:</li>\n</ul>\n<ul>\n<li>Optimist NFT holders</li>\n<li>Sybil classifiers used by the OP data team</li>\n<li>Social graph analysis</li>\n<li>Pre-permissionless Farcaster users</li>\n<li>ENS ownership</li>\n</ul>\n<ul>\n<li>OSO will be running some light scenario analysis and choose the best model(s). They will also model a variety of options and share a report on the results.</li>\n</ul>\n<p>Small fixes:<br>\nIn the second survey, badgeholders also made a number of straightforward suggestions for how metrics could be standardized and implemented more consistently. These include:</p>\n<ul>\n<li>Limiting all relevant metrics to the 6 month Retro Funding 4 evaluation window</li>\n<li>Creating versions of some metrics on both linear and logarithmic scales</li>\n<li>Creating versions of “user growth” metrics that look at a larger set of addresses vs just the “trusted user” set</li>\n<li>Copy-editing to make descriptions clearer</li>\n</ul>\n<p>Action items:</p>\n<ul>\n<li>OSO will proceed directly with making these changes</li>\n</ul>\n<p>New metrics:</p>\n<p>There were several metrics that had previously been considered and were proposed again in the feedback survey. These include looking at gas efficiency; power users; a larger set of addresses than just trusted users; and protocols that are favored by multisig users.</p>\n<p>Action items:</p>\n<ul>\n<li>OSO will implement these new metrics where feasible</li>\n</ul>\n<h3><a name=\"next-steps-testing-metrics-out-6\" class=\"anchor\" href=\"https://gov.optimism.io#next-steps-testing-metrics-out-6\"></a>Next Steps: Testing metrics out</h3>\n<p>The next step in this process will be to take the metrics set for a test drive. In the week of June 3rd, Badgeholders will have the chance to test out the metrics through an interface that simulates IRL voting. Badgeholders will also have the opportunity to submit extra feedback per metric as they test each one out.</p>\n<p>Once this final round of feedback is collected and analyzed, we will be able to come back together in a session to discuss and decide on the final set of metrics to be used in Retro Funding 4.</p>\n            <p><small>2 posts - 2 participants</small></p>\n            <p><a href=\"https://gov.optimism.io/t/retro-funding-4-impact-metrics-a-collective-experiment/8226\">Read full topic</a></p>","link":"https://gov.optimism.io/t/retro-funding-4-impact-metrics-a-collective-experiment/8226","pubDate":"Wed, 29 May 2024 11:59:28 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"gov.optimism.io-topic-8226"},"source":{"@url":"https://gov.optimism.io/t/retro-funding-4-impact-metrics-a-collective-experiment/8226.rss","#text":"Retro Funding 4: Impact Metrics, a Collective Experiment"}},{"title":"Retro Funding 4: Application Review Process","dc:creator":"system","category":"Retro  Funding 🔴","description":"<p>The Retroactive Public Goods Funding (Retro Funding) application review process is applied to decide which applicants are eligible to participate in retro rounds and is used to enforce application rules and eligibility criteria. For a full overview of the application review process see <a href=\"https://gov.optimism.io/t/retro-funding-application-review-process/8012\">Retro Funding: Application Review Process</a></p>\n<h3><a name=\"application-review-process-overview-1\" class=\"anchor\" href=\"https://gov.optimism.io#application-review-process-overview-1\"></a>Application Review Process Overview</h3>\n<ol>\n<li>Any badgeholder can volunteer to take part in the review process. The Badgeholder Reviewers will assess whether applications violate the application rules.</li>\n<li>Applications that are not meeting the rounds <a href=\"https://gov.optimism.io/t/retro-funding-4-onchain-builders-round-details/7988#eligibility-criteria-4\">eligibility criteria</a> will be automatically rejected.</li>\n<li>Each application will be reviewed by 2 Reviewers. For the application to be pass, both reviewers have to accept it. If 1/2 reviewers reject the application, the application goes to a full review with 3 additional reviewers.</li>\n<li>An application is rejected if 3/5 reviewers reject the application. Reviewers will need to note the reason for rejection for each application.</li>\n<li>If applicants believe their application has been wrongfully excluded, and is not in violation of the Application Rules, they can file an appeal. Appeals are reviewed by 5 Badgeholder Reviewers, who have not reviewed the application before (step 3.).</li>\n<li>Badgeholder Reviewers are not allowed to vote on applications from their primary project.“Primary” is defined as a project to which you dedicate &gt;25% of working hours or derive &gt;25% of your compensation.</li>\n</ol>\n<h3><a name=\"how-to-participate-2\" class=\"anchor\" href=\"https://gov.optimism.io#how-to-participate-2\"></a><strong>How to participate</strong></h3>\n<ol>\n<li>Any badgeholder can volunteer to participate in the application review process\n<ul>\n<li>To join as a Reviewer, a badgeholder must submit <a href=\"https://deform.optimism.io/reviewer-sign-up\">this form</a> by <strong>Friday, June 7th</strong></li>\n</ul>\n</li>\n<li>The review process will take place from <strong>June 10th until June 20th</strong>. To effectively participate in this process, <strong>a reviewer should expect to spend at least 6 hours on reviews.</strong></li>\n<li>Reviewers will be rewarded for their participation in the application review process as part of Retro Governance Participation Rewards</li>\n<li>Those who fill in the form will be contacted on <strong>Monday, June 10th</strong></li>\n<li>We will have a Reviewer sync call on <strong>Monday, June 10th - 18:00 UTC</strong></li>\n</ol>\n<h3><a name=\"retro-funding-4-application-rules-3\" class=\"anchor\" href=\"https://gov.optimism.io#retro-funding-4-application-rules-3\"></a>Retro Funding 4 Application Rules</h3>\n<p>If projects fail to comply with the application rules, they will be excluded from participating in the retro round.</p>\n<ol>\n<li><strong>False statements &amp; deception</strong> - false claims about your contributions, past impact or funding &amp; grants are not allowed.</li>\n<li><strong>Hateful Content</strong> - No racist, sexist, or otherwise hateful speech, no discrimination as defined by the <a href=\"https://gov.optimism.io/t/rules-of-engagement-2-0/5728\">rules of engagement</a></li>\n<li><strong>Deceiving badgeholders</strong> - Malicious content that could cause harm or unintended consequences to users.</li>\n<li><strong>Fraud &amp; Impersonation</strong> - Claiming to be a brand or person you are not. The Grant owner must be directly affiliated with the project; the funds must go to the project.</li>\n<li><strong>Advertising</strong> - Using Retro Funding application to showcase something you are selling like a token sale or NFT drop</li>\n<li><strong>Outside of Retro round scope or not meeting eligibility criteria</strong> - Contributions that do not have a clear relationship to the scope of the retro round, or do not meet eligibility criteria</li>\n<li><strong>Spam</strong> - Applications containing spam, such as irrelevant answers, plagiarized content, broken or unrelated impact metrics and contribution links. Applications in languages other than English*.\n<ul>\n<li>This will help simplify the process as English is the working language of the majority of Badgeholders. Please ensure you translate any content that’s part of the application.</li>\n</ul>\n</li>\n<li><strong>Duplicate applications</strong> - Multiple applications from the same individual, project or group which apply for the same impact.\n<ul>\n<li>Members of <a href=\"https://www.notion.so/322eb3a24bf149eeb2bd7af5ba22d1b3?pvs=21\">contribution paths</a> (Council Members, Ambassadors, NumbaNERDs, SupNERDs, TechNERDs, Translators) or Councils can’t submit individual applications for their work within the relevant workstream, as each workstream will apply as a project.</li>\n</ul>\n</li>\n</ol>\n            <p><small>3 posts - 2 participants</small></p>\n            <p><a href=\"https://gov.optimism.io/t/retro-funding-4-application-review-process/8225\">Read full topic</a></p>","link":"https://gov.optimism.io/t/retro-funding-4-application-review-process/8225","pubDate":"Wed, 29 May 2024 11:42:41 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"gov.optimism.io-topic-8225"},"source":{"@url":"https://gov.optimism.io/t/retro-funding-4-application-review-process/8225.rss","#text":"Retro Funding 4: Application Review Process"}},{"title":"Open letter to Polynya","dc:creator":"jackanorak","category":"Delegates  🏛","description":"<p><a class=\"mention\" href=\"https://gov.optimism.io/u/polynya\">@polynya</a> -</p>\n<p>As far as I know, you’ve largely receded from active involvement across this industry, but you continue to command an enormous OP delegation, a powerful marginal vote that can unilaterally make or kill proposals.</p>\n<p>Do you intend to participate in Optimism in an ongoing way? If not, what are your plans for this voting position?</p>\n            <p><small>2 posts - 2 participants</small></p>\n            <p><a href=\"https://gov.optimism.io/t/open-letter-to-polynya/8220\">Read full topic</a></p>","link":"https://gov.optimism.io/t/open-letter-to-polynya/8220","pubDate":"Tue, 28 May 2024 16:11:42 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"gov.optimism.io-topic-8220"},"source":{"@url":"https://gov.optimism.io/t/open-letter-to-polynya/8220.rss","#text":"Open letter to Polynya"}},{"title":"Zeugh - Delegate Communication Thread","dc:creator":"Zeugh","category":"Delegates  🏛","description":"<p>Hello, I am Zeugh and as I’m starting <a href=\"https://vote.optimism.io/delegates/zeugh.eth\" rel=\"noopener nofollow ugc\">my delegate journey</a> in the collective I thought it’d be useful to give the community a bit of background on me.</p>\n<p>I chose to be a delegate because OP is building consistently towards being an enabler for the next internet, and I want to help build it. I have experience with other governances and helped design and create DAOs on OP with a lot of different tools.</p>\n<p>I work on <a href=\"https://blockful.io\" rel=\"noopener nofollow ugc\">Blockful</a> as lead product researcher focused on projects for coordination tooling and supporting the service provider team - currently working with <a href=\"https://discuss.ens.domains/t/service-provider-stream-nomination-thread/18142/38\" rel=\"noopener nofollow ugc\">ENS DAO</a> and <a href=\"https://shutterdao.discourse.group/t/rfp-develop-a-keyper-incentive-mechanism-and-delegated-staking-blockful/387\" rel=\"noopener nofollow ugc\">ShutterDAO</a>. We’re also working on a <a href=\"https://app.charmverse.io/op-grants/scale-ens-to-op-blockful-official-ens-service-provider-6112748728814419\" rel=\"noopener nofollow ugc\">mission for Optimism</a> and on a proposal for Arbitrum.</p>\n<p>I currently hold a lot of $JBX tokens and have been an <a href=\"https://nance.app/u/zeugh.eth?page=1&amp;space=jbdao.eth\" rel=\"noopener nofollow ugc\">active voter</a> for <a href=\"https://docs.juicebox.money/dao/\" rel=\"noopener nofollow ugc\">JuiceboxDAO</a></p>\n<p>If you’re interested in more, there’s some history and links here:</p>\n\n\"Past Life\" Background <a href=\"https://gov.optimism.io/t/zeugh-delegate-communication-thread/8218/1\">(click for more details)</a>\n\nPrevious DAO Experience <a href=\"https://gov.optimism.io/t/zeugh-delegate-communication-thread/8218/1\">(click for more details)</a>\n<p>I’ll be using this thread to detail my thinking process on the votes and bring other points and opinions that might be relevant as a delegate.</p>\n            <p><small>1 post - 1 participant</small></p>\n            <p><a href=\"https://gov.optimism.io/t/zeugh-delegate-communication-thread/8218\">Read full topic</a></p>","link":"https://gov.optimism.io/t/zeugh-delegate-communication-thread/8218","pubDate":"Tue, 28 May 2024 14:08:55 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"gov.optimism.io-topic-8218"},"source":{"@url":"https://gov.optimism.io/t/zeugh-delegate-communication-thread/8218.rss","#text":"Zeugh - Delegate Communication Thread"}},{"title":"Optimism Forum Weekly Recap (May 20, 2024 - May 26, 2024)","dc:creator":"daospace","category":"Updates  and Announcements 📢","description":"<p>gm Optimism Collective <img src=\"https://emoji.discourse-cdn.com/twitter/red_circle.png?v=12\" title=\":red_circle:\" class=\"emoji\" alt=\":red_circle:\" loading=\"lazy\" width=\"20\" height=\"20\"> <img src=\"https://emoji.discourse-cdn.com/twitter/sparkles.png?v=12\" title=\":sparkles:\" class=\"emoji\" alt=\":sparkles:\" loading=\"lazy\" width=\"20\" height=\"20\"></p>\n<p>Last week saw significant activity on the Optimism forum, 9 topics were created, and key highlights include Ed Mazurek’s 122,000 OP budget proposal for the Developer Advisory Board, PYOR’s report on a 140.5% increase in daily active users, and discussions on integrating OP tokens across all superchains to boost adoption and interoperability.</p>\n<p><a href=\"https://twitter.com/daospace_ai\" rel=\"noopener nofollow ugc\">daospace </a>is a DAO discovery platform that aggregates contributions across different DAOs. We will be providing weekly Automated AI Summaries to help reduce information overload, and so that all members can stay up to date on forum activity within the DAO. Below is a summary of every topic made within the OP Governance Forum from last week.</p>\n<p>Feel free to leave us feedback in the comments below. You can get in touch with the daospace team on <a href=\"https://twitter.com/daospace_ai\" rel=\"noopener nofollow ugc\">X (Twitter) </a>, or reach out to the founders directly on X as well: <a href=\"https://twitter.com/JarisJames\" rel=\"noopener nofollow ugc\">Jaris James </a>&amp; <a href=\"https://twitter.com/sixty_keys\" rel=\"noopener nofollow ugc\">Sixty</a></p>\n<h2><a name=\"ed-mazurek-developer-advisory-board-operating-budgethttpsgovoptimismioted-mazurek-developer-advisory-board-operating-budget8175-1\" class=\"anchor\" href=\"https://gov.optimism.io#ed-mazurek-developer-advisory-board-operating-budgethttpsgovoptimismioted-mazurek-developer-advisory-board-operating-budget8175-1\"></a><a href=\"https://gov.optimism.io/t/ed-mazurek-developer-advisory-board-operating-budget/8175\">Ed Mazurek - Developer Advisory Board Operating Budget</a></h2>\n<p><strong>Created</strong>: 2024-05-21 01:08 AM</p>\n<p><strong>Author</strong>: <a class=\"mention\" href=\"https://gov.optimism.io/u/wildmolasses\">@wildmolasses</a></p>\n<p><strong>Summary</strong></p>\n<p>This post outlines a proposal for the Developer Advisory Board’s operating budget, with Ed Mazurek proposed as the Board Lead and a budget of 122,000 OP. The goals include increasing transparency and fostering dialogue within the community. The proposal also details the responsibilities, qualifications, and budget breakdown for board members. Additionally, it discusses how to measure the impact of the Board and ensure it executes its charter effectively.</p>\n<h2><a name=\"daily-active-users-on-chainhttpsgovoptimismiotdaily-active-users-on-chain8179-2\" class=\"anchor\" href=\"https://gov.optimism.io#daily-active-users-on-chainhttpsgovoptimismiotdaily-active-users-on-chain8179-2\"></a><a href=\"https://gov.optimism.io/t/daily-active-users-on-chain/8179\">Daily Active Users on-chain</a></h2>\n<p><strong>Created</strong>: 2024-05-22 04:31 AM</p>\n<p><strong>Author</strong>: <a class=\"mention\" href=\"https://gov.optimism.io/u/aadarsh_pyor\">@Aadarsh_PYOR</a></p>\n<p><strong>Summary</strong></p>\n<p>PYOR, a blockchain analytics firm, analyzed Optimism’s user base and found a significant increase in daily active users by 140.5% since the beginning of the year. The user growth for Optimism in 2024 is broken down as follows: 12% in January, -20% in February, 60% in March, and 48% in April. This growth trend indicates a notable rise in user engagement and adoption of the platform.</p>\n<h2><a name=\"tvl-growth-of-rpgf-grant-recipientshttpsgovoptimismiottvl-growth-of-rpgf-grant-recipients8185-3\" class=\"anchor\" href=\"https://gov.optimism.io#tvl-growth-of-rpgf-grant-recipientshttpsgovoptimismiottvl-growth-of-rpgf-grant-recipients8185-3\"></a><a href=\"https://gov.optimism.io/t/tvl-growth-of-rpgf-grant-recipients/8185\">TVL Growth of RPGF Grant Recipients</a></h2>\n<p><strong>Created</strong>: 2024-05-22 05:22 AM</p>\n<p><strong>Author</strong>: Aadarsh_PYOR</p>\n<p><strong>Summary</strong></p>\n<p>Funded by RPGF grants, various protocols have seen a significant increase in Total Value Locked (TVL). Aerodome leads the pack with a remarkable 3x growth in TVL since January 2024. Other recipients like SushiSwap have also experienced substantial TVL growth. PYOR, a blockchain analytics firm, provides in-depth insights using their data product to analyze and deliver information to key institutions.</p>\n<h2><a name=\"optimism-post-rpgf-analysishttpsgovoptimismiotoptimism-post-rpgf-analysis8186-4\" class=\"anchor\" href=\"https://gov.optimism.io#optimism-post-rpgf-analysishttpsgovoptimismiotoptimism-post-rpgf-analysis8186-4\"></a><a href=\"https://gov.optimism.io/t/optimism-post-rpgf-analysis/8186\">Optimism post RPGF analysis</a></h2>\n<p><strong>Created</strong>: 2024-05-23 05:24 AM</p>\n<p><strong>Author</strong>: <a class=\"mention\" href=\"https://gov.optimism.io/u/thanatos\">@Thanatos</a></p>\n<p><strong>Summary</strong></p>\n<p>PYOR, a founding member at Optimism, conducted an Exploratory Data Analysis (EDA) on the performance of DeFi protocols that received Retroactive Public Goods Funding (RPGF) in January. They analyzed on-chain metrics such as Total Value Locked (TVL), fees, volumes, and user activity, before and after the RPGF distribution. Insights include notable growth in Aerodrome, a late revival in SushiSwap, poor performance in yield protocols like Yearn Finance and Sonne Finance, and positive growth in bridge protocols like Hop and Synapse.</p>\n<p>PYOR’s analysis aimed to empower Optimism Governance by focusing on recipients with a net positive impact on the Optimism Superchain. The study highlighted the performance of various protocols, normalized growth data by RPGF value, and compared DEXes like Uniswap to observe correlations. Their research emphasized the importance of a data-driven approach to enhance the on-chain RPGF program’s robustness.</p>\n<h2><a name=\"voting-cycle-roundup-23ahttpsgovoptimismiotvoting-cycle-roundup-23a8189-5\" class=\"anchor\" href=\"https://gov.optimism.io#voting-cycle-roundup-23ahttpsgovoptimismiotvoting-cycle-roundup-23a8189-5\"></a><a href=\"https://gov.optimism.io/t/voting-cycle-roundup-23a/8189\">Voting Cycle Roundup #23a</a></h2>\n<p><strong>Created</strong>: 2024-05-23 07:40 AM</p>\n<p><strong>Author</strong>: <a class=\"mention\" href=\"https://gov.optimism.io/u/system\">@system</a></p>\n<p><strong>Summary</strong></p>\n<p>Special Voting Cycle <span class=\"hashtag-raw\">#23</span> begins on May 23rd, with voting running until May 29th. The Citizens’ House has a week to veto any upgrades approved by the Token House. A snapshot of delegate voting weights will be taken when voting goes live at <a href=\"http://vote.optimism.io\" rel=\"noopener nofollow ugc\">vote.optimism.io</a>. The proposals for Protocol Upgrades, Governor Updates, Council Operating Budgets, and renewals for various councils and boards are being voted on.</p>\n<h2><a name=\"anthias-labs-delegate-communication-threadhttpsgovoptimismiotanthias-labs-delegate-communication-thread8198-6\" class=\"anchor\" href=\"https://gov.optimism.io#anthias-labs-delegate-communication-threadhttpsgovoptimismiotanthias-labs-delegate-communication-thread8198-6\"></a><a href=\"https://gov.optimism.io/t/anthias-labs-delegate-communication-thread/8198\">Anthias Labs - Delegate Communication Thread</a></h2>\n<p><strong>Created</strong>: 2024-05-24 04:02 PM</p>\n<p><strong>Author</strong>: <a class=\"mention\" href=\"https://gov.optimism.io/u/anthiaslabs\">@AnthiasLabs</a></p>\n<p><strong>Summary</strong></p>\n<p>Summary: The post provides an overview of Anthias Labs, a blockchain R&amp;D firm focusing on public goods tooling and risk management within the cryptocurrency space. Anthias Labs shares their principles for voting, centered on decentralization, risk mitigation, and support for proposals aligned with Optimism governance structures and processes. They invite OP holders to delegate to their address and connect with their team for further discussions.</p>\n<h2><a name=\"faq-retro-funding-onchain-buildershttpsgovoptimismiotfaq-retro-funding-onchain-builders8200-7\" class=\"anchor\" href=\"https://gov.optimism.io#faq-retro-funding-onchain-buildershttpsgovoptimismiotfaq-retro-funding-onchain-builders8200-7\"></a><a href=\"https://gov.optimism.io/t/faq-retro-funding-onchain-builders/8200\">FAQ Retro Funding “Onchain Builders”</a></h2>\n<p><strong>Created</strong>: 2024-05-24 05:48 PM</p>\n<p><strong>Author</strong>: <a class=\"mention\" href=\"https://gov.optimism.io/u/liliop.eth\">@Liliop.eth</a></p>\n<p><strong>Summary</strong></p>\n<p>In this post, the expansion of Retro Funding to support the Superchain is announced. Projects deployed on OP Mainnet, Base, Zora, Mode, Frax, and Metal, if meeting other criteria, are eligible for Retro Funding 4. Additionally, a suggestion is made to clarify a FAQ regarding the requirement of projects being on OP Mainnet for Retro Funding eligibility.</p>\n<h2><a name=\"discussion-op-token-on-all-superchainhttpsgovoptimismiotdiscussion-op-token-on-all-superchain8201-8\" class=\"anchor\" href=\"https://gov.optimism.io#discussion-op-token-on-all-superchainhttpsgovoptimismiotdiscussion-op-token-on-all-superchain8201-8\"></a><a href=\"https://gov.optimism.io/t/discussion-op-token-on-all-superchain/8201\">Discussion OP token on all Superchain</a></h2>\n<p><strong>Created</strong>: 2024-05-25 05:51 AM</p>\n<p><strong>Author</strong>: <a class=\"mention\" href=\"https://gov.optimism.io/u/nanobro\">@nanobro</a></p>\n<p><strong>Summary</strong></p>\n<p>The post discusses the importance of integrating OP tokens across all superchains to maximize the potential of blockchain networks. It emphasizes the benefits of standardizing OP tokens to boost awareness, adoption, and user experience. With OP tokens available on every superchain, users from different chains can equally access the benefits and functionalities, driving engagement and innovation. Standardizing OP tokens is seen as a strategic move that will elevate the ecosystem, enhance interoperability, and ensure universal recognition and utilization of OP across various chains.</p>\n<h2><a name=\"feedback-and-suggestionhttpsgovoptimismiotfeedback-and-suggestion8208-9\" class=\"anchor\" href=\"https://gov.optimism.io#feedback-and-suggestionhttpsgovoptimismiotfeedback-and-suggestion8208-9\"></a><a href=\"https://gov.optimism.io/t/feedback-and-suggestion/8208\">Feedback And Suggestion</a></h2>\n<p><strong>Created</strong>: 2024-05-26 03:28 AM</p>\n<p><strong>Author</strong>: <a class=\"mention\" href=\"https://gov.optimism.io/u/agung5611\">@Agung5611</a></p>\n<p><strong>Summary</strong></p>\n<p>The user is seeking assistance with an issue regarding their account not being accepted by RetroPGF 3.</p>\n            <p><small>2 posts - 2 participants</small></p>\n            <p><a href=\"https://gov.optimism.io/t/optimism-forum-weekly-recap-may-20-2024-may-26-2024/8214\">Read full topic</a></p>","link":"https://gov.optimism.io/t/optimism-forum-weekly-recap-may-20-2024-may-26-2024/8214","pubDate":"Mon, 27 May 2024 19:34:32 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"gov.optimism.io-topic-8214"},"source":{"@url":"https://gov.optimism.io/t/optimism-forum-weekly-recap-may-20-2024-may-26-2024/8214.rss","#text":"Optimism Forum Weekly Recap (May 20, 2024 - May 26, 2024)"}},{"title":"Feedback And Suggestion","dc:creator":"Agung5611","category":"✨ General","description":"<p>Please help me with the reference, Mr. My account was not accepted by RetroPGF3</p>\n            <p><small>1 post - 1 participant</small></p>\n            <p><a href=\"https://gov.optimism.io/t/feedback-and-suggestion/8208\">Read full topic</a></p>","link":"https://gov.optimism.io/t/feedback-and-suggestion/8208","pubDate":"Sun, 26 May 2024 07:28:02 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"gov.optimism.io-topic-8208"},"source":{"@url":"https://gov.optimism.io/t/feedback-and-suggestion/8208.rss","#text":"Feedback And Suggestion"}},{"title":"Share via Coinbase wallet","dc:creator":"Ighedo","category":"✨ General","description":"<p>bc1pex9uqzjkpcfhk7retwqwudl2j26sacmulpfgppyqe2jd26rh4dzqf800cn</p>\n            <p><small>1 post - 1 participant</small></p>\n            <p><a href=\"https://gov.optimism.io/t/share-via-coinbase-wallet/8203\">Read full topic</a></p>","link":"https://gov.optimism.io/t/share-via-coinbase-wallet/8203","pubDate":"Sat, 25 May 2024 21:25:00 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"gov.optimism.io-topic-8203"},"source":{"@url":"https://gov.optimism.io/t/share-via-coinbase-wallet/8203.rss","#text":"Share via Coinbase wallet"}},{"title":"Discussion OP token on all Superchain","dc:creator":"nanobro","category":"✨ General","description":"<p>We’re growing from 0 to 13 superchains and 38 OP Stack chains, yet the OP token is only available on the OP Mainnet.</p>\n<p>The integration of OP tokens across all superchains is essential for maximizing the potential of these blockchain networks. By ensuring that OP tokens are available on every superchain, we can significantly boost overall awareness and adoption. This uniformity will create a seamless user experience.</p>\n<p>Furthermore, without the presence of OP tokens on every superchain, there’s a lost opportunity for OP, as some chain users, like Base and Mode users, may remain unaware or underutilized in relation to OP. This fragmentation can hinder the growth and effectiveness of the superchain network as a whole. By standardizing OP tokens across all chains, we ensure that every participant, regardless of the specific chain they use, has equal access to the benefits and functionalities offered by OP. This will not only drive engagement and innovation within the network but also establish OP as a central, unifying asset in the blockchain community.</p>\n<p>When more developers and users know about the OP token, they will likely adopt the Optimistic vision, OP Stack, and retroPGF.</p>\n<p>In conclusion, making OP tokens available on all superchains is a strategic move that will elevate the entire ecosystem. It will enhance interoperability, increase user engagement, and ensure that the advantages of OP are universally recognized and utilized. This approach will create a more integrated and dynamic blockchain environment, ultimately driving greater success and innovation across all superchains.</p>\n            <p><small>2 posts - 2 participants</small></p>\n            <p><a href=\"https://gov.optimism.io/t/discussion-op-token-on-all-superchain/8201\">Read full topic</a></p>","link":"https://gov.optimism.io/t/discussion-op-token-on-all-superchain/8201","pubDate":"Sat, 25 May 2024 09:51:47 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"gov.optimism.io-topic-8201"},"source":{"@url":"https://gov.optimism.io/t/discussion-op-token-on-all-superchain/8201.rss","#text":"Discussion OP token on all Superchain"}},{"title":"FAQ Retro Funding “Onchain Builders”","dc:creator":"Liliop.eth","category":"Retro  Funding 🔴","description":"<p>Continuing the discussion from <a href=\"https://gov.optimism.io/t/retro-funding-4-onchain-builders-round-details/7988\">Retro Funding 4: Onchain Builders - round details</a>:</p>\n<aside class=\"quote no-group\" data-username=\"system\" data-post=\"1\" data-topic=\"7988\">\n<div class=\"title\">\n<div class=\"quote-controls\"></div>\n<img loading=\"lazy\" alt=\"\" width=\"24\" height=\"24\" src=\"https://global.discourse-cdn.com/business7/uploads/bc41dd/original/1X/391d6e71a279a9f881f75bfa7df5cdf3cf905b3f.png\" class=\"avatar\"><a href=\"https://gov.optimism.io/t/retro-funding-4-onchain-builders-round-details/7988/1\">Retro Funding 4: Onchain Builders - round details</a></div>\n<blockquote>\n<p>No! Retro Funding is expanding to support the Superchain! If you’ve deployed contracts on the following OP chains, and meet the other critera, you’re eligible for Retro Funding 4: OP Mainnet, Base, Zora, Mode, Frax and Metal.</p>\n</blockquote>\n</aside>\n<p>Thank you Jonass for considering my recommendation to add FAQ section!! <img src=\"https://emoji.discourse-cdn.com/twitter/clap/3.png?v=12\" title=\":clap:t3:\" class=\"emoji\" alt=\":clap:t3:\" loading=\"lazy\" width=\"20\" height=\"20\"></p>\n<p>“ Does my project need to be on OP Mainnet?</p>\n<p>No! Retro Funding is expanding to support the Superchain!”</p>\n<p>Just as a suggestion, here it could be “No, necessarily” as something that is not mandatory but it’s ok too. Because it could be confused with the fact that we don’t need it to be on OP Mainnet, even if it’s say down. <img src=\"https://emoji.discourse-cdn.com/twitter/sweat_smile.png?v=12\" title=\":sweat_smile:\" class=\"emoji\" alt=\":sweat_smile:\" loading=\"lazy\" width=\"20\" height=\"20\"></p>\n<p>Thanks!!</p>\n            <p><small>6 posts - 4 participants</small></p>\n            <p><a href=\"https://gov.optimism.io/t/faq-retro-funding-onchain-builders/8200\">Read full topic</a></p>","link":"https://gov.optimism.io/t/faq-retro-funding-onchain-builders/8200","pubDate":"Fri, 24 May 2024 21:48:32 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"gov.optimism.io-topic-8200"},"source":{"@url":"https://gov.optimism.io/t/faq-retro-funding-onchain-builders/8200.rss","#text":"FAQ Retro Funding “Onchain Builders”"}},{"title":"Anthias Labs - Delegate Communication Thread","dc:creator":"AnthiasLabs","category":"Delegate Updates","description":"<p></p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://global.discourse-cdn.com/business7/uploads/bc41dd/original/2X/6/65d4f16497cdb867caa0aac5c36398c8862e28e0.jpeg\" data-download-href=\"/uploads/short-url/ewQs42cvSmSLeXoZfxezCYo5nYA.jpeg?dl=1\" title=\"anthias-optimism\" rel=\"noopener nofollow ugc\"><img src=\"https://global.discourse-cdn.com/business7/uploads/bc41dd/optimized/2X/6/65d4f16497cdb867caa0aac5c36398c8862e28e0_2_500x292.jpeg\" alt=\"anthias-optimism\" data-base62-sha1=\"ewQs42cvSmSLeXoZfxezCYo5nYA\" width=\"500\" height=\"292\" srcset=\"https://global.discourse-cdn.com/business7/uploads/bc41dd/optimized/2X/6/65d4f16497cdb867caa0aac5c36398c8862e28e0_2_500x292.jpeg, https://global.discourse-cdn.com/business7/uploads/bc41dd/optimized/2X/6/65d4f16497cdb867caa0aac5c36398c8862e28e0_2_750x438.jpeg 1.5x, https://global.discourse-cdn.com/business7/uploads/bc41dd/optimized/2X/6/65d4f16497cdb867caa0aac5c36398c8862e28e0_2_1000x584.jpeg 2x\" data-dominant-color=\"0B3C3C\"></a></div><p></p>\n<h2><a name=\"overview-1\" class=\"anchor\" href=\"https://gov.optimism.io#overview-1\"></a>Overview</h2>\n<p>Delegate Name: <a class=\"mention\" href=\"https://gov.optimism.io/u/anthiaslabs\">@AnthiasLabs</a><br>\nDelegate Address: <strong>anthiaslabs.eth (0x7575f04a46b6d76142723e765f7546c354773406)</strong><br>\nWebsite: <a href=\"https://www.anthias.xyz/\" rel=\"noopener nofollow ugc\">anthias.xyz</a><br>\nTwitter: <a href=\"https://twitter.com/anthiasxyz\" rel=\"noopener nofollow ugc\">@anthiasxyz</a><br>\nEmail: team@anthias.xyz</p>\n<h2><a name=\"about-anthias-labs-2\" class=\"anchor\" href=\"https://gov.optimism.io#about-anthias-labs-2\"></a>About Anthias Labs</h2>\n<p>Anthias Labs is a boutique blockchain r&amp;d firm centered on public goods tooling and actionable research, with a specific focus on risk management and parameter design. Our team has taken an active role in multiple DAOs and is excited to be supporting Optimism further!</p>\n<h2><a name=\"principles-anthias-will-vote-by-3\" class=\"anchor\" href=\"https://gov.optimism.io#principles-anthias-will-vote-by-3\"></a>Principles Anthias Will Vote By</h2>\n<ol>\n<li><strong>Decentralization</strong>. Decentralization is a core tenet in how we determine votes.</li>\n<li><strong>Risk</strong>. Risk must be accounted for in all proposals. The primary risk we will seek to mitigate with our vote is direct economic risk to Optimism community members and OP holders. The second risk we will seek to mitigate with our vote is risk of centralization, which could lead to the primary risk above.</li>\n<li><strong>Structure and Process</strong>. We will support proposals that follow the structures and processes outlined by the Optimism governance community. We will assist the community in assuring proposals accurately outline their objectives and risks as well as follow a structure that all Optimism governance participants can easily follow to assist with Tenet <span class=\"hashtag-raw\">#1</span> of Decentralization.</li>\n</ol>\n<h2><a name=\"delegate-contact-4\" class=\"anchor\" href=\"https://gov.optimism.io#delegate-contact-4\"></a>Delegate / Contact</h2>\n<ul>\n<li>If you would like to delegate your OP to us, please delegate to our address here: <strong>anthiaslabs.eth (0x7575f04a46b6d76142723e765f7546c354773406)</strong></li>\n<li>If you would like to chat with the Anthias Labs team, feel free to reach out to our primary representative Charlie via Telegram <span class=\"mention\">@OxBroze</span> or via email at team@anthias.xyz.</li>\n</ul>\n            <p><small>2 posts - 1 participant</small></p>\n            <p><a href=\"https://gov.optimism.io/t/anthias-labs-delegate-communication-thread/8198\">Read full topic</a></p>","link":"https://gov.optimism.io/t/anthias-labs-delegate-communication-thread/8198","pubDate":"Fri, 24 May 2024 20:02:34 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"gov.optimism.io-topic-8198"},"source":{"@url":"https://gov.optimism.io/t/anthias-labs-delegate-communication-thread/8198.rss","#text":"Anthias Labs - Delegate Communication Thread"}},{"title":"Voting Cycle Roundup #23a","dc:creator":"system","category":"Updates  and Announcements 📢","description":"<p>Special Voting Cycle <span class=\"hashtag-raw\">#23a</span> begins on Thursday (May 23th) at 19:00 GMT and runs until Wednesday (May 29th) at 19:00 GMT. Additionally, the Citizens’ House will have a one-week period to veto any Upgrades approved by the Token House, immediately following the conclusion of the Token House Voting Period.</p>\n<p>A snapshot of delegate voting weights will be taken at the time votes go live. Voting will take place at <a href=\"https://vote.optimism.io/\">https://vote.optimism.io/</a> starting on May 23th at 19:00 GMT. The Citizens’ House veto vote will take place via Snapshot from May 30th to June 5th.</p>\n<p>The following proposals have received the required delegate approvals and will move to a vote in Special Voting Cycle <span class=\"hashtag-raw\">#23a:</span></p>\n<ul>\n<li><a href=\"https://gov.optimism.io/t/upgrade-proposal-fault-proofs/8161\">Protocol Upgrade #7: Fault Proofs</a></li>\n<li><a href=\"https://gov.optimism.io/t/upgrade-proposal-guardian-security-council-threshold-and-l2-proxyadmin-ownership-changes-for-stage-1-decentralization/8157\">Protocol Upgrade #8: Changes for Stage 1 Decentralization</a></li>\n<li><a href=\"https://gov.optimism.io/t/governor-update-proposal-2-improvements-to-advanced-delegation-allowance-calculations/8164\">Governor Update Proposal #2: Improvements to advanced delegation allowance calculations </a></li>\n<li><a href=\"https://gov.optimism.io/t/season-6-grants-council-operating-budget/8082\">Season 6: Grants Council Operating Budget </a>\n<ul>\n<li><a href=\"https://gov.optimism.io/t/season-6-grants-council-operating-budget/8171\">Grants Council Operating Budget proposed by Gonna.eth</a></li>\n</ul>\n</li>\n<li><a href=\"https://gov.optimism.io/t/season-6-code-of-conduct-council-renewal/8100\">Season 6: Code of Conduct Council Renewal </a>\n<ul>\n<li><a href=\"https://gov.optimism.io/t/draft-code-of-conduct-council-cocc-operating-budget-for-season-6/8167/1\">Code of Conduct Council Operating Budget proposed by Juan Carlos Bell (juankbell)</a></li>\n</ul>\n</li>\n<li><a href=\"https://gov.optimism.io/t/season-6-developer-advisory-board-renewal/8099\">Season 6: Developer Advisory Board Renewal </a>\n<ul>\n<li><a href=\"https://gov.optimism.io/t/zach-obront-developer-advisory-board-operating-budget/8141\">Developer Advisory Board Operating Budget proposed by Zach Obront</a></li>\n<li><a href=\"https://gov.optimism.io/t/ed-mazurek-developer-advisory-board-operating-budget/8175\">Developer Advisory Board Operating Budget proposed by Ed Mazurek (wildmolasses)</a></li>\n</ul>\n</li>\n<li><a href=\"https://gov.optimism.io/t/season-6-intents-ratification/8104\">Season 6: Intents Ratification and Budget Approval</a></li>\n</ul>\n            <p><small>1 post - 1 participant</small></p>\n            <p><a href=\"https://gov.optimism.io/t/voting-cycle-roundup-23a/8189\">Read full topic</a></p>","link":"https://gov.optimism.io/t/voting-cycle-roundup-23a/8189","pubDate":"Thu, 23 May 2024 11:40:33 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"gov.optimism.io-topic-8189"},"source":{"@url":"https://gov.optimism.io/t/voting-cycle-roundup-23a/8189.rss","#text":"Voting Cycle Roundup #23a"}},{"title":"Optimism post RPGF analysis","dc:creator":"Thanatos","category":"Retro  Funding 🔴","description":"<p><strong>OVERVIEW</strong></p>\n<p>I’m a founding member at <a href=\"https://www.pyor.xyz/\" rel=\"noopener nofollow ugc\">PYOR</a> and since Optimism’s recent round of on-chain Retroactive Public Goods Funding (RPGF) applications ended the first week of May, we analyzed the performance of previous RPGF receivers in the DeFi space, focusing on core fundamental on-chain metrics.</p>\n<p>This analysis is an Exploratory Data Analysis (EDA) of the performance of these receivers. Our end objective with this analysis is – to empower the Optimism Governance to focus on recipients that bring in a net positive outcome to the Optimism Superchain.</p>\n<p>As these are RPGF, these protocols weren’t expected to meet any criteria post-grant.</p>\n<p>From the <a href=\"https://github.com/opensource-observer/insights\" rel=\"noopener nofollow ugc\">datasets</a> by Opensource Observer, we filtered 11 protocols, with DeFi presence, that received the January RPGF drop:</p>\n<ol>\n<li>\n<p>Aerodrome</p>\n</li>\n<li>\n<p>Hop Protocol</p>\n</li>\n<li>\n<p>Kromatika</p>\n</li>\n<li>\n<p>Kwenta</p>\n</li>\n<li>\n<p>Lyra Finance</p>\n</li>\n<li>\n<p>Sonne Finance</p>\n</li>\n<li>\n<p>Sushi</p>\n</li>\n<li>\n<p>Synapse</p>\n</li>\n<li>\n<p>Synthetix</p>\n</li>\n<li>\n<p>Velodrome</p>\n</li>\n<li>\n<p>Yearn</p>\n</li>\n</ol>\n<p><strong>METHODOLOGY</strong></p>\n<p>For on-chain metrics, we defined the following:</p>\n<p>• TVL - Total Value locked in USD terms in the smart contracts controlled by the protocol</p>\n<p>• Fees - Fees generated via payment from users for the services provided</p>\n<p>• Volumes - DEX or Bridge volume of the respective protocol, if any.</p>\n<p>• User Activity - New and Active wallets interacting with the contracts of a protocol.</p>\n<p>For the metrics that are not continuous, i.e. fees, volumes, and user activity, a smoothing operation is performed with a 5-day moving average. This is performed to remove volatility spikes and show trends better.</p>\n<p>For the metrics above:</p>\n<ol>\n<li>Before and After RPGF: A self-reflection analysis of each protocol was performed by comparing the data points before and after January 1st, 2024 (the start of RPGF distribution). This is done to see if there is potential growth in the protocol. This is quantified and made comparable by converting raw values into percentages, to the value on the date of RPGF distribution</li>\n<li>Category-wise: Protocols are bucketed into their respective sectors, compared to see how a protocol performed with its peers</li>\n<li>Normalization of Values: The growth data points are further normalized by the RPGF value distributed to find the protocols with the best bang for the buck</li>\n<li>Benchmark for DEXs: For DEXes, Uniswap is chosen as a control and compared to with, to see if the growth can be correlated to RPGF</li>\n</ol>\n<p>Benchmark for protocols: The TVL of all protocols is compared to the TVL of Optimism and Base, to gauge the performance of the protocols.</p>\n<p><strong>INSIGHTS</strong></p>\n<p>[1] The biggest growth was seen in Aerodrome across – TVL, fees, and DEX volume:</p>\n<ul>\n<li>TVL: Grew by 3x</li>\n<li>Fees: Grew by 30x</li>\n<li>DEX Volume: Grew by 13x (for comparison, Uniswap’s volume grew by 5x in the time)</li>\n</ul>\n<p></p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://global.discourse-cdn.com/business7/uploads/bc41dd/original/2X/3/3a986e46dd683e569f6f4e9dc54a645131889187.png\" data-download-href=\"/uploads/short-url/8mmh1XbKWA4lG6JfOrq407iNaM7.png?dl=1\" title=\"\" rel=\"noopener nofollow ugc\"><img src=\"https://global.discourse-cdn.com/business7/uploads/bc41dd/optimized/2X/3/3a986e46dd683e569f6f4e9dc54a645131889187_2_602x339.png\" alt=\"\" data-base62-sha1=\"8mmh1XbKWA4lG6JfOrq407iNaM7\" width=\"602\" height=\"339\" role=\"presentation\" srcset=\"https://global.discourse-cdn.com/business7/uploads/bc41dd/optimized/2X/3/3a986e46dd683e569f6f4e9dc54a645131889187_2_602x339.png, https://global.discourse-cdn.com/business7/uploads/bc41dd/optimized/2X/3/3a986e46dd683e569f6f4e9dc54a645131889187_2_903x508.png 1.5x, https://global.discourse-cdn.com/business7/uploads/bc41dd/optimized/2X/3/3a986e46dd683e569f6f4e9dc54a645131889187_2_1204x678.png 2x\" data-dominant-color=\"0C0D09\"></a></div><p></p>\n<p>[2] SushiSwap saw an initial dip in all metrics, before a late revival. Its 7x fee growth is second only to Aerodrome, while TVL only doubled.</p>\n<p></p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://global.discourse-cdn.com/business7/uploads/bc41dd/original/2X/9/9391c3854707364d1289a843f9b0e37417c76d00.png\" data-download-href=\"/uploads/short-url/l3su6tpgMPfX4sjFly82Q9JA0yQ.png?dl=1\" title=\"\" rel=\"noopener nofollow ugc\"><img src=\"https://global.discourse-cdn.com/business7/uploads/bc41dd/optimized/2X/9/9391c3854707364d1289a843f9b0e37417c76d00_2_602x339.png\" alt=\"\" data-base62-sha1=\"l3su6tpgMPfX4sjFly82Q9JA0yQ\" width=\"602\" height=\"339\" role=\"presentation\" srcset=\"https://global.discourse-cdn.com/business7/uploads/bc41dd/optimized/2X/9/9391c3854707364d1289a843f9b0e37417c76d00_2_602x339.png, https://global.discourse-cdn.com/business7/uploads/bc41dd/optimized/2X/9/9391c3854707364d1289a843f9b0e37417c76d00_2_903x508.png 1.5x, https://global.discourse-cdn.com/business7/uploads/bc41dd/optimized/2X/9/9391c3854707364d1289a843f9b0e37417c76d00_2_1204x678.png 2x\" data-dominant-color=\"0B0C08\"></a></div><p></p>\n<p>[3] Yield protocols like – YearnFinance and Sonne Finance fared poorly during the incentive period.</p>\n<ul>\n<li>Yearn’s TVL fell by 5.6%</li>\n<li>Sonne’s TVL fell by 13.5%</li>\n</ul>\n<p></p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://global.discourse-cdn.com/business7/uploads/bc41dd/original/2X/9/9a32cb1d00ec939bb75f3490170ac465ecffc5f3.png\" data-download-href=\"/uploads/short-url/m06lZY9Yzk9020pPAdN4EgkBg6D.png?dl=1\" title=\"\" rel=\"noopener nofollow ugc\"><img src=\"https://global.discourse-cdn.com/business7/uploads/bc41dd/optimized/2X/9/9a32cb1d00ec939bb75f3490170ac465ecffc5f3_2_602x339.png\" alt=\"\" data-base62-sha1=\"m06lZY9Yzk9020pPAdN4EgkBg6D\" width=\"602\" height=\"339\" role=\"presentation\" srcset=\"https://global.discourse-cdn.com/business7/uploads/bc41dd/optimized/2X/9/9a32cb1d00ec939bb75f3490170ac465ecffc5f3_2_602x339.png, https://global.discourse-cdn.com/business7/uploads/bc41dd/optimized/2X/9/9a32cb1d00ec939bb75f3490170ac465ecffc5f3_2_903x508.png 1.5x, https://global.discourse-cdn.com/business7/uploads/bc41dd/optimized/2X/9/9a32cb1d00ec939bb75f3490170ac465ecffc5f3_2_1204x678.png 2x\" data-dominant-color=\"090905\"></a></div><p></p>\n<p>[4] Bridges fared well after February 2024</p>\n<ul>\n<li>Hop’s deposit grew by over 10x</li>\n<li>Synapse generated over 500% more fees</li>\n<li>Both bridges analyzed had flattish TVL growth during the period (due to rising withdrawals)</li>\n</ul>\n<p></p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://global.discourse-cdn.com/business7/uploads/bc41dd/original/2X/c/c10d5e659c789b91598e1ab7cbb8e26278a0e642.png\" data-download-href=\"/uploads/short-url/rxONeQG80ilWznx72OT0QPQR7sC.png?dl=1\" title=\"\" rel=\"noopener nofollow ugc\"><img src=\"https://global.discourse-cdn.com/business7/uploads/bc41dd/optimized/2X/c/c10d5e659c789b91598e1ab7cbb8e26278a0e642_2_602x339.png\" alt=\"\" data-base62-sha1=\"rxONeQG80ilWznx72OT0QPQR7sC\" width=\"602\" height=\"339\" role=\"presentation\" srcset=\"https://global.discourse-cdn.com/business7/uploads/bc41dd/optimized/2X/c/c10d5e659c789b91598e1ab7cbb8e26278a0e642_2_602x339.png, https://global.discourse-cdn.com/business7/uploads/bc41dd/optimized/2X/c/c10d5e659c789b91598e1ab7cbb8e26278a0e642_2_903x508.png 1.5x, https://global.discourse-cdn.com/business7/uploads/bc41dd/optimized/2X/c/c10d5e659c789b91598e1ab7cbb8e26278a0e642_2_1204x678.png 2x\" data-dominant-color=\"090A06\"></a></div><p></p>\n<p><strong>CONCLUSION</strong></p>\n<p>The protocols that are well established – either in terms of popularity or in terms of the number of grants received – saw net neutral growth before and after RFGF allocation. However, the newer protocols, especially on OP Superchains like Base saw positive growth in fundamental metrics.</p>\n<p>We would love to hear feedback from the community and the foundation to help us execute a data-driven approach to make the on-chain RPGF program more robust.</p>\n<p>We will also be posting snippets from our research in the forum, like <a href=\"https://gov.optimism.io/t/tvl-growth-of-rpgf-grant-recipients/8185\">this</a>.</p>\n<p><strong>ABOUT PYOR</strong></p>\n<p>PYOR is a blockchain analytics firm, specializing in measuring the business performance of protocols. We’re backed by Castle Island Ventures, Coinbase Ventures, Hash3, Balaji Srinivasan, and many more. We work with large institutional investors and protocols like Ribbit Capital, M31 Capital, Tezos, Compound, ICP, Swell, QuickSwap, etc. Our team has extensive experience building in the crypto space and were CXOs at Coinswitch, India’s largest crypto exchange backed by a16z.</p>\n            <p><small>1 post - 1 participant</small></p>\n            <p><a href=\"https://gov.optimism.io/t/optimism-post-rpgf-analysis/8186\">Read full topic</a></p>","link":"https://gov.optimism.io/t/optimism-post-rpgf-analysis/8186","pubDate":"Thu, 23 May 2024 09:24:29 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"gov.optimism.io-topic-8186"},"source":{"@url":"https://gov.optimism.io/t/optimism-post-rpgf-analysis/8186.rss","#text":"Optimism post RPGF analysis"}},{"title":"TVL Growth of RPGF Grant Recipients","dc:creator":"Aadarsh_PYOR","category":"✨ General","description":"<p>RPGF Grants are fueling TVL Growth of the recipients.</p>\n<p>We looked at over 10 protocols’ core metrics after they retroactively received funding as part of the Optimism Collective’s public goods funding.</p>\n<p><strong>PYOR</strong> is a blockchain analytics firm and we work with protocols by giving high-fidelity insights. We have our own data product which we use to perform analysis and deliver insights to institutions like Ribbit Capital, M31 Capital and Compound.</p>\n<p>Of the protocols that received the funding, Aerodome is leading the pack with a staggering 3x growth in TVL since January 2024! But Aerodome isn’t the only one! Other RPGF recipients have also experienced significant TVL growth, whereas some have seen moderate TVL change.</p>\n<p>• Standout Performers:<br>\nAerodromefi: 333% <img src=\"https://emoji.discourse-cdn.com/twitter/small_red_triangle.png?v=12\" title=\":small_red_triangle:\" class=\"emoji\" alt=\":small_red_triangle:\" loading=\"lazy\" width=\"20\" height=\"20\">in TVL<br>\nSushiSwap: 217% <img src=\"https://emoji.discourse-cdn.com/twitter/small_red_triangle.png?v=12\" title=\":small_red_triangle:\" class=\"emoji\" alt=\":small_red_triangle:\" loading=\"lazy\" width=\"20\" height=\"20\"> in TVL</p>\n<p><strong>PYOR | Power Your Own Research</strong><br>\nTwitter: <span class=\"mention\">@pyorxyz</span></p>\n<p></p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://global.discourse-cdn.com/business7/uploads/bc41dd/original/2X/7/72f7c8e84d30612df8500042423dbff662850674.jpeg\" data-download-href=\"/uploads/short-url/gp3j6m7UjJwZL1blBjZVoehFx5O.jpeg?dl=1\" title=\"StandoutPerformers_Optimism RPGF\" rel=\"noopener nofollow ugc\"><img src=\"https://global.discourse-cdn.com/business7/uploads/bc41dd/optimized/2X/7/72f7c8e84d30612df8500042423dbff662850674_2_690x388.jpeg\" alt=\"StandoutPerformers_Optimism RPGF\" data-base62-sha1=\"gp3j6m7UjJwZL1blBjZVoehFx5O\" width=\"690\" height=\"388\" srcset=\"https://global.discourse-cdn.com/business7/uploads/bc41dd/optimized/2X/7/72f7c8e84d30612df8500042423dbff662850674_2_690x388.jpeg, https://global.discourse-cdn.com/business7/uploads/bc41dd/optimized/2X/7/72f7c8e84d30612df8500042423dbff662850674_2_1035x582.jpeg 1.5x, https://global.discourse-cdn.com/business7/uploads/bc41dd/original/2X/7/72f7c8e84d30612df8500042423dbff662850674.jpeg 2x\" data-dominant-color=\"090908\"></a></div><p></p>\n            <p><small>4 posts - 3 participants</small></p>\n            <p><a href=\"https://gov.optimism.io/t/tvl-growth-of-rpgf-grant-recipients/8185\">Read full topic</a></p>","link":"https://gov.optimism.io/t/tvl-growth-of-rpgf-grant-recipients/8185","pubDate":"Wed, 22 May 2024 09:22:02 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"gov.optimism.io-topic-8185"},"source":{"@url":"https://gov.optimism.io/t/tvl-growth-of-rpgf-grant-recipients/8185.rss","#text":"TVL Growth of RPGF Grant Recipients"}},{"title":"Daily Active Users on-chain","dc:creator":"Aadarsh_PYOR","category":"✨ General","description":"<p>We studied Optimism’s user base and it is on fire🔥</p>\n<p><strong>PYOR</strong> is a blockchain analytics firm and we work with protocols by giving high-fidelity insights. We have our own data product which we use to perform analysis and deliver insights to institutions like Ribbit Capital, M31 Capital and Compound.</p>\n<p>The <strong>daily active users</strong> have increased by a staggering 140.5% since the year started!</p>\n<p>Optimism’s User Growth:<br>\n<img src=\"https://emoji.discourse-cdn.com/twitter/date.png?v=12\" title=\":date:\" class=\"emoji\" alt=\":date:\" loading=\"lazy\" width=\"20\" height=\"20\">January 2024: 12%<br>\n<img src=\"https://emoji.discourse-cdn.com/twitter/date.png?v=12\" title=\":date:\" class=\"emoji\" alt=\":date:\" loading=\"lazy\" width=\"20\" height=\"20\">February 2024: -20%<br>\n<img src=\"https://emoji.discourse-cdn.com/twitter/date.png?v=12\" title=\":date:\" class=\"emoji\" alt=\":date:\" loading=\"lazy\" width=\"20\" height=\"20\">March 2024: 60%<br>\n<img src=\"https://emoji.discourse-cdn.com/twitter/date.png?v=12\" title=\":date:\" class=\"emoji\" alt=\":date:\" loading=\"lazy\" width=\"20\" height=\"20\">April 2024: 48%</p>\n<p>For <em>more insights</em> on it you can find it <a href=\"https://x.com/pyorxyz/status/1792587913764413621\" rel=\"noopener nofollow ugc\">here</a></p>\n<p></p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://global.discourse-cdn.com/business7/uploads/bc41dd/original/2X/e/ec667f6678faf786c51c2ece4d75bacf8e9f4388.jpeg\" data-download-href=\"/uploads/short-url/xJihyMZGIV7RFtA6KIhBmNi7NNu.jpeg?dl=1\" title=\"Optimism_users_May\" rel=\"noopener nofollow ugc\"><img src=\"https://global.discourse-cdn.com/business7/uploads/bc41dd/optimized/2X/e/ec667f6678faf786c51c2ece4d75bacf8e9f4388_2_690x387.jpeg\" alt=\"Optimism_users_May\" data-base62-sha1=\"xJihyMZGIV7RFtA6KIhBmNi7NNu\" width=\"690\" height=\"387\" srcset=\"https://global.discourse-cdn.com/business7/uploads/bc41dd/optimized/2X/e/ec667f6678faf786c51c2ece4d75bacf8e9f4388_2_690x387.jpeg, https://global.discourse-cdn.com/business7/uploads/bc41dd/original/2X/e/ec667f6678faf786c51c2ece4d75bacf8e9f4388.jpeg 1.5x, https://global.discourse-cdn.com/business7/uploads/bc41dd/original/2X/e/ec667f6678faf786c51c2ece4d75bacf8e9f4388.jpeg 2x\" data-dominant-color=\"0D0A0A\"></a></div><p></p>\n            <p><small>3 posts - 2 participants</small></p>\n            <p><a href=\"https://gov.optimism.io/t/daily-active-users-on-chain/8179\">Read full topic</a></p>","link":"https://gov.optimism.io/t/daily-active-users-on-chain/8179","pubDate":"Wed, 22 May 2024 08:31:01 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"gov.optimism.io-topic-8179"},"source":{"@url":"https://gov.optimism.io/t/daily-active-users-on-chain/8179.rss","#text":"Daily Active Users on-chain"}},{"title":"Ed Mazurek - Developer Advisory Board Operating Budget","dc:creator":"wildmolasses","category":"Elected  Representatives 💼","description":"<h2><a name=\"developer-advisory-board-operating-budget-1\" class=\"anchor\" href=\"https://gov.optimism.io#developer-advisory-board-operating-budget-1\"></a>Developer Advisory Board Operating Budget</h2>\n<p>Proposed Board Lead: Ed Mazurek (wildmolasses)</p>\n<p>Proposed Board Operating Budget: 122,000 OP (+52,000 OP from last Season)</p>\n<p>Contact Info: <a href=\"mailto:changes@gmail.com\">changes@gmail.com</a></p>\n<h3><a name=\"goals-of-this-proposal-2\" class=\"anchor\" href=\"https://gov.optimism.io#goals-of-this-proposal-2\"></a>Goals of this proposal:</h3>\n<p>The goal of this proposal is not to compete directly with <a href=\"https://gov.optimism.io/t/zach-obront-developer-advisory-board-operating-budget/8141\">Zach Obront’s proposal</a>, which is fantastic. (Zach was on the S5 board and is otherwise very qualified. Furthermore, Zach was kindly helpful to my proposal, sharing his thoughts on the DAB on a call. Due to his kindness and qualification I happily support his proposal, and am keen to hear whether any of these ideas could fit within his Board.) Rather, it seeks to achieve 2 things:</p>\n<ul>\n<li>to consider the role of transparency in the DAB\n<ul>\n<li>In season 6, Optimism as a whole is moving to provide more transparency into shifting governance to the community. The DAB could also increase transparency to serve the community as well as future iterations of the DAB. Consistent with Season 6’s Intent <span class=\"hashtag-raw\">#1</span>, this proposal seeks to move the needle on governance decentralization by making it clearer <em>what</em> the DAB is doing <em>when</em>. Let’s borrow the spirit of the iterative approach suggested in <a href=\"https://gov.optimism.io/t/the-path-to-open-metagovernance/7728\">the path to open metagovernance</a>:\n<ul>\n<li>Hypothesis: Despite increased transparency and expanded responsibilities, the DAB can be more effective in S6 than in S5.</li>\n</ul>\n</li>\n</ul>\n</li>\n<li>to foster a healthy dialogue around the DAB\n<ul>\n<li>I was encouraged to submit a proposal because having only 1 leads to a vote-in by default, without any dialogue. By suggesting some ideas here, I have the potential to influence the DAB that emerges regardless of voting outcome. I apologize for any not-quite-mature ideas here that would be revised or improved via firsthand experience on the DAB. But, here are my thoughts given the information available!</li>\n</ul>\n</li>\n</ul>\n<h3><a name=\"previous-work-or-qualifications-to-be-board-lead-3\" class=\"anchor\" href=\"https://gov.optimism.io#previous-work-or-qualifications-to-be-board-lead-3\"></a>Previous work or qualifications to be Board Lead:</h3>\n<ul>\n<li>Community experience: I’m a proud Optimism badgeholder since RetroPGF 3. In RPGF3, in addition to my normal badgeholder responsibilities, I volunteered as a reviewer, triaging over 100 RetroPGF applications suspected of rule violations. I’ve been broadly wanting to get more involved in protocol governance, and believe my values combined with my technical expertise make me a unique asset. After reflecting on the values of Optimism, feeling aligned with the forking capitalism vision (let’s reward people who create value rather than extract it), and getting great vibes from people like LauNaMu, katie, and Griff (among many others) at the Citizens meetup this past ETHDenver, I’d like to devote more time to Optimism.</li>\n<li>Work experience:\n<ul>\n<li>Working at ScopeLift, a smart contract dev consultancy firm focusing largely on governance-related projects. Some of our recent work:\n<ul>\n<li>Flexible Voting, an extension of OpenZeppelin Governor: <a href=\"https://github.com/ScopeLift/flexible-voting\" class=\"inline-onebox\" rel=\"noopener nofollow ugc\">GitHub - ScopeLift/flexible-voting: 💪🗳️ Flexible Voting – A Powerful Building Block for DAO Governance</a></li>\n<li>Umbra: privacy preserving stealth payments on mainnet, Optimism, etc: <a href=\"https://github.com/ScopeLift/umbra-protocol\" class=\"inline-onebox\" rel=\"noopener nofollow ugc\">GitHub - ScopeLift/umbra-protocol: 🌕🌑 Privacy Preserving Shielded Payments On The Ethereum Blockchain</a></li>\n<li>UniStaker: allows Uniswap Governance to enable and manage fees on pools, permissionlessly distributing fees to UNI stakers: <a href=\"https://github.com/uniswapfoundation/UniStaker\" class=\"inline-onebox\" rel=\"noopener nofollow ugc\">GitHub - uniswapfoundation/UniStaker: Staking infrastructure for fee collection and reward distribution for the Uniswap protocol.</a></li>\n<li>MultiGov: a flexible multichain solution for DAO governance: <a href=\"https://tally.mirror.xyz/peHXv-1Bv4RY6Hf3UeCSH74aCu2e2ttSMytxJwB7DpY\" class=\"inline-onebox\" rel=\"noopener nofollow ugc\">Wormhole, Tally, and ScopeLift Announce ‘MultiGov,’ the First-Ev… — tally.xyz</a></li>\n<li>L2 Optimizoooors: An awesome hackathon project that minimized calldata on popular L2 contracts to make transactions cheaper: <a href=\"https://github.com/ScopeLift/l2-optimizoooors\" class=\"inline-onebox\" rel=\"noopener nofollow ugc\">GitHub - ScopeLift/l2-optimizoooors: Gas efficient routers for L2 applications</a></li>\n<li>Additionally, we did some early client work for Optimism:\n<ul>\n<li>Refactored OG gnosis multisigs for the OVM: <a href=\"https://github.com/ScopeLift/ovm-og-multisigwallet\" class=\"inline-onebox\" rel=\"noopener nofollow ugc\">GitHub - ScopeLift/ovm-og-multisigwallet: 💼 The OG Gnosis Multisig, updated to work on Optimistic Ethereum</a></li>\n<li>Refactored Uniswap for OVM: <a href=\"https://github.com/ScopeLift/uniswap-v3-core-ovm\" class=\"inline-onebox\" rel=\"noopener nofollow ugc\">GitHub - ScopeLift/uniswap-v3-core-ovm: 🦄 🦄 🦄 Core smart contracts of Uniswap v3</a></li>\n<li>We love Optimism so much we sent our favorite VIP coworker Matt Solomon to work there <img src=\"https://emoji.discourse-cdn.com/twitter/slight_smile.png?v=12\" title=\":slight_smile:\" class=\"emoji\" alt=\":slight_smile:\" loading=\"lazy\" width=\"20\" height=\"20\"></li>\n</ul>\n</li>\n</ul>\n</li>\n<li>Before I worked at ScopeLift, I worked with Thomas Jay Rush on TrueBlocks. I honed a data analysis skill that could be helpful to S6’s DAB, but more importantly, the mentorship from this exceptional guy strengthened my values around OSS, public goods, and giving to the community.</li>\n</ul>\n</li>\n<li>Other experience:\n<ul>\n<li>Organized a whitepaper reading group in Philadelphia</li>\n<li>Organized some meetings for the short-lived RadicalXChange: Philadelphia chapter</li>\n<li>Supported Ben Jones’s “roll roll roll… up” cover of Mackelmore’s Thrift Shop via spirited accompaniment on sax</li>\n</ul>\n</li>\n</ul>\n<h3><a name=\"board-charter-4\" class=\"anchor\" href=\"https://gov.optimism.io#board-charter-4\"></a>Board Charter:</h3>\n<ul>\n<li>Season 5 responsibilities that will persist (from <a href=\"https://gov.optimism.io/t/developer-advisory-board/6892\" class=\"inline-onebox\">Developer Advisory Board</a>)\n<ul>\n<li>Assess the completion of technical milestones that the Developer Advisory Board has advised the Council on. (In S5 this was mostly limited to Intent <span class=\"hashtag-raw\">#1</span>, but this will now relate to all 3 intents).</li>\n</ul>\n</li>\n<li>New responsibilities for Season 6 (predetermined from <a href=\"https://gov.optimism.io/t/season-6-developer-advisory-board-renewal/8099\" class=\"inline-onebox\">Season 6: Developer Advisory Board Renewal</a>):\n<ul>\n<li>The DAB will be expected to provide plain english explanation of Protocol Upgrades within 72 hours of a proposal draft being posted</li>\n<li>Approval by the DAB will be required as 1/4 delegate approvals required for a Protocol Upgrade to move to a vote</li>\n<li>The DAB, alongside Core Developers, will be able to create ideas on the Ideas List</li>\n<li>The DAB will advise the Grants Council on any technical grants and/or milestones, regardless of which Intent they fall under. Advisory should be provided to the Grants Council within 72 hours of a request.</li>\n<li>If DAB reviewers (at least 3) unanimously vote “no” on an application or milestone, it will prevent approval by the Grants Council</li>\n<li>It is recommended that the OP Labs representative vote on any application corresponding to the core protocol and/or associated roadmap</li>\n<li>All members will be accountable to governance as they remain removable via the Representative Removal proposal type outlined in the Operating Manual</li>\n</ul>\n</li>\n<li><strong>Additional responsibilities unique to this proposal:</strong>\n<ul>\n<li>Call for feedback from stakeholders: DAB should post a public thread on <a href=\"http://gov.optimism.io\">gov.optimism.io</a> that will serve as a call for feedback from stakeholders. Stakeholders should be formally reminded once a month to provide ideas on what’s working and what could be done 1% better. This will be useful for this season’s DAB as well as future iterations of the DAB.</li>\n<li>DAB should maintain a doc (linked in above forum thread) that captures what its members are doing each month. This includes an index of the protocol upgrade summaries, links to DAB feedback in Charmverse, etc. – our activity public whenever possible!</li>\n<li>DAB should be a key presence during Grants Council coordination, and should work with the Grants Council lead (and four review teams) to determine what meaningful presence looks like. This could mean, for example, at least one DAB member is expected to join for the first 15 minutes of every Council meeting, or that there’s a special Council or review team meeting every other month where the whole DAB board should attend. Notes from Grants Council/DAB synergy must be public, posted in the doc mentioned above.</li>\n<li>Grow the future DAB by inviting engineers in our network to join DAB coordination calls. These engineers can be either seasoned engineers who we’d invite for their unique knowledge related to some delegate request we’re considering, or junior engineers (perhaps DAB candidates in S7 or S8) who are present in order to learn firsthand what the DAB does. This will increase DAB transparency as well as grow the candidate pool for the DAB.</li>\n<li>Board lead should maintain regular update blurbs / articles on the experiment that is this season’s DAB; should be posted to forum (see Lead responsibilities)</li>\n<li>The DAB should move as much of their comms as possible to a public place (like the <span class=\"hashtag-raw\">#developer-advisory-board</span> discord channel, for example) and lean on a private channel only in the case where the sensitivity warrants it.</li>\n</ul>\n</li>\n</ul>\n<h3><a name=\"breakdown-of-board-operating-budget-5\" class=\"anchor\" href=\"https://gov.optimism.io#breakdown-of-board-operating-budget-5\"></a>Breakdown of Board Operating Budget:</h3>\n<p><em>Total Budget: 122,000 OP (+52,000 OP from last Season)</em></p>\n<ul>\n<li>Lead = 25,000 OP (+5,000 OP from last Season)\n<ul>\n<li>Responsibilities carried forward from last season\n<ul>\n<li>Publish internal operation procedures</li>\n<li>Facilitate board member review</li>\n<li>host board meetings that will occur every 2 weeks (last season specified at least once every 6 weeks, but with the increase in responsibilities, I’d like to increase this)</li>\n<li>Ensure milestones on technical missions have been met before dispersing funds</li>\n<li>Final decision maker in the event of board disagreement</li>\n</ul>\n</li>\n<li>Responsibilities not carried forward:\n<ul>\n<li>The Lead will not be solely responsible for the DAB retrospective. Instead, each DAB member (including the lead) will be asked to contribute their own thoughts inside one S6 DAB retrospective thread.</li>\n</ul>\n</li>\n<li>New responsibilities from last season:\n<ul>\n<li>Maintain public updates on forum of the experiment that is this season’s DAB to remind the Grants Council we’re here, and assist with the “learnings and iteration” of future DAB seasons.</li>\n</ul>\n</li>\n<li>The lead shares in the responsibilities of “Board Member” listed in the section below. Because of the increase in responsibilities, I seek to increase the lead’s budget by 5000 OP.</li>\n</ul>\n</li>\n<li>Ops Lead: = 25,000 OP x 1\n<ul>\n<li>New in S6, the ops lead is a board member with additional responsibilities:\n<ul>\n<li>Responsible for assigning an “owner” to each incoming Grants Council request. This owner does not have to answer the request themselves, but is responsible for calling in any other DAB member / stakeholder so that it gets answered on time.</li>\n<li>Interviews each DAB board member once a month, asking what’s going well and what can go 1% better. Feedback gets collated and is published in Board Lead’s public updates.</li>\n<li>Reminds Grants Council 1x a month that we’re looking for feedback in our feedback thread! (see Board Charter)</li>\n<li>Should be present at specially scheduled Grants Council&lt;&gt;DAB meetings, notetake, and publish the notes.</li>\n<li>Primary point of contact for Grants Council and review teams.</li>\n<li>Actively pulls invite list of special guest engineers from other board members for DAB calls, and coordinates scheduling (see Board Charter)</li>\n</ul>\n</li>\n<li>The ops lead shares in the responsibilities of “Board Member” listed in the section below.</li>\n</ul>\n</li>\n<li>Board Member (General): 18,000 OP x 3 = 54,000 OP (+5,500 OP from last season)\n<ul>\n<li>Update their activity on the “What is the DAB doing” doc on a regular basis.</li>\n<li>Each member expected to post their own post-mortem on the DAB during the reflection period. This increases the transparency of the DAB.</li>\n<li>Due to the increase in responsibilities, and consistent with the reward suggested in the <a href=\"https://gov.optimism.io/t/season-6-collective-reward-framework/8112\" class=\"inline-onebox\">Season 6: Collective Reward Framework</a>, I’d like to increase each board member’s budget by 5,500 OP this season.</li>\n</ul>\n</li>\n<li>Board Member (OP Labs): 0 OP x 1 = 0 OP\n<ul>\n<li>This OP Labs member will support both general board members and OP focused board members. Consistent with last season, it seems the payout here is 0. <img src=\"https://emoji.discourse-cdn.com/twitter/frowning.png?v=12\" title=\":frowning:\" class=\"emoji\" alt=\":frowning:\" loading=\"lazy\" width=\"20\" height=\"20\"></li>\n</ul>\n</li>\n<li>Board Member (OP focused): 18,000 OP x 1 = 18,000 OP\n<ul>\n<li>This board member will share the responsibilities of the general board members. Additionally, similar to Zach Obront’s proposal, this member will be responsible for doing most of the lifting on OP protocol upgrades, taking the time to understand and then explain internally to the DAB. Then, this member will drive the plain English upgrade summaries forward. Beyond that, this member will be responsible for attending token house calls to explain the upgrade when appropriate. To compensate for this additional lift, this member will share less of the grants council advising load, but is still expected to contribute.</li>\n<li>Due to the increase in responsibilities, and consistent with the reward suggested in the <a href=\"https://gov.optimism.io/t/season-6-collective-reward-framework/8112\" class=\"inline-onebox\">Season 6: Collective Reward Framework</a>, I’d like to increase each board member’s budget by 5,500 OP this season.</li>\n</ul>\n</li>\n</ul>\n<h3><a name=\"how-should-governance-participants-measure-the-boards-impact-and-ensure-its-executing-on-its-charter-6\" class=\"anchor\" href=\"https://gov.optimism.io#how-should-governance-participants-measure-the-boards-impact-and-ensure-its-executing-on-its-charter-6\"></a>How should governance participants measure the Board’s impact, and ensure its executing on its Charter?</h3>\n<h4><a name=\"user-experience-kpi-7\" class=\"anchor\" href=\"https://gov.optimism.io#user-experience-kpi-7\"></a>User Experience KPI:</h4>\n<p>Foundation suggested measures:</p>\n<ul>\n<li>NPS of Grants Council Reviewers (as the Grants Council is the primary user of the DAB’s advisory)</li>\n<li>Response time to Grants Council inquiries (as the Grants Council is the primary user of the DAB’s advisory)</li>\n<li>90% provision rate of plain english summaries of all protocol upgrades within 72 hours of proposal being posted</li>\n</ul>\n<p><strong>Additional measures unique to this proposal:</strong></p>\n<ul>\n<li>Community awareness of DAB activity as measured by likes/engagement in the forum</li>\n</ul>\n<h4><a name=\"performance-kpis-8\" class=\"anchor\" href=\"https://gov.optimism.io#performance-kpis-8\"></a>Performance KPIs:</h4>\n<p>Foundation suggested measures:</p>\n<ul>\n<li>Public feedback from OP Labs engineering team on the grants made by Grants Council (is it positive or negative?)</li>\n<li>Number of technical milestones not met</li>\n<li>Voting participation on protocol upgrades, considering the # of abstain votes of protocol upgrades</li>\n<li>Number of questions about protocol upgrades from Citizens</li>\n</ul>\n<p><strong>Additional measures unique to this proposal:</strong></p>\n<ul>\n<li>Number of DAB candidate applications into S7 (expecting an increase)</li>\n<li>Number of DAB Lead proposals in S7 (expecting an increase)</li>\n</ul>\n<p><a href=\"https://gov.optimism.io/t/ed-mazurek-developer-advisory-board-operating-budget/8175/1\">Click to view the poll.</a></p>\n            <p><small>8 posts - 8 participants</small></p>\n            <p><a href=\"https://gov.optimism.io/t/ed-mazurek-developer-advisory-board-operating-budget/8175\">Read full topic</a></p>","link":"https://gov.optimism.io/t/ed-mazurek-developer-advisory-board-operating-budget/8175","pubDate":"Tue, 21 May 2024 05:08:21 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"gov.optimism.io-topic-8175"},"source":{"@url":"https://gov.optimism.io/t/ed-mazurek-developer-advisory-board-operating-budget/8175.rss","#text":"Ed Mazurek - Developer Advisory Board Operating Budget"}},{"title":"Optimism Forum Weekly Recap (May 13, 2024 - May 19, 2024)","dc:creator":"daospace","category":"Updates  and Announcements 📢","description":"<p>gm Optimism Collective <img src=\"https://emoji.discourse-cdn.com/twitter/red_circle.png?v=12\" title=\":red_circle:\" class=\"emoji\" alt=\":red_circle:\" loading=\"lazy\" width=\"20\" height=\"20\"> <img src=\"https://emoji.discourse-cdn.com/twitter/sparkles.png?v=12\" title=\":sparkles:\" class=\"emoji\" alt=\":sparkles:\" loading=\"lazy\" width=\"20\" height=\"20\"></p>\n<p>Last week was pretty active on forum. 28 topics were created, including 2 Protocol Upgrade Proposals from OP Labs, aiming to enhance security and decentralization, and to reduce trust assumptions for users as well.</p>\n<p><a href=\"https://twitter.com/daospace_ai\" rel=\"noopener nofollow ugc\">daospace </a>is a DAO discovery platform that aggregates contributions across different DAOs. We will be providing weekly Automated AI Summaries to help reduce information overload, and so that all members can stay up to date on forum activity within the DAO. Below is a summary of every topic made within the OP Governance Forum from last week.</p>\n<p>Feel free to leave us feedback in the comments below. You can get in touch with the daospace team on <a href=\"https://twitter.com/daospace_ai\" rel=\"noopener nofollow ugc\">X (Twitter) </a>, or reach out to the founders directly on X as well: <a href=\"https://twitter.com/JarisJames\" rel=\"noopener nofollow ugc\">Jaris James </a>&amp; <a href=\"https://twitter.com/sixty_keys\" rel=\"noopener nofollow ugc\">Sixty</a></p>\n<h2><a name=\"about-the-renewal-categoryhttpsgovoptimismiotabout-the-renewal-category8139-1\" class=\"anchor\" href=\"https://gov.optimism.io#about-the-renewal-categoryhttpsgovoptimismiotabout-the-renewal-category8139-1\"></a><a href=\"https://gov.optimism.io/t/about-the-renewal-category/8139\">About the Renewal category</a></h2>\n<p><strong>Created</strong>: 2024-05-13</p>\n<p><strong>Author</strong>: <a class=\"mention\" href=\"https://gov.optimism.io/u/lavande\">@lavande</a></p>\n<p><strong>Summary</strong></p>\n<p>This post provides a template for creating a new category on the forum. It offers guidance on why the category is useful, how it differs from existing ones, recommended content for topics within the category, and considerations on merging it with another category if needed.</p>\n<h2><a name=\"forum-redesign-feedbackhttpsgovoptimismiotforum-redesign-feedback8140-2\" class=\"anchor\" href=\"https://gov.optimism.io#forum-redesign-feedbackhttpsgovoptimismiotforum-redesign-feedback8140-2\"></a><a href=\"https://gov.optimism.io/t/forum-redesign-feedback/8140\">Forum Redesign Feedback</a></h2>\n<p><strong>Created</strong>: 2024-05-13</p>\n<p><strong>Author</strong>: <a class=\"mention\" href=\"https://gov.optimism.io/u/maxwell\">@maxwell</a></p>\n<p><strong>Summary</strong></p>\n<p>A thread has been set up for feedback on the governance forum (<a href=\"http://gov.optimism.io\">gov.optimism.io</a>). Users are encouraged to share their thoughts on accessibility, ease of navigation, and clarity. Constructive feedback is being sought to maintain a high signal-to-noise ratio, with engagement subject to the Forum Rules of Engagement.</p>\n<h2><a name=\"zach-obront-developer-advisory-board-operating-budgethttpsgovoptimismiotzach-obront-developer-advisory-board-operating-budget8141-3\" class=\"anchor\" href=\"https://gov.optimism.io#zach-obront-developer-advisory-board-operating-budgethttpsgovoptimismiotzach-obront-developer-advisory-board-operating-budget8141-3\"></a><a href=\"https://gov.optimism.io/t/zach-obront-developer-advisory-board-operating-budget/8141\">Zach Obront - Developer Advisory Board Operating Budget</a></h2>\n<p><strong>Created</strong>: 2024-05-13</p>\n<p><strong>Author</strong>: <a class=\"mention\" href=\"https://gov.optimism.io/u/zachobront\">@zachobront</a></p>\n<p><strong>Summary</strong></p>\n<p>Zach Obront is being proposed as the lead for the Board with an operating budget of 90,000 OP. His qualifications include being a security researcher and past experience on the Developer Advisory Board. The proposed expanded charter focuses on supporting the community through technical decisions, assisting the Grants Council in evaluating Mission Requests, and providing a technical perspective on the OP ecosystem’s vision.</p>\n<p>The breakdown of the operating budget includes roles such as Lead, Upgrade Czar, Ops Lead, and Additional Members, each with specific responsibilities. The post also mentions key performance indicators and measurements to track user experience and performance, such as prompt non-technical summaries of Protocol Upgrades, participation rates, and grant recipient milestones.</p>\n<h2><a name=\"season-6-introducing-blockspace-charters-superchain-first-governancehttpsgovoptimismiotseason-6-introducing-blockspace-charters-superchain-first-governance8133-4\" class=\"anchor\" href=\"https://gov.optimism.io#season-6-introducing-blockspace-charters-superchain-first-governancehttpsgovoptimismiotseason-6-introducing-blockspace-charters-superchain-first-governance8133-4\"></a><a href=\"https://gov.optimism.io/t/season-6-introducing-blockspace-charters-superchain-first-governance/8133\">Season 6: Introducing Blockspace Charters: Superchain-first Governance</a></h2>\n<p><strong>Created</strong>: 2024-05-13</p>\n<p><strong>Author</strong>: system</p>\n<p><strong>Summary</strong></p>\n<p>In Season 6 of Optimism Governance, the introduction of Blockspace Charters is proposed to provide technical governance for the Superchain ecosystem. These Charters specify criteria, governing policies, and precommitments for different types of blockspace within the Superchain. The goal is to address the variety of OP Stack-based chains’ technical differences and to offer clear guidance for decision-making within the ecosystem. The Superchain Registry, along with an improved upgrade proposal process, will support the deployment of Blockspace Charters, ensuring transparency and accountability within the system. This initiative aims to foster a stable and innovative environment for growth and collaboration in the Superchain ecosystem.</p>\n<h2><a name=\"season-6-draft-charter-aware-upgrade-proposal-templatehttpsgovoptimismiotseason-6-draft-charter-aware-upgrade-proposal-template8134-5\" class=\"anchor\" href=\"https://gov.optimism.io#season-6-draft-charter-aware-upgrade-proposal-templatehttpsgovoptimismiotseason-6-draft-charter-aware-upgrade-proposal-template8134-5\"></a><a href=\"https://gov.optimism.io/t/season-6-draft-charter-aware-upgrade-proposal-template/8134\">Season 6: [Draft] Charter-Aware Upgrade Proposal Template</a></h2>\n<p><strong>Created</strong>: 2024-05-13</p>\n<p><strong>Author</strong>: system</p>\n<p><strong>Summary</strong></p>\n<p>The draft charter-aware upgrade proposal template for Season 6 involves soliciting community feedback on proposed changes. It includes sections such as Proposal Title, Proposal Type, Executive Summary, Motivation, Specifications (including Blockspace Charter details), Impact Summary, Precommitment Impact Review, Action Plan, and Conclusion. This structured format aims to ensure clarity, transparency, and accountability in governance proposals, with a final version to be approved by the Token House in Season 6.</p>\n<h2><a name=\"season-6-draft-standard-rollup-charterhttpsgovoptimismiotseason-6-draft-standard-rollup-charter8135-6\" class=\"anchor\" href=\"https://gov.optimism.io#season-6-draft-standard-rollup-charterhttpsgovoptimismiotseason-6-draft-standard-rollup-charter8135-6\"></a><a href=\"https://gov.optimism.io/t/season-6-draft-standard-rollup-charter/8135\">Season 6: [DRAFT] Standard Rollup Charter</a></h2>\n<p><strong>Created</strong>: 2024-05-13</p>\n<p><strong>Author</strong>: system</p>\n<p><strong>Summary</strong></p>\n<p>The document outlines a Draft Standard Rollup Charter proposed by the Optimism Collective for Season 6, seeking feedback from the community. The charter aims to establish the Standard Rollup as a high-security, decentralized blockspace product. It details criteria for being a Standard Rollup, including onchain and offchain checks, governance policies, and procedures for potential violations such as Governor Key Recovery, Sequencer Censorship, Responsible GasLimits, Responsible Batch Submission, Fee Margins, and ResourceMetering. Additionally, the charter makes precommitments related to fee splits and anticipates changes for future upgrades, including Governor/Servicer role separation, Ossified GasLimits, and Direct Fee Margin Controls.</p>\n<h2><a name=\"governance-fund-monitoring-warden-swaphttpsgovoptimismiotgovernance-fund-monitoring-warden-swap8136-7\" class=\"anchor\" href=\"https://gov.optimism.io#governance-fund-monitoring-warden-swaphttpsgovoptimismiotgovernance-fund-monitoring-warden-swap8136-7\"></a><a href=\"https://gov.optimism.io/t/governance-fund-monitoring-warden-swap/8136\">Governance Fund Monitoring: Warden Swap</a></h2>\n<p><strong>Created</strong>: 2024-05-13</p>\n<p><strong>Author</strong>: <a class=\"mention\" href=\"https://gov.optimism.io/u/v3naru_curia\">@v3naru_Curia</a></p>\n<p><strong>Summary</strong></p>\n<p>After the approval of the Warden Swap proposal in voting cycle 2.1, concerns arose regarding the utilization of the Governance Fund. The Fund was allocated towards Marketing, Trader Incentives, Referral Program, Builders, and Development &amp; Maintenance. Issues surfaced as minimal marketing efforts were observed, only a fraction of the Trader Incentives was distributed within the proposed timeline, and no significant activities were visible in the Builder &amp; Referral Programs. A recent resurgence in activity by Warden Swap in 2024 led to a proposed vote for distributing OP tokens, with some controversy surrounding new wallet holders amassing governance tokens just before the vote, potentially impacting governance decisions. The situation has sparked discussions within the community about transparency, legitimacy, and insider influence concerning governance processes.</p>\n<h2><a name=\"retro-funding-4-voting-experiencehttpsgovoptimismiotretro-funding-4-voting-experience8138-8\" class=\"anchor\" href=\"https://gov.optimism.io#retro-funding-4-voting-experiencehttpsgovoptimismiotretro-funding-4-voting-experience8138-8\"></a><a href=\"https://gov.optimism.io/t/retro-funding-4-voting-experience/8138\">Retro Funding 4: Voting Experience</a></h2>\n<p><strong>Created</strong>: 2024-05-13</p>\n<p><strong>Author</strong>: system</p>\n<p><strong>Summary</strong></p>\n<p>The discussion revolves around the Retroactive Public Goods Funding (Retro Funding) round 4 voting experience. It reflects on what was learned from previous rounds, addresses challenges faced in voting processes, and introduces a new approach where badgeholders vote via weighted metrics rather than individually. The voting implementation involves collaboration between various teams including the Optimism Foundation, West, Open Source Observer, and Agora. Impact metrics will be based on blockchain trace data, web social &amp; reputation data, and code contributions. Badgeholders are also involved in shaping impact metrics. The initiative aims to reward the use of Open Source licenses and is experimenting with defining profit within the impact = profit framework using a deliberative process. The discussion is ongoing, with updates to follow.</p>\n<h2><a name=\"top-delegates-and-their-interconnections-a-look-at-the-datahttpsgovoptimismiottop-delegates-and-their-interconnections-a-look-at-the-data8144-9\" class=\"anchor\" href=\"https://gov.optimism.io#top-delegates-and-their-interconnections-a-look-at-the-datahttpsgovoptimismiottop-delegates-and-their-interconnections-a-look-at-the-data8144-9\"></a><a href=\"https://gov.optimism.io/t/top-delegates-and-their-interconnections-a-look-at-the-data/8144\">Top delegates and their interconnections: a look at the data</a></h2>\n<p><strong>Created</strong>: 2024-05-14</p>\n<p><strong>Author</strong>: <a class=\"mention\" href=\"https://gov.optimism.io/u/eyal\">@Eyal</a></p>\n<p><strong>Summary</strong></p>\n<p><a href=\"http://DeepDAO.io\" rel=\"noopener nofollow ugc\">DeepDAO.io</a> analyzed data on top delegates and their interconnections within the ecosystem. The study showed that many top delegates are gaining delegators from platforms like Optimism and Arbitrum. The analysis focused on the top 5 delegates and brought up several key points:</p>\n<ol>\n<li>\n<p>Many top delegates are engaged in multiple DAOs, which can enable communication and partnerships but may also pose conflicts of interest.</p>\n</li>\n<li>\n<p>Looking at top delegates can help in discovering emerging DAOs that pique their interest.</p>\n</li>\n<li>\n<p>Questions were raised regarding whether top delegates constitute a new financial elite managing substantial amounts of value in top tokens.</p>\n</li>\n<li>\n<p>There is also a question about whether delegation is contributing to centralization or working as a second power center balancing the original teams and foundations.</p>\n</li>\n</ol>\n<p>The team at <a href=\"http://DeepDAO.io\" rel=\"noopener nofollow ugc\">DeepDAO.io</a> mentioned that they are developing a more detailed report with additional data and insights for the future.</p>\n<h2><a name=\"season-6-opensource-draft-charterhttpsgovoptimismiotseason-6-opensource-draft-charter8146-10\" class=\"anchor\" href=\"https://gov.optimism.io#season-6-opensource-draft-charterhttpsgovoptimismiotseason-6-opensource-draft-charter8146-10\"></a><a href=\"https://gov.optimism.io/t/season-6-opensource-draft-charter/8146\">Season 6 Opensource Draft Charter</a></h2>\n<p><strong>Created</strong>: 2024-05-14</p>\n<p><strong>Author</strong>: <a class=\"mention\" href=\"https://gov.optimism.io/u/danelund.eth\">@danelund.eth</a></p>\n<p><strong>Summary</strong></p>\n<p>The Season 5 grants council has engaged Lund Ventures to create an opensource draft charter for Season 6. The draft document is now available at the provided link and will be updated based on community feedback. Prospective leads are encouraged to provide commentary and make adaptations to the document as needed for Season 6.</p>\n<h2><a name=\"introducing-markitlend-us-consumer-credit-strategyhttpsgovoptimismiotintroducing-markitlend-us-consumer-credit-strategy8153-11\" class=\"anchor\" href=\"https://gov.optimism.io#introducing-markitlend-us-consumer-credit-strategyhttpsgovoptimismiotintroducing-markitlend-us-consumer-credit-strategy8153-11\"></a><a href=\"https://gov.optimism.io/t/introducing-markitlend-us-consumer-credit-strategy/8153\">Introducing MarkitLend US Consumer Credit Strategy</a></h2>\n<p><strong>Created</strong>: 2024-05-15</p>\n<p><strong>Author</strong>: <a class=\"mention\" href=\"https://gov.optimism.io/u/mison\">@mison</a></p>\n<p><strong>Summary</strong></p>\n<p>MarkitLend, co-founded by Michael Sonenshine and Fernando Sanchez, is introducing its Consumer Credit Strategy, focusing on buying consumer finance loans from platforms like Prosper and LendingClub. With a track record of generating an average 7.5% returns annually, they are now looking to attract external investors. The fund aims for growth with steady income, and interested parties can find more information on their website. Sonenshine invites the Optimism Community to discuss potential funding proposals and welcomes feedback. If interested, individuals can schedule a call with him via Calendly.</p>\n<h2><a name=\"big-picture-the-grants-councilhttpsgovoptimismiotbig-picture-the-grants-council8154-12\" class=\"anchor\" href=\"https://gov.optimism.io#big-picture-the-grants-councilhttpsgovoptimismiotbig-picture-the-grants-council8154-12\"></a><a href=\"https://gov.optimism.io/t/big-picture-the-grants-council/8154\">Big Picture: The Grants Council</a></h2>\n<p><strong>Created</strong>: 2024-05-15</p>\n<p><strong>Author</strong>: <a class=\"mention\" href=\"https://gov.optimism.io/u/seedlatam\">@seedlatam</a></p>\n<p><strong>Summary</strong></p>\n<p>The discussion revolves around the significant role played by the Grants Council within the governance of Optimism as a leading Layer 2 solution. The Council’s formation, evolution, structure, and impact over the past three seasons are detailed. The document highlights the Grants Council’s focus on efficiency, transparency, and responsible fund allocation and tracks its activities, including the number of applicants, beneficiaries, budgets, and grants distributed across seasons. The positive impact of the Grants Council on governance is noted, as seen through increased applicant numbers and beneficiaries. Suggestions for further improvement, such as dedicated subcommittees for audits, broader marketing efforts, and initial feedback groups for proposals, are also provided. The compiled data aims to offer delegates and community members a comprehensive view of the Grants Council’s work and influence within the Optimism ecosystem.</p>\n<h2><a name=\"optimism-community-study-calling-for-study-participantshttpsgovoptimismiotoptimism-community-study-calling-for-study-participants8147-13\" class=\"anchor\" href=\"https://gov.optimism.io#optimism-community-study-calling-for-study-participantshttpsgovoptimismiotoptimism-community-study-calling-for-study-participants8147-13\"></a><a href=\"https://gov.optimism.io/t/optimism-community-study-calling-for-study-participants/8147\">Optimism Community Study🔴: CALLING FOR STUDY PARTICIPANTS</a></h2>\n<p><strong>Created</strong>: 2024-05-15</p>\n<p><strong>Author</strong>: <a class=\"mention\" href=\"https://gov.optimism.io/u/josey\">@Josey</a></p>\n<p><strong>Summary</strong></p>\n<p>The post invites a range of participants to a behavioral science study on Optimism, funded by Optimism Academics. The study aims to understand the factors contributing to a sense of community and user loyalty within the Optimism network. Through the lens of identity fusion, the study explores how users form connections and perceive Optimism. Understanding these dynamics is crucial for Optimism’s growth, community resilience, and unique positioning within blockchain networks. The call to action encourages participation in the survey to support the study and strengthen Optimism’s standing in the blockchain space.</p>\n<h2><a name=\"season-6-ama-will-be-thursday-may-16th-at-1100-et-1500-utchttpsgovoptimismiotseason-6-ama-will-be-thursday-may-16th-at-11-00-et-15-00-utc8155-14\" class=\"anchor\" href=\"https://gov.optimism.io#season-6-ama-will-be-thursday-may-16th-at-1100-et-1500-utchttpsgovoptimismiotseason-6-ama-will-be-thursday-may-16th-at-11-00-et-15-00-utc8155-14\"></a><a href=\"https://gov.optimism.io/t/season-6-ama-will-be-thursday-may-16th-at-11-00-et-15-00-utc/8155\">Season 6 AMA will be Thursday, May 16th at 11:00 ET 15:00 UTC</a></h2>\n<p><strong>Created</strong>: 2024-05-15</p>\n<p><strong>Author</strong>: Michael</p>\n<p><strong>Summary</strong></p>\n<p>Learn more about Season 6 by joining an AMA session hosted by <a class=\"mention\" href=\"https://gov.optimism.io/u/lavande\">@lavande</a> and the Foundation. You can catch up on the latest information by watching the presentation from the recent community call, checking out the Season 6 Guide and Reflection Period Guide. Come prepared with your questions and join the discussion using the provided Google Meet link.</p>\n<h2><a name=\"superchain-and-the-monolithic-experience-a-cross-chain-guide-for-superchainhttpsgovoptimismiotsuperchain-and-the-monolithic-experience-a-cross-chain-guide-for-superchain8151-15\" class=\"anchor\" href=\"https://gov.optimism.io#superchain-and-the-monolithic-experience-a-cross-chain-guide-for-superchainhttpsgovoptimismiotsuperchain-and-the-monolithic-experience-a-cross-chain-guide-for-superchain8151-15\"></a><a href=\"https://gov.optimism.io/t/superchain-and-the-monolithic-experience-a-cross-chain-guide-for-superchain/8151\">Superchain and the Monolithic Experience - A cross-chain guide for Superchain</a></h2>\n<p><strong>Created</strong>: 2024-05-15</p>\n<p><strong>Author</strong>: sandman</p>\n<p><strong>Summary</strong></p>\n<p>Sandman, a researcher from Delphi Digital working on the cross-chain report for Superchain, introduces essential concepts of cross-chain interoperability like Token Bridges and Messaging Bridges. The report delves into stakeholder preferences, recommendations for Superchain, and various directions it can take, including options like No Changes to the Base Layer, Asynchronous Composability, Shared Validity Sequencing, zk-Aggregation Layer, Shared Sequencer Networks, and Based Sequencing. The report suggests focusing on solving the Ethereum interop problem using Based Sequencing, aiming for a monolithic chain with the benefits of fragmented rollups. Stakeholder efforts are also evaluated for achieving a cohesive user experience. The full report provides in-depth insights and invites a discussion on the proposed solutions.</p>\n<h2><a name=\"upgrade-proposal-guardian-security-council-threshold-and-l2-proxyadmin-ownership-changes-for-stage-1-decentralizationhttpsgovoptimismiotupgrade-proposal-guardian-security-council-threshold-and-l2-proxyadmin-ownership-changes-for-stage-1-decentralization8157-16\" class=\"anchor\" href=\"https://gov.optimism.io#upgrade-proposal-guardian-security-council-threshold-and-l2-proxyadmin-ownership-changes-for-stage-1-decentralizationhttpsgovoptimismiotupgrade-proposal-guardian-security-council-threshold-and-l2-proxyadmin-ownership-changes-for-stage-1-decentralization8157-16\"></a><a href=\"https://gov.optimism.io/t/upgrade-proposal-guardian-security-council-threshold-and-l2-proxyadmin-ownership-changes-for-stage-1-decentralization/8157\">Upgrade Proposal: Guardian, Security Council Threshold and L2 ProxyAdmin Ownership changes for Stage 1 Decentralization</a></h2>\n<p><strong>Created</strong>: 2024-05-16</p>\n<p><strong>Author</strong>: maurelian</p>\n<p><strong>Summary</strong></p>\n<p>Maurelian from OP Labs discusses a protocol upgrade for the Superchain, aiming to enhance security and decentralization. The upgrade includes: increasing Security Council Safe’s signing threshold, reassigning Guardian role, appointing DeputyGuardian, and transferring ownership of the L2 ProxyAdmin contract. The detailed technical changes to the existing system, security considerations regarding code and operational aspects, and the potential impact of the upgrade are outlined. The upgrade does not affect node operators and aims to increase decentralization within the system while maintaining incident response capabilities. If passed, the upgrade is planned to be executed efficiently without node operator intervention.</p>\n<h2><a name=\"joint-house-call-will-be-tuesday-may-21st-1000pt-1300-et-1700-gmt-1900-cethttpsgovoptimismiotjoint-house-call-will-be-tuesday-may-21st-10-00pt-13-00-et-17-00-gmt-19-00-cet8160-17\" class=\"anchor\" href=\"https://gov.optimism.io#joint-house-call-will-be-tuesday-may-21st-1000pt-1300-et-1700-gmt-1900-cethttpsgovoptimismiotjoint-house-call-will-be-tuesday-may-21st-10-00pt-13-00-et-17-00-gmt-19-00-cet8160-17\"></a><a href=\"https://gov.optimism.io/t/joint-house-call-will-be-tuesday-may-21st-10-00pt-13-00-et-17-00-gmt-19-00-cet/8160\">Joint House Call will be [Tuesday, May 21st @ 10:00PT / 13:00 ET / 17:00 GMT / 19:00 CET]</a></h2>\n<p><strong>Created</strong>: 2024-05-16</p>\n<p><strong>Author</strong>: Michael</p>\n<p><strong>Summary</strong></p>\n<p>The discussion event hosted by Joint House will feature an AMA with OP Labs engineers on future upgrades and Retrofunding Round 4 discussion. The meeting link is provided for those interested in joining.</p>\n<h2><a name=\"upgrade-proposal-fault-proofshttpsgovoptimismiotupgrade-proposal-fault-proofs8161-18\" class=\"anchor\" href=\"https://gov.optimism.io#upgrade-proposal-fault-proofshttpsgovoptimismiotupgrade-proposal-fault-proofs8161-18\"></a><a href=\"https://gov.optimism.io/t/upgrade-proposal-fault-proofs/8161\">Upgrade Proposal: Fault Proofs</a></h2>\n<p><strong>Created</strong>: 2024-05-16</p>\n<p><strong>Author</strong>: ajsutton</p>\n<p><strong>Summary</strong></p>\n<p>OP Labs, as a core developer of the OP Stack in the Optimism ecosystem, has proposed a protocol upgrade for the OP Mainnet to reduce trust assumptions for users. The upgrade introduces a permissionless fault proof system which empowers users to propose output roots and participate in disputes without relying on centralized entities. The upgrade also extends the capabilities of the Guardian role to disable the system in emergencies, maintaining security. Security Council approval is required for deployment, aligning with decentralization goals. The upgrade does not affect node software and includes contract changes for withdrawals and dispute resolution. Security measures and fallback mechanisms are in place to ensure system safety. The impact includes invalidating pending withdrawals, with users needing to re-prove them. The upgrade has already been activated internally and on testnets. No downtime for node operators is expected. Communication plans are in place to notify the community about changes. Ultimately, the upgrade signifies progress towards decentralization by implementing a permissionless fault dispute system on OP Mainnet.</p>\n<h2><a name=\"introducing-regenhttpsgovoptimismiotintroducing-regen8162-19\" class=\"anchor\" href=\"https://gov.optimism.io#introducing-regenhttpsgovoptimismiotintroducing-regen8162-19\"></a><a href=\"https://gov.optimism.io/t/introducing-regen/8162\">Introducing $REGEN</a></h2>\n<p><strong>Created</strong>: 2024-05-16</p>\n<p><strong>Author</strong>: revmiller</p>\n<p><strong>Summary</strong></p>\n<p>The forum post discusses $REGEN, a memecoin on Optimism aiming to create a culture coin and impact token. $REGEN will be distributed via iterative airdrops based on engagement and ‘Proof-of-Regen’ activities, with plans for a tipping system for users. The project seeks community feedback on various aspects such as alignment with Optimism, public goods funding, stakeholders, and reward mechanisms, encouraging collaboration and growth within the regenerative movement. Core contributors behind $REGEN include cyrus, innvertir, nicnode, cjh, mogylnyi, and rev. Interested participants are encouraged to visit regen.tips to engage with the project and contribute to its development.</p>\n<h2><a name=\"draft-code-of-conduct-council-cocc-operating-budget-for-season-6httpsgovoptimismiotdraft-code-of-conduct-council-cocc-operating-budget-for-season-68167-20\" class=\"anchor\" href=\"https://gov.optimism.io#draft-code-of-conduct-council-cocc-operating-budget-for-season-6httpsgovoptimismiotdraft-code-of-conduct-council-cocc-operating-budget-for-season-68167-20\"></a><a href=\"https://gov.optimism.io/t/draft-code-of-conduct-council-cocc-operating-budget-for-season-6/8167\">[Draft] Code of Conduct Council (CoCC) Operating Budget for Season 6</a></h2>\n<p><strong>Created</strong>: 2024-05-17</p>\n<p><strong>Author</strong>: juankbell</p>\n<p><strong>Summary</strong></p>\n<p>The discussion revolves around the renewal of the Code of Conduct Council (CoCC) for Season 6 in the Optimism ecosystem. The proposed scope for the council is limited to enforcing the Rules of Engagement on all Optimism platforms. Juan Carlos Bell is nominated as the proposed council lead with a budget increase from the previous season. The council structure includes subcommittees, member elections, positions, responsibilities, and KPIs for measuring impact. Delegates are asked to vote on approving the operating budget and thus electing the council lead. If the budget is not approved, supportNERDs will continue enforcing the rules. The importance of governance participation, reporting criteria, and impact measurement for the council are also highlighted in the discussion.</p>\n<h2><a name=\"gene-delegate-communication-threadhttpsgovoptimismiotgene-delegate-communication-thread8163-21\" class=\"anchor\" href=\"https://gov.optimism.io#gene-delegate-communication-threadhttpsgovoptimismiotgene-delegate-communication-thread8163-21\"></a><a href=\"https://gov.optimism.io/t/gene-delegate-communication-thread/8163\">Gene - Delegate Communication Thread</a></h2>\n<p><strong>Created</strong>: 2024-05-17</p>\n<p><strong>Author</strong>: gene</p>\n<p><strong>Summary</strong></p>\n<p>The user shared their opinion on developments in the OP ecosystem, specifically regarding protocol governance and individual proposals. They initially felt hesitant to voice their thoughts but now believe their experience and understanding of the ecosystem qualify them to participate in discussions and decision-making. They serve on both elected and appointed councils, which further motivates them to advocate for more inclusive participation in governance activities and encourage the involvement of diverse voices in decision-making processes.</p>\n<h2><a name=\"governor-update-proposal-2-improvements-to-advanced-delegation-allowance-calculationshttpsgovoptimismiotgovernor-update-proposal-2-improvements-to-advanced-delegation-allowance-calculations8164-22\" class=\"anchor\" href=\"https://gov.optimism.io#governor-update-proposal-2-improvements-to-advanced-delegation-allowance-calculationshttpsgovoptimismiotgovernor-update-proposal-2-improvements-to-advanced-delegation-allowance-calculations8164-22\"></a><a href=\"https://gov.optimism.io/t/governor-update-proposal-2-improvements-to-advanced-delegation-allowance-calculations/8164\">Governor Update Proposal #2: Improvements to advanced delegation allowance calculations</a></h2>\n<p><strong>Created</strong>: 2024-05-17</p>\n<p><strong>Author</strong>: Agora</p>\n<p><strong>Summary</strong></p>\n<p>Agora, the governance software company supporting the Optimism token house governor, is proposing an upgrade to address issues in the Alligator allowance storage system related to partial delegation and sub-delegation for OP voters. The upgrade aims to prevent scenarios where delegated votes could result in inaccurate voting power calculations. The motivation for this upgrade stems from the introduction of advanced delegation in a previous version, enabling users to delegate voting power to multiple delegates without splitting their balance. The proposed changes ensure correct calculation of voting power in complex delegation states. The upgrade has been audited by Open Zeppelin, with no identified issues. If approved, the Optimism Foundation will implement the changes, enhancing the voting experience for users with advanced voting power.</p>\n<h2><a name=\"la-causathon-hackathon-by-space4build-daos-challenge-feedbackhttpsgovoptimismiotla-causathon-hackathon-by-space4build-dao-s-challenge-feedback8168-23\" class=\"anchor\" href=\"https://gov.optimism.io#la-causathon-hackathon-by-space4build-daos-challenge-feedbackhttpsgovoptimismiotla-causathon-hackathon-by-space4build-dao-s-challenge-feedback8168-23\"></a><a href=\"https://gov.optimism.io/t/la-causathon-hackathon-by-space4build-dao-s-challenge-feedback/8168\">La Causathon - Hackathon by Space4Build (Dao´s Challenge feedback)</a></h2>\n<p><strong>Created</strong>: 2024-05-17</p>\n<p><strong>Author</strong>: TheMvp07</p>\n<p><strong>Summary</strong></p>\n<p>Space 4 Build announced the upcoming Causathon, an in-person hackathon in Lima, Peru, alongside the Optimism Connection Virtual Conference. The event aims to create a positive experience for developers, volunteers, and organizations. Challenges focus on Dao’s, Gaming, Marketing, and Innovation. Participants are encouraged to provide input on improving digital aspects of the collective, including governance, security, incentives, communication, and financial sustainability. The organization is dedicated to building a better community and invites feedback through various contact channels.</p>\n<h2><a name=\"optimize-optimism-development-with-getblock-rpc-node-serviceshttpsgovoptimismiotoptimize-optimism-development-with-getblock-rpc-node-services8166-24\" class=\"anchor\" href=\"https://gov.optimism.io#optimize-optimism-development-with-getblock-rpc-node-serviceshttpsgovoptimismiotoptimize-optimism-development-with-getblock-rpc-node-services8166-24\"></a><a href=\"https://gov.optimism.io/t/optimize-optimism-development-with-getblock-rpc-node-services/8166\">Optimize Optimism Development with GetBlock RPC Node Services</a></h2>\n<p><strong>Created</strong>: 2024-05-17</p>\n<p><strong>Author</strong>: pcGB</p>\n<p><strong>Summary</strong></p>\n<p>GetBlock, a leading flexible node provider, now offers support for Optimism and over 60 networks. Developers have the option to choose between shared and dedicated Optimism nodes, as well as request custom node clusters for specific project needs. With 24/7 support, developers can benefit from reduced stress and costs in blockchain development, whether for prototyping on testnets or scaling on Optimism mainnet. Explore leveraging Optimism nodes for web 3 dApps through GetBlock’s Optimism RPC and free API endpoints.</p>\n<h2><a name=\"grants-season-5-round-2-data-analysishttpsgovoptimismiotgrants-season-5-round-2-data-analysis8169-25\" class=\"anchor\" href=\"https://gov.optimism.io#grants-season-5-round-2-data-analysishttpsgovoptimismiotgrants-season-5-round-2-data-analysis8169-25\"></a><a href=\"https://gov.optimism.io/t/grants-season-5-round-2-data-analysis/8169\">Grants Season 5, Round 2 — Data Analysis</a></h2>\n<p><strong>Created</strong>: 2024-05-18</p>\n<p><strong>Author</strong>: 1a35e1</p>\n<p><strong>Summary</strong></p>\n<p>The discussion revolved around the lack of transparency in grant ranking for applicants in a specific project. The rubric scores were difficult to interpret, prompting someone to clean the data for analysis and share it for transparency. The goal was to identify key factors influencing ranking for applicants, assist reviewers with clean data, and increase transparency in the allocation process overall. Links to the cleaned data and a GitHub repository for reproducibility were shared, alongside references to relevant documents.</p>\n<h2><a name=\"draft-proposed-grants-council-charter-season-6httpsgovoptimismiotdraft-proposed-grants-council-charter-season-68170-26\" class=\"anchor\" href=\"https://gov.optimism.io#draft-proposed-grants-council-charter-season-6httpsgovoptimismiotdraft-proposed-grants-council-charter-season-68170-26\"></a><a href=\"https://gov.optimism.io/t/draft-proposed-grants-council-charter-season-6/8170\">[DRAFT]: Proposed Grants Council Charter - Season 6</a></h2>\n<p><strong>Created</strong>: 2024-05-19</p>\n<p><strong>Author</strong>: <a class=\"mention\" href=\"https://gov.optimism.io/u/gonna.eth\">@Gonna.eth</a></p>\n<p><strong>Summary</strong></p>\n<p>The discussion provided details on a proposed open-source charter for Season 6 of the Grants Council. The main goals include establishing a streamlined process for grant applicants, enabling delegates to make grant decisions, and reducing workload for non-Council delegates. The structure involves different teams like the Superchain, Optimism Mission, Audit and Special Mission, and Milestones and Metrics teams, each with specific goals, review processes, and consensus requirements. The participants are elected for each season, and accountability measures are in place to ensure transparency and re-election processes. Budget proposals and operational details are managed by the Council Lead. The Charter will be updated and posted on GitHub for any modifications.</p>\n<h2><a name=\"season-6-grants-council-operating-budgethttpsgovoptimismiotseason-6-grants-council-operating-budget8171-27\" class=\"anchor\" href=\"https://gov.optimism.io#season-6-grants-council-operating-budgethttpsgovoptimismiotseason-6-grants-council-operating-budget8171-27\"></a><a href=\"https://gov.optimism.io/t/season-6-grants-council-operating-budget/8171\">Season 6 Grants Council Operating Budget</a></h2>\n<p><strong>Created</strong>: 2024-05-19</p>\n<p><strong>Author</strong>: Gonna.eth</p>\n<p><strong>Summary</strong></p>\n<p>A proposal has been put forth by Gonna.eth to lead the council with an increased budget for the upcoming season, focusing on core metrics like active developers. The proposed budget of 605,000 OP includes allocations for various council members and roles. The council’s impact will be measured through KPIs related to builder experience and grant performance, aiming for high NPS ratings, supporting quality applicants, and achieving grant performance targets. Governance will focus on these metrics to evaluate the council’s effectiveness in driving network usage and successful grant outcomes.</p>\n<h2><a name=\"discussion-on-protocols-on-optimism-that-received-grantshttpsgovoptimismiotdiscussion-on-protocols-on-optimism-that-received-grants8172-28\" class=\"anchor\" href=\"https://gov.optimism.io#discussion-on-protocols-on-optimism-that-received-grantshttpsgovoptimismiotdiscussion-on-protocols-on-optimism-that-received-grants8172-28\"></a><a href=\"https://gov.optimism.io/t/discussion-on-protocols-on-optimism-that-received-grants/8172\">Discussion on Protocols on Optimism that received grants</a></h2>\n<p><strong>Created</strong>: 2024-05-19</p>\n<p><strong>Author</strong>: Aadarsh_PYOR</p>\n<p><strong>Summary</strong></p>\n<p>The discussion centered around the protocols that received grants from The Optimism Collective, as analyzed by PYOR, a blockchain analytics firm. The standout performer is Aerodomefi with a 333% increase in Total Value Locked (TVL), followed by SushiSwap with a 217% increase and Uniswap with a 153% increase. Other RPGF recipients saw varied changes in TVL, with some experiencing growth and others a decline. A key highlight was the impressive 3x TVL growth of Aerodomefi, showcasing significant progress in the Optimism ecosystem.</p>\n            <p><small>1 post - 1 participant</small></p>\n            <p><a href=\"https://gov.optimism.io/t/optimism-forum-weekly-recap-may-13-2024-may-19-2024/8174\">Read full topic</a></p>","link":"https://gov.optimism.io/t/optimism-forum-weekly-recap-may-13-2024-may-19-2024/8174","pubDate":"Mon, 20 May 2024 20:48:42 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"gov.optimism.io-topic-8174"},"source":{"@url":"https://gov.optimism.io/t/optimism-forum-weekly-recap-may-13-2024-may-19-2024/8174.rss","#text":"Optimism Forum Weekly Recap (May 13, 2024 - May 19, 2024)"}},{"title":"Discussion on Protocols on Optimism that received grants","dc:creator":"Aadarsh_PYOR","category":"✨ General","description":"<p><a href=\"https://x.com/pyorxyz/status/1792977418690469999\" rel=\"noopener nofollow ugc\">Here</a></p>\n            <p><small>3 posts - 2 participants</small></p>\n            <p><a href=\"https://gov.optimism.io/t/discussion-on-protocols-on-optimism-that-received-grants/8172\">Read full topic</a></p>","link":"https://gov.optimism.io/t/discussion-on-protocols-on-optimism-that-received-grants/8172","pubDate":"Sun, 19 May 2024 16:16:12 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"gov.optimism.io-topic-8172"},"source":{"@url":"https://gov.optimism.io/t/discussion-on-protocols-on-optimism-that-received-grants/8172.rss","#text":"Discussion on Protocols on Optimism that received grants"}},{"title":"Season 6 Grants Council Operating Budget Proposal","dc:creator":"Gonna.eth","category":"Elected  Representatives 💼","description":"<p><strong>Proposed Council Lead:</strong> Gonna.eth</p>\n<p><strong>Proposed Council Operating Budget:</strong> 610.000 OP (+ 170.000 OP relative to the previous Season)</p>\n<p><strong>Contact Info:</strong> <a href=\"mailto:gdhannte@gmail.com\">gdhannte@gmail.com</a></p>\n<p><strong>Please link to any previous work or qualifications to be Council Lead:</strong></p>\n<p>Link to community contributions:</p>\n<ul>\n<li><a href=\"https://gov.optimism.io/u/gonna.eth/activity/topics\">Forum</a> <a href=\"https://gov.optimism.io/u/gonna.eth/activity/topics\">posts</a></li>\n<li><a href=\"https://vote.optimism.io/delegates/gonna.eth\">Voting History</a></li>\n</ul>\n<p>Link to relevant work experience:</p>\n<ul>\n<li>Delegate since OP governance inception</li>\n<li>Member of the first committee</li>\n<li>Grants Council Reviewer on Season 3</li>\n<li>Grants Council Reviewer and Ops manager on Season 4</li>\n<li>Grants Council Reviewer and Ops manager on Season 5</li>\n<li>Grants Council appointed to lead on Season 5</li>\n</ul>\n<p><strong>Council Charter:</strong></p>\n<ul>\n<li>Link to Last Season’s Charter: <a href=\"https://github.com/ethereum-optimism/OPerating-manual/blob/main/Grants%20Council%20Charter%20v0.1.md\">Link</a></li>\n<li>Link to proposed Season 6 Charter: <a href=\"https://gov.optimism.io/t/draft-proposed-grants-council-charter-season-6/8170\">Link<br>\n</a></li>\n</ul>\n<p>Looking at Season 4, which had 314 applications, and Season 5, which saw an increase to 500 applications, we projected that Season 6 would have around 895 applications. However, Season 6 has fundamentally changed its scope to focus on core metrics such as “9,500 active developers driving network usage.” Given this shift, I believe a more realistic projection for Season 6 is between 500 and 700 applications.</p>\n<p><strong>Breakdown of Council Operating Budget:</strong></p>\n<ul>\n<li><strong>Superchain Mission Reviewer</strong> (top 3 ranked in token house vote) = 30.000 OP each (same as S5)</li>\n<li><strong>Optimism Mission Reviewer</strong> (9 members) = 30.000 OP each (same as S5)\n<ul>\n<li>Internal procedures will describe how reviewers will be penalized if they don’t complete 100% of their work.</li>\n<li>Internal Operating procedure will define how application distribution is done.</li>\n</ul>\n</li>\n<li><strong>Additional members</strong> = 50.000 OP (Stays in gov fund if not used)\n<ul>\n<li>The Grants Council may, by the affirmative vote of ten reviewers (including all relevant review teams), opt to add additional reviewers. In this case, the reviewer with the next most votes (after the elected reviewer with the least votes) shall be provided the option to join the Optimism Mission Review Team, with rewards pro-rated for the time that has elapsed in Season 6 prior to joining the Grants Council.</li>\n</ul>\n</li>\n<li><strong>Audit and Special Mission Reviewer</strong> (2 member) = 15.000 OP each (new position)\n<ul>\n<li>This Team may handle highly technical material and should consist of reviewers with a technical background.</li>\n</ul>\n</li>\n<li>M<strong>ilestones and Metrics Reviewer</strong> (3 members) = 25.000 OP each (same as S5)\n<ul>\n<li>Milestones and metrics will put additional efforts into metrics around council reviewers and performance.</li>\n</ul>\n</li>\n<li><strong>Milestones and Metrics Manager</strong> (1 MaM member) = 10.000 OP each (same as S5)\n<ul>\n<li>Must be an elected member of the Milestone and Metrics subcommittee and will be appointed by the Grants Council Lead.</li>\n</ul>\n</li>\n<li><strong>Ops Manager and Lead</strong> = 10.000 OP (same) + 30.000 (same)\n<ul>\n<li>Season 5 budget proposed 0 compensation for the lead and rewards should have happened during a Season 5 RetroPGF. A week before the first submission round, LundVenturesllc appointed me as the Grants Council Lead and I kept the reviewer rewards I had assigned, as lead rewards. I am proposing 40.000 instead of 0 because the latest RetroPGF design is not synched with the Grants Council Season (personal opinion). During Seasons 4 and 5 there was a division between Ops Manager and Grants Council Lead. The work between both positions is very intertwined and requires someone with deep knowledge of all the steps and things happening during the process, this is why I recommend unifying them.</li>\n</ul>\n</li>\n<li><strong>Communications manager</strong> = 5.000 OP (same)</li>\n<li><strong>Council-related requests for grants</strong> = 40k OP (same)\n<ul>\n<li>40k OP will be set aside for grants specifically designed to enhance Council operations (e.g., knowledge management platform, front-end, developer contributions, etc).</li>\n</ul>\n</li>\n</ul>\n<p><strong>Breakdown</strong>: There are 18 sports in the council, 12 reviewers, 3 Milestones and Metrics subcommittee members, 2 for Audits reviewers and the Grants Council Lead.</p>\n<ul>\n<li>Superchain Mission Reviewers = 90.000 OP</li>\n<li>Optimism Mission Reviewers = 270.000 OP</li>\n<li>Additional members = 50.000 OP (if needed)</li>\n<li>Audit and Special Mission Reviewer = 30.000 OP</li>\n<li>Milestones and Metrics Reviewer = 75.000 OP</li>\n<li>Milestone and metrics manager = 10.000 OP</li>\n<li>Ops Manager and Lead = 40.000 OP</li>\n<li>Communications manager = 5.000 OP</li>\n<li>Council-related requests for grants = 40.000 OP (if needed)</li>\n<li>Total = 610.000 OP (90.000 OP returns to Gov Fund if not needed)</li>\n</ul>\n<p><strong>How should governance participants measure the Council’s impact?</strong></p>\n<p>Builder Experience KPIs:</p>\n<ul>\n<li>NPS of finalists &gt; 9/10</li>\n<li>Quality applicants, the Grants Council is unable to support less than 5%\n<ul>\n<li>“Unable to support” Qualified applications are those that meet the criteria but weren’t supported due to budget constraints, tier limitations requiring Foundation intervention, or applications lost during the review process.</li>\n</ul>\n</li>\n</ul>\n<p>Grant Performance KPIs:</p>\n<p>The Foundation suggests the below measures, or similar:</p>\n<ul>\n<li>Intent 1 Commit a 5% increase on the votable supply</li>\n<li>Intent 3, increase active developers driving the network by 150 (pending revision of how this is measured)</li>\n<li>5 OP Chain grants programs launched</li>\n<li>Number of grants that have to be clawed back for failure to meet milestones less than 5%</li>\n</ul>\n            <p><small>21 posts - 15 participants</small></p>\n            <p><a href=\"https://gov.optimism.io/t/season-6-grants-council-operating-budget-proposal/8171\">Read full topic</a></p>","link":"https://gov.optimism.io/t/season-6-grants-council-operating-budget-proposal/8171","pubDate":"Sun, 19 May 2024 11:34:56 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"gov.optimism.io-topic-8171"},"source":{"@url":"https://gov.optimism.io/t/season-6-grants-council-operating-budget-proposal/8171.rss","#text":"Season 6 Grants Council Operating Budget Proposal"}},{"title":"[DRAFT]: Proposed Grants Council Charter - Season 6","dc:creator":"Gonna.eth","category":"✨ General","description":"<p><em>Note: Huge thanks to <a class=\"mention\" href=\"https://gov.optimism.io/u/danelund.eth\">@danelund.eth</a> for publishing an <a href=\"https://gov.optimism.io/t/season-6-opensource-draft-charter/8146\">open-source charter</a> designed for season 6 for anyone to use as a lead proponent.</em></p>\n<h2><a name=\"goals-1\" class=\"anchor\" href=\"https://gov.optimism.io#goals-1\"></a>Goals</h2>\n<p>In short, the goals of the Grants Council, as outlined by the Foundation in Season 3, are to:</p>\n<ul>\n<li>create a streamlined and consistent process for grant applicants</li>\n<li>empower high context delegates to make high context grant decisions</li>\n<li>reduce the workload required of non-Council delegates so that they have more time to weigh in on high impact votes</li>\n</ul>\n<p>In Season 6, the Collective will aim to bring the grants program to the Superchain. This Charter seeks to carry the goals above beyond the Optimism Collective and to participating Superchain grants programs.</p>\n<h2><a name=\"council-structure-2\" class=\"anchor\" href=\"https://gov.optimism.io#council-structure-2\"></a>Council Structure</h2>\n<p>The Governance Fund grants process will be managed by an elected Grants Council. The Grants Council will be comprised of a Lead and [15] Reviewers sitting across four review teams. The Council will have full decision-making authority as to which projects are named finalists for Governance Fund grants. Each team will have a clear mandate and be tied to a specific grant objective, as outlined below.</p>\n<h3><a name=\"superchain-review-team-3\" class=\"anchor\" href=\"https://gov.optimism.io#superchain-review-team-3\"></a>Superchain Review Team:</h3>\n<ul>\n<li><strong>Goal</strong> : Review grants programs applications for Superchain programs</li>\n<li><strong>Format</strong> : proposers receive grants that are used to perpetuate the grants programs for Superchain protocols</li>\n<li><strong>Reviewers</strong> : 3</li>\n<li><strong>Consensus</strong> : 2/3 vote required to approve a list of finalists</li>\n<li><strong>Notes</strong> : Superchain reviewers can join the Mission Review Team if and when they complete the review of relevant Superchain proposals.</li>\n<li><strong>Election</strong> : There will be no separate election for the Superchain Review Team. The top 3 reviewers in the election for the Optimism Mission Review team will be included by default. If the elected reviewer opts not to be a member of the Superchain Review Team or if they become unable to perform their duties as part of the team, the reviewer with the next highest number of votes in the Optimism Mission Review Team election will be added to the Superchain Review Team.</li>\n</ul>\n<h3><a name=\"optimism-mission-review-team-4\" class=\"anchor\" href=\"https://gov.optimism.io#optimism-mission-review-team-4\"></a>Optimism Mission Review Team:</h3>\n<ul>\n<li><strong>Goals</strong>: (1) maximize the number of builders building projects within a specified Intent; (2) maximize the number of users interacting with applications that further a specified intent defined by the Optimism Collective. These goals are of equal weight.</li>\n<li><strong>Non-goals</strong> : retroactive airdrops; retroactive funding</li>\n<li><strong>Format</strong>: proposers receive direct grants that are locked or unlocked according to the Collective Grants Policies.</li>\n<li><strong>Reviewers</strong>: 7 to 12 (counting Superchain and Audit and Special Mission Team reviewers)</li>\n<li><strong>Consensus</strong>: Minimum 3 supporting votes for a proposal to be considered a finalist. Simple majority of the relevant reviewers required to approve a list of finalists for a grants cycle. Notes: The Optimism Mission Review Team will publish proposed missions for community feedback at the beginning of Season 6 (in accordance with the governance calendar).</li>\n</ul>\n<h3><a name=\"audit-and-special-mission-team-5\" class=\"anchor\" href=\"https://gov.optimism.io#audit-and-special-mission-team-5\"></a>Audit and Special Mission Team:</h3>\n<ul>\n<li><strong>Goals</strong>: Review proposals and select finalists for Mission Requests or Legacy Requests for Grants that require ongoing review. The Audit and Special Mission Team will develop review standards in line with the goal of the particular mission.</li>\n<li><strong>Non-goals</strong>: retroactive airdrops; retroactive funding Format: proposers receive grants or allocations from previous grants that have been designated for a specific purpose pursuant to a Mission Request.</li>\n<li><strong>Reviewers</strong>: 2 elected to the Grants Council and 1 reviewer from the Developer Advisory Board (assigned in agreement between the Grants Council Lead and the Developer Advisory Board Lead)</li>\n<li><strong>Consensus</strong>: 2/3 vote is required to name a finalist or validate a proposal.</li>\n<li><strong>Notes</strong>: the grant’s lead will have the ability to declare a mission a “Special Mission” with a simple majority vote of the Optimism Mission Review Team. Successful past mission proposals that require ongoing incremental proposals (e.g., Season 4-5 audit proposals), will automatically be assigned to the Audit and Special Mission Team without a necessary council vote.</li>\n<li>Members of the Audit and Special Mission Team may conduct intake reviews for the Optimism Mission Review team.</li>\n<li>This Team may handle highly technical material and should consist of reviewers with a technical background. Audit and Special Mission reviewers can join the Mission Review Team if and when they complete the review of relevant Audit and Special Mission proposals.</li>\n</ul>\n<h3><a name=\"milestones-and-metrics-team-6\" class=\"anchor\" href=\"https://gov.optimism.io#milestones-and-metrics-team-6\"></a>Milestones and Metrics Team:</h3>\n<ul>\n<li>\n<p><strong>Goals</strong>: assessing historical grant finalist progress on milestones and maintaining relevant council and reviewer metrics</p>\n</li>\n<li>\n<p><strong>Non-goal</strong>: not meant to be punitive for the sake of being punitive</p>\n</li>\n<li>\n<p><strong>Responsibilities</strong> :</p>\n</li>\n<li>\n<p>The Milestone and Metrics Team will maintain an orderly list of historical and pending milestones, providing a clear location for proposers to report milestones and for the community to review milestone progress Responsible for monitoring Trust Tiers</p>\n</li>\n<li>\n<p>The Team will track reviewer-level KPIs for Season 6, which shall include (but not be limited to): Reviewer comment frequency on substantive rubric components during final reviews Reviewer attendance of office hours Reviewer voting on council polls</p>\n</li>\n<li>\n<p>The Milestone and Metrics team will review the application of review rubrics for each of the other two sub-committees and offer recommendations on how rubrics can be more finely tailored to their purposes</p>\n</li>\n<li>\n<p>Reviewers on this Team may be assigned to intake reviews (e.g., intake) if the Lead determines additional capacity is needed</p>\n</li>\n<li>\n<p><strong>Reviewers</strong> : 3</p>\n</li>\n<li>\n<p><strong>Consensus</strong> : 2/3 vote unless otherwise stated.</p>\n</li>\n<li>\n<p><strong>Notes</strong>: This Team will be capable of amending milestone assessment procedures by majority vote. Changes can be vetoed by a simple majority of the full Council within five days of the proposal to change the procedures. The Milestone and Metrics Team will consider any change-of-use or change of milestone proposals from prior finalists and make recommendations to the full Council. A simple majority of the full Council reviewers (8/15) shall be required to approve a change-of-use or change of milestone proposal. The Team will have the authority to determine how many votes are needed to accept or reject milestone completion reports through its Internal Operating Procedures.</p>\n</li>\n</ul>\n<h2><a name=\"participants-7\" class=\"anchor\" href=\"https://gov.optimism.io#participants-7\"></a>Participants</h2>\n<p>All council members may be removed via the Representative Proposal type in the Operating Manual. All Council members will be required to disclose all anticipated conflicts of interest when applying to serve on the Council and all actual conflicts of interest if engaged in a vote affected by the conflict. Where a conflict is known to be present, a reviewer should recuse themselves or provide a written voting rationale if the reviewer believes that they can vote impartially.</p>\n<h2><a name=\"cohorts-and-election-terms-8\" class=\"anchor\" href=\"https://gov.optimism.io#cohorts-and-election-terms-8\"></a>Cohorts and Election Terms</h2>\n<p>Members of the Grants Council, will be elected in the Reflection Period prior to each Season. Elected members serve for the duration of the Season and must be re-elected to serve in future Seasons.</p>\n<p>Should the Grants Council determine that it needs more reviewer capacity for the Optimism Mission Review Team, the Grants Council may by the affirmative vote of ten reviewers (including all relevant review teams) opt to add additional reviewers. In this case, the reviewer with the next most votes (after the elected reviewer with the least votes) (Selected Reviewer) shall be provided the option to join the Optimism Mission Review Team with rewards pro-rated for the time that has elapsed in Season 6 prior to joining the Grants Council. Should the Selected Reviewer decline, the reviewer with the next highest number of votes after the declining Selected Reviewer shall become the Selected Reviewer. There shall be a limit of three additional reviewers added through this method after which the Lead must put forward a proposal for the election of any further reviewer.</p>\n<h2><a name=\"responsibilities-9\" class=\"anchor\" href=\"https://gov.optimism.io#responsibilities-9\"></a>Responsibilities</h2>\n<p>The Grants Council will</p>\n<ul>\n<li>Originate and process Mission Proposals proposed in accordance with the Council’s Internal Operating Procedures</li>\n<li>Review applications in regular cycles, which include a reasonable deadline for proposal submission before a review period begins</li>\n<li>Publish a report outlining grant finalists for each Intent within three days of the end of Season 6. The council should additionally publish a report at the end of each review period</li>\n<li>Use best efforts to assess whether grant recipients have met pre-defined milestones</li>\n<li>Ensure ongoing Council operations and performance are reasonably transparent to the community</li>\n</ul>\n<p>The Council Lead will oversee the general administration of the grants program and should:</p>\n<ul>\n<li>oversee the provision and/or maintenance of external and internal information about the grants program, and any other resources needed by the Council</li>\n<li>facilitate coordination across Teams by scheduling and hosting regular Council meetings. It is suggested that meeting minutes or summaries be made available to the community</li>\n<li>not vote on Council decisions or score proposals</li>\n<li>prepare regular reports to communicate grant decisions at the end of each review period to be published within a reasonable timeframe of the review period’s conclusion</li>\n<li>exercise decision-making authority in the event that sub-committees cannot come to consensus on an administrative or operational matter</li>\n</ul>\n<p>Reviewers will vote on grant proposals submitted to their Teams and should:</p>\n<ul>\n<li>have the subject matter expertise required to evaluate advanced proposals. It is recommended that at least one member of each Team have a technical background</li>\n<li>be accessible to grant applicants - within reason - to provide feedback, answer questions, and respond to comments. Reviewers should favor feedback on public channels but may provide direct feedback where doing so is efficient</li>\n<li>work with proposers to ensure proposed milestones are clear, measurable, and achievable within the specified timeframe</li>\n<li>maintain a participation rate &gt;70% on Council votes and Team meetings aim to document voting rationale for each grant that receives a substantive review</li>\n<li>provide any information required to publish regular reports and periodic updates in a timely manner</li>\n<li>dedicate sufficient time on a weekly basis to accomplish the reviewers duties</li>\n</ul>\n<h2><a name=\"accountability-10\" class=\"anchor\" href=\"https://gov.optimism.io#accountability-10\"></a>Accountability</h2>\n<p>Grants Council members will be subject to the following checks on their authority:</p>\n<ul>\n<li>All Grants Council members are subject to the Code of Conduct and the enforcement procedures outlined therein</li>\n<li>All Grants Council members will be subject to re-election if they wish to be a member for an additional Season</li>\n<li>A high degree of transparency will be required of Grants Council operations so that non-Council Token Holders are able to provide effective oversight on the Council</li>\n<li>The Grants Council will conduct a retrospective at the end of Season 6</li>\n</ul>\n<h2><a name=\"budget-11\" class=\"anchor\" href=\"https://gov.optimism.io#budget-11\"></a>Budget</h2>\n<p>A Proposed Budget and Charter will be made by each prospective Lead and voted on by Token House according to the Governance Calendar.</p>\n<p>The Lead may propose a budget that contains variable rewards for participation or non-participation provided that any variable component relates to discrete measures of reviewer or manager performance and those components are verified by the Milestone and Metrics Teams.</p>\n<h2><a name=\"additional-details-12\" class=\"anchor\" href=\"https://gov.optimism.io#additional-details-12\"></a>Additional Details</h2>\n<p>While the Council must abide by the above guidelines, specific operational and administrative details are left to the Council Lead to determine with input from Reviewers. These will be outlined in an Internal Operating Procedures (to be linked once available), which may be updated periodically as determined by the Council.</p>\n<p>The grants council will not make an explicit or implicit promotion or endorsement of the projects or their underlying products. Rather, the grants council will acknowledge which grant proposers are most suited to receive a grant given the parameters applied by the mandate of Season 6 governance. KYC and grant delivery will be managed by the Foundation for Season 6. All grants are subject to KYC review and other terms.</p>\n<h2><a name=\"iteration-13\" class=\"anchor\" href=\"https://gov.optimism.io#iteration-13\"></a>Iteration</h2>\n<p>The canonical version of the approved Charter will be published to GitHub. Any material updates to the Charter will be reflected with a new version number at the top of this document, at which point the updated version will go into effect</p>\n            <p><small>1 post - 1 participant</small></p>\n            <p><a href=\"https://gov.optimism.io/t/draft-proposed-grants-council-charter-season-6/8170\">Read full topic</a></p>","link":"https://gov.optimism.io/t/draft-proposed-grants-council-charter-season-6/8170","pubDate":"Sun, 19 May 2024 11:15:02 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"gov.optimism.io-topic-8170"},"source":{"@url":"https://gov.optimism.io/t/draft-proposed-grants-council-charter-season-6/8170.rss","#text":"[DRAFT]: Proposed Grants Council Charter - Season 6"}},{"title":"Grants Season 5, Round 2 — Data Analysis","dc:creator":"1a35e1","category":"Accountability  🗂️","description":"<p>As a grant applicant, I wanted to know where I rank in relation to other similar projects.<br>\nCurrently the ranking is somewhat opaque and not immediately easy to understand.</p>\n<p>You can see this in Reference [4], where the rubric scores were all in one cell.</p>\n<p>I did some quick analysis to get the public data that was presented into a shape that was good for data analysis.</p>\n<p>Here is link to the cleaned data.</p>\n<ul>\n<li><a href=\"https://www.dropbox.com/scl/fi/60zhgm2247rghnxgd748c/expanded-data.csv?rlkey=2x1iyzkkl8447thnxzybkoved&amp;dl=0\" class=\"inline-onebox\" rel=\"noopener nofollow ugc\">Dropbox - expanded-data.csv - Simplify your life</a></li>\n</ul>\n<p>Here is a link to a repo so anyone can reproduce/correct my work.</p>\n<ul>\n<li><a href=\"https://github.com/1a35e1/op-s5r2-data\" class=\"inline-onebox\" rel=\"noopener nofollow ugc\">GitHub - 1a35e1/op-s5r2-data</a></li>\n</ul>\n<p>Here are some quick things we can do now.</p>\n<p><img src=\"https://global.discourse-cdn.com/business7/uploads/bc41dd/original/2X/d/d8892724b6ee277b1ac2012c034d1cc9894e2b6e.png\" alt=\"image\" data-base62-sha1=\"uTyYUbxMMrfIfqvxtyDKq9r1tF4\" width=\"640\" height=\"480\"></p>\n<p></p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://global.discourse-cdn.com/business7/uploads/bc41dd/original/2X/2/278185bffbfdb996f2adcee635be1bbdc88a96f4.png\" data-download-href=\"/uploads/short-url/5Du7yJEzZuwZagd2XZLATkmvfW4.png?dl=1\" title=\"image\" rel=\"noopener nofollow ugc\"><img src=\"https://global.discourse-cdn.com/business7/uploads/bc41dd/optimized/2X/2/278185bffbfdb996f2adcee635be1bbdc88a96f4_2_559x499.png\" alt=\"image\" data-base62-sha1=\"5Du7yJEzZuwZagd2XZLATkmvfW4\" width=\"559\" height=\"499\" srcset=\"https://global.discourse-cdn.com/business7/uploads/bc41dd/optimized/2X/2/278185bffbfdb996f2adcee635be1bbdc88a96f4_2_559x499.png, https://global.discourse-cdn.com/business7/uploads/bc41dd/optimized/2X/2/278185bffbfdb996f2adcee635be1bbdc88a96f4_2_838x748.png 1.5x, https://global.discourse-cdn.com/business7/uploads/bc41dd/optimized/2X/2/278185bffbfdb996f2adcee635be1bbdc88a96f4_2_1118x998.png 2x\" data-dominant-color=\"DCD4C2\"></a></div><p></p>\n<h2><a name=\"why-bother-1\" class=\"anchor\" href=\"https://gov.optimism.io#why-bother-1\"></a>Why bother ??</h2>\n<ul>\n<li>Unpack the scoring algorithm to make it more transparent.</li>\n<li>Surface the rubric data so its suitable for analysis.</li>\n</ul>\n<h2><a name=\"goals-2\" class=\"anchor\" href=\"https://gov.optimism.io#goals-2\"></a>Goals</h2>\n<h3><a name=\"for-grant-applicants-3\" class=\"anchor\" href=\"https://gov.optimism.io#for-grant-applicants-3\"></a>For grant applicants</h3>\n<ul>\n<li>Identify the key factors that influence the ranking.</li>\n</ul>\n<h3><a name=\"for-reviewers-4\" class=\"anchor\" href=\"https://gov.optimism.io#for-reviewers-4\"></a>For Reviewers</h3>\n<ul>\n<li>Clean data for analysis, to further inform the review process.</li>\n</ul>\n<h3><a name=\"for-the-collective-5\" class=\"anchor\" href=\"https://gov.optimism.io#for-the-collective-5\"></a>For the collective</h3>\n<ul>\n<li>Increased transparency for the allocation process.</li>\n</ul>\n<h2><a name=\"references-6\" class=\"anchor\" href=\"https://gov.optimism.io#references-6\"></a>References</h2>\n<ul>\n<li>\n<p>[1] <a href=\"https://gov.optimism.io/t/cycle-22-final-grants-roundup/8086\">https://gov.optimism.io/t/cycle-22-final-grants-roundup/8086</a></p>\n</li>\n<li>\n<p>[2] Season 5 Cycle 22 Grants database, <a href=\"https://docs.google.com/spreadsheets/d/1wY_7P_m0AggVaZG1L_uh6k27iFODVcvMxc052jiXXE8/edit#gid=335563146\" rel=\"noopener nofollow ugc\">https://docs.google.com/spreadsheets/d/1wY_7P_m0AggVaZG1L_uh6k27iFODVcvMxc052jiXXE8/edit#gid=335563146</a></p>\n</li>\n<li>\n<p>[3]<a href=\"https://gov.optimism.io/t/grants-council-cycle-22-preliminary-review-roundup/8030\">https://gov.optimism.io/t/grants-council-cycle-22-preliminary-review-roundup/8030</a></p>\n</li>\n<li>\n<p>[4] Prelim &amp; Final Feedback, <a href=\"https://docs.google.com/spreadsheets/d/14OKrK8BBoCxZ2ubebit9bZjQHd_J_JkgLMzxiQnNBCM/edit#gid=928489944\" rel=\"noopener nofollow ugc\">https://docs.google.com/spreadsheets/d/14OKrK8BBoCxZ2ubebit9bZjQHd_J_JkgLMzxiQnNBCM/edit#gid=928489944</a></p>\n</li>\n</ul>\n            <p><small>3 posts - 1 participant</small></p>\n            <p><a href=\"https://gov.optimism.io/t/grants-season-5-round-2-data-analysis/8169\">Read full topic</a></p>","link":"https://gov.optimism.io/t/grants-season-5-round-2-data-analysis/8169","pubDate":"Sat, 18 May 2024 13:45:38 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"gov.optimism.io-topic-8169"},"source":{"@url":"https://gov.optimism.io/t/grants-season-5-round-2-data-analysis/8169.rss","#text":"Grants Season 5, Round 2 — Data Analysis"}},{"title":"La Causathon - Hackathon by Space4Build (Dao´s Challenge feedback)","dc:creator":"TheMvp07","category":"Feedback  💬","description":"<p><strong>Hello collective</strong> =)</p>\n<p><strong>At Space4Build</strong> we are committed to the development of the SuperChain and its collective <img src=\"https://emoji.discourse-cdn.com/twitter/red_circle.png?v=12\" title=\":red_circle:\" class=\"emoji\" alt=\":red_circle:\" loading=\"lazy\" width=\"20\" height=\"20\">, which is why we want to inform you that in addition to the initiative of the <a href=\"https://gov.optimism.io/t/new-date-15-june-conference-optimism-connection-by-space4build/8060\">Optimimsm Conection Virtual Conference</a> we are also organizing an <strong>in-person hackathon in Lima, Peru</strong>.</p>\n<p><strong>Context</strong></p>\n<p>The Causathon is an activity that seeks to <strong>generate a wonderfull experience <img src=\"https://emoji.discourse-cdn.com/twitter/dizzy.png?v=12\" title=\":dizzy:\" class=\"emoji\" alt=\":dizzy:\" loading=\"lazy\" width=\"20\" height=\"20\"> for all</strong> participants, this includes developers, volunteers, organizations and communities that are encouraged to participate and support this activity.</p>\n<p></p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://global.discourse-cdn.com/business7/uploads/bc41dd/original/2X/6/6db962f1eccf27dcb2d6e053b78d1ab05a1287d4.jpeg\" data-download-href=\"/uploads/short-url/fEFerM1SQug5OQA7enlQwPMyUPa.jpeg?dl=1\" title=\"ENGposter\" rel=\"noopener nofollow ugc\"><img src=\"https://global.discourse-cdn.com/business7/uploads/bc41dd/optimized/2X/6/6db962f1eccf27dcb2d6e053b78d1ab05a1287d4_2_690x388.jpeg\" alt=\"ENGposter\" data-base62-sha1=\"fEFerM1SQug5OQA7enlQwPMyUPa\" width=\"690\" height=\"388\" srcset=\"https://global.discourse-cdn.com/business7/uploads/bc41dd/optimized/2X/6/6db962f1eccf27dcb2d6e053b78d1ab05a1287d4_2_690x388.jpeg, https://global.discourse-cdn.com/business7/uploads/bc41dd/optimized/2X/6/6db962f1eccf27dcb2d6e053b78d1ab05a1287d4_2_1035x582.jpeg 1.5x, https://global.discourse-cdn.com/business7/uploads/bc41dd/original/2X/6/6db962f1eccf27dcb2d6e053b78d1ab05a1287d4.jpeg 2x\" data-dominant-color=\"41272A\"></a></div><p></p>\n<p><strong>Challenges</strong></p>\n<p>Challenges have been selected that we consider will allow us to attract the attention of large organizations to join the ecosystem as well as improve elements that allow the entire group to maintain themselves and continue building. The main ones are: Dao’s, Gaming, Marketing and innovation.</p>\n<p></p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://global.discourse-cdn.com/business7/uploads/bc41dd/original/2X/e/ee17a3fd00b0955b1ba3c436e609b1e580da657c.jpeg\" data-download-href=\"/uploads/short-url/xYghPOQVRJVJdbmrt7cesqdZp5W.jpeg?dl=1\" title=\"retos\" rel=\"noopener nofollow ugc\"><img src=\"https://global.discourse-cdn.com/business7/uploads/bc41dd/optimized/2X/e/ee17a3fd00b0955b1ba3c436e609b1e580da657c_2_690x388.jpeg\" alt=\"retos\" data-base62-sha1=\"xYghPOQVRJVJdbmrt7cesqdZp5W\" width=\"690\" height=\"388\" srcset=\"https://global.discourse-cdn.com/business7/uploads/bc41dd/optimized/2X/e/ee17a3fd00b0955b1ba3c436e609b1e580da657c_2_690x388.jpeg, https://global.discourse-cdn.com/business7/uploads/bc41dd/optimized/2X/e/ee17a3fd00b0955b1ba3c436e609b1e580da657c_2_1035x582.jpeg 1.5x, https://global.discourse-cdn.com/business7/uploads/bc41dd/original/2X/e/ee17a3fd00b0955b1ba3c436e609b1e580da657c.jpeg 2x\" data-dominant-color=\"463037\"></a></div><p></p>\n<p>On this occasion we would like to <strong>focus the solutions of the Dao’s challenge on the optimistic collective</strong> and for this we would like them to be able to freely express in the comments <strong>what aspects consider can be improved digitally in the collective</strong>.</p>\n<p>Below are <strong>some ideas</strong> of things that could be improved but as we already mentioned, please <strong>feel free to respectfully give your opinion</strong> and express your opinions and suggestions:</p>\n<p><strong>+Governance and decision making</strong>: low voting, centralization of power and complexity for reviewing proposals.</p>\n<p><strong>+Security and risk management</strong>: vulnerabilities in wallets and attacks on delegates.</p>\n<p><strong>+Incentives and participation</strong>: Motivation of members to participate and incentives aligned to the benefit of the group.</p>\n<p><strong>+Communication and transparency</strong>: Improvements in communication channels and transparency in decision making.</p>\n<p><strong>+Financial sustainability</strong>: Fund management and mechanisms for additional financing resources for the SuperChain.</p>\n<p><strong>We hope to receive your comments</strong> and from Space4Build we will continue making efforts to contribute to a better community. <img src=\"https://emoji.discourse-cdn.com/twitter/slightly_smiling_face.png?v=12\" title=\":slightly_smiling_face:\" class=\"emoji\" alt=\":slightly_smiling_face:\" loading=\"lazy\" width=\"20\" height=\"20\"></p>\n<p><strong>Contact channels:</strong></p>\n<p>Twitter: <span class=\"mention\">@Space4Build</span><br>\nInstagram: Space4Build<br>\nWarpcast: <span class=\"mention\">@Builderland</span><br>\nEmail: <a href=\"mailto:space4build@gmail.com\">space4build@gmail.com</a><br>\nWebsite: <a href=\"https://space4build.xyz/\" rel=\"noopener nofollow ugc\">https://space4build.xyz/ </a></p>\n            <p><small>1 post - 1 participant</small></p>\n            <p><a href=\"https://gov.optimism.io/t/la-causathon-hackathon-by-space4build-dao-s-challenge-feedback/8168\">Read full topic</a></p>","link":"https://gov.optimism.io/t/la-causathon-hackathon-by-space4build-dao-s-challenge-feedback/8168","pubDate":"Sat, 18 May 2024 03:31:52 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"gov.optimism.io-topic-8168"},"source":{"@url":"https://gov.optimism.io/t/la-causathon-hackathon-by-space4build-dao-s-challenge-feedback/8168.rss","#text":"La Causathon - Hackathon by Space4Build (Dao´s Challenge feedback)"}},{"title":"[FINAL] Code of Conduct Council (CoCC) Operating Budget for Season 6","dc:creator":"juankbell","category":"Renewal","description":"<h1><a name=\"context-1\" class=\"anchor\" href=\"https://gov.optimism.io#context-1\"></a>Context:</h1>\n<p>A Code of Conduct Council (CoCC) was<a href=\"https://gov.optimism.io/t/code-of-conduct-councils/6888\">  created</a> in Season 5 to experiment with decentralizing the enforcement of the Code of Conduct.</p>\n<p>Since then, the Code of Conduct has been <a href=\"https://gov.optimism.io/t/season-6-code-of-conduct-rescoping-2/8101\">rescoped twice</a>, reducing the responsibilities of the Code of Conduct Council. You can find the retrospective of the Season 5 Code of Conduct Council <a href=\"https://gov.optimism.io/t/code-of-conduct-council-retrospective-season-5/8064\">here</a>.</p>\n<p>Follow this next thread If you would like to know about the <a href=\"https://gov.optimism.io/t/season-6-elections-code-of-conduct-council/8120\">election</a> process or <a href=\"https://gov.optimism.io/t/season-6-nominations-code-of-conduct-council/8118\">nominate</a> yourself to this council in season 6.</p>\n<hr>\n<p>Councils may be authorized by the Foundation for an initial pilot period -at least one Season- (season 5) After this pilot, representative structures must be renewed by governance for a subsequent Season (the Code of Conduct Council is in this stage.) If successfully renewed this Season, the CoCC will become a persistent structure in the Collective, assumed to continue unless/until a Council Dissolution proposal is put forward.</p>\n<p>Given the above rescoping, if renewed for Season 6, the Code of Conduct Council would have a scope limited to enforcing the Rules of Engagement, which govern the usage of all Optimism hosted platforms.</p>\n<ul>\n<li>\n<p>If delegates believe an elected Code of Conduct Council should enforce the Rules of Engagement, delegates should vote to approve a Code of Conduct Council Operating Budget. If delegates do not believe an elected Council is necessary to enforce the Rules of Engagement, they should not approve any associated operating budget.</p>\n</li>\n<li>\n<p>In the event that an operating budget is not approved for a Code of Conduct Council, the supportNERDs will continue to monitor the forum and enforce the Rules of Engagement as they previously have. supportNERDs are not selected by the Foundation, but rather operate as an open contribution path. If any decisions made by the supportNERDs are questioned, they may be appealed to a third party (likely the party contracted to provide mediation services.)</p>\n</li>\n</ul>\n<p>All prospective Leads may propose a Code of Conduct Council Operating Budget for Season 6. Delegates that believe the Council should be renewed, should only vote to approve one Code of Conduct Council Operating Budget. The budget proposal with the highest proportion of “Yes” votes will be approved. Delegates are effectively electing the Lead who has authored an approved budget. If continued, the rest of the members of the CoCC will be elected, according to the process outlined here.</p>\n<p><strong>Proposal drafts, with 4 delegate approvals, are due by May 22nd at 19:00 GMT.</strong></p>\n<p>Please see the <a href=\"https://gov.optimism.io/t/season-6-collective-reward-framework/8112\">Collective Reward Guidelines</a> for help evaluating budget requests.</p>\n<hr>\n<h1><a name=\"code-of-conduct-council-operating-budget-season-6-2\" class=\"anchor\" href=\"https://gov.optimism.io#code-of-conduct-council-operating-budget-season-6-2\"></a>Code of Conduct Council Operating Budget (Season 6)</h1>\n<hr>\n<p><strong>Proposed Council Lead: Juan Carlos Bell</strong></p>\n<p><strong>Proposed Council Operating Budget: 55.000 OP (+37.000 OP increase from last Season)</strong></p>\n<p>Contact Info: (<a class=\"mention\" href=\"https://gov.optimism.io/u/juankbell\">@juankbell</a> Op forum) - (<a href=\"https://x.com/Bellcho\" rel=\"noopener nofollow ugc\">@bellcho</a> X) - juankbell (Discord) -</p>\n<p><strong>- Please link to any previous work or qualifications to be Council Lead:</strong></p>\n<p><a href=\"https://regenscore.io/share/0x7d547666209755FB833f9B37EebEa38eBF513Abb\" rel=\"noopener nofollow ugc\">Regenscore</a>: My on-chain interaction has been mostly in Optimism, ETH mainnet, and Gnosis chain, contributing actively to many projects in the web3 space Since 2019.</p>\n<p><a href=\"https://gov.optimism.io/t/how-do-you-feel-about-a-conflict-committee/3117/14\">First forum post in OP forum</a>: My first interaction with the OP forum was precisely supporting the idea of a conflict committee, back in Oct 2022.</p>\n<p><a href=\"https://github.com/ethereum-optimism/ecosystem-contributions/issues/2\" rel=\"noopener nofollow ugc\">RFP # 2:</a> (2023) I posted a proposal in the name of Gravity DAO, supporting the implementation of code of conduct enforcement solutions in the optimism collective, improving governance accessibility, and minimizing governance overhead from the foundation, which at that point was managing Code of conduct violations via token voting. Implementation of the solution by the end of Season 4.</p>\n<p><a href=\"https://www.youtube.com/watch?v=60mkU28TTJg&amp;list=PL0LGQUgClaRg4zH_bWEYxPhUc0_Beinwf\" rel=\"noopener nofollow ugc\">Graviton training in Optimism playlist</a>: Playlist from the live training we did in season 4 (August and Sept 2023) for the Optimism community, as part of the above-mentioned RFP. Here are the <a href=\"https://docs.google.com/presentation/d/1FVETL_QZxYia819CGfIh6JiXv7OHCXVdpu_pRXiI3ms/edit#slide=id.g25fa6367006_1_239\" rel=\"noopener nofollow ugc\">Slides</a> used</p>\n<p><a href=\"https://gravitydao.org/course/graviton-introductory-course/\" rel=\"noopener nofollow ugc\">Graviton free online course</a>: Free online course about conflict management and trust creation, available in 5 languages.</p>\n<p><a href=\"https://collectors.poap.xyz/scan/juankbell.eth\" rel=\"noopener nofollow ugc\">Graviton POAPs</a>: Certifications for multiple trainings in diverse communities, since 2020.</p>\n<p><a href=\"https://vote.optimism.io/proposals/102821998933460159156263544808281872605936639206851804749751748763651967264110\" rel=\"noopener nofollow ugc\">Member of the first Code of Conduct council</a> via public nomination and token vote.</p>\n<p><a href=\"https://gov.optimism.io/t/code-of-conduct-council-communication-thread/7453\">Season 5 Code of Conduct communication thread.</a> Communication thread from past seasons CoC Council in Optimism.</p>\n<p><strong>-   Links to relevant work experience</strong></p>\n<p>I have experience leading and shaping groups, managing conflict individually and collectively, and working on intentionally developing trust in spaces. I think I am qualified to lead</p>\n<ul>\n<li>\n<p><a href=\"https://www.linkedin.com/in/juan-carlos-bell-llin%C3%A1s-/?locale=en_US\" rel=\"noopener nofollow ugc\">Linkedin</a>. Political Scientist, Mg. in Alternative Dispute Resolution,</p>\n</li>\n<li>\n<p>Worked in Human Resources at 2 in Universities Colombia.</p>\n</li>\n<li>\n<p>Stewarded the launch and commons upgrade of <a href=\"https://tecommons.org/\" rel=\"noopener nofollow ugc\">TEC</a> with the implementation of Ostrom’s principles in its design. <a href=\"https://abcswap.xyz/#/tec\" rel=\"noopener nofollow ugc\">TEC’s bonding</a> curve is now on Optimism.</p>\n</li>\n<li>\n<p>Leading <a href=\"https://gravitydao.org/\" rel=\"noopener nofollow ugc\">Gravity DAO</a> as an organization that provides coordination solutions and continued education to Web3 communities.</p>\n</li>\n<li>\n<p>Supporting the development of the Ethereum Community in Colombia (<a href=\"https://twitter.com/EthColombia\" rel=\"noopener nofollow ugc\">Ethcolombia X</a>)</p>\n</li>\n</ul>\n<p><strong>Council Charter:</strong></p>\n<ul>\n<li>\n<p>Link to original Charter: <a href=\"https://gov.optimism.io/t/code-of-conduct-councils/6888#token-house-code-of-conduct-council-charter-1\">Season 5 Charter</a></p>\n</li>\n<li>\n<p>Link to <a href=\"https://gov.optimism.io/t/code-of-conduct-council-internal-procedures/7341\">internal procedures </a></p>\n</li>\n<li>\n<p>The Season 6 Charter will need to be updated as described in this proposed operating budget, to account for the following changes in Scope:</p>\n<ul>\n<li>\n<p>The Charter of the Council will need to be updated in season 6</p>\n</li>\n<li>\n<p>The Code of Conduct Council will only oversee the Rules of Engagement</p>\n</li>\n<li>\n<p>As such, the decisions of the Code of Conduct Council will no longer be subject to optimistic approval by governance</p>\n</li>\n<li>\n<p>All members will be accountable to governance as they remain removable via the Representative Removal proposal type outlined in the Operating Manual</p>\n</li>\n<li>\n<p>Integrate feedback about improving the readability of public documents related to the code of conduct council and the processing of conflicts for simplicity and clarity.</p>\n</li>\n</ul>\n</li>\n</ul>\n<h1><a name=\"breakdown-of-board-operating-budget-3\" class=\"anchor\" href=\"https://gov.optimism.io#breakdown-of-board-operating-budget-3\"></a>Breakdown of Board Operating Budget:</h1>\n<p><strong>Subcommittee 1: Code of Conduct Council</strong></p>\n<p>The community is reminded to report any harassment or discrimination and to stay vigilant against scams and phishing attempts.</p>\n<p>The Code of Conduct Council is available to facilitate discussions and provide feedback, and changes to the Code of Conduct and Rules of Engagement for transparency and coherence.</p>\n<p>Violations can be reported using platform tools, processed by NERDs or govNERDs for users, or through specific forms for delegates or Citizens. Since the Rules of Engagement apply to anyone using Optimism-hosted platforms, there is no distinction between Token House and Citizens’ House - the CoCC would enforce the Rules of Engagement for everyone, regardless of House, with penalties ranging from warnings to potential permanent removal.</p>\n<p><strong>Number of Council Members = 5 (40.000 OP total) (+ 25.000 increase from last Season)</strong></p>\n<p><strong>(8.000 OP each)</strong></p>\n<p>Council members should be elected by the community via public nomination, and be present and available to process any case that arises in the community during the season. Individuals with this role must have experience and knowledge managing complexity in human groups, distinguishing for their ethical and professional behavior.</p>\n<p>Rationale: <a href=\"https://gov.optimism.io/t/season-6-collective-reward-framework/8112\">Impact 7</a></p>\n<ul>\n<li>\n<p>Council members, with voice and vote to implement the rules of engagement and process conflicting cases in the community.</p>\n</li>\n<li>\n<p>In season 5, there was a stipend of 3.000 OP per council member, the augment of the rewards is because the amount of work and specialty in this role is high and the incentive to participate actively in the community was low for the council members. The council would be primarily rewarded retroactively, so this is fair for the time and effort required to participate in the council during the whole season, avoiding incentives to conflict or bureaucracy.</p>\n</li>\n</ul>\n<p><strong>-   All Council members should:</strong></p>\n<ul>\n<li>\n<p>Process all Code of Conduct Violation reports by the end of the nearest review period. If the end of the nearest review period is less than 3 days away, the report may be processed by the end of the next nearest review period.</p>\n</li>\n<li>\n<p>Publish a summary of any enforcement decisions made during the Voting Cycle to the forum by the end of the review period of each voting cycle (Wednesday at 19:00 GMT.).</p>\n</li>\n<li>\n<p>Participate in the election of the supportNERDs from the shadow council and in the distribution of loads in the team to support the lead in the synthesis, keeping track of internal work, the gathering of information, scheduling, organizing, and management of the council’s platforms for fast responses to the needs of the collective.</p>\n</li>\n</ul>\n<p><strong>Council Lead = 1  (10.000 OP total) (+ 7000 increase from last Season)</strong></p>\n<p>The council lead will be the author of this proposal, in the case it is successfully endorsed by delegate approval in the forum and subsequent governance vote.</p>\n<ul>\n<li>\n<p>The council lead will only vote when there is no majority in the council.</p>\n</li>\n<li>\n<p>The lead has the additional responsibilities of stewarding the team through voting decisions and cycles, while communicating with the foundation, and all other governance efforts, councils, and commissions in Optimism. The lead has to comply with the deadlines for communicating decisions and recommendations from the cases observed to feedback and reflection instances. The leader has to keep updated internal documents, procedures, and platforms within the team.</p>\n</li>\n</ul>\n<p><strong>-   The Council Lead should:</strong></p>\n<ul>\n<li>\n<p>Facilitate coordination of review and host regular Council meetings, which should occur at least once per Voting Cycle in which reports are filed. It is suggested that meeting minutes or summaries be made available to the community.</p>\n</li>\n<li>\n<p>Exercise decision-making authority if the Council cannot come to a consensus on an administrative or operational matter (ie. act as a tiebreaker)</p>\n</li>\n<li>\n<p>Become a point of contact for the support nerds that compose the shadow council and the council members.</p>\n</li>\n<li>\n<p>Become a point of contact for the foundation, commission, councils, and all governance efforts in Optimism with the code of conduct council.</p>\n</li>\n</ul>\n<p><strong>Subcommittee 2: SupportNERDs / Shadow council</strong></p>\n<p>A group of SupportNERDs matching the number of council members 1 to 1 composing a shadow council that acts as a viewer of the code of conduct council, and a contact point between the council and community moderators who can facilitate access to information. We think this is a great way of supporting the contribution path and allowing more people to get involved with OP governance while increasing the reach of sight of the council, and connecting it positively to the overall moderation of platforms.</p>\n<p><strong>-   Number of supportNERDs = 5 (5.000 OP total) (new in season 6) (1.000 each)</strong></p>\n<p>Contribution paths may be supported via a combination of bounties, via Foundation or Delegate Mission Requests, but are best suited to Retro Funding in the longer term. Contribution paths are led by “Maintainers,” which are similar to “Leads” on Councils.</p>\n<p>Rationale: <a href=\"https://gov.optimism.io/t/season-6-collective-reward-framework/8112\">Impact 3</a></p>\n<p><strong>-   This group of supportNERDs should:</strong></p>\n<ul>\n<li>\n<p>Participate with voice but not vote in council meetings. Playing the role of monitors of the council, and first filter on platforms.</p>\n</li>\n<li>\n<p>Raise relevant cases arising in the community to the council.</p>\n</li>\n<li>\n<p>Be elected by vote of the council members between a pool of available and interested SupportNERDs.</p>\n</li>\n</ul>\n<hr>\n<h1><a name=\"how-should-governance-participants-measure-the-councils-impact-and-ensure-its-execution-on-its-charter-4\" class=\"anchor\" href=\"https://gov.optimism.io#how-should-governance-participants-measure-the-councils-impact-and-ensure-its-execution-on-its-charter-4\"></a>How should governance participants measure the Council’s impact, and ensure its execution on its Charter?</h1>\n<p><strong>Reporter Experience KPIs:</strong></p>\n<ul>\n<li>\n<p>Response time and response rate on filed reports</p>\n</li>\n<li>\n<p>Number of reports that de-escalate without enforcement actions and the number of reports with enforcement actions.</p>\n</li>\n<li>\n<p>Accountability and transparency around the due processing of cases with recurrent posting on the forum.</p>\n</li>\n<li>\n<p>Number of updates to charters and operating procedures to match the functionality of the council to the evolving seasonal nature of Optimism.</p>\n</li>\n<li>\n<p>Availability and ease of access to the council with monthly office hours, where the community can raise or get information on cases processed.</p>\n</li>\n</ul>\n<p><strong>Performance KPIs:</strong></p>\n<ul>\n<li>\n<p>Number of community members that disengage/resign/offboard due to unmanaged conflict</p>\n</li>\n<li>\n<p>None, or least amount of token votes regarding Conflict management actions related to implementing rules of engagement. (As council members remain removable via the Representative Removal proposal, it is desired to not have any member removed or signaled through that mechanism)</p>\n</li>\n<li>\n<p>Separate the collective from the visibility of conflicts and their outcomes.</p>\n</li>\n<li>\n<p>Mid and end-season feedback from the supportNERDs on the activity of the council. Shared in the forum.</p>\n</li>\n<li>\n<p>Mid and end-season analysis from the council about patterns identified in cases, to signal improvement opportunities. Shared in the forum.</p>\n</li>\n</ul>\n<hr>\n<p>Consistent with other reward allocations, all rewards will be subject to a KYC and claims flow process.</p>\n<h2><a name=\"what-does-this-mean-for-delegates-5\" class=\"anchor\" href=\"https://gov.optimism.io#what-does-this-mean-for-delegates-5\"></a>What Does This Mean for Delegates?</h2>\n<p>Please see Code of Conduct <a href=\"https://gov.optimism.io/t/season-6-code-of-conduct-rescoping-2/8101\">Rescoping #2</a> before voting on this proposal.</p>\n<p>Delegates will vote on a Code of Conduct Council Operating Budget in Special Voting Cycle <span class=\"hashtag-raw\">#23a</span>. Approving a Code of Conduct Budget elects the proposal author as the Council Lead. If approved, delegates will vote to elect Council members in Special Voting Cycle <span class=\"hashtag-raw\">#23b</span> as outlined here.</p>\n<p>If you do not wish to renew the Code of Conduct Council, do not approve any operating budget proposals. In this case, the supportNERDs will continue to monitor the forum and enforce the Rules of Engagement as they previously have. If any decisions made by the supportNERDs are questioned, they may be appealed to a third party (likely the party contracted to provide mediation services.)</p>\n<p>__</p>\n<p><strong>If you like this proposal and you are a delegate, please express us your approval by replying to this post before May 22nd at 19:00 GMT.</strong> <img src=\"https://emoji.discourse-cdn.com/twitter/slight_smile.png?v=12\" title=\":slight_smile:\" class=\"emoji\" alt=\":slight_smile:\" loading=\"lazy\" width=\"20\" height=\"20\"></p>\n            <p><small>22 posts - 15 participants</small></p>\n            <p><a href=\"https://gov.optimism.io/t/final-code-of-conduct-council-cocc-operating-budget-for-season-6/8167\">Read full topic</a></p>","link":"https://gov.optimism.io/t/final-code-of-conduct-council-cocc-operating-budget-for-season-6/8167","pubDate":"Fri, 17 May 2024 20:33:14 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"gov.optimism.io-topic-8167"},"source":{"@url":"https://gov.optimism.io/t/final-code-of-conduct-council-cocc-operating-budget-for-season-6/8167.rss","#text":"[FINAL] Code of Conduct Council (CoCC) Operating Budget for Season 6"}}]}}}