{"rss":{"@version":"2.0","@xmlns:discourse":"http://www.discourse.org/","@xmlns:atom":"http://www.w3.org/2005/Atom","@xmlns:dc":"http://purl.org/dc/elements/1.1/","channel":{"title":"Rocket Pool Governance - Latest topics","link":"https://dao.rocketpool.net/latest","description":"Latest topics","language":"en-GB","lastBuildDate":"Fri, 10 May 2024 03:54:28 +0000","atom:link":{"@href":"https://dao.rocketpool.net/latest.rss","@rel":"self","@type":"application/rss+xml"},"item":[{"title":"Liquity Incentive Vibe Check","dc:creator":"Valdorff","category":"Growth","description":"<p>Hi folks!</p>\n<p>I talked with Liquity a bit, partly with my IMC hat on, and more with just a community member hat on.</p>\n<p>I wanted to see how the DAO feels about providing incentives for their product</p>\n\nLiquity Intro (including v2) <a href=\"https://dao.rocketpool.net/t/liquity-incentive-vibe-check/2975/1\">(click for more details)</a>\n<p>So why do we want rETH involved?</p>\n<ul>\n<li>Useful to be able to borrow against it, ofc</li>\n<li>The dynamic interest rate things allows for the market to have a strong voice (vs, eg, Maker where the interest rates are set by governance)</li>\n<li>We try to steer clear of “degen leverage”; while this does allow it, the inclusion of the stability pool helps mitigate damage from this kind of use.</li>\n<li>We have very little liquidity against USDlike on-chain (and a ton off-chain); would it help to add some on-chain?</li>\n<li>Good brand relationship for both of us</li>\n</ul>\n<h2><a name=\"paths-1\" class=\"anchor\" href=\"https://dao.rocketpool.net#paths-1\"></a>Paths</h2>\n<p>Liquity are asking for help bootstrapping the first year, and then hope to be self sustaining. I will purposely give a broad set here, without presenting my own opinion. For context, IMC’s current spend is ~$350k/period (periods are 28 days). It was somewhat higher when the RPL ratio was higher because we’ve been trying to run lean to preserve runway. It fluctuates somewhat with ETH price, as we track most expenses in ETH (and a couple in RPL).</p>\n<p>What are some paths we could take?</p>\n<ul>\n<li>IMC could provide on the order of 8E=$24k/period incentives to rETH/BOLD\n<ul>\n<li>Context: this would be about a tenth of our total rETH/ETH mainnet spend</li>\n<li>Context: this would be a bit over half our L2 rETH/ETH spend</li>\n<li>Context: this would be half our spend on PancakeSwap’s mainnet rETH/ETH concentrated liquidity</li>\n<li>Context: this would be 3.5x our spend on RPL/ETH</li>\n<li>Can the IMC do this: This is a lot. I’d want an explicit voted pDAO direction for this.</li>\n</ul>\n</li>\n<li>IMC could provide on the order of 2.5E=$7.5k/period incentives to rETH/BOLD\n<ul>\n<li>Context: this would be similar to the spend on RPL/ETH</li>\n<li>Context: this would be about half the spend of rETH/ETH on <em>one</em> L2</li>\n<li>Can the IMC do this: The IMC charter doesn’t cover USDlike at all, though it does talk about “access to rETH across major DeFi protocols” and “build rETH exchange volume”. This is an amount I’d feel comfortable moving on with either strong support in forums and other casual channels <em>or</em> a vote.</li>\n</ul>\n</li>\n<li>We could provide funds for stability pool incentives\n<ul>\n<li>The rough expectation is that incentives here improve the peg and thus ten to reduce interest rates indirectly</li>\n<li>In a leverage cascade, a healthy stability pool acts as a buffer\n<ul>\n<li>The IMC is generally not a big fan of leverage (and especially incentivizing it) due to the potential for cascades.</li>\n</ul>\n</li>\n<li>Can the IMC do this: I think this would need a vote, either to have someone else do it, or to tell the IMC to do it despite being a bit outside the usual remit.</li>\n</ul>\n</li>\n<li>Nothing\n<ul>\n<li>We determine we won’t provide incentives at this time due to some combo of being USDlike, encouraging leverage, etc</li>\n</ul>\n</li>\n</ul>\n<p>There would be some open questions: Do we provide more budget to IMC for this? Does IMC have control at all, eg, to spend less if they judge that appropriate? Should we explore starting aggressive and ramping down instead of uniform? What level do we actually want (the bullets are rough examples, not the only options)?</p>\n<p>For now, I’m looking for high level vibes, and we can figure out details if there’s enough interest to make that sensible.</p>\n            <p><small>5 posts - 4 participants</small></p>\n            <p><a href=\"https://dao.rocketpool.net/t/liquity-incentive-vibe-check/2975\">Read full topic</a></p>","link":"https://dao.rocketpool.net/t/liquity-incentive-vibe-check/2975","pubDate":"Fri, 10 May 2024 03:54:28 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"dao.rocketpool.net-topic-2975"},"source":{"@url":"https://dao.rocketpool.net/t/liquity-incentive-vibe-check/2975.rss","#text":"Liquity Incentive Vibe Check"}},{"title":"Interval 22 post-mortem","dc:creator":"Patches","category":"Governance","description":"<p>Disclaimer first:</p>\n<ul>\n<li>What follows is my interpretation of the events that led to interval 22 producing what social consensus has deemed a bugged tree</li>\n<li>Financial impact is so trivial that even if we set up a way to correct it, the gas cost of doing so would greatly exceed the the remuneration</li>\n<li>RPL rewards were correct, only the smoothing pool was impacted</li>\n<li><strong>Voting against v9 will not fix anything, this issue is present in all previous versions</strong></li>\n</ul>\n<hr>\n<p>Interval 22 was just completed and, as <a class=\"mention\" href=\"https://dao.rocketpool.net/u/langers\">@langers</a> mentioned in the protocol channel on discord:</p>\n<blockquote>\n<p><strong>rewards are safe but the calculation doesn’t align with the <code>v8</code> spec for this interval (22), impact on node operators is insignificant (~0.000001 ETH per minipool opted into the Smoothing Pool) but we are letting you know.</strong></p>\n</blockquote>\n<p>The disparity arises from a few attestations which were included more than 32 slots after their assignment. These attestations arrived late, and the rolling-records implementation of treegen in watchtower treated them as missed, while the non-rolling-records implementation of treegen in watchtower <em>and</em> <a class=\"mention\" href=\"https://dao.rocketpool.net/u/ramana\">@ramana</a> 's independent implementation treated them as valid.</p>\n<h2><a name=\"timeline-of-events-1\" class=\"anchor\" href=\"https://dao.rocketpool.net#timeline-of-events-1\"></a>Timeline of events</h2>\n<ol>\n<li>The treegen spec in its original form didn’t establish a deadline for attestations, it established a methodology for counting attestations that set an implicit limit to one epoch.</li>\n<li>v6 updated this methodology to make the boundary explicitly inclusive</li>\n<li>Joe created the rolling-records implementation to enforce that deadline, but forgot to update the non-rolling-records implementation</li>\n<li>Deneb included <a href=\"https://eips.ethereum.org/EIPS/eip-7045\" class=\"inline-onebox\" rel=\"noopener nofollow ugc\">EIP-7045: Increase max attestation inclusion slot</a> which extended the deadline for attestation inclusion, making the non-rolling-records implementation trivially aligned with the beacon spec, but leaving the rolling-records implementation and ramana’s implementation correct per the rewards spec - albeit tacitly diverging from social consensus and the beacon spec</li>\n<li>A preview tree detected the issue, but Ramana nor I realized the spec still specified a 32 slot deadline, so Ramana updated his implementation to match the non-rolling-records implementation</li>\n<li>An unrelated bug in treegen forced the oDAO off of rolling records for interval 21, so the interval 21 tree actually diverged from the spec, but matched ‘social consensus’ and the beacon spec</li>\n<li>The bug in step 6 was fixed and the oDAO switched back to rolling-records for interval 22 and produced a tree that matched the spec but not social consensus nor the beacon spec</li>\n</ol>\n<p>The result of this is that no matter which specification you believe is correct (the one that follows the written language of the v8 RPIP, or the one that follows the unwritten social consensus on how to handle late attestations), at least one interval was finalized with the <em>other</em> methodology.</p>\n<hr>\n<h2><a name=\"updating-the-spec-2\" class=\"anchor\" href=\"https://dao.rocketpool.net#updating-the-spec-2\"></a>Updating the spec</h2>\n<p>The spec says:</p>\n<blockquote>\n<ol>\n<li>Look at the attestations in the subsequent blocks with matching <code>slotIndex</code>, <code>committeeIndex</code>, and <code>position</code>. Start at the block directly after <code>slotIndex</code>, and look up to 1 Epoch away (<code>BeaconConfig.SlotsPerEpoch</code>) from <code>slotIndex</code>.\n<ol>\n<li>If one was recorded in <em>any of these blocks</em>, this attestation was successful. Calculate the <code>minipoolScore</code> for this attestation as described below.</li>\n<li>If the attestation was not found, it was missed. Add it to a running list of <code>missedAttestations</code>.</li>\n<li>The boundary is inclusive, so if an attestation for slot <code>n</code> is found in slot <code>n + BeaconConfig.SlotsPerEpoch</code> then it was successful. If it was found in slot <code>n + BeaconConfig.SlotsPerEpoch + 1</code>, it is too late and should be considered missed.</li>\n</ol>\n</li>\n</ol>\n</blockquote>\n<p>This is, in my view, overly descriptive, and <strong>we can simply amend the spec to say that attestations are considered valid if they are valid for the fork in which they’re assigned</strong>, with an explanation that EIP-7045 in Deneb changed the criteria from a 32 slot deadline to a deadline at the end of the epoch following the assignment.</p>\n<p>Please opine on how you think this should be corrected in the following sentiment poll:</p>\n<p><a href=\"https://dao.rocketpool.net/t/interval-22-post-mortem/2974/1\">Click to view the poll.</a></p>\n<p>I am explicitly in favor of amending the RPIPs via errata. We can have this done in a day.</p>\n<p>The alternative is:</p>\n<ol>\n<li>Correcting treegen to consistently follow the spec in both implementations (quick)</li>\n<li>Passing an RPIP to create a new version of the rewards spec that updates attestation criteria (3 weeks)</li>\n<li>Releasing a new version of watchtower to the odao (2 to 6 weeks depending on the timing)</li>\n</ol>\n<p>Given the financial scope of the change, if we can’t fix this via errata, I would probably prefer correcting treegen to match the spec as-is and wait until a v10 proposal is created for some other reason and piggy-back the attestation eligibility changes into that proposal.</p>\n<p>Keep in mind that even if you are an absolute purist, it is too late to amend intervals 22 and 21 for consistency. If we have to go the new-RPIP route, the benefits of a clean history will not be retroactive.</p>\n            <p><small>3 posts - 3 participants</small></p>\n            <p><a href=\"https://dao.rocketpool.net/t/interval-22-post-mortem/2974\">Read full topic</a></p>","link":"https://dao.rocketpool.net/t/interval-22-post-mortem/2974","pubDate":"Thu, 09 May 2024 17:21:38 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"dao.rocketpool.net-topic-2974"},"source":{"@url":"https://dao.rocketpool.net/t/interval-22-post-mortem/2974.rss","#text":"Interval 22 post-mortem"}},{"title":"Round 13 - GMC Call for Retrospective Applications - Deadline is June 7","dc:creator":"ShfRyn","category":"Grants / Bounties","description":"<p>This thread is for applications for Rocket Pool’s May 7, 2024 - June 7, 2024 retrospective awards. Please only post retrospective award applications in this thread. If you would like to discuss and/or ask questions about any applications you see in this thread, we ask that you do so in this <a href=\"https://dao.rocketpool.net/t/round-13-gmc-community-discussion-of-submitted-applications/2968/1\">separate forum thread</a> which has been established for all community discussions related to this round of applications. Only those grant applications that are posted in this thread and timestamped by June 7, 2024 at 23:59 (11:59 PM) UTC will be considered. Any retrospective award applications posted after that deadline will be carried over to the next award period.</p>\n<p>This is the expected schedule for round 13:</p>\n<ul>\n<li>Application Period (May 7th - June 7th)</li>\n<li>Negotiation Period (June 8th - June 24th)</li>\n<li>Scoring Deadline (June 25th)</li>\n<li>Final Voting Amendments, Discussion and Finalization (June 26th - June 29th)</li>\n<li>Award Announcement (June 30th)</li>\n</ul>\n<p>To guide you in your application, the GMC has established the following goals and the following scoring rubric:</p>\nGMC Goals <a href=\"https://dao.rocketpool.net/t/round-13-gmc-call-for-retrospective-applications-deadline-is-june-7/2971/1\">(click for more details)</a>\nRetrospective Award Rubric <a href=\"https://dao.rocketpool.net/t/round-13-gmc-call-for-retrospective-applications-deadline-is-june-7/2971/1\">(click for more details)</a>\n<h2><a name=\"retrospective-award-application-template-1\" class=\"anchor\" href=\"https://dao.rocketpool.net#retrospective-award-application-template-1\"></a>Retrospective Award Application Template</h2>\n<p>Please copy paste the template below into a reply. Answer the questions there, feel free to remove or add sections based on relevance.</p>\n<pre><code class=\"lang-auto\">## Name of Retrospective Award\n\n### Who is the proposed retrospective award recipient?\n\n### What specific project or work is the retrospective award in recognition of? Please detail what the project or work entailed and the duration over which it took place.\n\n### Are the subjects of this award entirely open source ([MIT](https://opensource.org/licenses/MIT), [GPL](https://www.gnu.org/licenses/gpl-3.0.en.html), [Apache](https://www.apache.org/licenses/LICENSE-2.0), [CC BY](https://creativecommons.org/licenses/by/4.0/) license or similar)? If not, which parts will not be, why, and under what license will they be published?\n\n\n\n## Benefit\n\n&lt;please enter N/A where appropriate&gt;\n\n| Group | Benefits |\n|---|---|\n| Potential rETH holders | How did the project or work for which the retrospective award would be given help people looking to stake ETH for rETH? |\n| rETH holders | How did the project or work for which the retrospective award would be given help rETH holders? |\n| Potential NOs | How did the project or work for which the retrospective award would be given help people looking to run a Rocket Pool node for the first time? |\n| NOs | How did the project or work for which the retrospective award would be given help people already running a Rocket Pool node? |\n| Community |  How did the project or work for which the retrospective award would be given how does this help the Rocket Pool community? |\n| RPL holders |  How did the project or work for which the retrospective award would be given how does this help RPL holders? |\n\n\n\n## Costs\n\n### How much USD $ is the applicant requesting be awarded to the recipient?\n\n### Is the applicant requesting RPL or LUSD?\n\n\n\n## Conflict of Interest\n\n### Does the person or persons requesting the retrospective award have any conflicts of interest to disclose? (Please disclose here if you are a member of the GMC or if you have nominated a member of the GMC for this retrospective award).\n</code></pre>\n            <p><small>1 post - 1 participant</small></p>\n            <p><a href=\"https://dao.rocketpool.net/t/round-13-gmc-call-for-retrospective-applications-deadline-is-june-7/2971\">Read full topic</a></p>","link":"https://dao.rocketpool.net/t/round-13-gmc-call-for-retrospective-applications-deadline-is-june-7/2971","pubDate":"Wed, 08 May 2024 00:24:10 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"dao.rocketpool.net-topic-2971"},"source":{"@url":"https://dao.rocketpool.net/t/round-13-gmc-call-for-retrospective-applications-deadline-is-june-7/2971.rss","#text":"Round 13 - GMC Call for Retrospective Applications - Deadline is June 7"}},{"title":"Round 13 - Call For Bounty Applications - Deadline is June 7","dc:creator":"ShfRyn","category":"Grants / Bounties","description":"<p>This thread is for applications for Rocket Pool’s May 7, 2024 - June 7, 2024 bounties. Please only post bounty applications in this thread. If you would like to discuss and/or ask questions about any applications you see in this thread, we ask that you do so in this <a href=\"https://dao.rocketpool.net/t/round-13-gmc-community-discussion-of-submitted-applications/2968/1\">separate forum thread</a> which has been established for all community discussions related to this round of applications. Only those grant applications that are posted in this thread and timestamped by June 7, 2024 at 23:59 (11:59 PM) UTC will be considered. Any bounties posted after that deadline will be carried over to the next award period.</p>\n<p>This is the expected schedule for round 13:</p>\n<ul>\n<li>Application Period (May 7th - June 7th)</li>\n<li>Negotiation Period (June 8th - June 24th)</li>\n<li>Scoring Deadline (June 25th)</li>\n<li>Final Voting Amendments, Discussion and Finalization (June 26th - June 29th)</li>\n<li>Award Announcement (June 30th)</li>\n</ul>\nDifferences Between Grants and Bounties <a href=\"https://dao.rocketpool.net/t/round-13-call-for-bounty-applications-deadline-is-june-7/2970/1\">(click for more details)</a>\n<p>To guide you in your application, the GMC has established the following goals and the following scoring rubric:</p>\nGMC Goals <a href=\"https://dao.rocketpool.net/t/round-13-call-for-bounty-applications-deadline-is-june-7/2970/1\">(click for more details)</a>\nBounties Rubric <a href=\"https://dao.rocketpool.net/t/round-13-call-for-bounty-applications-deadline-is-june-7/2970/1\">(click for more details)</a>\n<h1><a name=\"bounty-proposal-template-1\" class=\"anchor\" href=\"https://dao.rocketpool.net#bounty-proposal-template-1\"></a>Bounty Proposal Template</h1>\n<h2><a name=\"guidelines-2\" class=\"anchor\" href=\"https://dao.rocketpool.net#guidelines-2\"></a>Guidelines</h2>\n<ul>\n<li>The goals of the Bounty Proposal are:\n<ul>\n<li>to communicate your bounty idea clearly, in general terms, such that the GMC can decide if it’s worth pursuing.</li>\n<li>to estimate the benefits and costs attached to your proposal.</li>\n<li>to disclose any relevant conflicts of interest.</li>\n</ul>\n</li>\n<li>Answers to the template questions do not need to be highly detailed. Estimates or ranges are acceptable. Brief answers are also fine.</li>\n</ul>\n<h2><a name=\"template-3\" class=\"anchor\" href=\"https://dao.rocketpool.net#template-3\"></a>Template</h2>\n<pre><code class=\"lang-auto\"># Bounty Name\n\n## General Information\n\n### What is the nature of the proposed bounty?\n\n### Why are you writing this bounty proposal?\n\n\n## Benefit\n\n&lt;please enter N/A where appropriate&gt;\n\n| Group | Benefits |\n|---|---|\n| Potential rETH holders | If the bounty is successfully completed, how does this help people looking to stake ETH for rETH? |\n| rETH holders | If the bounty is successfully completed, how does this help rETH holders? |\n| Potential NOs |  If the bounty is successfully completed, how does this help people looking to run a Rocket Pool node for the first time? |\n| NOs | If the bounty is successfully completed, how does this help people already running a Rocket Pool node? |\n| Community |  If the bounty is successfully completed, how does this help the Rocket Pool community? |\n| RPL holders |  If the bounty is successfully completed, how does this help RPL holders? |\n\n### Which other non-RPL protocols, DAOs, projects, or individuals would stand to benefit from the bounty being successfully completed?\n\n\n\n## Work\n\n### What steps would be entailed in completing the bounty? Do successful examples of such work exist elsewhere? What skillsets or knowledge will be required?\n\n### What advice would you give a bounty hunter working on this bounty?\n\n### Should the output of this bounty be available under an open source license?\n\n\n\n## Costs\n\n### How much do you think the completion of this bounty worth to Rocket Pool (in USD)?\n\n### How much work will be needed to verify this bounty has been completed? What skillsets or knowledge will be required?\n\n\n## Structure\n\n### How would you structure this bounty, and why? \n* A single payout to single team on completion? \n* Divided into milestones? \n* Multiple payouts to multiple teams? \n* Should this be written up as multiple bounty definitions?\n* Something else?\n\n### Is this bounty repeatable?\n\n### Are there any reasonable circumstances under which this bounty should be withdrawn? Should it expire?\n\n\n## Conflicts of Interest\n\n### Does the person or persons proposing the bounty have any conflicts of interest to disclose? (Please disclose here if you are a member of the GMC or if any member of the GMC would benefit directly financially from the successful completion of the bounty).\n\n### Will the applicant, or any protocol or project in which the applicant has a vested interest (other than Rocket Pool), benefit financially if the bounty is successfully completed?\n</code></pre>\n<h1><a name=\"bounty-definition-template-4\" class=\"anchor\" href=\"https://dao.rocketpool.net#bounty-definition-template-4\"></a>Bounty Definition Template</h1>\n<h2><a name=\"guidelines-5\" class=\"anchor\" href=\"https://dao.rocketpool.net#guidelines-5\"></a>Guidelines</h2>\n<ul>\n<li>When a single proposal bounty proposal has parts that must be completed by different groups, it should become multiple definitions.</li>\n<li>Where reasonably possible, bountiy definitions should limit the number of distinct skillsets required for completion of the bounty.</li>\n<li>Bounties should be defined in terms of the smallest worthwhile unit of work. IE: $25 to add/update a single relevant FAQ question rather than $5,000 to update the FAQ.</li>\n<li>Include any information or resources that might reasonably help a bounty hunter complete the bounty.</li>\n<li>Think carefully about which tasks are required, and which can be optional.</li>\n<li>Clearly list any dependencies, if the bounty cannot be completed in all circumstances.</li>\n<li>Only include multiple milestones for large bounties with natural points of division.</li>\n</ul>\n<h2><a name=\"template-6\" class=\"anchor\" href=\"https://dao.rocketpool.net#template-6\"></a>Template</h2>\n<pre><code class=\"lang-auto\"># Bounty Name \n\n## Data\n* Repeatable?\n* Expiring?\n* Skillsets for completion? (See existing bounties and reuse where possible, new skillsets are recommended if sufficiently distinct)\n* Relevant tags? (See existing bounties and reuse where possible, new tags are recommended if sufficiently distinct)\n* Min reward (USD)?\n* Max reward (USD)?\n* Any linked definitions? (e.g. if a single bounty proposal becomes multiple definitions.)\n* Any dependencies? \n\n## Summary \nShort 1-3 sentences describing the bounty.\n\n## Dependencies\nIs there anything that must happen (outside of a bounty hunter's control) before it is possible to complete this bounty? This may be other bounties that must be completed first, an upcoming event or change or a regular occurance that triggers a valid bounty. This section is optional. May be later removed from the definition if the dependency becomes permanently met. \n\n## Required Milestones\nWhat _must_ be completed for a bounty hunter to claim some amount of bounty. Described per milestone.\n\n### Milestone A - &lt;Name of Milestone&gt;\n**Payout: ** &lt;payout amount&gt;\nClear bulleted list or subheadings covering the items that must be completed and/or adhered to for this milestone to be valid.\n\n### Milestone B - &lt;Name of Milestone&gt;\n**Payout: ** &lt;payout amount&gt;\nClear bulleted list or subheadings covering the items that must be completed and/or adhered to for this milestone to be valid.\n\n### Milestone C - &lt;Name of Milestone&gt;...\n\n## Optional Milestones\nWhat tasks _may_ be completed for a bounty hunter to earn extra bounty rewards. Described per milestone. This section is optional.\n\nOptional milestones may be less strictly defined than required milestones. You may aggregate multiple minor considerations that would contribute to a payout. \n\n### Milestone D - &lt;Name of Milestone&gt;\n**Maximum Payout: ** &lt;maximum payout amount&gt;\nClear bulleted list of the items that would contribute to payout for this milestone.\n\n### Milestone E - &lt;Name of Milestone&gt;...\n\n\n## Further Notes\nAnything you think that would be beneficial for a bounty hunter to know when working on this bounty. Maybe be divided into subsections as needed.\n\n## Resources\nLinks to repositories, web pages, forum discussions, etc. Anything that the bounty hunter may be able to use to do a better job on the bounty work. \n\n## Contacts\nIndividuals that have agreed to act as contacts for this bounty. Include usernames + contact details for any platform on which the contact is willing to respond to requests. Any contacts are expected to fully understand the bounty definition. This section is optional. \n\nContacts:\n* MAY be eligible for incentives.\n* SHOULD NOT assist the bounty hunter directly with the bounty work.\n* SHOULD assist bounty hunters via feedback, direction and oversight upon request.\n\n## Verification\nWho is expected to verify that the work delivered meets the relevant milestones? This person or group must have agreed to do this in advance of this definition being published. This person or group should have any relevant skillsets needed to properly verify the bounty work.\n\n\n</code></pre>\n            <p><small>1 post - 1 participant</small></p>\n            <p><a href=\"https://dao.rocketpool.net/t/round-13-call-for-bounty-applications-deadline-is-june-7/2970\">Read full topic</a></p>","link":"https://dao.rocketpool.net/t/round-13-call-for-bounty-applications-deadline-is-june-7/2970","pubDate":"Wed, 08 May 2024 00:18:04 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"dao.rocketpool.net-topic-2970"},"source":{"@url":"https://dao.rocketpool.net/t/round-13-call-for-bounty-applications-deadline-is-june-7/2970.rss","#text":"Round 13 - Call For Bounty Applications - Deadline is June 7"}},{"title":"Round 13 - Call For Grant Applications - Deadline is June 7","dc:creator":"ShfRyn","category":"Grants / Bounties","description":"<p>This thread is for applications for Rocket Pool’s May 7, 2024 - June 7, 2024 grants. Please only post grant applications in this thread. If you would like to discuss and/or ask questions about any applications you see in this thread, we ask that you do so in this <a href=\"https://dao.rocketpool.net/t/round-13-gmc-community-discussion-of-submitted-applications/2968\">separate forum thread</a> which has been established for all community discussions related to this round of applications. Only those grant applications that are posted in this thread and timestamped by June 7, 2024 at 23:59 (11:59 PM) UTC will be considered. Any grants posted after that deadline will be carried over to the next award period.</p>\n<p>This is the expected schedule for round 13:</p>\n<ul>\n<li>Application Period (May 7th - June 7th)</li>\n<li>Negotiation Period (June 8th - June 24th)</li>\n<li>Scoring Deadline (June 25th)</li>\n<li>Final Voting Amendments, Discussion and Finalization (June 26th - June 29th)</li>\n<li>Award Announcement (June 30th)</li>\n</ul>\nDifferences Between Grants and Bounties <a href=\"https://dao.rocketpool.net/t/round-13-call-for-grant-applications-deadline-is-june-7/2969/1\">(click for more details)</a>\n<p>To guide you in your application, the GMC has established the following goals and the following scoring rubric:</p>\nGMC Goals <a href=\"https://dao.rocketpool.net/t/round-13-call-for-grant-applications-deadline-is-june-7/2969/1\">(click for more details)</a>\nGrants Rubric <a href=\"https://dao.rocketpool.net/t/round-13-call-for-grant-applications-deadline-is-june-7/2969/1\">(click for more details)</a>\n<h2><a name=\"grant-application-template-1\" class=\"anchor\" href=\"https://dao.rocketpool.net#grant-application-template-1\"></a>Grant Application Template</h2>\n<p>Please copy paste the template below into a reply. Answer the questions there, feel free to remove or add sections based on relevance.</p>\n<pre><code class=\"lang-auto\">## Name of Grant\n\n### What is the work being proposed?\n\n### Is there any related work this builds off of?\n\n### Will the results of this project be entirely open source ([MIT](https://opensource.org/licenses/MIT), [GPL](https://www.gnu.org/licenses/gpl-3.0.en.html), [Apache](https://www.apache.org/licenses/LICENSE-2.0), [CC BY](https://creativecommons.org/licenses/by/4.0/) license or similar)? If not, which parts will not be, why, and under what license will they be published?\n\n\n\n## Benefit\n\n&lt;please enter N/A where appropriate&gt;\n\n| Group | Benefits |\n|---|---|\n| Potential rETH holders | If the grant is successfully completed, how does this help people looking to stake ETH for rETH? |\n| rETH holders | If the grant is successfully completed, how does this help rETH holders? |\n| Potential NOs |  If the grant is successfully completed, how does this help people looking to run a Rocket Pool node for the first time? |\n| NOs | If the grant is successfully completed, how does this help people already running a Rocket Pool node? |\n| Community |  If the grant is successfully completed, how does this help the Rocket Pool community? |\n| RPL holders |  If the grant is successfully completed, how does this help RPL holders? |\n\n### Which other non-RPL protocols, DAOs, projects, or individuals, would stand to benefit from this grant?\n\n\n\n## Work\n\n### Who is doing the work?\n\n### What is the background of the person(s) doing the work? What experience do they have with such projects in the past?\n\n### What is the breakdown of the proposed work, in terms of milestones and/or deadlines?\n\n### How is the work being tested? Is testing included in the schedule?\n\n### How will the work be maintained after delivery?\n\n\n\n## Costs\n\n### What is the acceptance criteria?\n\n### What is the proposed payment schedule for the grant? How much USD $ and over what period of time is the applicant requesting?\n\n### Is the applicant requesting RPL or LUSD?\n\n### How will the GMC verify that the work delivered matches the proposed cadence?\n\n### What alternatives or options have been considered in order to save costs for the proposed project?\n\n\n\n## Conflict of Interest\n\n### Does the person or persons proposing the grant have any conflicts of interest to disclose? (Please disclose here if you are a member of the GMC or if any member of the GMC would benefit directly financially from the grant).\n\n### Will the recipient of the grant, or any protocol or project in which the recipient has a vested interest (other than Rocket Pool), benefit financially if the grant is successful?\n</code></pre>\n            <p><small>1 post - 1 participant</small></p>\n            <p><a href=\"https://dao.rocketpool.net/t/round-13-call-for-grant-applications-deadline-is-june-7/2969\">Read full topic</a></p>","link":"https://dao.rocketpool.net/t/round-13-call-for-grant-applications-deadline-is-june-7/2969","pubDate":"Wed, 08 May 2024 00:15:43 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"dao.rocketpool.net-topic-2969"},"source":{"@url":"https://dao.rocketpool.net/t/round-13-call-for-grant-applications-deadline-is-june-7/2969.rss","#text":"Round 13 - Call For Grant Applications - Deadline is June 7"}},{"title":"Round 13 - GMC Community Discussion of Submitted Applications","dc:creator":"ShfRyn","category":"Grants / Bounties","description":"<p>In order to keep the application threads clear of discussions (to make it easier for committee members to read and score them), please use this thread for any and all questions and discussions of round 13 period of grant, bounty, and retrospective award applications.</p>\n            <p><small>1 post - 1 participant</small></p>\n            <p><a href=\"https://dao.rocketpool.net/t/round-13-gmc-community-discussion-of-submitted-applications/2968\">Read full topic</a></p>","link":"https://dao.rocketpool.net/t/round-13-gmc-community-discussion-of-submitted-applications/2968","pubDate":"Tue, 07 May 2024 23:54:31 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"dao.rocketpool.net-topic-2968"},"source":{"@url":"https://dao.rocketpool.net/t/round-13-gmc-community-discussion-of-submitted-applications/2968.rss","#text":"Round 13 - GMC Community Discussion of Submitted Applications"}},{"title":"pDAO 2024/04/11-2024/05/09 Treasury Report","dc:creator":"vacalaranja","category":"Governance","description":"<h4><a name=\"hello-rocket-pool-1\" class=\"anchor\" href=\"https://dao.rocketpool.net#hello-rocket-pool-1\"></a>Hello, Rocket Pool!</h4>\n<p>If you need an intro to how pDAO treasury works, check <a href=\"https://dao.rocketpool.net/t/pdao-2022-9-29-2022-12-22-treasury-report/1314/1\">(this post)</a>.</p>\n<p>This period the pDAO reserve received 6,126.97 RPL from inflation, its balance is now 53,936.17 RPL. The IMC and GMC were paid 10,384.69 RPL and 4,257.72 RPL, respectively.</p>\n<p>You can keep up with pDAO treasury with the following spreadsheets:<br>\n(<a href=\"https://docs.google.com/spreadsheets/d/1b8ZtXBzh2TkwrdyGYMPtjZNPB4jzErhp0z29rwb2ByQ/edit?usp=sharing\" rel=\"noopener nofollow ugc\">RP Treasury Report - Google Sheets </a>)<br>\n(<a href=\"https://docs.google.com/spreadsheets/d/1Zo9iFJ2YZNAkgNo53yJGSCnz8XAYuLJ7SeiwJx6oF0A/edit?usp=sharing\" rel=\"noopener nofollow ugc\">pDAO Treasury Summary - Google Sheets </a>).</p>\n<h4><a name=\"thank-you-for-reading-see-you-next-period-2\" class=\"anchor\" href=\"https://dao.rocketpool.net#thank-you-for-reading-see-you-next-period-2\"></a>Thank you for reading, see you next period!</h4>\n            <p><small>1 post - 1 participant</small></p>\n            <p><a href=\"https://dao.rocketpool.net/t/pdao-2024-04-11-2024-05-09-treasury-report/2966\">Read full topic</a></p>","link":"https://dao.rocketpool.net/t/pdao-2024-04-11-2024-05-09-treasury-report/2966","pubDate":"Mon, 06 May 2024 22:08:50 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"dao.rocketpool.net-topic-2966"},"source":{"@url":"https://dao.rocketpool.net/t/pdao-2024-04-11-2024-05-09-treasury-report/2966.rss","#text":"pDAO 2024/04/11-2024/05/09 Treasury Report"}},{"title":"Fireblocks - Institutional Custodial Questions","dc:creator":"OrnamentalHermit","category":"Community","description":"<p>hi,</p>\n<p>i migrated my eth to stake rETH with Fireblocks with is not self custody but an institutional grade custody provder so sometimes things are different there so just sanity checking here <img src=\"https://dao.rocketpool.net/images/emoji/twitter/slight_smile.png?v=12\" title=\":slight_smile:\" class=\"emoji\" alt=\":slight_smile:\" loading=\"lazy\" width=\"20\" height=\"20\"></p>\n<p>Q1: do i need to actively claim staked rewards or are they just distributed - is there a place I can put a URL in and see rewards accruing?</p>\n<p>Q2: I notice some ‘pool rewards’ type tokens - are these claimable via Fireblocks?</p>\n<p>Q3; Airdrops like Starknet - again on Fireblocks are these distributed with wallets on Fireblocks</p>\n<p>Cheers!</p>\n<p>OH</p>\n            <p><small>3 posts - 2 participants</small></p>\n            <p><a href=\"https://dao.rocketpool.net/t/fireblocks-institutional-custodial-questions/2964\">Read full topic</a></p>","link":"https://dao.rocketpool.net/t/fireblocks-institutional-custodial-questions/2964","pubDate":"Mon, 06 May 2024 09:19:43 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"dao.rocketpool.net-topic-2964"},"source":{"@url":"https://dao.rocketpool.net/t/fireblocks-institutional-custodial-questions/2964.rss","#text":"Fireblocks - Institutional Custodial Questions"}},{"title":"IMC Period 19/20/21/22 Reports; Period 20/21/22 Budgets","dc:creator":"Valdorff","category":"Governance","description":"<p>Hi All, from your friendly neighborhood delinquent IMC treasurer.<br>\nToday, I’m ramping up my delinquency, by catching up on a record number of items.</p>\n<h2><a name=\"period-19-report-1\" class=\"anchor\" href=\"https://dao.rocketpool.net#period-19-report-1\"></a>Period 19 Report</h2>\n<p></p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://dao.rocketpool.net/uploads/default/original/2X/d/d03cef5eec5edff0598bcb6a3b63111be2af5b59.png\" data-download-href=\"https://dao.rocketpool.net/uploads/default/d03cef5eec5edff0598bcb6a3b63111be2af5b59\" title=\"image\"><img src=\"https://dao.rocketpool.net/uploads/default/optimized/2X/d/d03cef5eec5edff0598bcb6a3b63111be2af5b59_2_372x500.png\" alt=\"image\" data-base62-sha1=\"tI9RJ84wuLuXHG2BC1rujkgFLaV\" width=\"372\" height=\"500\" srcset=\"https://dao.rocketpool.net/uploads/default/optimized/2X/d/d03cef5eec5edff0598bcb6a3b63111be2af5b59_2_372x500.png, https://dao.rocketpool.net/uploads/default/optimized/2X/d/d03cef5eec5edff0598bcb6a3b63111be2af5b59_2_558x750.png 1.5x, https://dao.rocketpool.net/uploads/default/optimized/2X/d/d03cef5eec5edff0598bcb6a3b63111be2af5b59_2_744x1000.png 2x\" data-dominant-color=\"E7E8E9\"></a></div><p></p>\n<ul>\n<li>We started working with Ramses on Arbitrum. We have some POL there, we have a veNFT they provided which we use to steer incentives, we provide incentives weekly.\n<ul>\n<li>There’s a bunch of entries to support getting the right types of money over to Arb wallet etc</li>\n</ul>\n</li>\n<li>There was some unused money from Paladin quests earlier – we got it back</li>\n<li>The planned Base increase to 2 ETH happened, woo. Flat Money started incentives on Base as well. The combo really strengthened rETH on Base.</li>\n</ul>\n<h2><a name=\"period-20-budget-2\" class=\"anchor\" href=\"https://dao.rocketpool.net#period-20-budget-2\"></a>Period 20 Budget</h2>\n<p></p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://dao.rocketpool.net/uploads/default/original/2X/1/1bcfa2cbcc33c7eef84810e9290f4bdb0ab7c247.png\" data-download-href=\"https://dao.rocketpool.net/uploads/default/1bcfa2cbcc33c7eef84810e9290f4bdb0ab7c247\" title=\"image\"><img src=\"https://dao.rocketpool.net/uploads/default/original/2X/1/1bcfa2cbcc33c7eef84810e9290f4bdb0ab7c247.png\" alt=\"image\" data-base62-sha1=\"3Y1KtvXbN3FJyhLkRmxJKr6K1fh\" width=\"565\" height=\"500\" data-dominant-color=\"E9E8E9\"></a></div><p></p>\n<ul>\n<li>The Arbitrum rETH/WETH pool migrated due to a rate provider change. We’re executing a bit oddly here to help get that transition to happen smoothly. Same amount of money though.</li>\n<li>Optimism going from 2.5 ETH/fortnight to 2 ETH/fortnight. This reflects Arbitrum currently being ahead in usage.</li>\n<li>We’re reducing rETH/RPL full-range balancer from 1.25ETH+50RPL per fortnight to just 1.25ETH/fortnight</li>\n<li>We’re swapping away from Paladin for rETH/osETH b/c of bad efficiency on curve/convex</li>\n<li>We’re trying out Merkl for ETH/RPL Uniswap concentrated market liquidity</li>\n</ul>\n<h2><a name=\"period-20-report-3\" class=\"anchor\" href=\"https://dao.rocketpool.net#period-20-report-3\"></a>Period 20 Report</h2>\n<p></p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://dao.rocketpool.net/uploads/default/original/2X/c/cb35cf2544a9623a1fe0c591c3cfd97fd8766c28.png\" data-download-href=\"https://dao.rocketpool.net/uploads/default/cb35cf2544a9623a1fe0c591c3cfd97fd8766c28\" title=\"image\"><img src=\"https://dao.rocketpool.net/uploads/default/optimized/2X/c/cb35cf2544a9623a1fe0c591c3cfd97fd8766c28_2_426x500.png\" alt=\"image\" data-base62-sha1=\"sZGd9jm4saouUcnlM0DjSr7c0is\" width=\"426\" height=\"500\" srcset=\"https://dao.rocketpool.net/uploads/default/optimized/2X/c/cb35cf2544a9623a1fe0c591c3cfd97fd8766c28_2_426x500.png, https://dao.rocketpool.net/uploads/default/optimized/2X/c/cb35cf2544a9623a1fe0c591c3cfd97fd8766c28_2_639x750.png 1.5x, https://dao.rocketpool.net/uploads/default/optimized/2X/c/cb35cf2544a9623a1fe0c591c3cfd97fd8766c28_2_852x1000.png 2x\" data-dominant-color=\"E4E7EB\"></a></div><p></p>\n<ul>\n<li>While this period was active, Cakepie became an option for us (a bribe market to incentivize CAKE steering to particular pools). We tried it with 1 ETH. The experiment was “mostly successful”. There was a modest execution issue (we actually ended up incentivizing further in the future), but the Cakepie team worked with us to get the equivalent effect of having not messed up at all. Efficiency was quite good (spoiler, it continues to be good <a href=\"https://dune.com/queries/3696265/6218557\" rel=\"noopener nofollow ugc\">https://dune.com/queries/3696265/6218557</a>)</li>\n<li>We did not repeat the Merkl ETH/RPL incentive – it seemed to have zero impact</li>\n</ul>\n<h2><a name=\"h-21-budget-4\" class=\"anchor\" href=\"https://dao.rocketpool.net#h-21-budget-4\"></a>21 Budget</h2>\n<p></p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://dao.rocketpool.net/uploads/default/original/2X/6/6ddec80ee4e4c716d90b2ef1194ce47bc1aff5b9.png\" data-download-href=\"https://dao.rocketpool.net/uploads/default/6ddec80ee4e4c716d90b2ef1194ce47bc1aff5b9\" title=\"image\"><img src=\"https://dao.rocketpool.net/uploads/default/original/2X/6/6ddec80ee4e4c716d90b2ef1194ce47bc1aff5b9.png\" alt=\"image\" data-base62-sha1=\"fFXlMKIcqMdLZqsJxnWpCHqvKE9\" width=\"690\" height=\"427\" data-dominant-color=\"ECEDED\"></a></div><p></p>\n<ul>\n<li>We continue to move more PancakeSwap incentives to Cakepie rather than Merkl</li>\n<li>We plan to take a significant step down on mainnet rETH/ETH. In internal discussions, part of the thought behind this includes recognizing that the deposit pool and rETH contract had a lot of liquidity for exiting rETH. Essentially, we’re internally questioning whether “1% price impact from market liquidity alone” is really the proper metric.\n<ul>\n<li>We’re also trying to run leaner to maintain good runway in the face of dropping ratio</li>\n</ul>\n</li>\n</ul>\n<h2><a name=\"h-21-report-5\" class=\"anchor\" href=\"https://dao.rocketpool.net#h-21-report-5\"></a>21 Report</h2>\n<p></p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://dao.rocketpool.net/uploads/default/original/2X/d/d51d38163b184905b9af0e38bb216b35443c26ce.png\" data-download-href=\"https://dao.rocketpool.net/uploads/default/d51d38163b184905b9af0e38bb216b35443c26ce\" title=\"image\"><img src=\"https://dao.rocketpool.net/uploads/default/optimized/2X/d/d51d38163b184905b9af0e38bb216b35443c26ce_2_430x500.png\" alt=\"image\" data-base62-sha1=\"upiiM1qIrCMaWN3xVvKz5rHvcv4\" width=\"430\" height=\"500\" srcset=\"https://dao.rocketpool.net/uploads/default/optimized/2X/d/d51d38163b184905b9af0e38bb216b35443c26ce_2_430x500.png, https://dao.rocketpool.net/uploads/default/optimized/2X/d/d51d38163b184905b9af0e38bb216b35443c26ce_2_645x750.png 1.5x, https://dao.rocketpool.net/uploads/default/optimized/2X/d/d51d38163b184905b9af0e38bb216b35443c26ce_2_860x1000.png 2x\" data-dominant-color=\"E5E7E9\"></a></div><p></p>\n<ul>\n<li>There was an error in the rETH/RPL amount - intent had been 1.25E, but did that +50RPL (the old amount)</li>\n</ul>\n<h2><a name=\"h-22-budget-6\" class=\"anchor\" href=\"https://dao.rocketpool.net#h-22-budget-6\"></a>22 Budget</h2>\n<p><img src=\"https://dao.rocketpool.net/uploads/default/original/2X/4/49672e402424f3d960b970c8818237b3063dbb3a.png\" alt=\"image\" data-base62-sha1=\"atlUYfKfX6IqfflZ8Wu8CdZwugO\" width=\"681\" height=\"429\"></p>\n<ul>\n<li>We’re finishing migrating PancakeSwap incentives from Merkl to Cakepie</li>\n<li>We’re somewhat reducing total spend on PancakeSwap - read as “belt tightening continues”</li>\n<li>We looked into the rETH/osETH pool more and found that it’s not doing much for us directly. We’re doing one last coincentive and then we’ll be bowing out from that. In this case, belt-tightening may have caused us to look, but I think this is the right call regardless.</li>\n</ul>\n<h2><a name=\"data-1-price-impact-7\" class=\"anchor\" href=\"https://dao.rocketpool.net#data-1-price-impact-7\"></a>Data - 1% price impact</h2>\n<p></p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://dao.rocketpool.net/uploads/default/original/2X/f/fe96713a6fe97e8de7d857e48f1f2480d1b93124.png\" data-download-href=\"https://dao.rocketpool.net/uploads/default/fe96713a6fe97e8de7d857e48f1f2480d1b93124\" title=\"image\"><img src=\"https://dao.rocketpool.net/uploads/default/optimized/2X/f/fe96713a6fe97e8de7d857e48f1f2480d1b93124_2_690x366.png\" alt=\"image\" data-base62-sha1=\"AkbB78uw82mIHObitvHpNgAtzPC\" width=\"690\" height=\"366\" srcset=\"https://dao.rocketpool.net/uploads/default/optimized/2X/f/fe96713a6fe97e8de7d857e48f1f2480d1b93124_2_690x366.png, https://dao.rocketpool.net/uploads/default/optimized/2X/f/fe96713a6fe97e8de7d857e48f1f2480d1b93124_2_1035x549.png 1.5x, https://dao.rocketpool.net/uploads/default/optimized/2X/f/fe96713a6fe97e8de7d857e48f1f2480d1b93124_2_1380x732.png 2x\" data-dominant-color=\"1F2224\"></a></div><br>\nWe’re definitely seeing an impact from tightening our belts on mainnet.<p></p>\n<h2><a name=\"resources-8\" class=\"anchor\" href=\"https://dao.rocketpool.net#resources-8\"></a>Resources</h2>\n<ul>\n<li>IMC tracking spreadsheet: <a href=\"https://docs.google.com/spreadsheets/d/1jLGkoiSjNr1UgG1spAH9ppBfrk_FqjJXg9CIw35nLCA/edit?pli=1#gid=1671653401\" class=\"inline-onebox\" rel=\"noopener nofollow ugc\">IMC tracking - Google Sheets</a></li>\n<li>IMC RPL tracker: <a href=\"https://dune.com/queries/3209520/5365584\" rel=\"noopener nofollow ugc\">https://dune.com/queries/3209520/5365584</a></li>\n<li>1% price impact tracker (assumes RP smart contracts not used): <a href=\"https://xrchz.net/imc/\" class=\"inline-onebox\" rel=\"noopener nofollow ugc\">rETH Slippage for IMC</a></li>\n</ul>\n            <p><small>1 post - 1 participant</small></p>\n            <p><a href=\"https://dao.rocketpool.net/t/imc-period-19-20-21-22-reports-period-20-21-22-budgets/2962\">Read full topic</a></p>","link":"https://dao.rocketpool.net/t/imc-period-19-20-21-22-reports-period-20-21-22-budgets/2962","pubDate":"Mon, 06 May 2024 03:47:58 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"dao.rocketpool.net-topic-2962"},"source":{"@url":"https://dao.rocketpool.net/t/imc-period-19-20-21-22-reports-period-20-21-22-budgets/2962.rss","#text":"IMC Period 19/20/21/22 Reports; Period 20/21/22 Budgets"}},{"title":"2024-05 IMC Nomination Thread","dc:creator":"Valdorff","category":"Governance","description":"<p>Hi All,</p>\n<p>It’s been a year (and a bit) – time for a new IMC selection.</p>\n<h2><a name=\"committee-size-1\" class=\"anchor\" href=\"https://dao.rocketpool.net#committee-size-1\"></a>Committee size</h2>\n<p>6/9 has been somewhat unwieldy. The RPIPs actually aren’t terribly prescriptive on size outside of a bare minimum, so we have some choice here. Internally, the IMC has discussed changing size, and selection is a natural time to do it.</p>\n<p>Some comparisons for reference: the oDAO (10/18; or team+6/18), the arbitrum security council (7/12 for slow upgrades, 9/12 for instant upgrades), Eigenlayer (3/5 upgrades with 10-day delay, 9/13 instant power). All of those protect value in the billions, while we have thus far peaked just over a million USD.</p>\n<p><a href=\"https://dao.rocketpool.net/t/2024-05-imc-nomination-thread/2959/1\">Click to view the poll.</a></p>\n<h2><a name=\"nominations-2\" class=\"anchor\" href=\"https://dao.rocketpool.net#nominations-2\"></a>Nominations</h2>\n<p>Per <a href=\"https://rpips.rocketpool.net/RPIPs/RPIP-10\" class=\"inline-onebox\" rel=\"noopener nofollow ugc\">RPIP-10: pDAO Budget Allocation</a>, this thread will be live at least 5 days.<br>\nGiven that a relevant vote is live on <a href=\"https://vote.rocketpool.net/#/proposal/0xe89ab0a846846884b088ba4ec5e37fb4ecb1a3a5b9639c53ee480055570c53d2\" class=\"inline-onebox\" rel=\"noopener nofollow ugc\">Snapshot</a> we will instead keep this thread live until ~3 days after the vote concludes.</p>\n<ul>\n<li>Anyone can nominate anyone, including themselves</li>\n<li>Anyone can remove themselves from consideration simply by saying so</li>\n<li>~3 days after the vote mentioned concludes, there will be a “this thread is closed” comment, and the final list will then be generated</li>\n<li>If you are nominated and don’t remove yourself from consideration, please read the “Nominee information sharing” section of RPIP-10 so you can be ready to provide your statements.</li>\n<li>Remember that vacancies that occur get filled by going down the list from previous selections. This means more nominations are definitely good - including well past “can field a full committee”.</li>\n<li>See <a href=\"https://dao.rocketpool.net/t/looking-for-imcers/2823\" class=\"inline-onebox\">Looking for IMCers</a> for a description of the role</li>\n<li>See the post below for some metrics on the current IMC’s participation</li>\n</ul>\n            <p><small>11 posts - 8 participants</small></p>\n            <p><a href=\"https://dao.rocketpool.net/t/2024-05-imc-nomination-thread/2959\">Read full topic</a></p>","link":"https://dao.rocketpool.net/t/2024-05-imc-nomination-thread/2959","pubDate":"Sat, 04 May 2024 02:02:15 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"dao.rocketpool.net-topic-2959"},"source":{"@url":"https://dao.rocketpool.net/t/2024-05-imc-nomination-thread/2959.rss","#text":"2024-05 IMC Nomination Thread"}},{"title":"Houston Specification Discrepancies","dc:creator":"LongForWisdom","category":"Governance","description":"<p>This post is intended to list the discrepancies between the Houston codebase and ratified RPIPs describing specifications that concern the Houston upgrade.</p>\n<p>I’ll keep this list maintained as these are discovered and resolved. Depending on the discrepancy, possible resolutions include modifying the Houston codebase, modifying the RPIP specifications without a vote, and voting on changes to the specification RPIPs.</p>\n<p>The overall goal is to ensure that ratified specifications are consistent with the reality of how the protocol actually works in order to prevent future grief.</p>\n<p>I’m attempting to just list these here for tracking purposes, if I’ve made a mistake in any of these, or misrepresented their status, please leave a reply and I will update the post.</p>\n<hr>\n<h3><a name=\"h-1-rpip-31-triggering-rpl-reward-claims-1\" class=\"anchor\" href=\"https://dao.rocketpool.net#h-1-rpip-31-triggering-rpl-reward-claims-1\"></a><span class=\"hashtag-raw\">#1</span> RPIP-31 - Triggering RPL Reward Claims</h3>\n<p>Per <a href=\"https://rpips.rocketpool.net/RPIPs/RPIP-31#claiming-rpl-rewards\">RPIP-31</a>:</p>\n<blockquote>\n<p>As the controller of the RPL for a node, I MUST be able to trigger a claim of RPL rewards</p>\n</blockquote>\n<p>In code, this isn’t absolute and can be prevented by the node operator (less of an issue with v10, but still exists). Should at least be highlighted under Security Considerations.</p>\n<p>Further described by Knoshua <a href=\"https://dao.rocketpool.net/t/rewards-tree-spec-v10/2937/22\">here</a>.</p>\n<p><strong>Current Status:</strong> Under consideration - Partial mitigation present in RPIP-53 draft, <em>may</em> be corrected for Houston release. Currently waiting on feedback from auditors to see if code-fix can be turned around fast enough to prevent significant delay to Houston.<br>\n<strong>Estimated Impact:</strong> Medium</p>\n<hr>\n<h3><a name=\"h-2-rpip-31-triggering-rpl-reward-claims-valid-sources-2\" class=\"anchor\" href=\"https://dao.rocketpool.net#h-2-rpip-31-triggering-rpl-reward-claims-valid-sources-2\"></a><span class=\"hashtag-raw\">#2</span> RPIP-31 - Triggering RPL Reward Claims Valid Sources</h3>\n<p>Per <a href=\"https://rpips.rocketpool.net/RPIPs/RPIP-31#claiming-rpl-rewards\">RPIP-31</a>:</p>\n<blockquote>\n<p>If a node’s RPL withdrawal address is set, the call MUST come from one of: the node’s primary withdrawal address, the current RPL withdrawal address, or the node’s address</p>\n</blockquote>\n<p>Per the <a href=\"https://docs.rocketpool.net/guides/houston/whats-new#rpl-withdrawal-address\">Houston documentation</a>, only the current RPL withdrawal address is able to claim in the current implementation.</p>\n<p>Further described by Knoshua <a href=\"https://dao.rocketpool.net/t/rewards-tree-spec-v10/2937/22\">here</a>.</p>\n<p><strong>Current Status:</strong> Under consideration - Partial mitigation present in RPIP-53 draft, <em>may</em> be corrected for Houston release. Currently waiting on feedback from auditors to see if code-fix can be turned around fast enough to prevent significant delay to Houston.<br>\n<strong>Estimated Impact:</strong> Medium-Low</p>\n<hr>\n<h3><a name=\"h-3-rpip-33-recurring-treasury-spend-interval-amount-3\" class=\"anchor\" href=\"https://dao.rocketpool.net#h-3-rpip-33-recurring-treasury-spend-interval-amount-3\"></a><span class=\"hashtag-raw\">#3</span> RPIP-33 - Recurring Treasury Spend Interval Amount</h3>\n<p>Per <a href=\"https://rpips.rocketpool.net/RPIPs/RPIP-33#treasury-contract-change\">RPIP-33</a>:</p>\n<blockquote>\n<p>Amount Per Interval: The amount of RPL to send per reward interval. Specified as a percentage of RPL rewards the pDAO received in a given interval.</p>\n</blockquote>\n<p>Per the <a href=\"https://docs.rocketpool.net/guides/houston/participate#creating-a-recurring-treasury-spend\">Houston documentation</a> the implementation is for absolute amount of RPL per payment interval, rather than a percentage amount.</p>\n<p><strong>Current Status:</strong> Outstanding Discrepancy. Coded version may make more sense. Will likely try to resolve via forum sentiment vote to avoid overhead of full pDAO snapshot vote.<br>\n<strong>Estimated Impact:</strong> Medium-Low</p>\n<hr>\n<h3><a name=\"h-4-rpip-33-security-council-quorum-thresholds-4\" class=\"anchor\" href=\"https://dao.rocketpool.net#h-4-rpip-33-security-council-quorum-thresholds-4\"></a><span class=\"hashtag-raw\">#4</span> RPIP-33 - Security Council Quorum Thresholds</h3>\n<p>Per <a href=\"https://rpips.rocketpool.net/RPIPs/RPIP-33#parameter-table\">RPIP-33</a>:</p>\n<blockquote>\n<p>rocketDAOProtocolSettingsSecurity - security.members.quorum … <code>&gt;= 51% &amp; &lt; 75%</code></p>\n</blockquote>\n<p>Per the Houston audit, the implemented check is <code>&gt;= 51% and &lt;=75%</code></p>\n<p><strong>Current Status:</strong> Coded version may make more sense. Outstanding Discrepancy.<br>\n<strong>Estimated Impact:</strong> Very Low</p>\n<hr>\n<h3><a name=\"h-5-rpip-33-network-submission-frequency-guard-5\" class=\"anchor\" href=\"https://dao.rocketpool.net#h-5-rpip-33-network-submission-frequency-guard-5\"></a><span class=\"hashtag-raw\">#5</span> RPIP-33 - Network Submission Frequency Guard</h3>\n<p>Per <a href=\"https://rpips.rocketpool.net/RPIPs/RPIP-33#parameter-table\">RPIP-33</a>:</p>\n<blockquote>\n<p>rocketDAOProtocolSettingsNetwork - network.submit.balances.frequency … <code>&gt; 1 hour</code></p>\n</blockquote>\n<p>Per the Houston audit, the implemented check is <code>&gt;= 1 hour</code>.</p>\n<p><strong>Current Status:</strong> Coded version may make more sense. Outstanding Discrepancy.<br>\n<strong>Estimated Impact:</strong> Very Low</p>\n            <p><small>5 posts - 3 participants</small></p>\n            <p><a href=\"https://dao.rocketpool.net/t/houston-specification-discrepancies/2958\">Read full topic</a></p>","link":"https://dao.rocketpool.net/t/houston-specification-discrepancies/2958","pubDate":"Fri, 03 May 2024 17:25:13 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"dao.rocketpool.net-topic-2958"},"source":{"@url":"https://dao.rocketpool.net/t/houston-specification-discrepancies/2958.rss","#text":"Houston Specification Discrepancies"}},{"title":"GMC 2024/04/01 - 2024/04/30 Treasury Report","dc:creator":"ShfRyn","category":"Grants / Bounties","description":"<p>The GMC just wrapped up round 11, and payments went out for Round 10’s retrospective awards and ongoing grants.</p>\n<p>Here is a link to the treasury sheet - <a href=\"https://docs.google.com/spreadsheets/d/1dMtHJ4sffBidSN5RphLYC9A5HrsRNqHfqLVn-nJR104/\">GMC Treasury Sheet - Google Sheets </a></p>\n<div class=\"md-table\">\n<table>\n<thead>\n<tr>\n<th>Funds at Start</th>\n<th>Inflows</th>\n<th>Payments</th>\n<th>Diversification (LUSD)</th>\n<th>Outflows (Total)</th>\n<th>Funds at End</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>58,268.74</td>\n<td>4,257.72</td>\n<td>5,600.11</td>\n<td>814.56</td>\n<td>6,414.67</td>\n<td>56,926.36</td>\n</tr>\n</tbody>\n</table>\n</div><div class=\"md-table\">\n<table>\n<thead>\n<tr>\n<th>LUSD Funds at Start</th>\n<th>LUSD Inflows</th>\n<th>LUSD Payments</th>\n<th>LUSD Funds at End</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>103,991.61</td>\n<td>16,359.96</td>\n<td>23,000.00</td>\n<td>97,351.57</td>\n</tr>\n</tbody>\n</table>\n</div><p>On the topic of RPL price calculation, the GMC is currently voting on the following proposal:</p>\n<blockquote>\n<p>Award amounts for grants, bounties, and retrospective awards will be denominated in USD. RPL amounts will no longer be price locked at the time of award for grants and bounties. The GMC will take into account the requested token on the original application but ultimately has discretion on whether or not to pay with RPL or LUSD at the time of payment. For RPL calculations, the value of RPL will be assessed on the 13th of the month at 0:00 UTC from CoinGecko and rounded to the nearest RPL.</p>\n<p>Grants awarded prior to Tuesday, May 7, 2024 4:30 PM will not be effected.</p>\n</blockquote>\n            <p><small>1 post - 1 participant</small></p>\n            <p><a href=\"https://dao.rocketpool.net/t/gmc-2024-04-01-2024-04-30-treasury-report/2955\">Read full topic</a></p>","link":"https://dao.rocketpool.net/t/gmc-2024-04-01-2024-04-30-treasury-report/2955","pubDate":"Wed, 01 May 2024 15:20:45 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"dao.rocketpool.net-topic-2955"},"source":{"@url":"https://dao.rocketpool.net/t/gmc-2024-04-01-2024-04-30-treasury-report/2955.rss","#text":"GMC 2024/04/01 - 2024/04/30 Treasury Report"}},{"title":"Rocket Pool <> Fyde Treasury Pilot Program","dc:creator":"Fyde","category":"Integration","description":"<h1><a name=\"proposal-fyde-treasury-rocket-pool-1\" class=\"anchor\" href=\"https://dao.rocketpool.net#proposal-fyde-treasury-rocket-pool-1\"></a>Proposal: Fyde Treasury &lt;&gt; Rocket Pool</h1>\n<h3><a name=\"about-fyde-2\" class=\"anchor\" href=\"https://dao.rocketpool.net#about-fyde-2\"></a>About Fyde:</h3>\n<p>Earn more. Risk Less. Fyde is an AI driven portfolio management and liquidity optimiser. Team building since 2022 with experiences from NASA, JP Morgan, Bloomberg, Wintermute, Synthetix, Stanford, and more. Traction includes integrations with 25+ crypto protocols, DAOs and Layer 2s onboarded. Investors include Inception Capital, Big Brain Holdings, Arrington Capital, Merit Circle and more.</p>\n<p>To date the liquid vault has outperformed with lower volatility across bull and bear. Currently, Fyde is rewarding early adopters with boosted Fyde points up until FYDE token launch in Q2 2024.</p>\n<p><strong></strong></p><div class=\"lightbox-wrapper\"><strong><a class=\"lightbox\" href=\"https://dao.rocketpool.net/uploads/default/original/2X/7/7253027e06575d1ed0deb16abb9097ae9d156b91.png\" data-download-href=\"https://dao.rocketpool.net/uploads/default/7253027e06575d1ed0deb16abb9097ae9d156b91\" title=\"\"><img src=\"https://dao.rocketpool.net/uploads/default/optimized/2X/7/7253027e06575d1ed0deb16abb9097ae9d156b91_2_624x369.png\" alt=\"\" data-base62-sha1=\"gjmhj7QzqnsjNJBILpZtVKP6Pw5\" width=\"624\" height=\"369\" role=\"presentation\" srcset=\"https://dao.rocketpool.net/uploads/default/optimized/2X/7/7253027e06575d1ed0deb16abb9097ae9d156b91_2_624x369.png, https://dao.rocketpool.net/uploads/default/optimized/2X/7/7253027e06575d1ed0deb16abb9097ae9d156b91_2_936x553.png 1.5x, https://dao.rocketpool.net/uploads/default/original/2X/7/7253027e06575d1ed0deb16abb9097ae9d156b91.png 2x\" data-dominant-color=\"09080B\"></a></strong></div><br>\n<em>TRSY Performance &amp; Volatility</em><p></p>\n<h3><a name=\"summary-3\" class=\"anchor\" href=\"https://dao.rocketpool.net#summary-3\"></a>Summary:</h3>\n<p>Treasuries face challenges in managing their native governance token holdings, which is essential for long-term sustainability and growth. Protocols, founders and whales often hold high concentration positions in governance tokens due to liquidity mismatch between value of what they own and what can be realized. Trading these positions results in high slippage and price impacts - they’re often forced holders until it’s too late and the bear market has begun. Fyde Treasury Protocol provides a solution to mitigate these various issues.</p>\n<p>Enabling treasuries, such as Rocket Pool’s, to diversify a portion of their native token holdings through the Fyde Liquid Vault without introducing sell pressure from open market or OTC sales. In doing so token issuers also benefit from increased liquidity pathways for their native token and the creation of yield, while preserving governance of deposited tokens.</p>\n<h3><a name=\"abstract-4\" class=\"anchor\" href=\"https://dao.rocketpool.net#abstract-4\"></a>Abstract:</h3>\n<p>This proposal outlines a pilot program for Rocket Pool to deposit a portion of its RPL token holdings into the Fyde Liquid Vault on a trial basis, receiving TRSY in return thus enhancing treasury resilience. Fyde offers features like instant withdrawal and market liquidity, providing a simplified and sustainable approach to treasury management.</p>\n<h3><a name=\"motivation-5\" class=\"anchor\" href=\"https://dao.rocketpool.net#motivation-5\"></a>Motivation:</h3>\n<p>Protocols focus on creating liquidity for their native token which can be notoriously difficult. Issues such as impermanent loss can be mitigated in the short-term through liquidity incentives however this does not fix the problem over the long-term. Token liquidity should actually be seen as a by-product of what token treasuries actually need - which is portfolio liquidity and this can be achieved much more efficiently than for an individual token (e.g. ETFs vs individual stocks). Fyde creates an on-chain liquid vault where users can deposit governance tokens, and in return, receive increased liquidity, diversification, and yield - while still being able to retain governance rights.</p>\n<p>Fyde Protocol addresses the complexities of crypto treasury management for DAOs and protocols, promoting long-term growth and sustainability. By leveraging Fyde’s Liquid Vault, Rocket Pool intends to enhance treasury resilience, increase liquidity, improve token distribution and optimize operational efficiency.</p>\n<h3><a name=\"specification-6\" class=\"anchor\" href=\"https://dao.rocketpool.net#specification-6\"></a>Specification:</h3>\n<p>The proposal suggests depositing a percentage of Rocket Pool’s RPL treasury holdings (or core contributor positions) into Fyde’s Liquid Vault as a pilot program. A deposit of between 5 000 to 15 000 RPL (~$100k to $300k as of 01/05/24) is recommended, with an intention of maintaining the deposit for 3-6 months.</p>\n<p>This suggestion is aligned with our target concentration of RPL within the vault. Recent deposit sizes from DAO and protocol clients have ranged between $100k to $300k.</p>\n<div class=\"md-table\">\n<table>\n<thead>\n<tr>\n<th>Step</th>\n<th>Action</th>\n<th>Rocket Pool/ Fyde</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>1</td>\n<td>Proposal review</td>\n<td>Rocket Pool</td>\n</tr>\n<tr>\n<td>2</td>\n<td>Follow-up call</td>\n<td>Rocket Pool/ Fyde</td>\n</tr>\n<tr>\n<td>3</td>\n<td>Confirm the proposal &amp; seed deposit amount</td>\n<td>Rocket Pool</td>\n</tr>\n<tr>\n<td>4</td>\n<td>Fyde to whitelist RPL (Done)</td>\n<td>Fyde</td>\n</tr>\n<tr>\n<td>5</td>\n<td>Deposit seed</td>\n<td>Rocket Pool</td>\n</tr>\n<tr>\n<td>6</td>\n<td>Comarketing</td>\n<td>Rocket Pool/ Fyde</td>\n</tr>\n<tr>\n<td>7</td>\n<td>Explore additional collaboration</td>\n<td>Rocket Pool/ Fyde</td>\n</tr>\n</tbody>\n</table>\n</div><h3><a name=\"benefits-7\" class=\"anchor\" href=\"https://dao.rocketpool.net#benefits-7\"></a>Benefits:</h3>\n<ul>\n<li>Liquidity: Depositing RPL into Fyde’s Liquid Vault increases liquidity and trading volume across DEXs/CEXs through new pairs.</li>\n<li>Ecosystem liquidations: RPL grant recipients can deposit into Fyde, receiving a less volatile asset which can be liquidated to fund expenditures as needed.</li>\n<li>Diversification: Fyde enables Rocket Pool to diversify its treasury holdings, enhancing overall resilience and allowing the Rocket Pool to better grow across market cycles.</li>\n<li>Distribution: Tokens included in the Fyde Liquid Vault benefit from 35+ new direct trading pairs as tokens can be swapped without routing through WETH/ USDT - our vault becomes the cheapest place to execute swaps at scale</li>\n<li>No Lock-ups: Deposits are non-custodial and can be withdrawn instantly, providing flexibility to Rocket Pool.</li>\n</ul>\n<h3><a name=\"considerations-8\" class=\"anchor\" href=\"https://dao.rocketpool.net#considerations-8\"></a>Considerations:</h3>\n<ul>\n<li>Limited Day 1 Liquidity: Fyde plans to implement LP token buyback programs to facilitate liquidity. Initial liquidity may be limited until these measures are enacted upon the FYDE issuance in Q2 2024.</li>\n<li>Execution Size: Due to Fyde’s recent launch, large deposit sizes will need to be scaled over time.</li>\n<li>Exchange Rate: Withdrawn amounts of RPL are subject to prevailing exchange rates and risk concentration targets within the vault.</li>\n<li>Short-Term Performance: TRSY is designed to capture broad market performance. As a result, there may be times when RPL outperforms TRSY. However, it’s impossible to predict when certain tokens will outperform - as a result, we believe broad market exposure is the best approach to prevent missing out on gains across the crypto ecosystem.</li>\n</ul>\n<h3><a name=\"comarketing-9\" class=\"anchor\" href=\"https://dao.rocketpool.net#comarketing-9\"></a>Comarketing:</h3>\n<p>Marketing options around the Fyde &lt;&gt; Rocket Pool collaboration:</p>\n<ul>\n<li>Twitter thread written by Fyde, reposted by Rocket Pool eg.</li>\n</ul>\n<p>Silo: https (remove space) ://x.com/FydeTreasury/status/1750525354358509708?s=20</p>\n<p>Alchemix: https (remove space) ://x.com/FydeTreasury/status/1729556049340842476?s=20</p>\n<ul>\n<li>\n<p>Create a unique Rocket Pool referral code, allowing Rocket Pool to accrue FYDE points from all deposits and receive FYDE airdrop.</p>\n</li>\n<li>\n<p>Schedule AMA eg. SushiSwap: https (remove space) ://x.com/SushiSwap/status/1752070889456209951?s=20</p>\n</li>\n</ul>\n<h3><a name=\"fees-10\" class=\"anchor\" href=\"https://dao.rocketpool.net#fees-10\"></a>Fees:</h3>\n<p>Fyde charges a 1% annual fee for the service, deducted continuously over time, ensuring a fair and transparent cost structure for Rocket Pool.</p>\n<h3><a name=\"feedback-and-airdrop-11\" class=\"anchor\" href=\"https://dao.rocketpool.net#feedback-and-airdrop-11\"></a>Feedback and Airdrop:</h3>\n<p>Rocket Pool core members and stakeholders are encouraged to provide feedback and engage directly with the Fyde team for deposit inquiries or airdrop details. All depositors who stake TRSY before TGE in Q2 24 will receive Fyde points and be eligible for the FYDE airdrop.</p>\n<h3><a name=\"future-collaboration-12\" class=\"anchor\" href=\"https://dao.rocketpool.net#future-collaboration-12\"></a>Future Collaboration:</h3>\n<p>Our team is primarily focused on ensuring our upcoming token launch is a success. In Q3 after TGE we have more capacity, we would like to open discussions around fixing a concentration target of rETH long term. This would mean we incentivize deposits as the vault grows, increasing rETH TVL and distribution into our clients’ treasuries.</p>\n<h3><a name=\"links-13\" class=\"anchor\" href=\"https://dao.rocketpool.net#links-13\"></a>Links:</h3>\n<p>Website:<a href=\"https://www.fyde.fi/\" rel=\"noopener nofollow ugc\"> https://www.fyde.fi/</a></p>\n<p>Twitter:<a href=\"https://twitter.com/FydeTreasury\" rel=\"noopener nofollow ugc\"> https://twitter.com/FydeTreasury</a></p>\n            <p><small>4 posts - 3 participants</small></p>\n            <p><a href=\"https://dao.rocketpool.net/t/rocket-pool-fyde-treasury-pilot-program/2953\">Read full topic</a></p>","link":"https://dao.rocketpool.net/t/rocket-pool-fyde-treasury-pilot-program/2953","pubDate":"Wed, 01 May 2024 14:14:33 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"dao.rocketpool.net-topic-2953"},"source":{"@url":"https://dao.rocketpool.net/t/rocket-pool-fyde-treasury-pilot-program/2953.rss","#text":"Rocket Pool <> Fyde Treasury Pilot Program"}},{"title":"[Proposal] Deploy Rocketpool on Sei, the Fastest Parallelized EVM (L1/L2) Chain","dc:creator":"Seishiro","category":"Growth","description":"<p>Hello, Dear Rocket Community!</p>\n<p><em><strong>What would you say about deploying Rocketpool on the fastest Parallelized EVM Chain?</strong></em> Faster transactions mean more transactions mean more possibilities and achieving higher goals that were previously unreachable in the DeFi space!</p>\n<p><em>Sei V2 (EVM compatible) offers this opportunity.</em></p>\n<p><em><strong>Deploying Rocketpool on Sei would considerably reduce gas fees, resolve network congestion with faster transactions and more transactions…</strong></em></p>\n<p>To make it simple. Sei is the fusion between Ethereum and Solana but faster with cheaper transactions.</p>\n<p><strong>I’m proposing to deploy Rocketpool on Sei Network to achieve and reach more within the decentralized finance space (we all share this goal)! Parallelization is the future: [“Vitalik Buterin emphasizes need for parallelization in Ethereum rollups” - The Block]</strong></p>\n<p>Also, another benefit to deploy on Sei is worth mentioning! <em>LayerZero will be live on Sei V2 on day-one. This integration will allow developers building on other LayerZero-supported chains to seamlessly connect to and build on Sei V2.</em></p>\n<p>Dear Rocket Community! <strong>Let’s go beyond together and open up new horizons in the DeFi landscape!</strong></p>\n<p>Interested? <img src=\"https://dao.rocketpool.net/images/emoji/twitter/point_down.png?v=12\" title=\":point_down:\" class=\"emoji\" alt=\":point_down:\" loading=\"lazy\" width=\"20\" height=\"20\"> I’ve compiled what’s important to know about Sei below <img src=\"https://dao.rocketpool.net/images/emoji/twitter/point_down.png?v=12\" title=\":point_down:\" class=\"emoji\" alt=\":point_down:\" loading=\"lazy\" width=\"20\" height=\"20\">:</p>\n<p><strong>What is SEI Network?</strong></p>\n<p>Sei, a Layer-1 blockchain, aims to be the fastest network for exchanging digital assets. It features novel technological features built into its blockchain. Namely, Twin-Turbo Consensus and transaction parallelization, which increase transaction efficiency and throughput. Since launching its mainnet in August 2023, Sei has seen an ecosystem of native projects launch and a community emerge. To maintain momentum, Sei must successfully deploy the features planned for the Sei V2 upgrade. EVM compatibility could unlock new opportunities by expanding Sei’s developer ecosystem and enabling established EVM protocols to deploy on Sei. Optimistic transaction parallelization will ease the developer experience, while SeiDB improves the network’s performance across the board. Post-V2, sights can be set on the Parallel Stack. The stack could enable further growth in Sei’s ecosystem and validator usage as Layer-2 EVM rollups are launched by developers seeking an improved user experience and novel design space. All these planned features could lead to more activity on the network as it continues to mature and differentiate itself from other competing Layer-1 networks.</p>\n<p><strong>Optimistic Parallelization.</strong></p>\n<p>To further elaborate on the execution environment, we must highlight Sei’s rollout of optimistic parallelization. By enabling transactions to be processed in parallel rather than sequentially, Sei v2 enables significantly increased throughput and reduced transactions fees. This architecture diverges from traditional, sequential blockchain processing seen traditionally with the EVM, where transactions are confirmed one after another, leading to potential bottlenecks as the network’s usage grows. Sequential transactions therefore present anti-network effects–parallelization alleviates such growing pains.</p>\n<p><em>Key Numbers</em>: <a href=\"https://twitter.com/SeiNetwork/status/1770159112866963540?s=20\" rel=\"noopener nofollow ugc\">https://twitter.com/SeiNetwork/status/1770159112866963540?s=20</a></p>\n<p>Sei v2 utilizes optimistic parallelization, where transactions are processed in parallel under the assumption that they will not conflict or interfere with each other’s state changes. This approach optimistically assumes that concurrent transactions can access and modify the blockchain state without creating inconsistencies. If conflict arises, then sequential re-execution of the transactions is needed. Deterministic execution requires developers to assign the parts of state that can be accessed, but these assignments require more developer overhead.</p>\n<p><em>To learn more about it</em>: <a href=\"https://forum.sei.io/t/optimistic-concurrency-control/28?ref=blog.sei.io\" rel=\"noopener nofollow ugc\">Optimistic Concurrency Control - Standards and RFCs - Sei Developer Forum</a></p>\n<p><strong>What is SeiDB?</strong></p>\n<p>More transactions also means more problems, specifically around state management. If a blockchain cannot effectively manage high throughput at the state/storage level, it encounters another bottleneck. This undermines the advantages initially gained from employing a parallel execution environment.</p>\n<p>That’s where SeiDB comes in.</p>\n<p>Sei Labs has redesigned their database for high-performance storage, making sure that information is organized, stored, and accessed efficiently.</p>\n<p>Operationally, efficiency and performance is achieved by separating state store (SS) and state commit (SC). This bifurcation is designed to optimize Sei for two requirements: handling vast historical data and processing new transactions efficiently.</p>\n<p>SS pertains to historical data. By organizing data as raw key values while minimizing unnecessary metadata, SeiDB ensures that historical records–encompassing transactions, state changes, and other relevant data–are stored in a compact and accessible manner. This makes it easier to conduct auditing, transaction verification, and node synchronization. Such storage efficiency helps mitigate potential issues related to state bloat, ensuring that Sei remains scalable and efficient as it grows, not falling subject to diminishing performance from scale.</p>\n<p>SC deals with the processing and validating of new transactions by performing state changes in-memory and streamlining access to the most recent state information. This way, SeiDB reduces the need for intensive Input/Output operations, enabling faster transaction validation and commitment.</p>\n<p>The above architecture positions Sei in a place to aptly deal with high-volume applications.</p>\n<p><strong>Conclusion:</strong></p>\n<p>The heightened activity in the prior bull market exposed some limitations in blockchain technology as networks experienced high gas fees and slow transaction speeds. However, in the recent bear market, Sei emerged with technological innovations that hoped to address these limitations. Sei Labs created a Layer-1 network with the goal of becoming the fastest network for exchanging digital assets. Sei’s built-in blockchain technologies, such as Twin-Turbo Consensus and transaction parallelization, enable reduced transaction latency and increased transaction throughput.</p>\n<p>Sei v2’s efficient design is meant to introduce an influx of applications that have not been previously possible due to the limited EVM design space. SVM and MoveVM chains will act as the direct architectural competitors to Sei going forward since they’ve been able to introduce unique applications like onchain order books. More parallelized EVMs will invariably be introduced in the coming months as well. Solana also has a parallelized EVM L2 called Neon, which has so far gained very little traction. This puts Sei in a strong position because it, ideally, enables high-throughput applications while simultaneously bringing forward a familiar developer environment.</p>\n<p><strong>SEI V2 (EVM Compatible) is set to go live on mainnet before the end of this Q2. (Before the end of June). And Sei V2 Code is COMPLETE! Audit Complete!<img src=\"https://dao.rocketpool.net/images/emoji/twitter/ballot_box_with_check.png?v=12\" title=\":ballot_box_with_check:\" class=\"emoji\" alt=\":ballot_box_with_check:\" loading=\"lazy\" width=\"20\" height=\"20\"> We are closer than ever to the V2 update!</strong></p>\n            <p><small>2 posts - 2 participants</small></p>\n            <p><a href=\"https://dao.rocketpool.net/t/proposal-deploy-rocketpool-on-sei-the-fastest-parallelized-evm-l1-l2-chain/2951\">Read full topic</a></p>","link":"https://dao.rocketpool.net/t/proposal-deploy-rocketpool-on-sei-the-fastest-parallelized-evm-l1-l2-chain/2951","pubDate":"Tue, 30 Apr 2024 08:55:44 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"dao.rocketpool.net-topic-2951"},"source":{"@url":"https://dao.rocketpool.net/t/proposal-deploy-rocketpool-on-sei-the-fastest-parallelized-evm-l1-l2-chain/2951.rss","#text":"[Proposal] Deploy Rocketpool on Sei, the Fastest Parallelized EVM (L1/L2) Chain"}},{"title":"Round 11 (Mar 10 - Apr 7) Grants / Bounties / Retrospective Awards Results)","dc:creator":"ShfRyn","category":"Grants / Bounties","description":"<p>The GMC has concluded discussions and scoring for the Round 11 (Mar 10 - Apr 7) Grants/Bounties/RA Award Round. For those who did not receive an award, please note that applicants are welcome to re-apply.</p>\n<p>This post also begins the fourteen-day clock during which, according to RPIP-15, “[a]nyone MAY file an RPIP disputing a grant, bounty, or retrospective award within two weeks of the announcement of recipients. Such an RPIP SHALL be subject to a snapshot vote.” Any awards not subject to such a challenge will become official on May 10, 2024 at 23:59 UTC.</p>\n\nSubcommittees <a href=\"https://dao.rocketpool.net/t/round-11-mar-10-apr-7-grants-bounties-retrospective-awards-results/2948/1\">(click for more details)</a>\n\nAwarded Amounts <a href=\"https://dao.rocketpool.net/t/round-11-mar-10-apr-7-grants-bounties-retrospective-awards-results/2948/1\">(click for more details)</a>\n\nApplication Breakdown <a href=\"https://dao.rocketpool.net/t/round-11-mar-10-apr-7-grants-bounties-retrospective-awards-results/2948/1\">(click for more details)</a>\n\nAwards, Average Overall Scores <a href=\"https://dao.rocketpool.net/t/round-11-mar-10-apr-7-grants-bounties-retrospective-awards-results/2948/1\">(click for more details)</a>\n\nDetailed Award Results <a href=\"https://dao.rocketpool.net/t/round-11-mar-10-apr-7-grants-bounties-retrospective-awards-results/2948/1\">(click for more details)</a>\n\nMember Participation <a href=\"https://dao.rocketpool.net/t/round-11-mar-10-apr-7-grants-bounties-retrospective-awards-results/2948/1\">(click for more details)</a>\n\nFinal Voting Stages <a href=\"https://dao.rocketpool.net/t/round-11-mar-10-apr-7-grants-bounties-retrospective-awards-results/2948/1\">(click for more details)</a>\n            <p><small>1 post - 1 participant</small></p>\n            <p><a href=\"https://dao.rocketpool.net/t/round-11-mar-10-apr-7-grants-bounties-retrospective-awards-results/2948\">Read full topic</a></p>","link":"https://dao.rocketpool.net/t/round-11-mar-10-apr-7-grants-bounties-retrospective-awards-results/2948","pubDate":"Fri, 26 Apr 2024 21:52:03 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"dao.rocketpool.net-topic-2948"},"source":{"@url":"https://dao.rocketpool.net/t/round-11-mar-10-apr-7-grants-bounties-retrospective-awards-results/2948.rss","#text":"Round 11 (Mar 10 - Apr 7) Grants / Bounties / Retrospective Awards Results)"}},{"title":"ETH to rETH - Is it considered a disposal and thus a taxable event?","dc:creator":"Graffiki","category":"Education","description":"<p>I have ETH on a cold wallet that I’m considering staking with RocketPool.</p>\n<p>I’m UK-based, but I imagine this question is relevant to many other jurisdictions:</p>\n<p>Does converting my ETH to rETH trigger a tax event due to disposal? - Meaning will I have to pay the capital gains tax on the profit I’ve made on my ETH so far?</p>\n<p>For reference, in the UK it is stated:</p>\n<ol>\n<li><strong>Disposal</strong>: When you exchange ETH for any other coin, it is treated as if you are ‘disposing’ of your ETH. This means you are potentially realizing any gains (or losses) that have accrued since you originally acquired the ETH.</li>\n</ol>\n            <p><small>2 posts - 2 participants</small></p>\n            <p><a href=\"https://dao.rocketpool.net/t/eth-to-reth-is-it-considered-a-disposal-and-thus-a-taxable-event/2939\">Read full topic</a></p>","link":"https://dao.rocketpool.net/t/eth-to-reth-is-it-considered-a-disposal-and-thus-a-taxable-event/2939","pubDate":"Sat, 20 Apr 2024 17:04:55 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"dao.rocketpool.net-topic-2939"},"source":{"@url":"https://dao.rocketpool.net/t/eth-to-reth-is-it-considered-a-disposal-and-thus-a-taxable-event/2939.rss","#text":"ETH to rETH - Is it considered a disposal and thus a taxable event?"}},{"title":"Rewards Tree Spec v10","dc:creator":"jcrtp","category":"Governance","description":"<p>Hey everyone!</p>\n<p>It’s been a while since we’ve had some rewards tree changes but new network upgrades tend to bring them, and this time we have two: <a href=\"https://dao.rocketpool.net/t/rewards-tree-spec-v9/2928/5\">v9 from Patches</a> and v10 from me (proposed here). Luckily they aren’t mutually exclusive; they can come in either order and one (or both) can be ratified without issue. I’m calling this v10 out of respect because his came first and I’m assuming it’s going to go through.</p>\n<p>Anyway, unlike past updates where I dump all of the proposal contents into one of these, I wrote a proper RPIP this time. For your consideration:</p>\n<aside class=\"onebox githubblob\" data-onebox-src=\"https://github.com/rocket-pool/RPIPs/blob/rewards_v10/RPIPs/RPIP-53.md\">\n  <header class=\"source\">\n\n      <a href=\"https://github.com/rocket-pool/RPIPs/blob/rewards_v10/RPIPs/RPIP-53.md\" target=\"_blank\" rel=\"noopener nofollow ugc\">github.com</a>\n  </header>\n\n  <article class=\"onebox-body\">\n    <h4><a href=\"https://github.com/rocket-pool/RPIPs/blob/rewards_v10/RPIPs/RPIP-53.md\" target=\"_blank\" rel=\"noopener nofollow ugc\">rocket-pool/RPIPs/blob/rewards_v10/RPIPs/RPIP-53.md</a></h4>\n\n\n      <pre><code class=\"lang-md\">---\nrpip: 53\ntitle: Rewards Tree v10 Specification\ndescription: Adjusts the rewards file to account for Houston changes, generalizing rewards from nodes to claimers and supporting the RPL withdrawal address\nauthor: Joe Clapis (@jcrtp), Jacob Shufro (@jshufro)\ndiscussions-to: TBD\nstatus: Review\ntype: Protocol\ncreated: 2024-04-19\n---\n\n\n## Abstract\n\nThe incoming Houston upgrade introduces [RPIP-31](https://github.com/rocket-pool/RPIPs/blob/main/RPIPs/RPIP-31.md) - the **RPL withdrawal address**. Unfortunately, node operators using this new feature are **no longer able to claim rewards** if they have an RPL withdrawal address. *Only* the RPL withdrawal address is able to claim their rewards. This includes both RPL *and* Smoothing Pool ETH rewards.\n\nThis RPIP proposes to generalize the rewards tree, changing *nodes* to *claimers*. The tree will now specify the amount of RPL and Smoothing Pool ETH available to individual claimers, where:\n- If a node does not have an RPL withdrawal address set, their node address is the claimer address (same as today).\n- If a node *does* have an RPL withdrawal address set, the node's rewards will be split in two:\n  - One claimer will be the node's primary withdrawal address, which will have the node's ETH portion of the rewards.\n</code></pre>\n\n\n\n  This file has been truncated. <a href=\"https://github.com/rocket-pool/RPIPs/blob/rewards_v10/RPIPs/RPIP-53.md\" target=\"_blank\" rel=\"noopener nofollow ugc\">show original</a>\n\n  </article>\n\n  <div class=\"onebox-metadata\">\n    \n    \n  </div>\n\n  <div style=\"clear: both\"></div>\n</aside>\n\n<p>The full details are covered in there but to summarize, in Houston we added a special setting called an “RPL withdrawal address” in accordance with <a href=\"https://github.com/rocket-pool/RPIPs/blob/rewards_v10/RPIPs/RPIP-31.md\" rel=\"noopener nofollow ugc\">RPIP-31</a>. It’s distinct from the <em>primary</em> withdrawal address (the one you have today). If you have the RPL withdrawal address set, then all RPL rewards you claim will go to that address and all Smoothing Pool ETH you claim will go to your primary withdrawal address.</p>\n<p>The problem, though, is that if you have an RPL withdrawal address set, <em>you can’t claim rewards anymore</em> as the node operator. Only the RPL withdrawal address is allowed to claim rewards. This is fine for RPL rewards but since the Smoothing Pool ETH is tied to the claiming system, it means only the RPL withdrawal address can claim Smoothing Pool ETH on your behalf. Bummer.</p>\n<p>v10 proposes a fix to that via a small tweak to the rewards tree spec, which (thanks to a quirk in the contracts), doesn’t require any contract changes and doesn’t affect nodes that don’t have an RPL withdrawal address set. Here’s the TLDR:</p>\n<ul>\n<li>No contract changes</li>\n<li>Nodes without an RPL withdrawal address are unchanged</li>\n<li>Nodes with an RPL withdrawal address will be removed from the tree, and in their place will be 2 entries:\n<ul>\n<li>1 for the primary withdrawal address, with the ETH</li>\n<li>1 for the RPL withdrawal address, for the RPL</li>\n</ul>\n</li>\n<li>Yes, having tree entries that aren’t node operators actually works and yes, you can only claim for those entries from the entry address itself. Like I said, weird quirk.</li>\n</ul>\n<p>This has an interesting side effect too: if the RPL withdrawal address is set, nodes with the same one will have their RPL aggregated into a single entry within the rewards tree so claiming it will only take a single transaction instead of <code>n</code> transactions (<code>n</code> being the number of nodes with that particular address set). Same story for ETH rewards. It reduces O(n) operations down to O(1) which is compelling for entities that plan to use this setup but are being blocked by linearly scaling gas costs.</p>\n<p>That being said, this also has some important ramifications. For example, it means nodes with the RPL withdrawal address set can no longer <code>claimAndStake</code>, and they can’t claim from the node address anymore - claims have to be done from both the primary withdrawal address and the RPL withdrawal address.</p>\n<p>Instead of rehashing the entire proposal here I think that’s probably a fair summary. Please go take a look at the RPIP and let’s talk!</p>\n            <p><small>28 posts - 8 participants</small></p>\n            <p><a href=\"https://dao.rocketpool.net/t/rewards-tree-spec-v10/2937\">Read full topic</a></p>","link":"https://dao.rocketpool.net/t/rewards-tree-spec-v10/2937","pubDate":"Sat, 20 Apr 2024 03:04:10 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"dao.rocketpool.net-topic-2937"},"source":{"@url":"https://dao.rocketpool.net/t/rewards-tree-spec-v10/2937.rss","#text":"Rewards Tree Spec v10"}},{"title":"GMC Budgeting Allocations","dc:creator":"ShfRyn","category":"Grants / Bounties","description":"<p>The GMC is requesting community feedback on future funding priorities.</p>\n<p><strong>Project Categories</strong><br>\nMarketing - The marketing category encompasses a wide range of projects, with subcategories including videos, business development, marketing materials, live streams, educational initiatives, and POAPs. The marketing has funded YouTube videos such as Rocket Fuel and The Weekly Orbit. The GMC has also invested in educational initiatives such as Rocket School and Rocket Pool University.</p>\n<p>Development - The development category finances projects that have either directly contributed to Rocket Pool Core or have provided valuable tools for the community. Subcategories include community resources, development features, and documentation. Funded development projects include the Rescue Node, RocketScan, Rocket Watch, and others.</p>\n<p>Governance - The governance category includes work on creating RPIPs, conducting protocol research, and producing in-depth papers. Subcategories encompass research, research papers, and governance. Examples include GovAlpha’s efforts in organizing and documenting the Rocket Pool governance process, as well as Valdorff’s administrative management of the Incentives Management Committee, facilitating RPIP-30 and other governance contributions.</p>\n<p>Support - Support primarily involves contributions within the Rocket Pool Discord’s support channel. Some notable support recipients include Patches, [object Object], 0xFornax, haloooloolo, and poupas.</p>\n<p>Public Goods - These are projects that support the greater good of Ethereum. Some examples of these projects include solo support for the Rescue Node and a trustless oracle by DendrETH.</p>\n<p><strong>Allocation History</strong><br>\nThe GMC’s latest report, available <a href=\"https://dao.rocketpool.net\">here</a>, indicates that the first year of funding was well-distributed across different categories.</p>\n<p><strong>Breakdown</strong><br>\nMarketing - 30.7%<br>\nDevelopment - 29.6%<br>\nGovernance - 24.0%<br>\nSupport - 10.4%<br>\nPublic Goods - 5.2%</p>\n<p></p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://dao.rocketpool.net/uploads/default/original/2X/4/40decd4e95466f7449f315432fe8778acf86e7df.jpeg\" data-download-href=\"https://dao.rocketpool.net/uploads/default/40decd4e95466f7449f315432fe8778acf86e7df\" title=\"Screen Shot 2024-04-16 at 1.34.06 PM\"><img src=\"https://dao.rocketpool.net/uploads/default/optimized/2X/4/40decd4e95466f7449f315432fe8778acf86e7df_2_690x388.jpeg\" alt=\"Screen Shot 2024-04-16 at 1.34.06 PM\" data-base62-sha1=\"9fRUmLV6KmSfLQjRWrQ3hzj0BIj\" width=\"690\" height=\"388\" srcset=\"https://dao.rocketpool.net/uploads/default/optimized/2X/4/40decd4e95466f7449f315432fe8778acf86e7df_2_690x388.jpeg, https://dao.rocketpool.net/uploads/default/optimized/2X/4/40decd4e95466f7449f315432fe8778acf86e7df_2_1035x582.jpeg 1.5x, https://dao.rocketpool.net/uploads/default/optimized/2X/4/40decd4e95466f7449f315432fe8778acf86e7df_2_1380x776.jpeg 2x\" data-dominant-color=\"EEE8E3\"></a></div><p></p>\n<p><a href=\"https://dao.rocketpool.net/t/gmc-budgeting-allocations/2933/1\">Click to view the poll.</a></p>\n<p>Please share your thoughts and suggestions below on areas where you would like to see the GMC allocate more funding.</p>\n            <p><small>6 posts - 5 participants</small></p>\n            <p><a href=\"https://dao.rocketpool.net/t/gmc-budgeting-allocations/2933\">Read full topic</a></p>","link":"https://dao.rocketpool.net/t/gmc-budgeting-allocations/2933","pubDate":"Tue, 16 Apr 2024 20:57:48 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"dao.rocketpool.net-topic-2933"},"source":{"@url":"https://dao.rocketpool.net/t/gmc-budgeting-allocations/2933.rss","#text":"GMC Budgeting Allocations"}},{"title":"Rewards Tree Spec v9","dc:creator":"Patches","category":"Governance","description":"<p>I’d like to kick off discussion on Rewards Tree Spec v9. I’d like to see the following changes:</p>\n<h1><a name=\"changes-to-specifications-1\" class=\"anchor\" href=\"https://dao.rocketpool.net#changes-to-specifications-1\"></a>Changes to Specifications</h1>\n<ol>\n<li>Rewards merkle tree file format must be fully specified</li>\n<li>It should be a binary format</li>\n<li>It should no longer contain the CID of the minipool performance file</li>\n</ol>\n<p>The motivation is:</p>\n<ol>\n<li>Enable the oDAO to run alternative treegen implementations</li>\n<li>Remove the need for compression, which currently ties the resulting CIDs (which are part of the consensus vote) to specific versions of the specific compression library used in smartnode</li>\n<li>Make performance file generation optional (simply reduces specification work)</li>\n</ol>\n<p>In more detail, the reason the oDAO cannot currently run independent implementations of treegen is that after building the tree, they must:</p>\n<ol>\n<li>serialize an unspecified performance json file with the exact same bytes as every other oDAO member</li>\n<li>name the file exactly the same as the other oDAO members</li>\n<li>compress that file with the exact same version of <a href=\"https://pkg.go.dev/github.com/klauspost/compress/zstd\" rel=\"noopener nofollow ugc\">this library</a> as other oDAO members</li>\n<li>compute a CID in a manner exactly the same as the other oDAO members</li>\n<li>serialize an unspecified merkle tree json file with the exact same bytes as every other oDAO member, containing the CID from the first file</li>\n<li>repeat steps 3 and 4 with the merkle tree json file</li>\n</ol>\n<p>The zstd library used by watchtower specifically warns against this:</p>\n<blockquote>\n<p>[…] the encoding should never be assumed to remain the same, and you should not use hashes of compressed output for similarity checks.</p>\n</blockquote>\n<p>So, instead of using this compression library, we should just remove the need for compression in the first place. In earlier experiments I’ve done, binary formats had roughly the same file size as compressed json, or even smaller, which make them a good option. In keeping with ethereum practices, <code>ssz</code> seems like the obvious format choice.</p>\n<p>The process, then, would become:</p>\n<ol>\n<li>Serialize the merkle tree ssz file with the same name as the rest of the oDAO</li>\n<li>Compute the CID</li>\n</ol>\n<p>Minipool performance files are not mission-critical and will still be made available, but not necessarily on IPFS.</p>\n<p>Additional tooling will be published to convert ssz trees back into json, and json trees will still be usable to claim rewards.</p>\n<h1><a name=\"process-changes-2\" class=\"anchor\" href=\"https://dao.rocketpool.net#process-changes-2\"></a>Process Changes</h1>\n<p>From v9 and onward, tree specifications, both for the generation of the tree, and the format, name, and ipfs tree of the resulting artifacts will be written as RPIPs.</p>\n<p>Process note: Past rewards tree versions have required a sentiment vote and (somewhat inconsistently) a full pDAO vote to ratify them. Since part of this proposal is to begin codifying the rewards tree specs with RPIPs, I think we should just do a single poll for the RPIP itself, when ready.</p>\n<p>I’m writing this thread now to kick off discussion. A poll will follow when the RPIP is written.</p>\n            <p><small>7 posts - 3 participants</small></p>\n            <p><a href=\"https://dao.rocketpool.net/t/rewards-tree-spec-v9/2928\">Read full topic</a></p>","link":"https://dao.rocketpool.net/t/rewards-tree-spec-v9/2928","pubDate":"Thu, 11 Apr 2024 08:47:46 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"dao.rocketpool.net-topic-2928"},"source":{"@url":"https://dao.rocketpool.net/t/rewards-tree-spec-v9/2928.rss","#text":"Rewards Tree Spec v9"}},{"title":"[Proposal] requesting retrospective grant funding for Node Operator User Research study conducted by OpenUX","dc:creator":"GeorgiaOpenUX","category":"Grants / Bounties","description":"<p>In October 2023, OpenUX began an in-depth study about the experiences of node operators getting started with Rocket Pool. Earlier this year, we <a href=\"https://dao.rocketpool.net/t/completion-of-user-research-report-how-node-operator-experience-insights-can-help-rocket-pool-continue-to-enhance-the-security-of-ethereum/2615/3\">published the full insights including recommendations</a>, produced an explainer video, spoke on a Twitter space to explain the findings, and hosted an AMA with the GMC to discuss possible solutions to put into action.</p>\n<p>In our <a href=\"https://dao.rocketpool.net/t/september-1-9-2023-gmc-call-for-grant-applications-deadline-is-september-9/2156/2\">original proposal</a>, we requested a budget of $50,000 to conduct the work, but agreed to deliver it at a reduced rate in order to prove the value to the GMC and wider community, with the option to request retrospective funding later. We agreed to execute the research study for $33,300 including research participant incentives. We now wish to make a request for retrospective funding of $16,700 to bring us up to the original cost for the work.</p>\n<p>Our goal for the research was to improve the experience of node operators, increase the number of people becoming node operators, and therefore increase the security of Ethereum overall. These are bold but achievable end results, however just having the research findings is not enough to make that so; the end users of our research (Rocket Pool core team, GMC and wider community) must be able to adequately action the findings. And due to the nature of user research in large distributed organizations like Rocket Pool, it can time for findings to turn into action, and results.</p>\n<p>As a measure to evidence the effectiveness of our research, we anonymously surveyed GMC recipients to collect feedback on the research. Three people filled out the survey. Specific feedback we received from members of the GMC and community included:</p>\n<p><em>“Very high quality work. In terms of ‘value adding’ to the community, high marks, though in some cases technical realities diminish the low hang of the low hanging fruit.”</em></p>\n<p><em>“This was a positive experience with OpenUX. It will be interesting to see how many of the suggestions can be actioned by the pDAO or GMC.”</em></p>\n<p><em>“Very professional and helpful report. The actionable stuff might take some time to massage into something that works for us, but that is not a knock to OpenUX.”</em></p>\n<p>We asked our work to be scored and received the following scoring on 3 measurements: the deliverables being high quality, value-adding, and enabling for the Rocket Pool team.</p>\n<p></p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://dao.rocketpool.net/uploads/default/original/2X/a/a9a2a4c5ba15e82b46f1dc4a1a6319145804d989.png\" data-download-href=\"https://dao.rocketpool.net/uploads/default/a9a2a4c5ba15e82b46f1dc4a1a6319145804d989\" title=\"Screenshot 2024-04-09 at 19.23.38\"><img src=\"https://dao.rocketpool.net/uploads/default/optimized/2X/a/a9a2a4c5ba15e82b46f1dc4a1a6319145804d989_2_690x222.png\" alt=\"Screenshot 2024-04-09 at 19.23.38\" data-base62-sha1=\"ocF9Brt70jcQDkWL13L4wXxua2B\" width=\"690\" height=\"222\" srcset=\"https://dao.rocketpool.net/uploads/default/optimized/2X/a/a9a2a4c5ba15e82b46f1dc4a1a6319145804d989_2_690x222.png, https://dao.rocketpool.net/uploads/default/optimized/2X/a/a9a2a4c5ba15e82b46f1dc4a1a6319145804d989_2_1035x333.png 1.5x, https://dao.rocketpool.net/uploads/default/optimized/2X/a/a9a2a4c5ba15e82b46f1dc4a1a6319145804d989_2_1380x444.png 2x\" data-dominant-color=\"EEF0EA\"></a></div><p></p>\n<p>Feedback was overall positive. Based on all the above, we wish to request $16,700 in retrospective grant funding.</p>\n<p>We are interested in any additional feedback on the research, so please do reply to my post here if you have any comments or questions to add prior to the proposal being assessed by the GMC.</p>\n            <p><small>5 posts - 3 participants</small></p>\n            <p><a href=\"https://dao.rocketpool.net/t/proposal-requesting-retrospective-grant-funding-for-node-operator-user-research-study-conducted-by-openux/2924\">Read full topic</a></p>","link":"https://dao.rocketpool.net/t/proposal-requesting-retrospective-grant-funding-for-node-operator-user-research-study-conducted-by-openux/2924","pubDate":"Tue, 09 Apr 2024 19:33:18 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"dao.rocketpool.net-topic-2924"},"source":{"@url":"https://dao.rocketpool.net/t/proposal-requesting-retrospective-grant-funding-for-node-operator-user-research-study-conducted-by-openux/2924.rss","#text":"[Proposal] requesting retrospective grant funding for Node Operator User Research study conducted by OpenUX"}},{"title":"pDAO 2023/03/14-2024/04/11 Treasury Report","dc:creator":"vacalaranja","category":"Governance","description":"<h4><a name=\"hello-rocket-pool-1\" class=\"anchor\" href=\"https://dao.rocketpool.net#hello-rocket-pool-1\"></a>Hello, Rocket Pool!</h4>\n<p>If you need an intro to how pDAO treasury works, check <a href=\"https://dao.rocketpool.net/t/pdao-2022-9-29-2022-12-22-treasury-report/1314/1\">(this post)</a>.</p>\n<p>This period saw the payment of 9,933.64 RPL and 4,072.80 RPL for the IMC and GMC, respectively. This period the pDAO reserve received 6,104.08 RPL from inflation, its balance is now 47,809.20 RPL.</p>\n<p>This period the pDAO allocation was updated from 24.1% to 27.4%, which provides us with an extra 2.5k RPL each period. The IMC and GMC received a bit less than 50% and 20.5% of the pDAO inflation this period  (412.25 and 169.02 RPL less, respectively) to compensate having received more than they were due two periods ago.</p>\n<p>Last period saw the largest pDAO reserve expense yet: <a href=\"https://vote.rocketpool.net/#/proposal/0xcf65db682d2392ba723af437168b0fb528567f1765678d2ef88b92a0edc04b12\" rel=\"noopener nofollow ugc\">RPIP-37 was approved by the pDAO</a> and <a href=\"https://etherscan.io/tx/0x0524ac9f725751244392971d0de22661f79992a2f9b4dec575b8d1f1fbdd49e1\" rel=\"noopener nofollow ugc\">49420.55 RPL were sent to the dev team</a> in order to fund development from 2023-10-26 until 2024-10-24. This represented 54% of the pDAO reserves that went from ~91k to ~41k RPL.</p>\n<p>You can keep up with pDAO treasury with the following spreadsheets:<br>\n(<a href=\"https://docs.google.com/spreadsheets/d/1b8ZtXBzh2TkwrdyGYMPtjZNPB4jzErhp0z29rwb2ByQ/edit?usp=sharing\" rel=\"noopener nofollow ugc\">RP Treasury Report - Google Sheets </a>)<br>\n(<a href=\"https://docs.google.com/spreadsheets/d/1Zo9iFJ2YZNAkgNo53yJGSCnz8XAYuLJ7SeiwJx6oF0A/edit?usp=sharing\" rel=\"noopener nofollow ugc\">pDAO Treasury Summary - Google Sheets </a>).</p>\n<h4><a name=\"thank-you-for-reading-see-you-next-period-2\" class=\"anchor\" href=\"https://dao.rocketpool.net#thank-you-for-reading-see-you-next-period-2\"></a>Thank you for reading, see you next period!</h4>\n            <p><small>1 post - 1 participant</small></p>\n            <p><a href=\"https://dao.rocketpool.net/t/pdao-2023-03-14-2024-04-11-treasury-report/2922\">Read full topic</a></p>","link":"https://dao.rocketpool.net/t/pdao-2023-03-14-2024-04-11-treasury-report/2922","pubDate":"Tue, 09 Apr 2024 07:16:51 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"dao.rocketpool.net-topic-2922"},"source":{"@url":"https://dao.rocketpool.net/t/pdao-2023-03-14-2024-04-11-treasury-report/2922.rss","#text":"pDAO 2023/03/14-2024/04/11 Treasury Report"}},{"title":"Round 12 - GMC Call for Retrospective Applications - Deadline is May 7","dc:creator":"ShfRyn","category":"Grants / Bounties","description":"<p>This thread is for applications for Rocket Pool’s April 7, 2024 - May 7, 2024 retrospective awards. Please only post retrospective award applications in this thread. If you would like to discuss and/or ask questions about any applications you see in this thread, we ask that you do so in this <a href=\"https://dao.rocketpool.net/t/round-12-gmc-community-discussion-of-submitted-applications/2917/1\">separate forum thread</a> which has been established for all community discussions related to this round of applications. Only those grant applications that are posted in this thread and timestamped by May 7, 2024 at 23:59 (11:59 PM) UTC will be considered. Any retrospective award applications posted after that deadline will be carried over to the next award period.</p>\n<p>This is the expected schedule for round 12:</p>\n<ul>\n<li>Application Period (April 7th - May 7th)</li>\n<li>Negotiation Period (May 8th - May 20th)</li>\n<li>Scoring Deadline (May 21st)</li>\n<li>Final Voting Amendments, Discussion and Finalization (May 22nd - May 25th)</li>\n<li>Award Announcement (May 26th)</li>\n</ul>\n<p>To guide you in your application, the GMC has established the following goals and the following scoring rubric:</p>\nGMC Goals <a href=\"https://dao.rocketpool.net/t/round-12-gmc-call-for-retrospective-applications-deadline-is-may-7/2920/1\">(click for more details)</a>\nRetrospective Award Rubric <a href=\"https://dao.rocketpool.net/t/round-12-gmc-call-for-retrospective-applications-deadline-is-may-7/2920/1\">(click for more details)</a>\n<h2><a name=\"retrospective-award-application-template-1\" class=\"anchor\" href=\"https://dao.rocketpool.net#retrospective-award-application-template-1\"></a>Retrospective Award Application Template</h2>\n<p>Please copy paste the template below into a reply. Answer the questions there, feel free to remove or add sections based on relevance.</p>\n<pre><code class=\"lang-auto\">## Name of Retrospective Award\n\n### Who is the proposed retrospective award recipient?\n\n### What specific project or work is the retrospective award in recognition of? Please detail what the project or work entailed and the duration over which it took place.\n\n### Are the subjects of this award entirely open source ([MIT](https://opensource.org/licenses/MIT), [GPL](https://www.gnu.org/licenses/gpl-3.0.en.html), [Apache](https://www.apache.org/licenses/LICENSE-2.0), [CC BY](https://creativecommons.org/licenses/by/4.0/) license or similar)? If not, which parts will not be, why, and under what license will they be published?\n\n\n\n## Benefit\n\n&lt;please enter N/A where appropriate&gt;\n\n| Group | Benefits |\n|---|---|\n| Potential rETH holders | How did the project or work for which the retrospective award would be given help people looking to stake ETH for rETH? |\n| rETH holders | How did the project or work for which the retrospective award would be given help rETH holders? |\n| Potential NOs | How did the project or work for which the retrospective award would be given help people looking to run a Rocket Pool node for the first time? |\n| NOs | How did the project or work for which the retrospective award would be given help people already running a Rocket Pool node? |\n| Community |  How did the project or work for which the retrospective award would be given how does this help the Rocket Pool community? |\n| RPL holders |  How did the project or work for which the retrospective award would be given how does this help RPL holders? |\n\n\n\n## Costs\n\n### How much USD $ is the applicant requesting be awarded to the recipient?\n\n### Is the applicant requesting RPL or LUSD?\n\n\n\n## Conflict of Interest\n\n### Does the person or persons requesting the retrospective award have any conflicts of interest to disclose? (Please disclose here if you are a member of the GMC or if you have nominated a member of the GMC for this retrospective award).\n</code></pre>\n            <p><small>9 posts - 7 participants</small></p>\n            <p><a href=\"https://dao.rocketpool.net/t/round-12-gmc-call-for-retrospective-applications-deadline-is-may-7/2920\">Read full topic</a></p>","link":"https://dao.rocketpool.net/t/round-12-gmc-call-for-retrospective-applications-deadline-is-may-7/2920","pubDate":"Sun, 07 Apr 2024 23:57:21 +0000","discourse:topicPinned":"No","discourse:topicClosed":"Yes","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"dao.rocketpool.net-topic-2920"},"source":{"@url":"https://dao.rocketpool.net/t/round-12-gmc-call-for-retrospective-applications-deadline-is-may-7/2920.rss","#text":"Round 12 - GMC Call for Retrospective Applications - Deadline is May 7"}},{"title":"Round 12 - Call For Bounty Applications - Deadline is May 7","dc:creator":"ShfRyn","category":"Grants / Bounties","description":"<p>This thread is for applications for Rocket Pool’s April 7, 2024 - May 7, 2024 bounties. Please only post bounty applications in this thread. If you would like to discuss and/or ask questions about any applications you see in this thread, we ask that you do so in this <a href=\"https://dao.rocketpool.net/t/round-12-gmc-community-discussion-of-submitted-applications/2917/1\">separate forum thread</a> which has been established for all community discussions related to this round of applications. Only those grant applications that are posted in this thread and timestamped by May 7, 2024 at 23:59 (11:59 PM) UTC will be considered. Any bounties posted after that deadline will be carried over to the next award period.</p>\n<p>This is the expected schedule for round 12:</p>\n<ul>\n<li>Application Period (April 7th - May 7th)</li>\n<li>Negotiation Period (May 8th - May 20th)</li>\n<li>Scoring Deadline (May 21st)</li>\n<li>Final Voting Amendments, Discussion and Finalization (May 22nd - May 25th)</li>\n<li>Award Announcement (May 26th)</li>\n</ul>\nDifferences Between Grants and Bounties <a href=\"https://dao.rocketpool.net/t/round-12-call-for-bounty-applications-deadline-is-may-7/2919/1\">(click for more details)</a>\n<p>To guide you in your application, the GMC has established the following goals and the following scoring rubric:</p>\nGMC Goals <a href=\"https://dao.rocketpool.net/t/round-12-call-for-bounty-applications-deadline-is-may-7/2919/1\">(click for more details)</a>\nBounties Rubric <a href=\"https://dao.rocketpool.net/t/round-12-call-for-bounty-applications-deadline-is-may-7/2919/1\">(click for more details)</a>\n<h1><a name=\"bounty-proposal-template-1\" class=\"anchor\" href=\"https://dao.rocketpool.net#bounty-proposal-template-1\"></a>Bounty Proposal Template</h1>\n<h2><a name=\"guidelines-2\" class=\"anchor\" href=\"https://dao.rocketpool.net#guidelines-2\"></a>Guidelines</h2>\n<ul>\n<li>The goals of the Bounty Proposal are:\n<ul>\n<li>to communicate your bounty idea clearly, in general terms, such that the GMC can decide if it’s worth pursuing.</li>\n<li>to estimate the benefits and costs attached to your proposal.</li>\n<li>to disclose any relevant conflicts of interest.</li>\n</ul>\n</li>\n<li>Answers to the template questions do not need to be highly detailed. Estimates or ranges are acceptable. Brief answers are also fine.</li>\n</ul>\n<h2><a name=\"template-3\" class=\"anchor\" href=\"https://dao.rocketpool.net#template-3\"></a>Template</h2>\n<pre><code class=\"lang-auto\"># Bounty Name\n\n## General Information\n\n### What is the nature of the proposed bounty?\n\n### Why are you writing this bounty proposal?\n\n\n## Benefit\n\n&lt;please enter N/A where appropriate&gt;\n\n| Group | Benefits |\n|---|---|\n| Potential rETH holders | If the bounty is successfully completed, how does this help people looking to stake ETH for rETH? |\n| rETH holders | If the bounty is successfully completed, how does this help rETH holders? |\n| Potential NOs |  If the bounty is successfully completed, how does this help people looking to run a Rocket Pool node for the first time? |\n| NOs | If the bounty is successfully completed, how does this help people already running a Rocket Pool node? |\n| Community |  If the bounty is successfully completed, how does this help the Rocket Pool community? |\n| RPL holders |  If the bounty is successfully completed, how does this help RPL holders? |\n\n### Which other non-RPL protocols, DAOs, projects, or individuals would stand to benefit from the bounty being successfully completed?\n\n\n\n## Work\n\n### What steps would be entailed in completing the bounty? Do successful examples of such work exist elsewhere? What skillsets or knowledge will be required?\n\n### What advice would you give a bounty hunter working on this bounty?\n\n### Should the output of this bounty be available under an open source license?\n\n\n\n## Costs\n\n### How much do you think the completion of this bounty worth to Rocket Pool (in USD)?\n\n### How much work will be needed to verify this bounty has been completed? What skillsets or knowledge will be required?\n\n\n## Structure\n\n### How would you structure this bounty, and why? \n* A single payout to single team on completion? \n* Divided into milestones? \n* Multiple payouts to multiple teams? \n* Should this be written up as multiple bounty definitions?\n* Something else?\n\n### Is this bounty repeatable?\n\n### Are there any reasonable circumstances under which this bounty should be withdrawn? Should it expire?\n\n\n## Conflicts of Interest\n\n### Does the person or persons proposing the bounty have any conflicts of interest to disclose? (Please disclose here if you are a member of the GMC or if any member of the GMC would benefit directly financially from the successful completion of the bounty).\n\n### Will the applicant, or any protocol or project in which the applicant has a vested interest (other than Rocket Pool), benefit financially if the bounty is successfully completed?\n</code></pre>\n<h1><a name=\"bounty-definition-template-4\" class=\"anchor\" href=\"https://dao.rocketpool.net#bounty-definition-template-4\"></a>Bounty Definition Template</h1>\n<h2><a name=\"guidelines-5\" class=\"anchor\" href=\"https://dao.rocketpool.net#guidelines-5\"></a>Guidelines</h2>\n<ul>\n<li>When a single proposal bounty proposal has parts that must be completed by different groups, it should become multiple definitions.</li>\n<li>Where reasonably possible, bountiy definitions should limit the number of distinct skillsets required for completion of the bounty.</li>\n<li>Bounties should be defined in terms of the smallest worthwhile unit of work. IE: $25 to add/update a single relevant FAQ question rather than $5,000 to update the FAQ.</li>\n<li>Include any information or resources that might reasonably help a bounty hunter complete the bounty.</li>\n<li>Think carefully about which tasks are required, and which can be optional.</li>\n<li>Clearly list any dependencies, if the bounty cannot be completed in all circumstances.</li>\n<li>Only include multiple milestones for large bounties with natural points of division.</li>\n</ul>\n<h2><a name=\"template-6\" class=\"anchor\" href=\"https://dao.rocketpool.net#template-6\"></a>Template</h2>\n<pre><code class=\"lang-auto\"># Bounty Name \n\n## Data\n* Repeatable?\n* Expiring?\n* Skillsets for completion? (See existing bounties and reuse where possible, new skillsets are recommended if sufficiently distinct)\n* Relevant tags? (See existing bounties and reuse where possible, new tags are recommended if sufficiently distinct)\n* Min reward (USD)?\n* Max reward (USD)?\n* Any linked definitions? (e.g. if a single bounty proposal becomes multiple definitions.)\n* Any dependencies? \n\n## Summary \nShort 1-3 sentences describing the bounty.\n\n## Dependencies\nIs there anything that must happen (outside of a bounty hunter's control) before it is possible to complete this bounty? This may be other bounties that must be completed first, an upcoming event or change or a regular occurance that triggers a valid bounty. This section is optional. May be later removed from the definition if the dependency becomes permanently met. \n\n## Required Milestones\nWhat _must_ be completed for a bounty hunter to claim some amount of bounty. Described per milestone.\n\n### Milestone A - &lt;Name of Milestone&gt;\n**Payout: ** &lt;payout amount&gt;\nClear bulleted list or subheadings covering the items that must be completed and/or adhered to for this milestone to be valid.\n\n### Milestone B - &lt;Name of Milestone&gt;\n**Payout: ** &lt;payout amount&gt;\nClear bulleted list or subheadings covering the items that must be completed and/or adhered to for this milestone to be valid.\n\n### Milestone C - &lt;Name of Milestone&gt;...\n\n## Optional Milestones\nWhat tasks _may_ be completed for a bounty hunter to earn extra bounty rewards. Described per milestone. This section is optional.\n\nOptional milestones may be less strictly defined than required milestones. You may aggregate multiple minor considerations that would contribute to a payout. \n\n### Milestone D - &lt;Name of Milestone&gt;\n**Maximum Payout: ** &lt;maximum payout amount&gt;\nClear bulleted list of the items that would contribute to payout for this milestone.\n\n### Milestone E - &lt;Name of Milestone&gt;...\n\n\n## Further Notes\nAnything you think that would be beneficial for a bounty hunter to know when working on this bounty. Maybe be divided into subsections as needed.\n\n## Resources\nLinks to repositories, web pages, forum discussions, etc. Anything that the bounty hunter may be able to use to do a better job on the bounty work. \n\n## Contacts\nIndividuals that have agreed to act as contacts for this bounty. Include usernames + contact details for any platform on which the contact is willing to respond to requests. Any contacts are expected to fully understand the bounty definition. This section is optional. \n\nContacts:\n* MAY be eligible for incentives.\n* SHOULD NOT assist the bounty hunter directly with the bounty work.\n* SHOULD assist bounty hunters via feedback, direction and oversight upon request.\n\n## Verification\nWho is expected to verify that the work delivered meets the relevant milestones? This person or group must have agreed to do this in advance of this definition being published. This person or group should have any relevant skillsets needed to properly verify the bounty work.\n\n\n</code></pre>\n            <p><small>6 posts - 3 participants</small></p>\n            <p><a href=\"https://dao.rocketpool.net/t/round-12-call-for-bounty-applications-deadline-is-may-7/2919\">Read full topic</a></p>","link":"https://dao.rocketpool.net/t/round-12-call-for-bounty-applications-deadline-is-may-7/2919","pubDate":"Sun, 07 Apr 2024 23:55:06 +0000","discourse:topicPinned":"No","discourse:topicClosed":"Yes","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"dao.rocketpool.net-topic-2919"},"source":{"@url":"https://dao.rocketpool.net/t/round-12-call-for-bounty-applications-deadline-is-may-7/2919.rss","#text":"Round 12 - Call For Bounty Applications - Deadline is May 7"}},{"title":"Round 12 - Call For Grant Applications - Deadline is May 7","dc:creator":"ShfRyn","category":"Grants / Bounties","description":"<p>This thread is for applications for Rocket Pool’s April 7, 2024 - May 7, 2024 grants. Please only post grant applications in this thread. If you would like to discuss and/or ask questions about any applications you see in this thread, we ask that you do so in this <a href=\"https://dao.rocketpool.net/t/round-12-gmc-community-discussion-of-submitted-applications/2917/1\">separate forum thread</a> which has been established for all community discussions related to this round of applications. Only those grant applications that are posted in this thread and timestamped by May 7, 2024 at 23:59 (11:59 PM) UTC will be considered. Any grants posted after that deadline will be carried over to the next award period.</p>\n<p>This is the expected schedule for round 12:</p>\n<ul>\n<li>Application Period (April 7th - May 7th)</li>\n<li>Negotiation Period (May 8th - May 20th)</li>\n<li>Scoring Deadline (May 21st)</li>\n<li>Final Voting Amendments, Discussion and Finalization (May 22nd - May 25th)</li>\n<li>Award Announcement (May 26th)</li>\n</ul>\nDifferences Between Grants and Bounties <a href=\"https://dao.rocketpool.net/t/round-12-call-for-grant-applications-deadline-is-may-7/2918/1\">(click for more details)</a>\n<p>To guide you in your application, the GMC has established the following goals and the following scoring rubric:</p>\nGMC Goals <a href=\"https://dao.rocketpool.net/t/round-12-call-for-grant-applications-deadline-is-may-7/2918/1\">(click for more details)</a>\nGrants Rubric <a href=\"https://dao.rocketpool.net/t/round-12-call-for-grant-applications-deadline-is-may-7/2918/1\">(click for more details)</a>\n<h2><a name=\"grant-application-template-1\" class=\"anchor\" href=\"https://dao.rocketpool.net#grant-application-template-1\"></a>Grant Application Template</h2>\n<p>Please copy paste the template below into a reply. Answer the questions there, feel free to remove or add sections based on relevance.</p>\n<pre><code class=\"lang-auto\">## Name of Grant\n\n### What is the work being proposed?\n\n### Is there any related work this builds off of?\n\n### Will the results of this project be entirely open source ([MIT](https://opensource.org/licenses/MIT), [GPL](https://www.gnu.org/licenses/gpl-3.0.en.html), [Apache](https://www.apache.org/licenses/LICENSE-2.0), [CC BY](https://creativecommons.org/licenses/by/4.0/) license or similar)? If not, which parts will not be, why, and under what license will they be published?\n\n\n\n## Benefit\n\n&lt;please enter N/A where appropriate&gt;\n\n| Group | Benefits |\n|---|---|\n| Potential rETH holders | If the grant is successfully completed, how does this help people looking to stake ETH for rETH? |\n| rETH holders | If the grant is successfully completed, how does this help rETH holders? |\n| Potential NOs |  If the grant is successfully completed, how does this help people looking to run a Rocket Pool node for the first time? |\n| NOs | If the grant is successfully completed, how does this help people already running a Rocket Pool node? |\n| Community |  If the grant is successfully completed, how does this help the Rocket Pool community? |\n| RPL holders |  If the grant is successfully completed, how does this help RPL holders? |\n\n### Which other non-RPL protocols, DAOs, projects, or individuals, would stand to benefit from this grant?\n\n\n\n## Work\n\n### Who is doing the work?\n\n### What is the background of the person(s) doing the work? What experience do they have with such projects in the past?\n\n### What is the breakdown of the proposed work, in terms of milestones and/or deadlines?\n\n### How is the work being tested? Is testing included in the schedule?\n\n### How will the work be maintained after delivery?\n\n\n\n## Costs\n\n### What is the acceptance criteria?\n\n### What is the proposed payment schedule for the grant? How much USD $ and over what period of time is the applicant requesting?\n\n### Is the applicant requesting RPL or LUSD?\n\n### How will the GMC verify that the work delivered matches the proposed cadence?\n\n### What alternatives or options have been considered in order to save costs for the proposed project?\n\n\n\n## Conflict of Interest\n\n### Does the person or persons proposing the grant have any conflicts of interest to disclose? (Please disclose here if you are a member of the GMC or if any member of the GMC would benefit directly financially from the grant).\n\n### Will the recipient of the grant, or any protocol or project in which the recipient has a vested interest (other than Rocket Pool), benefit financially if the grant is successful?\n</code></pre>\n            <p><small>5 posts - 2 participants</small></p>\n            <p><a href=\"https://dao.rocketpool.net/t/round-12-call-for-grant-applications-deadline-is-may-7/2918\">Read full topic</a></p>","link":"https://dao.rocketpool.net/t/round-12-call-for-grant-applications-deadline-is-may-7/2918","pubDate":"Sun, 07 Apr 2024 23:52:28 +0000","discourse:topicPinned":"No","discourse:topicClosed":"Yes","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"dao.rocketpool.net-topic-2918"},"source":{"@url":"https://dao.rocketpool.net/t/round-12-call-for-grant-applications-deadline-is-may-7/2918.rss","#text":"Round 12 - Call For Grant Applications - Deadline is May 7"}},{"title":"Round 12 - GMC Community Discussion of Submitted Applications","dc:creator":"ShfRyn","category":"Grants / Bounties","description":"<p>In order to keep the application threads clear of discussions (to make it easier for committee members to read and score them), please use this thread for any and all questions and discussions of round 12 period of grant, bounty, and retrospective award applications.</p>\n            <p><small>15 posts - 8 participants</small></p>\n            <p><a href=\"https://dao.rocketpool.net/t/round-12-gmc-community-discussion-of-submitted-applications/2917\">Read full topic</a></p>","link":"https://dao.rocketpool.net/t/round-12-gmc-community-discussion-of-submitted-applications/2917","pubDate":"Sun, 07 Apr 2024 23:47:54 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"dao.rocketpool.net-topic-2917"},"source":{"@url":"https://dao.rocketpool.net/t/round-12-gmc-community-discussion-of-submitted-applications/2917.rss","#text":"Round 12 - GMC Community Discussion of Submitted Applications"}},{"title":"Tokenomic Rework Vibe Check: Surplus Revenue Redistribution","dc:creator":"Valdorff","category":"Growth","description":"<p>Hi All,</p>\n<p>Some of us research/governance nerds wanted to get a pulse on the perceptions of a broader group.</p>\n<p>The current <a href=\"https://dao.rocketpool.net/t/2024-tokenomics-rework-drafts/2847\">draft proposal</a> starts with the the total amount of revenue from rETH commission and then splits it up. First, it ensures that NOs are getting paid enough to want to be with RP (the <code>node_operator_commission_share</code>). Next it pays vote-eligible staked RPL enough to ensure governance is very expensive to attack (the <code>voter_share</code>). Finally - the remaining revenue is “surplus”. Here is a summary table with 3 columns of how we could direct that surplus – I’d love to hear which you think would be most beneficial to RP and RPL.</p>\n<div class=\"md-table\">\n<table>\n<thead>\n<tr>\n<th></th>\n<th>Increase <code>voter_share</code></th>\n<th>Buy &amp; burn</th>\n<th>LP deposits</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>Benefit mechanism</td>\n<td>100% of ETH is distributed based on vote-eligible staked RPL</td>\n<td>100% of ETH is used to buy RPL and burn it, creating ongoing demand</td>\n<td>100% of ETH is used for single-asset deposits in a weighted pool; this means ~90% of ETH creates ongoing demand and ~10% of ETH provides liquidity depth to ensure easy entrance/exit</td>\n</tr>\n<tr>\n<td>Market addressed</td>\n<td>People that want to (a) stake RPL, (b) run a node, (c) stake a “matching” amount of ETH</td>\n<td>People that want to hold RPL (staked or not); note that a larger market means more total demand, which may bolster value/price</td>\n<td>Same as buy &amp; burn</td>\n</tr>\n<tr>\n<td>Building on top</td>\n<td>A second layer could address folks that want to stake RPL amounts that don’t match the amount of ETH they want to stake; since this increases earnings, the second layer could take a portion as a revenue stream</td>\n<td>RPL stakers/holders freely earn the “surplus” revenue stream without using a second layer. A second layer could access the <code>voter_share</code> as needed for governance.</td>\n<td>Same as buy &amp; burn</td>\n</tr>\n<tr>\n<td>Utility in defi</td>\n<td>Choosing to use RPL in defi, eg, as collateral, would result in that RPL being much less productive than if it’s staked</td>\n<td>Choosing to use RPL in defi, would result in that RPL being somewhat less productive (would lose the <code>voter_share</code>, but not the surplus revenue)</td>\n<td>Same as buy &amp; burn</td>\n</tr>\n</tbody>\n</table>\n</div><h3><a name=\"which-of-these-do-you-think-would-be-most-beneficial-to-rp-and-rpl-1\" class=\"anchor\" href=\"https://dao.rocketpool.net#which-of-these-do-you-think-would-be-most-beneficial-to-rp-and-rpl-1\"></a>Which of these do you think would be most beneficial to RP and RPL?</h3>\n<p><em>(select more than one if you think it’s close)</em></p>\n<p><a href=\"https://dao.rocketpool.net/t/tokenomic-rework-vibe-check-surplus-revenue-redistribution/2912/1\">Click to view the poll.</a></p>\n<p>If you have question, comments, feedback, or simply want to discuss – this thread’s a perfect place for it <img src=\"https://dao.rocketpool.net/images/emoji/twitter/slight_smile.png?v=12\" title=\":slight_smile:\" class=\"emoji\" alt=\":slight_smile:\" loading=\"lazy\" width=\"20\" height=\"20\"></p>\n            <p><small>12 posts - 7 participants</small></p>\n            <p><a href=\"https://dao.rocketpool.net/t/tokenomic-rework-vibe-check-surplus-revenue-redistribution/2912\">Read full topic</a></p>","link":"https://dao.rocketpool.net/t/tokenomic-rework-vibe-check-surplus-revenue-redistribution/2912","pubDate":"Sun, 07 Apr 2024 03:33:01 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"dao.rocketpool.net-topic-2912"},"source":{"@url":"https://dao.rocketpool.net/t/tokenomic-rework-vibe-check-surplus-revenue-redistribution/2912.rss","#text":"Tokenomic Rework Vibe Check: Surplus Revenue Redistribution"}},{"title":"Solutions to Guard Against MEV Theft [Research Paper]","dc:creator":"ShfRyn","category":"Governance","description":"<p><a class=\"mention\" href=\"https://dao.rocketpool.net/u/ken\">@ken</a> has completed a draft of a research report on Forced Exits. This paper was approved funding by the GMC during round 1. (<a href=\"https://dao.rocketpool.net/t/january-2023-gmc-call-for-grant-applications-deadline-is-january-15th/1335/24\">Link to Application</a>) (<a href=\"https://dao.rocketpool.net/t/january-2023-grants-bounties-retrospective-awards-round-results/1474/20\">Link to Award Results</a>)</p>\n<p>The 34-page  discusses Ethereum staking concepts and strategies to combat MEV theft. It covers staking rewards, MEV, and methods to detect and prevent MEV theft, including off-chain and on-chain solutions such as forced exits.</p>\n<p>A draft copy for review and comment can be found <a href=\"https://github.com/htimsk/ForcedExits/blob/main/README.md\">here</a>.</p>\n<blockquote>\n<p>I think its timing will be quite useful with the tokenomic design under current consideration and the early planning efforts for Megapools and Saturn design objectives.<br>\n<strong>- Ken</strong></p>\n</blockquote>\n<p>I’m sharing it here to enhance visibility and to encourage any questions, critiques, or comments on the paper.</p>\n            <p><small>3 posts - 3 participants</small></p>\n            <p><a href=\"https://dao.rocketpool.net/t/solutions-to-guard-against-mev-theft-research-paper/2906\">Read full topic</a></p>","link":"https://dao.rocketpool.net/t/solutions-to-guard-against-mev-theft-research-paper/2906","pubDate":"Fri, 05 Apr 2024 19:27:38 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"dao.rocketpool.net-topic-2906"},"source":{"@url":"https://dao.rocketpool.net/t/solutions-to-guard-against-mev-theft-research-paper/2906.rss","#text":"Solutions to Guard Against MEV Theft [Research Paper]"}},{"title":"Notification Channels Poll","dc:creator":"Patches","category":"Node Operator Experience","description":"<p>Thanks to the diligent work of <a class=\"mention\" href=\"https://dao.rocketpool.net/u/activescott\">@activescott</a> smartnode 1.12 added the alerts/notifications feature, and currently only supports discord notifications.</p>\n<p>Under the hood, we use alertmanager, which supports many more channels. Please vote for the ones you are likely to use in this poll so we can prioritize the order in which we add and test them.</p>\n<p><a href=\"https://dao.rocketpool.net/t/notification-channels-poll/2901/1\">Click to view the poll.</a></p>\n<p>Additionally, how important is it to you that you are able to route specific alerts to one or more channels (e.g. uptime alerts to Pagerduty, Proposal Notifications to Email, Critically Low Disk Space to Pagerduty AND Email.)</p>\n<p><a href=\"https://dao.rocketpool.net/t/notification-channels-poll/2901/1\">Click to view the poll.</a></p>\n            <p><small>3 posts - 2 participants</small></p>\n            <p><a href=\"https://dao.rocketpool.net/t/notification-channels-poll/2901\">Read full topic</a></p>","link":"https://dao.rocketpool.net/t/notification-channels-poll/2901","pubDate":"Tue, 02 Apr 2024 16:31:21 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"dao.rocketpool.net-topic-2901"},"source":{"@url":"https://dao.rocketpool.net/t/notification-channels-poll/2901.rss","#text":"Notification Channels Poll"}},{"title":"RPIP-0 Draft and Sentiment Poll","dc:creator":"Valdorff","category":"Community","description":"<p>Hi All,</p>\n<p>After a great deal of thought, I think I have found a solution to all of RP’s governance and strategy issues that has no downsides of any kind. Please see <a href=\"https://github.com/Valdorff/RPIPs/blob/rpip-0/RPIPs/RPIP-0.md\" rel=\"noopener nofollow ugc\">RPIP-0 draft</a>.</p>\n<p><a href=\"https://dao.rocketpool.net/t/rpip-0-draft-and-sentiment-poll/2896/1\">Click to view the poll.</a></p>\n            <p><small>9 posts - 8 participants</small></p>\n            <p><a href=\"https://dao.rocketpool.net/t/rpip-0-draft-and-sentiment-poll/2896\">Read full topic</a></p>","link":"https://dao.rocketpool.net/t/rpip-0-draft-and-sentiment-poll/2896","pubDate":"Mon, 01 Apr 2024 17:05:44 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"dao.rocketpool.net-topic-2896"},"source":{"@url":"https://dao.rocketpool.net/t/rpip-0-draft-and-sentiment-poll/2896.rss","#text":"RPIP-0 Draft and Sentiment Poll"}},{"title":"GMC 2024/03/01 - 2024/03/31 Treasury Report","dc:creator":"ShfRyn","category":"Grants / Bounties","description":"<p>Here is a link to the treasury sheet - <a href=\"https://docs.google.com/spreadsheets/d/1dMtHJ4sffBidSN5RphLYC9A5HrsRNqHfqLVn-nJR104/\">GMC Treasury Sheet - Google Sheets </a></p>\n<div class=\"md-table\">\n<table>\n<thead>\n<tr>\n<th>Funds at Start</th>\n<th>Inflows</th>\n<th>Payments</th>\n<th>Diversification (LUSD)</th>\n<th>Outflows (Total)</th>\n<th>Funds at End</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>56,282.02</td>\n<td>4072.796</td>\n<td>2,086.07</td>\n<td>0.00</td>\n<td>2,086.07</td>\n<td>58268.74</td>\n</tr>\n</tbody>\n</table>\n</div><div class=\"md-table\">\n<table>\n<thead>\n<tr>\n<th>LUSD Funds at Start</th>\n<th>LUSD Inflows</th>\n<th>LUSD Payments</th>\n<th>LUSD Funds at End</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>103,991.61</td>\n<td>0.00</td>\n<td>0</td>\n<td>103,991.61</td>\n</tr>\n</tbody>\n</table>\n</div><p>In March, the GMC did not transfer RPL for LUSD due to a larger transfer made in the previous month, mainly driven by catch-up payments. Additionally, their RPL inflow (4072.796) was received later in the month, after payments were processed on the 20th. This month saw fewer payments compared to the average. For a comprehensive overview of GMC spending trends over time, refer to the latest GMC report available <a href=\"https://rocketpoolgmc.github.io/rocketpool-gmc/reports/gmc-report-2024.pdf\">here</a>.</p>\n            <p><small>1 post - 1 participant</small></p>\n            <p><a href=\"https://dao.rocketpool.net/t/gmc-2024-03-01-2024-03-31-treasury-report/2895\">Read full topic</a></p>","link":"https://dao.rocketpool.net/t/gmc-2024-03-01-2024-03-31-treasury-report/2895","pubDate":"Mon, 01 Apr 2024 16:58:51 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"dao.rocketpool.net-topic-2895"},"source":{"@url":"https://dao.rocketpool.net/t/gmc-2024-03-01-2024-03-31-treasury-report/2895.rss","#text":"GMC 2024/03/01 - 2024/03/31 Treasury Report"}}]}}}