{"rss":{"@version":"2.0","@xmlns:discourse":"http://www.discourse.org/","@xmlns:atom":"http://www.w3.org/2005/Atom","@xmlns:dc":"http://purl.org/dc/elements/1.1/","channel":{"title":"Rocket Pool Governance - Latest topics","link":"https://dao.rocketpool.net/latest","description":"Latest topics","language":"en-GB","lastBuildDate":"Fri, 13 Sep 2024 07:07:07 +0000","atom:link":{"@href":"https://dao.rocketpool.net/latest.rss","@rel":"self","@type":"application/rss+xml"},"item":[{"title":"How to Diversify Staking Portfolio with Rocket Pool?","dc:creator":"leroga1934","category":"Uncategorized","description":"<p>Hey guys… <img src=\"https://dao.rocketpool.net/images/emoji/twitter/wave.png?v=12\" title=\":wave:\" class=\"emoji\" alt=\":wave:\" loading=\"lazy\" width=\"20\" height=\"20\"></p>\n<p>I am intrigued by the idea of being able to participate in Ethereum staking without needing to run a validator myself. However, I have a few questions on how best to integrate Rocket Pool into a broader staking strategy.</p>\n<ul>\n<li>\n<p>Node Operation vs. Liquid Staking: Could someone explain the pros and cons of running a Rocket Pool node versus simply using rETH for liquid staking? What are the key factors to consider when deciding between these options?</p>\n</li>\n<li>\n<p>How does Rocket Pool help mitigate risks compared to other staking methods? Are there specific strategies or best practices to ensure a safer staking experience?</p>\n</li>\n<li>\n<p>Lastly, how does the earnings potential compare when using Rocket Pool versus staking directly or with other protocols? What has been the community’s experience in terms of returns?</p>\n</li>\n</ul>\n<p>I also check this: <a href=\"https://dao.rocketpool.net/t/bankless-academy-staking-on-ethereum-lesson-w-rocket-pool/2730\">https://dao.rocketpool.net/t/bankless-academy-staking-on-ethereum-lesson-w-rocket-pool</a><a href=\"https://www.igmguru.com/digital-marketing-programming/mendix-training\" rel=\"noopener nofollow ugc\">mendix</a> But I have not found any solution. Could anyone guide me about this?</p>\n<p>Your help will be grateful for me.</p>\n<p>Thanks in advance!</p>\n<p>Respected community member! <img src=\"https://dao.rocketpool.net/images/emoji/twitter/smiling_face_with_three_hearts.png?v=12\" title=\":smiling_face_with_three_hearts:\" class=\"emoji\" alt=\":smiling_face_with_three_hearts:\" loading=\"lazy\" width=\"20\" height=\"20\"></p>\n            <p><small>2 posts - 2 participants</small></p>\n            <p><a href=\"https://dao.rocketpool.net/t/how-to-diversify-staking-portfolio-with-rocket-pool/3271\">Read full topic</a></p>","link":"https://dao.rocketpool.net/t/how-to-diversify-staking-portfolio-with-rocket-pool/3271","pubDate":"Fri, 13 Sep 2024 07:07:07 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"dao.rocketpool.net-topic-3271"},"source":{"@url":"https://dao.rocketpool.net/t/how-to-diversify-staking-portfolio-with-rocket-pool/3271.rss","#text":"How to Diversify Staking Portfolio with Rocket Pool?"}},{"title":"RPIP-63: Houston Hotfix","dc:creator":"langers","category":"Governance","description":"<p>This is the official discussion thread for <a href=\"https://rpips.rocketpool.net/RPIPs/RPIP-63\">RPIP-63: Houston Hotfix</a>.</p>\n<p>The changes described in this RPIP are about to enter audits. We acknowledge that this is not the preferred flow of creating an RPIP ahead of the work. In part this is because the initial scope of the hotfix was purely in “bugfix” territory and it grew to include items that merited a pDAO vote.</p>\n<p>Key required bugfixes:</p>\n<ul>\n<li>Fixing legacy minipool finalisation</li>\n<li>Onchain voting: Prevent abuse of proposals to exit RPL stake</li>\n<li>Onchain voting: Prevent attacks that allow a proposer’s bond to be stolen</li>\n<li>Reduce the guardrail on on-chain voting quorum (the exact number is up for discussion)</li>\n</ul>\n<p>Key items that aren’t required bugfixes:</p>\n<ul>\n<li>Allow the minimum per-minipool RPL stake to go to zero without causing reverts elsewhere; while this is a bugfix, it’s only needed to enable something similar to RPIP-62</li>\n<li>Use ETH for the scrub check penalty instead of RPL; this is primarily needed to enable something similar to RPIP-62</li>\n</ul>\n            <p><small>6 posts - 4 participants</small></p>\n            <p><a href=\"https://dao.rocketpool.net/t/rpip-63-houston-hotfix/3269\">Read full topic</a></p>","link":"https://dao.rocketpool.net/t/rpip-63-houston-hotfix/3269","pubDate":"Fri, 13 Sep 2024 05:42:12 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"dao.rocketpool.net-topic-3269"},"source":{"@url":"https://dao.rocketpool.net/t/rpip-63-houston-hotfix/3269.rss","#text":"RPIP-63: Houston Hotfix"}},{"title":"Round 17 - GMC Call for Retrospective Applications - Deadline is October 7","dc:creator":"ShfRyn","category":"Grants / Bounties","description":"<p>This thread is for applications for Rocket Pool’s September 7, 2024 - October 7, 2024 retrospective awards. Please only post retrospective award applications in this thread. If you would like to discuss and/or ask questions about any applications you see in this thread, we ask that you do so in this <a href=\"https://dao.rocketpool.net/t/round-17-gmc-community-discussion-of-submitted-applications/3251\">separate forum thread</a> which has been established for all community discussions related to this round of applications. Only those retrospective applications that are posted in this thread and timestamped by October 7, 2024 at 23:59 (11:59 PM) UTC will be considered. Any retrospective award applications posted after that deadline will be carried over to the next award period.</p>\n<p>This is the expected schedule for round 17:</p>\n<ul>\n<li>\n<p>Application Period (September 7 - October 7)</p>\n</li>\n<li>\n<p>Scoring Deadline (October 22)</p>\n</li>\n<li>\n<p>Final Voting Amendments, Discussion and Finalization (October 23 - October 26)</p>\n</li>\n<li>\n<p>Award Announcement (October 29)</p>\n</li>\n</ul>\n<p>To guide you in your application, the GMC has established the following goals and the following scoring rubric:</p>\nGMC Goals <a href=\"https://dao.rocketpool.net/t/round-17-gmc-call-for-retrospective-applications-deadline-is-october-7/3254/1\">(click for more details)</a>\nRetrospective Award Rubric <a href=\"https://dao.rocketpool.net/t/round-17-gmc-call-for-retrospective-applications-deadline-is-october-7/3254/1\">(click for more details)</a>\n<h2><a name=\"p-9723-retrospective-award-application-template-1\" class=\"anchor\" href=\"https://dao.rocketpool.net#p-9723-retrospective-award-application-template-1\"></a>Retrospective Award Application Template</h2>\n<p>Please copy paste the template below into a reply. Answer the questions there, feel free to remove or add sections based on relevance.</p>\n<pre><code class=\"lang-auto\">\n## Name of Retrospective Award\n\n### Who is the proposed retrospective award recipient?\n\n### What specific project or work is the retrospective award in recognition of? Please detail what the project or work entailed and the duration over which it took place.\n\n### Are the subjects of this award entirely open source ([MIT](https://opensource.org/licenses/MIT), [GPL](https://www.gnu.org/licenses/gpl-3.0.en.html), [Apache](https://www.apache.org/licenses/LICENSE-2.0), [CC BY](https://creativecommons.org/licenses/by/4.0/) license or similar)? If not, which parts will not be, why, and under what license will they be published?\n\n## Benefit\n\n&lt;please enter N/A where appropriate&gt;\n\n| Group | Benefits |\n\n|---|---|\n\n| Potential rETH holders | How did the project or work for which the retrospective award would be given help people looking to stake ETH for rETH? |\n\n| rETH holders | How did the project or work for which the retrospective award would be given help rETH holders? |\n\n| Potential NOs | How did the project or work for which the retrospective award would be given help people looking to run a Rocket Pool node for the first time? |\n\n| NOs | How did the project or work for which the retrospective award would be given help people already running a Rocket Pool node? |\n\n| Community | How did the project or work for which the retrospective award would be given how does this help the Rocket Pool community? |\n\n| RPL holders | How did the project or work for which the retrospective award would be given how does this help RPL holders? |\n\n## Costs\n\n### How much USD $ is the applicant requesting be awarded to the recipient?\n\n### Is the applicant requesting RPL or LUSD?\n\n## Conflict of Interest\n\n### Does the person or persons requesting the retrospective award have any conflicts of interest to disclose? (Please disclose here if you are a member of the GMC or if you have nominated a member of the GMC for this retrospective award).\n\n</code></pre>\n            <p><small>1 post - 1 participant</small></p>\n            <p><a href=\"https://dao.rocketpool.net/t/round-17-gmc-call-for-retrospective-applications-deadline-is-october-7/3254\">Read full topic</a></p>","link":"https://dao.rocketpool.net/t/round-17-gmc-call-for-retrospective-applications-deadline-is-october-7/3254","pubDate":"Sat, 07 Sep 2024 17:49:57 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"dao.rocketpool.net-topic-3254"},"source":{"@url":"https://dao.rocketpool.net/t/round-17-gmc-call-for-retrospective-applications-deadline-is-october-7/3254.rss","#text":"Round 17 - GMC Call for Retrospective Applications - Deadline is October 7"}},{"title":"Round 17 - GMC Call for Bounty Applications - Deadline is October 7","dc:creator":"ShfRyn","category":"Grants / Bounties","description":"<p>This thread is for applications for Rocket Pool’s September 7, 2024 - October 7, 2024 bounties. Please only post bounty applications in this thread. If you would like to discuss and/or ask questions about any applications you see in this thread, we ask that you do so in this <a href=\"https://dao.rocketpool.net/t/round-17-gmc-community-discussion-of-submitted-applications/3251\">separate forum thread</a> which has been established for all community discussions related to this round of applications. Only those grant applications that are posted in this thread and timestamped by October 7, 2024 at 23:59 (11:59 PM) UTC will be considered. Any bounties posted after that deadline will be carried over to the next award period.</p>\n<p>This is the expected schedule for round 17:</p>\n<ul>\n<li>\n<p>Application Period (September 7 - October 7)</p>\n</li>\n<li>\n<p>Scoring Deadline (October 22)</p>\n</li>\n<li>\n<p>Final Voting Amendments, Discussion and Finalization (October 23 - October 26)</p>\n</li>\n<li>\n<p>Award Announcement (October 29)</p>\n</li>\n</ul>\nDifferences Between Grants and Bounties <a href=\"https://dao.rocketpool.net/t/round-17-gmc-call-for-bounty-applications-deadline-is-october-7/3253/1\">(click for more details)</a>\n<p>To guide you in your application, the GMC has established the following goals and the following scoring rubric:</p>\nGMC Goals <a href=\"https://dao.rocketpool.net/t/round-17-gmc-call-for-bounty-applications-deadline-is-october-7/3253/1\">(click for more details)</a>\nBounties Rubric <a href=\"https://dao.rocketpool.net/t/round-17-gmc-call-for-bounty-applications-deadline-is-october-7/3253/1\">(click for more details)</a>\n<h1><a name=\"p-9722-bounty-proposal-template-1\" class=\"anchor\" href=\"https://dao.rocketpool.net#p-9722-bounty-proposal-template-1\"></a>Bounty Proposal Template</h1>\n<h2><a name=\"p-9722-guidelines-2\" class=\"anchor\" href=\"https://dao.rocketpool.net#p-9722-guidelines-2\"></a>Guidelines</h2>\n<ul>\n<li>\n<p>The goals of the Bounty Proposal are:</p>\n</li>\n<li>\n<p>to communicate your bounty idea clearly, in general terms, such that the GMC can decide if it’s worth pursuing.</p>\n</li>\n<li>\n<p>to estimate the benefits and costs attached to your proposal.</p>\n</li>\n<li>\n<p>to disclose any relevant conflicts of interest.</p>\n</li>\n<li>\n<p>Answers to the template questions do not need to be highly detailed. Estimates or ranges are acceptable. Brief answers are also fine.</p>\n</li>\n</ul>\n<h2><a name=\"p-9722-template-3\" class=\"anchor\" href=\"https://dao.rocketpool.net#p-9722-template-3\"></a>Template</h2>\n<pre><code class=\"lang-auto\">\n# Bounty Name\n\n## General Information\n\n### What is the nature of the proposed bounty?\n\n### Why are you writing this bounty proposal?\n\n## Benefit\n\n&lt;please enter N/A where appropriate&gt;\n\n| Group | Benefits |\n\n|---|---|\n\n| Potential rETH holders | If the bounty is successfully completed, how does this help people looking to stake ETH for rETH? |\n\n| rETH holders | If the bounty is successfully completed, how does this help rETH holders? |\n\n| Potential NOs | If the bounty is successfully completed, how does this help people looking to run a Rocket Pool node for the first time? |\n\n| NOs | If the bounty is successfully completed, how does this help people already running a Rocket Pool node? |\n\n| Community | If the bounty is successfully completed, how does this help the Rocket Pool community? |\n\n| RPL holders | If the bounty is successfully completed, how does this help RPL holders? |\n\n### Which other non-RPL protocols, DAOs, projects, or individuals would stand to benefit from the bounty being successfully completed?\n\n## Work\n\n### What steps would be entailed in completing the bounty? Do successful examples of such work exist elsewhere? What skillsets or knowledge will be required?\n\n### What advice would you give a bounty hunter working on this bounty?\n\n### Should the output of this bounty be available under an open source license?\n\n## Costs\n\n### How much do you think the completion of this bounty worth to Rocket Pool (in USD)?\n\n### How much work will be needed to verify this bounty has been completed? What skillsets or knowledge will be required?\n\n## Structure\n\n### How would you structure this bounty, and why?\n\n* A single payout to single team on completion?\n\n* Divided into milestones?\n\n* Multiple payouts to multiple teams?\n\n* Should this be written up as multiple bounty definitions?\n\n* Something else?\n\n### Is this bounty repeatable?\n\n### Are there any reasonable circumstances under which this bounty should be withdrawn? Should it expire?\n\n## Conflicts of Interest\n\n### Does the person or persons proposing the bounty have any conflicts of interest to disclose? (Please disclose here if you are a member of the GMC or if any member of the GMC would benefit directly financially from the successful completion of the bounty).\n\n### Will the applicant, or any protocol or project in which the applicant has a vested interest (other than Rocket Pool), benefit financially if the bounty is successfully completed?\n\n</code></pre>\n<h1><a name=\"p-9722-bounty-definition-template-4\" class=\"anchor\" href=\"https://dao.rocketpool.net#p-9722-bounty-definition-template-4\"></a>Bounty Definition Template</h1>\n<h2><a name=\"p-9722-guidelines-5\" class=\"anchor\" href=\"https://dao.rocketpool.net#p-9722-guidelines-5\"></a>Guidelines</h2>\n<ul>\n<li>\n<p>When a single proposal bounty proposal has parts that must be completed by different groups, it should become multiple definitions.</p>\n</li>\n<li>\n<p>Where reasonably possible, bountiy definitions should limit the number of distinct skillsets required for completion of the bounty.</p>\n</li>\n<li>\n<p>Bounties should be defined in terms of the smallest worthwhile unit of work. IE: $25 to add/update a single relevant FAQ question rather than $5,000 to update the FAQ.</p>\n</li>\n<li>\n<p>Include any information or resources that might reasonably help a bounty hunter complete the bounty.</p>\n</li>\n<li>\n<p>Think carefully about which tasks are required, and which can be optional.</p>\n</li>\n<li>\n<p>Clearly list any dependencies, if the bounty cannot be completed in all circumstances.</p>\n</li>\n<li>\n<p>Only include multiple milestones for large bounties with natural points of division.</p>\n</li>\n</ul>\n<h2><a name=\"p-9722-template-6\" class=\"anchor\" href=\"https://dao.rocketpool.net#p-9722-template-6\"></a>Template</h2>\n<pre><code class=\"lang-auto\">\n# Bounty Name\n\n## Data\n\n* Repeatable?\n\n* Expiring?\n\n* Skillsets for completion? (See existing bounties and reuse where possible, new skillsets are recommended if sufficiently distinct)\n\n* Relevant tags? (See existing bounties and reuse where possible, new tags are recommended if sufficiently distinct)\n\n* Min reward (USD)?\n\n* Max reward (USD)?\n\n* Any linked definitions? (e.g. if a single bounty proposal becomes multiple definitions.)\n\n* Any dependencies?\n\n## Summary\n\nShort 1-3 sentences describing the bounty.\n\n## Dependencies\n\nIs there anything that must happen (outside of a bounty hunter's control) before it is possible to complete this bounty? This may be other bounties that must be completed first, an upcoming event or change or a regular occurance that triggers a valid bounty. This section is optional. May be later removed from the definition if the dependency becomes permanently met.\n\n## Required Milestones\n\nWhat _must_ be completed for a bounty hunter to claim some amount of bounty. Described per milestone.\n\n### Milestone A - &lt;Name of Milestone&gt;\n\n**Payout: ** &lt;payout amount&gt;\n\nClear bulleted list or subheadings covering the items that must be completed and/or adhered to for this milestone to be valid.\n\n### Milestone B - &lt;Name of Milestone&gt;\n\n**Payout: ** &lt;payout amount&gt;\n\nClear bulleted list or subheadings covering the items that must be completed and/or adhered to for this milestone to be valid.\n\n### Milestone C - &lt;Name of Milestone&gt;...\n\n## Optional Milestones\n\nWhat tasks _may_ be completed for a bounty hunter to earn extra bounty rewards. Described per milestone. This section is optional.\n\nOptional milestones may be less strictly defined than required milestones. You may aggregate multiple minor considerations that would contribute to a payout.\n\n### Milestone D - &lt;Name of Milestone&gt;\n\n**Maximum Payout: ** &lt;maximum payout amount&gt;\n\nClear bulleted list of the items that would contribute to payout for this milestone.\n\n### Milestone E - &lt;Name of Milestone&gt;...\n\n## Further Notes\n\nAnything you think that would be beneficial for a bounty hunter to know when working on this bounty. Maybe be divided into subsections as needed.\n\n## Resources\n\nLinks to repositories, web pages, forum discussions, etc. Anything that the bounty hunter may be able to use to do a better job on the bounty work.\n\n## Contacts\n\nIndividuals that have agreed to act as contacts for this bounty. Include usernames + contact details for any platform on which the contact is willing to respond to requests. Any contacts are expected to fully understand the bounty definition. This section is optional.\n\nContacts:\n\n* MAY be eligible for incentives.\n\n* SHOULD NOT assist the bounty hunter directly with the bounty work.\n\n* SHOULD assist bounty hunters via feedback, direction and oversight upon request.\n\n## Verification\n\nWho is expected to verify that the work delivered meets the relevant milestones? This person or group must have agreed to do this in advance of this definition being published. This person or group should have any relevant skillsets needed to properly verify the bounty work.\n\n</code></pre>\n            <p><small>1 post - 1 participant</small></p>\n            <p><a href=\"https://dao.rocketpool.net/t/round-17-gmc-call-for-bounty-applications-deadline-is-october-7/3253\">Read full topic</a></p>","link":"https://dao.rocketpool.net/t/round-17-gmc-call-for-bounty-applications-deadline-is-october-7/3253","pubDate":"Sat, 07 Sep 2024 17:48:49 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"dao.rocketpool.net-topic-3253"},"source":{"@url":"https://dao.rocketpool.net/t/round-17-gmc-call-for-bounty-applications-deadline-is-october-7/3253.rss","#text":"Round 17 - GMC Call for Bounty Applications - Deadline is October 7"}},{"title":"Round 17 - GMC Call for Grant Applications - Deadline is October 7","dc:creator":"ShfRyn","category":"Grants / Bounties","description":"<p>This thread is for applications for Rocket Pool’s September 7, 2024 - October 7, 2024 grants. Please only post grant applications in this thread. If you would like to discuss and/or ask questions about any applications you see in this thread, we ask that you do so in this <a href=\"https://dao.rocketpool.net/t/round-17-gmc-community-discussion-of-submitted-applications/3251\">separate forum thread</a> which has been established for all community discussions related to this round of applications. Only those grant applications that are posted in this thread and timestamped by October 7, 2024 at 23:59 (11:59 PM) UTC will be considered. Any grants posted after that deadline will be carried over to the next award period.</p>\n<p>This is the expected schedule for round 17:</p>\n<ul>\n<li>\n<p>Application Period (September 7 - October 7)</p>\n</li>\n<li>\n<p>Scoring Deadline (October 22)</p>\n</li>\n<li>\n<p>Final Voting Amendments, Discussion and Finalization (October 23 - October 26)</p>\n</li>\n<li>\n<p>Award Announcement (October 29)</p>\n</li>\n</ul>\nDifferences Between Grants and Bounties <a href=\"https://dao.rocketpool.net/t/round-17-gmc-call-for-grant-applications-deadline-is-october-7/3252/1\">(click for more details)</a>\n<p>To guide you in your application, the GMC has established the following goals and the following scoring rubric:</p>\nGMC Goals <a href=\"https://dao.rocketpool.net/t/round-17-gmc-call-for-grant-applications-deadline-is-october-7/3252/1\">(click for more details)</a>\nGrants Rubric <a href=\"https://dao.rocketpool.net/t/round-17-gmc-call-for-grant-applications-deadline-is-october-7/3252/1\">(click for more details)</a>\n<h2><a name=\"p-9721-grant-application-template-1\" class=\"anchor\" href=\"https://dao.rocketpool.net#p-9721-grant-application-template-1\"></a>Grant Application Template</h2>\n<p>Please copy paste the template below into a reply. Answer the questions there, feel free to remove or add sections based on relevance.</p>\n<pre><code class=\"lang-auto\">\n## Name of Grant\n\n### What is the work being proposed?\n\n### Is there any related work this builds off of?\n\n### Will the results of this project be entirely open source ([MIT](https://opensource.org/licenses/MIT), [GPL](https://www.gnu.org/licenses/gpl-3.0.en.html), [Apache](https://www.apache.org/licenses/LICENSE-2.0), [CC BY](https://creativecommons.org/licenses/by/4.0/) license or similar)? If not, which parts will not be, why, and under what license will they be published?\n\n## Benefit\n\n&lt;please enter N/A where appropriate&gt;\n\n| Group | Benefits |\n\n|---|---|\n\n| Potential rETH holders | If the grant is successfully completed, how does this help people looking to stake ETH for rETH? |\n\n| rETH holders | If the grant is successfully completed, how does this help rETH holders? |\n\n| Potential NOs | If the grant is successfully completed, how does this help people looking to run a Rocket Pool node for the first time? |\n\n| NOs | If the grant is successfully completed, how does this help people already running a Rocket Pool node? |\n\n| Community | If the grant is successfully completed, how does this help the Rocket Pool community? |\n\n| RPL holders | If the grant is successfully completed, how does this help RPL holders? |\n\n### Which other non-RPL protocols, DAOs, projects, or individuals, would stand to benefit from this grant?\n\n## Work\n\n### Who is doing the work?\n\n### What is the background of the person(s) doing the work? What experience do they have with such projects in the past?\n\n### What is the breakdown of the proposed work, in terms of milestones and/or deadlines?\n\n### How is the work being tested? Is testing included in the schedule?\n\n### How will the work be maintained after delivery?\n\n## Costs\n\n### What is the acceptance criteria?\n\n### What is the proposed payment schedule for the grant? How much USD $ and over what period of time is the applicant requesting?\n\n### Is the applicant requesting RPL or LUSD?\n\n### How will the GMC verify that the work delivered matches the proposed cadence?\n\n### What alternatives or options have been considered in order to save costs for the proposed project?\n\n## Conflict of Interest\n\n### Does the person or persons proposing the grant have any conflicts of interest to disclose? (Please disclose here if you are a member of the GMC or if any member of the GMC would benefit directly financially from the grant).\n\n### Will the recipient of the grant, or any protocol or project in which the recipient has a vested interest (other than Rocket Pool), benefit financially if the grant is successful?\n\n</code></pre>\n            <p><small>1 post - 1 participant</small></p>\n            <p><a href=\"https://dao.rocketpool.net/t/round-17-gmc-call-for-grant-applications-deadline-is-october-7/3252\">Read full topic</a></p>","link":"https://dao.rocketpool.net/t/round-17-gmc-call-for-grant-applications-deadline-is-october-7/3252","pubDate":"Sat, 07 Sep 2024 17:47:38 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"dao.rocketpool.net-topic-3252"},"source":{"@url":"https://dao.rocketpool.net/t/round-17-gmc-call-for-grant-applications-deadline-is-october-7/3252.rss","#text":"Round 17 - GMC Call for Grant Applications - Deadline is October 7"}},{"title":"Round 17 - GMC Community Discussion of Submitted Applications","dc:creator":"ShfRyn","category":"Grants / Bounties","description":"<p>In order to keep the application threads clear of discussions (to make it easier for committee members to read and score them), please use this thread for any and all questions and discussions of round 17 period of grant, bounty, and retrospective award applications.</p>\n            <p><small>1 post - 1 participant</small></p>\n            <p><a href=\"https://dao.rocketpool.net/t/round-17-gmc-community-discussion-of-submitted-applications/3251\">Read full topic</a></p>","link":"https://dao.rocketpool.net/t/round-17-gmc-community-discussion-of-submitted-applications/3251","pubDate":"Sat, 07 Sep 2024 17:45:51 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"dao.rocketpool.net-topic-3251"},"source":{"@url":"https://dao.rocketpool.net/t/round-17-gmc-community-discussion-of-submitted-applications/3251.rss","#text":"Round 17 - GMC Community Discussion of Submitted Applications"}},{"title":"Roman Storm Legal Fundraising","dc:creator":"SSJ2_Spartan","category":"Grants / Bounties","description":"<p>Gx Rocket Pool community</p>\n<p>You may have read about the recent arrest of Telegram founder, Pavel Durov, but the case that’ll set a precedent for Telegram and other privacy tools is happening right now: the Tornado Cash trial <a href=\"https://www.justice.gov/usao-sdny/file/1311391/dl?inline\" rel=\"noopener nofollow ugc\"><strong>U.S. v. Storm</strong></a>, scheduled to begin on December 2, 2024.</p>\n<p>Roman Storm <a href=\"https://www.coindesk.com/policy/2024/07/12/conduct-versus-code-may-be-the-defining-question-in-roman-storm-prosecution/amp/\" rel=\"noopener nofollow ugc\">has been building a strong defense</a> since his arrest a year ago because he understands the grave implications of his trial’s outcome on the software development industry worldwide. But per <a href=\"https://x.com/rstormsf/status/1815464551686828155?s=46&amp;t=7PEdoEHYUCfSFxHSUP_9sg\" rel=\"noopener nofollow ugc\">Roman’s video address</a> he still needs ~$2 million to see this case through trial; otherwise, he risks losing his legal team and facing a guilty verdict.</p>\n<p>A breakdown of charges against Roman and the budget outline are accessible via <a href=\"http://WeWantJusticeDAO.org\" rel=\"noopener nofollow ugc\">WeWantJusticeDAO.org</a> — the not-for-profit entity dedicated to the legal fundraising  campaign:</p>\n<aside class=\"onebox pdf\" data-onebox-src=\"https://static.wewantjusticedao.org/docs/Legal_defense_fund_overview_and_budget_august_2024.pdf\">\n  <header class=\"source\">\n\n      <a href=\"https://static.wewantjusticedao.org/docs/Legal_defense_fund_overview_and_budget_august_2024.pdf\" target=\"_blank\" rel=\"noopener nofollow ugc\">static.wewantjusticedao.org</a>\n  </header>\n\n  <article class=\"onebox-body\">\n    <a href=\"https://static.wewantjusticedao.org/docs/Legal_defense_fund_overview_and_budget_august_2024.pdf\" target=\"_blank\" rel=\"noopener nofollow ugc\"><span class=\"pdf-onebox-logo\"></span></a>\n\n<h3><a href=\"https://static.wewantjusticedao.org/docs/Legal_defense_fund_overview_and_budget_august_2024.pdf\" target=\"_blank\" rel=\"noopener nofollow ugc\">Legal_defense_fund_overview_and_budget_august_2024.pdf</a></h3>\n\n  <p class=\"filesize\">984.79 KB</p>\n\n  </article>\n\n  <div class=\"onebox-metadata\">\n    \n    \n  </div>\n\n  <div style=\"clear: both\"></div>\n</aside>\n\n<p>Donations can be made in USD, Eth, or other currencies:</p>\n<aside class=\"onebox allowlistedgeneric\" data-onebox-src=\"https://wewantjusticedao.org/donate/\">\n  <header class=\"source\">\n      <img src=\"https://static.wewantjusticedao.org/icons/favicon.ico\" class=\"site-icon\" width=\"32\" height=\"32\">\n\n      <a href=\"https://wewantjusticedao.org/donate/\" target=\"_blank\" rel=\"noopener nofollow ugc\">wewantjusticedao</a>\n  </header>\n\n  <article class=\"onebox-body\">\n    <div class=\"aspect-image\" style=\"--aspect-ratio:690/361;\"><img src=\"https://static.wewantjusticedao.org/images/ogImage.jpg\" class=\"thumbnail\" width=\"690\" height=\"368\"></div>\n\n<h3><a href=\"https://wewantjusticedao.org/donate/\" target=\"_blank\" rel=\"noopener nofollow ugc\">Help us Defend Privacy Protocol Devs | Justice DAO</a></h3>\n\n  <p>The right to privacy is in danger. Help defend privacy protocol developers!</p>\n\n\n  </article>\n\n  <div class=\"onebox-metadata\">\n    \n    \n  </div>\n\n  <div style=\"clear: both\"></div>\n</aside>\n\n<p>Please donate or help spread the word!</p>\n<p>AlphaGrowth is helping Roman Storm raise funds for his legal efforts. We are asking the community to donate any amount they can to help Roman Storm in his legal efforts to ensure we set up proper precedence globally for developers to not be prosecuted for writing code. We will also be conducting co-marketing campaigns to highlight DAO’s, protocols, and people that have donated to this cause.</p>\n<p>I will also post post this to the GMC but wanted to post on the forum to get community feedback and engagement.</p>\n<p>Thank you,</p>\n<p>From your Sad Broke Director</p>\n            <p><small>9 posts - 5 participants</small></p>\n            <p><a href=\"https://dao.rocketpool.net/t/roman-storm-legal-fundraising/3247\">Read full topic</a></p>","link":"https://dao.rocketpool.net/t/roman-storm-legal-fundraising/3247","pubDate":"Fri, 06 Sep 2024 13:18:41 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"dao.rocketpool.net-topic-3247"},"source":{"@url":"https://dao.rocketpool.net/t/roman-storm-legal-fundraising/3247.rss","#text":"Roman Storm Legal Fundraising"}},{"title":"GMC 2024/08/01 - 2024/08/31 Treasury Report","dc:creator":"ShfRyn","category":"Grants / Bounties","description":"<p>The GMC has an updated treasury report to better categorize funding categories and allocations:<br>\n<a href=\"https://docs.google.com/spreadsheets/d/1dMtHJ4sffBidSN5RphLYC9A5HrsRNqHfqLVn-nJR104/\">GMC Treasury Sheet - Google Sheets</a></p>\n<div class=\"md-table\">\n<table>\n<thead>\n<tr>\n<th>Funds at Start</th>\n<th>Inflows</th>\n<th>Payments</th>\n<th>Diversification (LUSD)</th>\n<th>Outflows (Total)</th>\n<th>Funds at End</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>61,259.89</td>\n<td>9,007.76</td>\n<td>10,449.41</td>\n<td>899.09</td>\n<td>11,348.50</td>\n<td>58,919.16</td>\n</tr>\n</tbody>\n</table>\n</div><div class=\"md-table\">\n<table>\n<thead>\n<tr>\n<th>LUSD Funds at Start</th>\n<th>LUSD Inflows</th>\n<th>LUSD Payments</th>\n<th>LUSD Funds at End</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>$ 127,503.52</td>\n<td>$ 10,685.30</td>\n<td>$ 22,068.08</td>\n<td>$ 116,120.75</td>\n</tr>\n</tbody>\n</table>\n</div><p>The GMC was paid twice in August. Payments are typically around 4,500 RPL per month.</p>\n<ul>\n<li>August 7 - 4,495.453 RPL</li>\n<li>August 30 - 4,512.31 RPL</li>\n</ul>\n<p>August was one of the historically largest months for expenses, whereas $125k was paid out for the tokenomics rework retro.</p>\n<p></p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://dao.rocketpool.net/uploads/default/original/2X/f/fddab7731d69d81199d938d75a2fbe4558354f0a.jpeg\" data-download-href=\"https://dao.rocketpool.net/uploads/default/fddab7731d69d81199d938d75a2fbe4558354f0a\" title=\"September Transactions\"><img src=\"https://dao.rocketpool.net/uploads/default/optimized/2X/f/fddab7731d69d81199d938d75a2fbe4558354f0a_2_690x435.jpeg\" alt=\"September Transactions\" data-base62-sha1=\"AdHoGB5F8cXmNLIZOvtndJosY1s\" width=\"690\" height=\"435\" srcset=\"https://dao.rocketpool.net/uploads/default/optimized/2X/f/fddab7731d69d81199d938d75a2fbe4558354f0a_2_690x435.jpeg, https://dao.rocketpool.net/uploads/default/optimized/2X/f/fddab7731d69d81199d938d75a2fbe4558354f0a_2_1035x652.jpeg 1.5x, https://dao.rocketpool.net/uploads/default/optimized/2X/f/fddab7731d69d81199d938d75a2fbe4558354f0a_2_1380x870.jpeg 2x\" data-dominant-color=\"E7E7E7\"></a></div><p></p>\n<p>You can view all transactions, including inflows and outflows on the <a href=\"https://docs.google.com/spreadsheets/d/1dMtHJ4sffBidSN5RphLYC9A5HrsRNqHfqLVn-nJR104/\">treasury sheet</a>.</p>\n            <p><small>1 post - 1 participant</small></p>\n            <p><a href=\"https://dao.rocketpool.net/t/gmc-2024-08-01-2024-08-31-treasury-report/3245\">Read full topic</a></p>","link":"https://dao.rocketpool.net/t/gmc-2024-08-01-2024-08-31-treasury-report/3245","pubDate":"Thu, 05 Sep 2024 19:22:40 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"dao.rocketpool.net-topic-3245"},"source":{"@url":"https://dao.rocketpool.net/t/gmc-2024-08-01-2024-08-31-treasury-report/3245.rss","#text":"GMC 2024/08/01 - 2024/08/31 Treasury Report"}},{"title":"RPIP-62: Tokenomics Rework Prelude","dc:creator":"haloooloolo","category":"Governance","description":"<p>This is the official discussion thread for <a href=\"https://rpips.rocketpool.net/RPIPs/RPIP-62\" rel=\"noopener nofollow ugc\">RPIP-62: Tokenomics Rework Prelude</a>, also referred to as Saturn 0 or ETH-only minipools.</p>\n<p>The proposal is now in a state where discussion on <a href=\"https://discord.com/channels/405159462932971535/1267421248288198677\" rel=\"noopener nofollow ugc\">Discord</a> has largely converged, the results of which are reflected in the current draft.</p>\n<p>The main ideas are:</p>\n<ul>\n<li>Remove the RPL requirement for new minipools</li>\n<li>Set minipool contract commission to 5% (from 14%, commission of existing pools will be unaffected)</li>\n<li>Provide additional rewards based on RPL stake to temporarily increase effective commission from 10% (no RPL) to 14% (≥10% RPL collateral) as part of the smoothing pool claim\n<ul>\n<li>This temporary increase will end a few periods after Saturn 1 is released</li>\n</ul>\n</li>\n</ul>\n<p><img src=\"https://dao.rocketpool.net/uploads/default/original/2X/a/a8d6a9435fd9f73e08563d7812c6e9adcca6fbc0.png\" alt=\"Dynamic Commission Model\" data-base62-sha1=\"o5C7IAfmYvGI5s0FSgMGNMIIzvi\" width=\"640\" height=\"480\"></p>\n<p>There is still an open item on how to handle RPL rewards, which we’d like more feedback on. Please see the comment below for a summary of the options and a survey on your preference.</p>\n            <p><small>19 posts - 12 participants</small></p>\n            <p><a href=\"https://dao.rocketpool.net/t/rpip-62-tokenomics-rework-prelude/3238\">Read full topic</a></p>","link":"https://dao.rocketpool.net/t/rpip-62-tokenomics-rework-prelude/3238","pubDate":"Tue, 03 Sep 2024 21:48:04 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"dao.rocketpool.net-topic-3238"},"source":{"@url":"https://dao.rocketpool.net/t/rpip-62-tokenomics-rework-prelude/3238.rss","#text":"RPIP-62: Tokenomics Rework Prelude"}},{"title":"IMC Period 25/26 Reports; Period 26/27 Budgets","dc:creator":"Valdorff","category":"Governance","description":"<p>And hello again, from your friendly neighborhood delinquent IMC treasurer. Catching up the rest of the way <img src=\"https://dao.rocketpool.net/images/emoji/twitter/slight_smile.png?v=12\" title=\":slight_smile:\" class=\"emoji\" alt=\":slight_smile:\" loading=\"lazy\" width=\"20\" height=\"20\"></p>\n<h2><a name=\"p-9668-report-25-1\" class=\"anchor\" href=\"https://dao.rocketpool.net#p-9668-report-25-1\"></a>Report 25</h2>\n<p></p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://dao.rocketpool.net/uploads/default/original/2X/0/0d33a31d3b4e8d459c2ccfdba7ae7aa2abc99c6d.png\" data-download-href=\"https://dao.rocketpool.net/uploads/default/0d33a31d3b4e8d459c2ccfdba7ae7aa2abc99c6d\" title=\"image\"><img src=\"https://dao.rocketpool.net/uploads/default/optimized/2X/0/0d33a31d3b4e8d459c2ccfdba7ae7aa2abc99c6d_2_381x500.png\" alt=\"image\" data-base62-sha1=\"1SMQ20hKyFYY8dG8VErCn1PnlNz\" width=\"381\" height=\"500\" srcset=\"https://dao.rocketpool.net/uploads/default/optimized/2X/0/0d33a31d3b4e8d459c2ccfdba7ae7aa2abc99c6d_2_381x500.png, https://dao.rocketpool.net/uploads/default/optimized/2X/0/0d33a31d3b4e8d459c2ccfdba7ae7aa2abc99c6d_2_571x750.png 1.5x, https://dao.rocketpool.net/uploads/default/original/2X/0/0d33a31d3b4e8d459c2ccfdba7ae7aa2abc99c6d.png 2x\" data-dominant-color=\"EFEFEF\"></a></div><p></p>\n<ul>\n<li>Out of reserves in Gamma’s contract, so we’re back to adding funds. Actually need to add a bit extra on the first one so we have enough buffer time to act comfortably.</li>\n</ul>\n<h2><a name=\"p-9668-budget-26-2\" class=\"anchor\" href=\"https://dao.rocketpool.net#p-9668-budget-26-2\"></a>Budget 26</h2>\n<p></p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://dao.rocketpool.net/uploads/default/original/2X/8/8771356c51770f08361cd9e42ec1f499ffdf71ec.png\" data-download-href=\"https://dao.rocketpool.net/uploads/default/8771356c51770f08361cd9e42ec1f499ffdf71ec\" title=\"image\"><img src=\"https://dao.rocketpool.net/uploads/default/original/2X/8/8771356c51770f08361cd9e42ec1f499ffdf71ec.png\" alt=\"image\" data-base62-sha1=\"jkb0qTIIgSWLn47tWnf20lo0eQY\" width=\"614\" height=\"499\" data-dominant-color=\"EBE5E0\"></a></div><br>\n<img src=\"https://dao.rocketpool.net/images/emoji/twitter/star.png?v=12\" title=\":star:\" class=\"emoji\" alt=\":star:\" loading=\"lazy\" width=\"20\" height=\"20\"> This is a big one folks. If you’ve been paying attention to the IMC’s wallet, you’ll know it’s been dwindling. This is the period we stopped hoping for the ratio to bail us out. The strategy is pretty simple:<p></p>\n<ul>\n<li>Cap how low an RPL price we’ll use for the purposes of ETH-denominated outflows. This makes our worst-case spend predictable.</li>\n<li>Reduce spend given the above so that we can continue to operate, ideally indefinitely.\n<ul>\n<li>One interesting tidbit is that we opted to reduce PCS proportionally less. This is due to a mix of efficiency (from being early in the voting ecosystem, from concentration) and a routine premium (our metastable pools emphasize the peg and lose some efficiency when off peg).</li>\n</ul>\n</li>\n<li>We don’t like abrupt motion for our incentives when it’s possible to avoid, so we’ll transtion over a couple of months.</li>\n</ul>\n<p>In the spreadsheet, orange items are decreased from the previous fortnight and purple is being eliminated.</p>\n<h2><a name=\"p-9668-report-26-3\" class=\"anchor\" href=\"https://dao.rocketpool.net#p-9668-report-26-3\"></a>Report 26</h2>\n<p></p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://dao.rocketpool.net/uploads/default/original/2X/3/3b4a7406e65a2b391d0e6271c278f181ca0b77d3.png\" data-download-href=\"https://dao.rocketpool.net/uploads/default/3b4a7406e65a2b391d0e6271c278f181ca0b77d3\" title=\"image\"><img src=\"https://dao.rocketpool.net/uploads/default/original/2X/3/3b4a7406e65a2b391d0e6271c278f181ca0b77d3.png\" alt=\"image\" data-base62-sha1=\"8svGxeU3fvlkWbrII99hRPYkdh1\" width=\"375\" height=\"500\" data-dominant-color=\"EFEFEF\"></a></div><p></p>\n<ul>\n<li>Executing on the plan</li>\n<li>RPL ratio cap is in effect as ratio is below 0.005</li>\n</ul>\n<h2><a name=\"p-9668-budget-27-4\" class=\"anchor\" href=\"https://dao.rocketpool.net#p-9668-budget-27-4\"></a>Budget 27</h2>\n<p><img src=\"https://dao.rocketpool.net/uploads/default/original/2X/5/5d6467d93b44c35e86e92f502f0be902f075fc33.png\" alt=\"image\" data-base62-sha1=\"dkbwpXCKZ6XaOmrlN4Z46sP7i3V\" width=\"676\" height=\"498\"></p>\n<ul>\n<li>We continue to implement our budgeting plan.</li>\n<li>This budget still uses 973 RPL more than is covered by inflows. Based on reserves and unclaimed rewards, we could operate through period 31 assuming RPL ratio stays at/below 0.005; we would need to make a little more cuts or ask for more funding to hit indefinite operation.</li>\n</ul>\n<h2><a name=\"p-9668-data-1-price-impact-5\" class=\"anchor\" href=\"https://dao.rocketpool.net#p-9668-data-1-price-impact-5\"></a>Data - 1% price impact</h2>\n<p></p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://dao.rocketpool.net/uploads/default/original/2X/d/d290cb613e358bbc93e4df72f8ce3390b9147bd5.jpeg\" data-download-href=\"https://dao.rocketpool.net/uploads/default/d290cb613e358bbc93e4df72f8ce3390b9147bd5\" title=\"image\"><img src=\"https://dao.rocketpool.net/uploads/default/optimized/2X/d/d290cb613e358bbc93e4df72f8ce3390b9147bd5_2_690x378.jpeg\" alt=\"image\" data-base62-sha1=\"u2KulymbXVSYL2PZ8VMZyiwMnOt\" width=\"690\" height=\"378\" srcset=\"https://dao.rocketpool.net/uploads/default/optimized/2X/d/d290cb613e358bbc93e4df72f8ce3390b9147bd5_2_690x378.jpeg, https://dao.rocketpool.net/uploads/default/optimized/2X/d/d290cb613e358bbc93e4df72f8ce3390b9147bd5_2_1035x567.jpeg 1.5x, https://dao.rocketpool.net/uploads/default/original/2X/d/d290cb613e358bbc93e4df72f8ce3390b9147bd5.jpeg 2x\" data-dominant-color=\"202224\"></a></div><br>\nThe highlighted region is periods 25-26. There is minimal impact from the additional belt-tightening we did.<p></p>\n<h2><a name=\"p-9668-resources-6\" class=\"anchor\" href=\"https://dao.rocketpool.net#p-9668-resources-6\"></a>Resources</h2>\n<ul>\n<li>IMC tracking spreadsheet: <a href=\"https://docs.google.com/spreadsheets/d/1jLGkoiSjNr1UgG1spAH9ppBfrk_FqjJXg9CIw35nLCA/edit?pli=1#gid=1671653401\">IMC tracking - Google Sheets </a></li>\n<li>IMC RPL tracker: <a href=\"https://dune.com/queries/3209520/5365584\">https://dune.com/queries/3209520/5365584</a></li>\n<li>1% price impact tracker (assumes RP smart contracts not used): <a href=\"https://xrchz.net/imc/\">rETH Slippage for IMC</a></li>\n</ul>\n            <p><small>1 post - 1 participant</small></p>\n            <p><a href=\"https://dao.rocketpool.net/t/imc-period-25-26-reports-period-26-27-budgets/3231\">Read full topic</a></p>","link":"https://dao.rocketpool.net/t/imc-period-25-26-reports-period-26-27-budgets/3231","pubDate":"Sat, 31 Aug 2024 03:26:47 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"dao.rocketpool.net-topic-3231"},"source":{"@url":"https://dao.rocketpool.net/t/imc-period-25-26-reports-period-26-27-budgets/3231.rss","#text":"IMC Period 25/26 Reports; Period 26/27 Budgets"}},{"title":"IMC Period 22/23/24 Reports; Period 23/24/25 Budgets","dc:creator":"Valdorff","category":"Governance","description":"<p>Hi All, from your friendly neighborhood delinquent IMC treasurer.<br>\nToday, I’m catching up about halfway, cuz it was a lot.</p>\n<h2><a name=\"p-9667-report-22-1\" class=\"anchor\" href=\"https://dao.rocketpool.net#p-9667-report-22-1\"></a>Report 22</h2>\n<p></p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://dao.rocketpool.net/uploads/default/original/2X/2/29873206a7824474d5dc4dc6bd659957b8606399.png\" data-download-href=\"https://dao.rocketpool.net/uploads/default/29873206a7824474d5dc4dc6bd659957b8606399\" title=\"image\"><img src=\"https://dao.rocketpool.net/uploads/default/optimized/2X/2/29873206a7824474d5dc4dc6bd659957b8606399_2_345x500.png\" alt=\"image\" data-base62-sha1=\"5Vneks3Rr2t3epaVFCYvvgNwlNn\" width=\"345\" height=\"500\" srcset=\"https://dao.rocketpool.net/uploads/default/optimized/2X/2/29873206a7824474d5dc4dc6bd659957b8606399_2_345x500.png, https://dao.rocketpool.net/uploads/default/optimized/2X/2/29873206a7824474d5dc4dc6bd659957b8606399_2_517x750.png 1.5x, https://dao.rocketpool.net/uploads/default/original/2X/2/29873206a7824474d5dc4dc6bd659957b8606399.png 2x\" data-dominant-color=\"E0E3E9\"></a></div><p></p>\n<ul>\n<li>Once again included 50 RPL more than intended on mainnet ETH/RPL incentives on hidden hand. Our bad. This does end up being the last iteration of this mistake.</li>\n</ul>\n<h2><a name=\"p-9667-budget-23-2\" class=\"anchor\" href=\"https://dao.rocketpool.net#p-9667-budget-23-2\"></a>Budget 23</h2>\n<p></p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://dao.rocketpool.net/uploads/default/original/2X/5/5180c8816c6c5550d8dd64fac7f88c39cfb84389.png\" data-download-href=\"https://dao.rocketpool.net/uploads/default/5180c8816c6c5550d8dd64fac7f88c39cfb84389\" title=\"image\"><img src=\"https://dao.rocketpool.net/uploads/default/original/2X/5/5180c8816c6c5550d8dd64fac7f88c39cfb84389.png\" alt=\"image\" data-base62-sha1=\"bD0AHeHcz2z1basn0NnRNQXHlj3\" width=\"642\" height=\"500\" data-dominant-color=\"EFEFEF\"></a></div><p></p>\n<ul>\n<li>Pretty much just copy-pasted with the planned osETH/rETH removal</li>\n</ul>\n<h2><a name=\"p-9667-report-23-3\" class=\"anchor\" href=\"https://dao.rocketpool.net#p-9667-report-23-3\"></a>Report 23</h2>\n<p></p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://dao.rocketpool.net/uploads/default/original/2X/1/1c083a53678cb69214b9b03eaade3001b5ead01c.png\" data-download-href=\"https://dao.rocketpool.net/uploads/default/1c083a53678cb69214b9b03eaade3001b5ead01c\" title=\"image\"><img src=\"https://dao.rocketpool.net/uploads/default/optimized/2X/1/1c083a53678cb69214b9b03eaade3001b5ead01c_2_333x500.png\" alt=\"image\" data-base62-sha1=\"3ZYZPlngvef8Dk4ERHF5BU0i1kg\" width=\"333\" height=\"500\" srcset=\"https://dao.rocketpool.net/uploads/default/optimized/2X/1/1c083a53678cb69214b9b03eaade3001b5ead01c_2_333x500.png, https://dao.rocketpool.net/uploads/default/optimized/2X/1/1c083a53678cb69214b9b03eaade3001b5ead01c_2_499x750.png 1.5x, https://dao.rocketpool.net/uploads/default/optimized/2X/1/1c083a53678cb69214b9b03eaade3001b5ead01c_2_666x1000.png 2x\" data-dominant-color=\"E4E6E8\"></a></div><p></p>\n<ul>\n<li>More belt-tightening; we reduced ETH-denominated targets by ~15%</li>\n<li>We found that we’d been paying more money into Gamma than was going out – this means we don’t have to pay into it for a while and could let the contract use up some reserves</li>\n<li>PCS asked us to work with them on Arbitrum coincentives. The nature of the coincentives made this an extremely efficient spend, so we went for it even though we weren’t looking to spend more in the area at the time. We were tight on time, so the IMC opted to have Val execute on this personally and pay him back</li>\n</ul>\n<h2><a name=\"p-9667-budget-24-4\" class=\"anchor\" href=\"https://dao.rocketpool.net#p-9667-budget-24-4\"></a>Budget 24</h2>\n<p></p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://dao.rocketpool.net/uploads/default/original/2X/5/57c8ccd8d87e9e3080685c58deecbdfa4d78c183.png\" data-download-href=\"https://dao.rocketpool.net/uploads/default/57c8ccd8d87e9e3080685c58deecbdfa4d78c183\" title=\"image\"><img src=\"https://dao.rocketpool.net/uploads/default/original/2X/5/57c8ccd8d87e9e3080685c58deecbdfa4d78c183.png\" alt=\"image\" data-base62-sha1=\"cwzKDZo68SF7AbdEke07R2VjSSv\" width=\"613\" height=\"500\" data-dominant-color=\"ECEAEA\"></a></div><p></p>\n<ul>\n<li>2 more planned fortnights of Gamma using up reserves here</li>\n<li>Switched our mainnet incentives from Hidden hand to Paladin\n<ul>\n<li>The killer feature of Paladin is that you can set a limit to pay per vote. Any amount beyond that, gets sent directly to the gauge instead of getting paid to voters. This means we can target an efficiency and essentially use the voting market <em>only</em> insofar as it’s more efficient than direct incentives. There’s some details in there as there are plenty of unknowns (price action of AURA/BAL/RPL after we act, number of votes used in the ecosystem)… but if we aim for at least 100% efficiency we’ll be quite close at least.</li>\n<li>They were also willing to work with us on the fee side, which we appreciate <img src=\"https://dao.rocketpool.net/images/emoji/twitter/slight_smile.png?v=12\" title=\":slight_smile:\" class=\"emoji\" alt=\":slight_smile:\" loading=\"lazy\" width=\"20\" height=\"20\"></li>\n</ul>\n</li>\n</ul>\n<h2><a name=\"p-9667-report-24-5\" class=\"anchor\" href=\"https://dao.rocketpool.net#p-9667-report-24-5\"></a>Report 24</h2>\n<p></p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://dao.rocketpool.net/uploads/default/original/2X/3/3a6f0b9a1b1aec4fd2cbbf0efa559c287582616b.png\" data-download-href=\"https://dao.rocketpool.net/uploads/default/3a6f0b9a1b1aec4fd2cbbf0efa559c287582616b\" title=\"image\"><img src=\"https://dao.rocketpool.net/uploads/default/optimized/2X/3/3a6f0b9a1b1aec4fd2cbbf0efa559c287582616b_2_393x500.png\" alt=\"image\" data-base62-sha1=\"8kVBCuq2YPr7kf2CUiXx4YWl8uf\" width=\"393\" height=\"500\" srcset=\"https://dao.rocketpool.net/uploads/default/optimized/2X/3/3a6f0b9a1b1aec4fd2cbbf0efa559c287582616b_2_393x500.png, https://dao.rocketpool.net/uploads/default/optimized/2X/3/3a6f0b9a1b1aec4fd2cbbf0efa559c287582616b_2_589x750.png 1.5x, https://dao.rocketpool.net/uploads/default/original/2X/3/3a6f0b9a1b1aec4fd2cbbf0efa559c287582616b.png 2x\" data-dominant-color=\"EEEEEE\"></a></div><p></p>\n<ul>\n<li>A new IMC was selected in a vote ending June 9\n<ul>\n<li>We swapped in the new members 6/12, 6/13, 6/15, 6/21</li>\n<li>We set the new wallet threshold as previously discussed from 6-of-9 to 5-of-9 on 6/26</li>\n<li>Look at our fancy new “Nonce” column… these young kids coming and making things better, I tell you what</li>\n</ul>\n</li>\n<li>The old IMC acted for the first fortnight in period 24, and then the new one for the second fortnight</li>\n<li>Val was paid back as planned</li>\n<li>Gamma reserves used up completely</li>\n</ul>\n<h2><a name=\"p-9667-budget-25-6\" class=\"anchor\" href=\"https://dao.rocketpool.net#p-9667-budget-25-6\"></a>Budget 25</h2>\n<p></p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://dao.rocketpool.net/uploads/default/original/2X/1/134f4a105e562dc9f3f3829c21dd570e27ab8d8e.png\" data-download-href=\"https://dao.rocketpool.net/uploads/default/134f4a105e562dc9f3f3829c21dd570e27ab8d8e\" title=\"image\"><img src=\"https://dao.rocketpool.net/uploads/default/original/2X/1/134f4a105e562dc9f3f3829c21dd570e27ab8d8e.png\" alt=\"image\" data-base62-sha1=\"2KOWO3G8orh8Q1DpBhiFEcypic6\" width=\"628\" height=\"500\" data-dominant-color=\"EDEDED\"></a></div><p></p>\n<ul>\n<li>Copy pastad the last period</li>\n<li>Gamma needs to get funded this time, but there’s no actual change on its output – we’ve simply used up the reserves we had in the contract</li>\n</ul>\n<h2><a name=\"p-9667-data-1-price-impact-7\" class=\"anchor\" href=\"https://dao.rocketpool.net#p-9667-data-1-price-impact-7\"></a>Data - 1% price impact</h2>\n<p></p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://dao.rocketpool.net/uploads/default/original/2X/7/706664cc1900576982ee14357ec622f9eec1a730.jpeg\" data-download-href=\"https://dao.rocketpool.net/uploads/default/706664cc1900576982ee14357ec622f9eec1a730\" title=\"image\"><img src=\"https://dao.rocketpool.net/uploads/default/optimized/2X/7/706664cc1900576982ee14357ec622f9eec1a730_2_690x375.jpeg\" alt=\"image\" data-base62-sha1=\"g2kQXNfVxviFv1cnRkhTS6Y831C\" width=\"690\" height=\"375\" srcset=\"https://dao.rocketpool.net/uploads/default/optimized/2X/7/706664cc1900576982ee14357ec622f9eec1a730_2_690x375.jpeg, https://dao.rocketpool.net/uploads/default/optimized/2X/7/706664cc1900576982ee14357ec622f9eec1a730_2_1035x562.jpeg 1.5x, https://dao.rocketpool.net/uploads/default/original/2X/7/706664cc1900576982ee14357ec622f9eec1a730.jpeg 2x\" data-dominant-color=\"202224\"></a></div><p></p>\n<p>The highlighted region is periods 22-24. There is, interestingly, minimal impact from the additional belt-tightening we did.</p>\n<h2><a name=\"p-9667-resources-8\" class=\"anchor\" href=\"https://dao.rocketpool.net#p-9667-resources-8\"></a>Resources</h2>\n<ul>\n<li>IMC tracking spreadsheet: <a href=\"https://docs.google.com/spreadsheets/d/1jLGkoiSjNr1UgG1spAH9ppBfrk_FqjJXg9CIw35nLCA/edit?pli=1#gid=1671653401\">IMC tracking - Google Sheets </a></li>\n<li>IMC RPL tracker: <a href=\"https://dune.com/queries/3209520/5365584\">https://dune.com/queries/3209520/5365584</a></li>\n<li>1% price impact tracker (assumes RP smart contracts not used): <a href=\"https://xrchz.net/imc/\">rETH Slippage for IMC</a></li>\n</ul>\n            <p><small>1 post - 1 participant</small></p>\n            <p><a href=\"https://dao.rocketpool.net/t/imc-period-22-23-24-reports-period-23-24-25-budgets/3230\">Read full topic</a></p>","link":"https://dao.rocketpool.net/t/imc-period-22-23-24-reports-period-23-24-25-budgets/3230","pubDate":"Fri, 30 Aug 2024 21:33:47 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"dao.rocketpool.net-topic-3230"},"source":{"@url":"https://dao.rocketpool.net/t/imc-period-22-23-24-reports-period-23-24-25-budgets/3230.rss","#text":"IMC Period 22/23/24 Reports; Period 23/24/25 Budgets"}},{"title":"pDAO 2024/08/01-2024/08/29 Treasury Report","dc:creator":"vacalaranja","category":"Governance","description":"<h4><a name=\"p-9662-hello-rocket-pool-1\" class=\"anchor\" href=\"https://dao.rocketpool.net#p-9662-hello-rocket-pool-1\"></a>Hello, Rocket Pool!</h4>\n<p>If you need an intro to how pDAO treasury works, check <a href=\"https://dao.rocketpool.net/t/pdao-2022-9-29-2022-12-22-treasury-report/1314/1\">(this post)</a>. &lt; It’s time to update this, I’ll work on a new explainer post.</p>\n<p>This period the pDAO reserve received 6,469.07 RPL from inflation, its balance is now 79,173.08 RPL. The IMC and GMC were paid 10,964.52 RPL and 4,495.45 RPL, respectively.</p>\n<p>You can keep up with pDAO treasury with the following spreadsheets:<br>\n(<a href=\"https://docs.google.com/spreadsheets/d/1b8ZtXBzh2TkwrdyGYMPtjZNPB4jzErhp0z29rwb2ByQ/edit?usp=sharing\" rel=\"noopener nofollow ugc\">RP Treasury Report - Google Sheets </a>)<br>\n(<a href=\"https://docs.google.com/spreadsheets/d/1Zo9iFJ2YZNAkgNo53yJGSCnz8XAYuLJ7SeiwJx6oF0A/edit?usp=sharing\" rel=\"noopener nofollow ugc\">pDAO Treasury Summary - Google Sheets </a>).</p>\n<h4><a name=\"p-9662-thank-you-for-reading-see-you-next-period-2\" class=\"anchor\" href=\"https://dao.rocketpool.net#p-9662-thank-you-for-reading-see-you-next-period-2\"></a>Thank you for reading, see you next period!</h4>\n            <p><small>1 post - 1 participant</small></p>\n            <p><a href=\"https://dao.rocketpool.net/t/pdao-2024-08-01-2024-08-29-treasury-report/3225\">Read full topic</a></p>","link":"https://dao.rocketpool.net/t/pdao-2024-08-01-2024-08-29-treasury-report/3225","pubDate":"Thu, 29 Aug 2024 03:02:13 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"dao.rocketpool.net-topic-3225"},"source":{"@url":"https://dao.rocketpool.net/t/pdao-2024-08-01-2024-08-29-treasury-report/3225.rss","#text":"pDAO 2024/08/01-2024/08/29 Treasury Report"}},{"title":"Round 15 (July 7 - August 7) Grants/Bounties/RA Award Round","dc:creator":"ShfRyn","category":"Grants / Bounties","description":"<p>The GMC has concluded discussions and scoring for the Round 15 (July 7 - August 7) Grants/Bounties/RA Award Round.</p>\n<p><em>This post also begins the fourteen-day clock during which, according to RPIP-15, “[a]nyone MAY file an RPIP disputing a grant, bounty, or retrospective award within two weeks of the announcement of recipients. Such an RPIP SHALL be subject to a snapshot vote.” Any awards not subject to such a challenge will become official on September 8, 2024 at 23:59 UTC.</em></p>\n\nGeneral Updates <a href=\"https://dao.rocketpool.net/t/round-15-july-7-august-7-grants-bounties-ra-award-round/3214/1\">(click for more details)</a>\n\nCurrent GMC Roster <a href=\"https://dao.rocketpool.net/t/round-15-july-7-august-7-grants-bounties-ra-award-round/3214/1\">(click for more details)</a>\n\nApplication Breakdown <a href=\"https://dao.rocketpool.net/t/round-15-july-7-august-7-grants-bounties-ra-award-round/3214/1\">(click for more details)</a>\n\nAwards, Average Overall Scores <a href=\"https://dao.rocketpool.net/t/round-15-july-7-august-7-grants-bounties-ra-award-round/3214/1\">(click for more details)</a>\n\nDetailed Award Results <a href=\"https://dao.rocketpool.net/t/round-15-july-7-august-7-grants-bounties-ra-award-round/3214/1\">(click for more details)</a>\n\nBounties That Need Definitions <a href=\"https://dao.rocketpool.net/t/round-15-july-7-august-7-grants-bounties-ra-award-round/3214/1\">(click for more details)</a>\n\nMember Participation <a href=\"https://dao.rocketpool.net/t/round-15-july-7-august-7-grants-bounties-ra-award-round/3214/1\">(click for more details)</a>\n\nFinal Voting Stages <a href=\"https://dao.rocketpool.net/t/round-15-july-7-august-7-grants-bounties-ra-award-round/3214/1\">(click for more details)</a>\n<p>Look out for the GMC’s monthly public town hall which should take place in the next couple weeks. Join the GMC server <a href=\"https://discord.gg/Y8RPR2Ba\">here</a>.</p>\n            <p><small>1 post - 1 participant</small></p>\n            <p><a href=\"https://dao.rocketpool.net/t/round-15-july-7-august-7-grants-bounties-ra-award-round/3214\">Read full topic</a></p>","link":"https://dao.rocketpool.net/t/round-15-july-7-august-7-grants-bounties-ra-award-round/3214","pubDate":"Sun, 25 Aug 2024 14:57:58 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"dao.rocketpool.net-topic-3214"},"source":{"@url":"https://dao.rocketpool.net/t/round-15-july-7-august-7-grants-bounties-ra-award-round/3214.rss","#text":"Round 15 (July 7 - August 7) Grants/Bounties/RA Award Round"}},{"title":"Post Mortem - Rocket Split Grant","dc:creator":"LIBlockchain","category":"Grants / Bounties","description":"<h3><a name=\"p-9619-h-1-introduction-1\" class=\"anchor\" href=\"https://dao.rocketpool.net#p-9619-h-1-introduction-1\"></a>1. Introduction</h3>\n<ul>\n<li>Project Overview:\n<ul>\n<li>A RocketSplit contract is a tool designed for a Node Operator and a RPL Contributor to split the rewards of a Rocket Pool Validator. After a Node is configured and registered with Rocket Pool, they will (1) identify the node on Rocketsplit.xyz, (2) set the end-point wallet address for each user, (3) set the financial terms between the Node Operator and the RPL Contributor, (4) create the contract.</li>\n</ul>\n</li>\n<li>Grant Details:\n<ul>\n<li>A proposal from Ramana in April 2023 (<a href=\"https://dao.rocketpool.net/t/april-2023-gmc-call-for-grant-applications-deadline-is-april-15th/1638/7\" class=\"inline-onebox\">April 2023 GMC Call for Grant Applications - Deadline is April 15th - #7 by ramana</a>) was initially denied (<a href=\"https://dao.rocketpool.net/t/april-2023-grants-bounties-retrospective-awards-round-results/1743\" class=\"inline-onebox\">April 2023 Grants/Bounties/Retrospective Awards Round Results</a>). It was then resubmitted (<a href=\"https://dao.rocketpool.net/t/july-2023-gmc-call-for-grant-applications-deadline-is-july-15th/1934/3\" class=\"inline-onebox\">July 2023 GMC Call for Grant Applications - Deadline is July 15th - #3 by Patches</a>) and denied again. Then appealed, (<a href=\"https://dao.rocketpool.net/t/appeal-of-july-2023-gmc-results-rocket-split-ga032303/2085\" class=\"inline-onebox\">Appeal of July 2023 GMC Results - Rocket Split (GA032303)</a>) and passed (<a href=\"https://github.com/rocket-pool/RPIPs/blob/main/RPIPs/RPIP-27.md\" class=\"inline-onebox\" rel=\"noopener nofollow ugc\">RPIPs/RPIPs/RPIP-27.md at main · rocket-pool/RPIPs · GitHub</a>).</li>\n<li>Finally, there was an additional grant request, which was denied, for the smart contract audits (<a href=\"https://dao.rocketpool.net/t/round-8-gmc-call-for-grant-applications-deadline-is-january-14/2556/8\" class=\"inline-onebox\">Round 8 - GMC Call for Grant Applications - Deadline is January 14 - #8 by LIBlockchain</a>)</li>\n</ul>\n</li>\n<li>Project Duration:\n<ul>\n<li>Originally proposed in April 2023, was available for public testing in October 2023 and Version 1 was deployed in December 2023 to rocketsplit.xyz</li>\n<li>Version 2 deployment July 2024</li>\n</ul>\n</li>\n<li>Team Members: Ramana (<span class=\"mention\">@xrchz</span>), Nick (<a class=\"mention\" href=\"https://dao.rocketpool.net/u/direct\">@direct</a>), Craig (<span class=\"mention\">@Rudes.eth</span>)</li>\n</ul>\n<h3><a name=\"p-9619-h-2-objectives-and-goals-2\" class=\"anchor\" href=\"https://dao.rocketpool.net#p-9619-h-2-objectives-and-goals-2\"></a>2. Objectives and Goals</h3>\n<ul>\n<li>Initial Objectives:\n<ul>\n<li>Launch a website (rocketsplit.xyz) where users can custom-configure and deploy a smart contract (a Rocket Split) that can become a Rocket Pool node’svalidator’s withdrawal address. A Rocket Split will share validator rewards as configured between a maximum of two parties (typically an ETH contributor and an RPL contributor).</li>\n</ul>\n</li>\n<li>Final Outcomes:\n<ul>\n<li>Rocket Split does not have an audit but remains available for use in production.</li>\n<li>Rocket Pool has released the Houston upgrade in June 2024, enabling TWO potential withdrawal addresses, an ETH withdrawal address and an RPL withdrawal address. Rocket Split is designed to work with RPL withdrawal address NOT SET. Website will provide alerts if it recognizes the RPL address set.</li>\n<li>Version 1 deployed December 2023 and a Rocket SplitRocketsplit was used in Main net Ethereum (now exited)</li>\n<li>Version 2 is available for use. There are interested parties but no new Rocket Splits yet created.</li>\n</ul>\n</li>\n</ul>\n<h3><a name=\"p-9619-h-3-successes-3\" class=\"anchor\" href=\"https://dao.rocketpool.net#p-9619-h-3-successes-3\"></a>3. Successes</h3>\n<ul>\n<li>Achievements:\n<ul>\n<li>Main net smart contract deployment March 2024</li>\n<li>Initial Rocket Split launched March 2024. Validator exited June 2024.</li>\n<li>Upgraded smart contract deployment July 2024</li>\n<li>Wave 2 of production Rocket Splits, July 2024</li>\n</ul>\n</li>\n<li>Milestones Met:\n<ul>\n<li>Smart contract configuration website launch</li>\n<li>Deployed Rocket Split smart contract factory</li>\n<li>Rocket Split used in production to share rewards</li>\n</ul>\n</li>\n</ul>\n<h3><a name=\"p-9619-h-4-challenges-and-issues-4\" class=\"anchor\" href=\"https://dao.rocketpool.net#p-9619-h-4-challenges-and-issues-4\"></a>4. Challenges and Issues</h3>\n<ul>\n<li>Major Challenges:\n<ul>\n<li>Funding:\n<ul>\n<li>Difficulty in estimating cost and value: Rocket Split has taken 100s of hours for development, testing, and governance management over the course of 15+ months. If grants are designed to cover a market value, the grant would have cost multiples higher. Contributions from the teams were more altruistic in nature.</li>\n<li>Early-stage decentralized governance: This feature request Grant was denied 3 times. Two times on the initial submission and once for an audit. Full payment not yet received</li>\n</ul>\n</li>\n<li>Testing:\n<ul>\n<li>Challenging test environment. To test, users need to have an active validator on the Holesky testnet, registered with the Rocket Pool protocol. Users could then either act as both the ETH contributor &amp; the RPL contributor, or find a partner tester.</li>\n</ul>\n</li>\n<li>Changing technical landscape\n<ul>\n<li>The Rocket Pool Houston upgrade introduced an additional withdrawal address, the RPL withdrawal address. This was a fundamental change to how Rocket Split was designed.</li>\n</ul>\n</li>\n</ul>\n</li>\n</ul>\n<h3><a name=\"p-9619-h-5-lessons-learned-5\" class=\"anchor\" href=\"https://dao.rocketpool.net#p-9619-h-5-lessons-learned-5\"></a>5. Lessons Learned</h3>\n<ul>\n<li>Technical Lessons:\n<ul>\n<li>Nick: From a front end perspective I think taking more time up front to identify all the user personas and respected workflows would have served us better. We originally tried to build the UI off an initial prototype that was pure HTML/JS. This became unwieldy as we were managing different user perspectives and respected workflows of which could be in different states at any given time. We switched gears to using React and the wagmi library. This allowed for improved isolation of concerns within the app. This also allowed for core functionality to work more reliably (ex. Basic wallet connections). During this process much of my time was spent developing hooks into Rocketpools core protocol smart contracts along with Rocket Split. As a result we did not spend as much time as we would have liked on core UX. The result is a working system but in my opinion one that can be greatly improved with improvements in design. Of course time and budget constraints play a role here. If this project does prove to be a valuable component in the RP toolset I would recommend we iterate on this a bit.</li>\n<li>Ramana: The bug that meant exiting the first live validator was not a straightforward process could have been caught with more thorough testing of all pathways through Rocket Split. Our test suite did not have complete coverage of even all the typical uses of Rocket Split. I’m not sure if this is a lesson learned, though, since I know it is possible to miss issues without thorough testing: it’s more a question of us not having time/capacity/budget available for filling out the test suite (let alone an external audit). Perhaps there is a lesson to be gleaned here in what to prioritize under a very limited budget?</li>\n</ul>\n</li>\n<li>Decentralized Governance Community Roles:\n<ul>\n<li>A GMC Admin position was approved in 1H 2023 to be the primary liaison for active projects. If this role were approved prior to the Rocket Split grant approval, there could have been several pitfalls avoided.\n<ul>\n<li>Grant denial <span class=\"hashtag-raw\">#1</span> (April 2023) was a result of needing to incorporate “Mentors requirements”. Those requirements however were not well understood or documented.</li>\n<li>Grant denial <span class=\"hashtag-raw\">#2</span> (July 2023) was a result of a misunderstanding from the GMC team of Rocket Split functionality. GMC team believed Rocket Split was redundant to the Rocket Pool protocol development already underway. It was appealed by Knoshua on the grounds that “the team is not working on things that would make Rocket Split obsolete. It is different than Nodeset”. The grant was approved after a unanimous (30-0) vote to appeal its rejection.</li>\n<li>Grant denial <span class=\"hashtag-raw\">#3</span> (January 2024) was a denial of the audit costs. The lesson learned here is that any project that acts as the withdrawal address of a Rocket Pool node, should be expected to have an audit. Clear expectations at the onset will have set the project for greater success.</li>\n</ul>\n</li>\n</ul>\n</li>\n<li>Team Dynamics:\n<ul>\n<li>Conventional github development operations. Discussions of when to merge or critical needs took place in Discord channels.</li>\n<li>Asynchronous coordination across multiple time zones. Nick’s late night development cycles flowed smoothly into updates for Ramana as he woke up the following day to continue iterating forward.</li>\n<li>An additional front-end developer for future projects would be ideal. Nick and Ramana share similar skillsets. Ramana is brilliant at identifying custom paths to deliver intended functionality. Nick is fantastic at identifying the unique code and proposing structure and optimizations. Taking more time up front designing and prototyping front end workflows would have benefited the UX.</li>\n</ul>\n</li>\n</ul>\n<h3><a name=\"p-9619-h-6-conclusion-6\" class=\"anchor\" href=\"https://dao.rocketpool.net#p-9619-h-6-conclusion-6\"></a>6. Conclusion</h3>\n<ul>\n<li>Summary of Findings:\n<ul>\n<li>Although not audited, there are production users clearly showing a demand for Splitter / “Marriage” functionality</li>\n<li>Rocket Pool Houston upgrade added a new primitive with the RPL withdrawal address separate from the ETH withdrawal address. This does not have any configuration management for the “Marriage”. ETH will go to ETH withdrawal address, RPL will go to RPL withdrawal address. Rocket Split application is designed to operate with RPL withdrawal NOT SET.</li>\n<li>Rocket Split is limited to only 2 partners in a contract. An improved version of Rocket Split that enabled multiple parties in an agreement, each with a custom configuration of rewards, may find better product market fit.</li>\n</ul>\n</li>\n</ul>\n            <p><small>1 post - 1 participant</small></p>\n            <p><a href=\"https://dao.rocketpool.net/t/post-mortem-rocket-split-grant/3203\">Read full topic</a></p>","link":"https://dao.rocketpool.net/t/post-mortem-rocket-split-grant/3203","pubDate":"Thu, 22 Aug 2024 10:59:21 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"dao.rocketpool.net-topic-3203"},"source":{"@url":"https://dao.rocketpool.net/t/post-mortem-rocket-split-grant/3203.rss","#text":"Post Mortem - Rocket Split Grant"}},{"title":"Protocol Development - Roadmap Prioritisation","dc:creator":"langers","category":"Governance","description":"<p>Hey everyone!</p>\n<p>As per RPIP-37 Protocol Development (<a href=\"https://rpips.rocketpool.net/RPIPs/RPIP-37\" class=\"inline-onebox\">RPIP-37: Protocol Development</a>), the core protocol team will facilitate a prioritisation discussion with the Rocket Pool community.</p>\n<p>With the following RPIPs’ imminent ratification there is a significant amount of work ahead of us.</p>\n<ul>\n<li>RPIP-49 Tokenomics Rework\n<ul>\n<li>RPIP-42 Bond Curves</li>\n<li>RPIP-43 Megapools</li>\n<li>RPIP-44 Integrating Execution Layer Triggerable Exits</li>\n<li>RPIP-46 Universal Adjustable Revenue Split</li>\n<li>RPIP-47 Enable Forced Delegate Update</li>\n<li>RPIP-59 Deposit Mechanics</li>\n<li>RPIP-60 Protocol Upgrade Guardrails</li>\n</ul>\n</li>\n<li>RPIP-57 Node Distributor User Fund Unbundling</li>\n<li>RPIP-58 MEV Penalty Guardrail</li>\n<li>RPIP-61 Balance Submission Guardrail</li>\n</ul>\n<p>These RPIPs and prioritisation generally can be organised around particular themes to help guide what we want to achieve and identify any gaps. I have organised them around the following themes but I would love to hear the community’s opinion on what themes are appropriate.</p>\n<p><strong>Tokenomics</strong> - the outcome being long term sustainability<br>\n<strong>rETH Demand</strong> - obviously rETH demand is essential for growth of the protocol<br>\n<strong>Node Operator Supply / Efficiency</strong> - again this is essential for growth of the protocol, and with Lido CSM on the horizon, a side order of competition<br>\n<strong>Decentralisation</strong> - to ensure the protocol is open, permissionless, decentralised, and as trustless as possible<br>\n<strong>Protocol Safety</strong> - to ensure the security and smooth running of the protocol<br>\n<strong>Emerging Research</strong> - to facilitate innovation so that we can push the boundaries</p>\n<p></p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://dao.rocketpool.net/uploads/default/original/2X/2/27866db4af85858c8233d3a4d55e0cbeffd3f625.png\" data-download-href=\"https://dao.rocketpool.net/uploads/default/27866db4af85858c8233d3a4d55e0cbeffd3f625\" title=\"Roadmap vs Themes\"><img src=\"https://dao.rocketpool.net/uploads/default/optimized/2X/2/27866db4af85858c8233d3a4d55e0cbeffd3f625_2_690x307.png\" alt=\"Roadmap vs Themes\" data-base62-sha1=\"5DEDfSm0QqeudiWgVxbRrgwiRM1\" width=\"690\" height=\"307\" srcset=\"https://dao.rocketpool.net/uploads/default/optimized/2X/2/27866db4af85858c8233d3a4d55e0cbeffd3f625_2_690x307.png, https://dao.rocketpool.net/uploads/default/optimized/2X/2/27866db4af85858c8233d3a4d55e0cbeffd3f625_2_1035x460.png 1.5x, https://dao.rocketpool.net/uploads/default/optimized/2X/2/27866db4af85858c8233d3a4d55e0cbeffd3f625_2_1380x614.png 2x\" data-dominant-color=\"FAFBFB\"></a></div><p></p>\n<p>As we deliver the Saturn RPIPs, it is likely that new prioritises emerge.</p>\n<p>But to kick off the discussion here are some questions but please feel free to go in other direction:</p>\n<ul>\n<li>Are there themes missing?</li>\n<li>Is there a better way to organise it?</li>\n<li>Are there areas we should focus on in the future?</li>\n<li>Are there strength areas we can double down on?</li>\n<li>Are there weaknesses that we should strengthen?</li>\n<li>Are there threats that we should be prepared for?</li>\n</ul>\n            <p><small>7 posts - 6 participants</small></p>\n            <p><a href=\"https://dao.rocketpool.net/t/protocol-development-roadmap-prioritisation/3202\">Read full topic</a></p>","link":"https://dao.rocketpool.net/t/protocol-development-roadmap-prioritisation/3202","pubDate":"Wed, 21 Aug 2024 04:41:05 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"dao.rocketpool.net-topic-3202"},"source":{"@url":"https://dao.rocketpool.net/t/protocol-development-roadmap-prioritisation/3202.rss","#text":"Protocol Development - Roadmap Prioritisation"}},{"title":"Protocol Development - May, June July Roadmap Update","dc:creator":"langers","category":"Governance","description":"<p>Hey everyone!</p>\n<p>Here is a quarterly roadmap update for May, June, July 2024.</p>\n<p><strong>Houston</strong></p>\n<p>The beginning of the period saw the Houston audit reports made public (<a href=\"https://rocketpool.net/protocol/security\" class=\"inline-onebox\">Rocket Pool - Decentralised Ethereum Liquid Staking Protocol</a>).</p>\n<p>Before launch, some specification discrepancies were identified and subsequently resolved (<a href=\"https://dao.rocketpool.net/t/houston-specification-discrepancies/2958\" class=\"inline-onebox\">Houston Specification Discrepancies</a>). Additionally, a bug bounty was raised, assessed, and it was decided to incorporate a fix into the Houston release.</p>\n<p>Finally, the Houston smart contracts were deployed and verified by the community. Once the ODAO had voted and executed the upgrade proposal, Houston was ready for launch (<a href=\"https://medium.com/rocket-pool/rocket-pool-houston-launch-b056ca1a6c10\" class=\"inline-onebox\">Rocket Pool — Houston Launch. Hello Rocket Poolers! | by David Rugendyke | Rocket Pool | Medium</a>). Houston went live on the 17th June.</p>\n<p>Post Houston launch, the core team had to combine Snapshot and the on-chain voting system to ensure we have a unified governance system. This was a little more involved than we expected, mainly due to Snapshot not having a Holesky deployment, so we were unable to develop or test anything up front. The team successfully integrated Snapshot and the on-chain voting system. Additionally, significant changes needed to be made to the Delegates’ website (<a href=\"https://delegates.rocketpool.net/\">https://delegates.rocketpool.net/</a>) to align it with the new voting system and support current delegates.</p>\n<p>Since launch, the core team have been monitoring the Protocol DAO voting initialisation. Currently the Protocol DAO on-chain voting element is disabled until enough vote power is initialised. We are now have enough vote power to enable the system but please see the Houston Hotfix section below.</p>\n<p>To summarise the current status of governance voting:</p>\n<ul>\n<li>Snapshot will still be used for most governance votes - because it is gas-free.</li>\n<li>The on-chain system will be used when protocol settings or protocol treasury spends are necessary</li>\n<li>Snapshot is integrated into the new voting system so we have a unified governance system - essentially vote power is consistent</li>\n<li>The on-chain system is disabled for now until the Houston hotfix goes live</li>\n</ul>\n<p>For more information please take a look at the Protocol DAO Governance medium article:</p><aside class=\"onebox allowlistedgeneric\" data-onebox-src=\"https://medium.com/rocket-pool/rocket-pool-protocol-dao-governance-a3c3e92904e0\">\n  <header class=\"source\">\n      <img src=\"https://dao.rocketpool.net/uploads/default/original/2X/e/e104963df516c38fd2365d242e30375b15c0f91e.png\" class=\"site-icon\" data-dominant-color=\"3B3B3B\" width=\"32\" height=\"32\">\n\n      <a href=\"https://medium.com/rocket-pool/rocket-pool-protocol-dao-governance-a3c3e92904e0\" target=\"_blank\" rel=\"noopener\" title=\"01:20AM - 08 July 2024\">Medium – 8 Jul 24</a>\n  </header>\n\n  <article class=\"onebox-body\">\n    <div class=\"aspect-image\" style=\"--aspect-ratio:690/388;\"><img src=\"https://dao.rocketpool.net/uploads/default/optimized/2X/f/f8747e588d2a3276da4ea5c2267113e6293cb576_2_690x388.png\" class=\"thumbnail\" data-dominant-color=\"FD9A78\" width=\"690\" height=\"388\"></div>\n\n<h3><a href=\"https://medium.com/rocket-pool/rocket-pool-protocol-dao-governance-a3c3e92904e0\" target=\"_blank\" rel=\"noopener\">Rocket Pool — Protocol DAO Governance</a></h3>\n\n  <p>At Rocket Pool’s heart is a vibrant community of node operators from across the globe, that care deeply for Ethereum and staking. We…</p>\n\n  <p>\n    <span class=\"label1\">Reading time: 8 min read</span>\n  </p>\n\n  </article>\n\n  <div class=\"onebox-metadata\">\n    \n    \n  </div>\n\n  <div style=\"clear: both\"></div>\n</aside>\n\n<p><strong>Houston Hotfix</strong></p>\n<p>Just after the launch of Houston an issue was raised with older 16 ETH minipools. A bug introduced with Houston corrupted state when exiting minipools if the node operator had not initialised voting. We announced a smart node release to prevent node operators from experiencing the issue but ultimately a smart contract fix is required.</p>\n<p>In the meantime, we have had some interesting Immunefi bug bounties raised about the on-chain voting system. The first was a medium severity protocol griefing vector that did not effect funds but would allow someone to withdraw their RPL collateral when they are not supposed to. Another excellent submission, allowed a challenger to steal a proposer’s bond - the impact was limited but clearly it was a good find. We have developed fixes for these bug bounty submissions.</p>\n<p>Additionally, there were small non-functional changes that we wanted to include:</p>\n<ul>\n<li>Changed the way a vetod proposer’s bond is burnt - instead of sending to burn address it uses RPL’s burn feature</li>\n<li>Fixed possible error situation if RPL bond amount is set to 0</li>\n<li>Event naming consistency</li>\n</ul>\n<p>Lastly, we have been paying attention to the discussions around an interim release before Saturn that would launch ETH-only minipools earlier. One issue with the potential interim release is the scrub check RPL penalty. The penalty is important for security reasons but cannot be enforced if there is no RPL bond. So included in the hotfix is a change to make this an ETH penalty rather than an RPL penalty. We are in discussion about how this is processed through governance.</p>\n<p><strong>RPIP-28 and RPIP-30</strong></p>\n<p>As per RPIP-30, we reduced the RPL withdrawal limit to 60% of node’s bonded ETH.</p>\n<p>RPIP-28 - Implementation needs to be discussed. Depending on the result of the RPIP-49 vote it is not currently in that scope afaik.<br>\nRPIP-30 - Depending on the result of RPIP-49 (which looks certain), RPIP-30 is included in the rework scope so will be included in Saturn.</p>\n<p><strong>Saturn</strong></p>\n<p>Over the last few months, the core team have engaged in discussions on the reworked tokenomics proposal. As the scope has formalised the team have provided feedback, feasibility advice, and conducted multiple full day internal workshops to break down the components.</p>\n<p>The core team have also engaged in discussion on alternative proposals:</p>\n<ul>\n<li><a href=\"https://dao.rocketpool.net/t/1kx-tokenomics-proposal/3119\" class=\"inline-onebox\">1kx Tokenomics Proposal</a></li>\n<li><a href=\"https://dao.rocketpool.net/t/an-alternative-and-simple-tokenomics-proposal/3130\" class=\"inline-onebox\">An Alternative (and simple) Tokenomics Proposal</a></li>\n</ul>\n<p>The core team have kicked off development of the least contested elements of Saturn, namely Megapools. As soon as the RPIP-49 vote is ratified we will continue to break the components down, determine delivery order, and plan key milestones.</p>\n<p>The core team have also been engaged in conversation about the possible interim release that would deliver ETH-only minipools sooner.</p>\n<p><strong>v2 Smart Node</strong></p>\n<p>The smart node devs have been hard at work bringing the v2 Smart Node release up to feature parity with v1. The v2 release now has all new Houston features and continues to be beta tested. We have started the process of feature freezing v1 and will start the transition to v2.</p>\n<p><strong>Node Manager Website</strong></p>\n<p>We have been working on a new user experience for node operators. The node manager website be separate to the staking website and be a consolidated place for managing your node. The new node manager website is very close to launch so look out for that.</p>\n<p>Please let me know if you have any questions!</p>\n            <p><small>1 post - 1 participant</small></p>\n            <p><a href=\"https://dao.rocketpool.net/t/protocol-development-may-june-july-roadmap-update/3197\">Read full topic</a></p>","link":"https://dao.rocketpool.net/t/protocol-development-may-june-july-roadmap-update/3197","pubDate":"Tue, 20 Aug 2024 01:45:40 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"dao.rocketpool.net-topic-3197"},"source":{"@url":"https://dao.rocketpool.net/t/protocol-development-may-june-july-roadmap-update/3197.rss","#text":"Protocol Development - May, June July Roadmap Update"}},{"title":"bloXroute Validator Gateway","dc:creator":"ShfRyn","category":"Integration","description":"<p>The GMC recently met with <a href=\"https://bloxroute.com/\">bloXroute</a> to learn about their Validator Gateway product, which has the potential to enhance effectiveness across Rocket Pool validators. Example data can be viewed at <a href=\"https://relayscan.io/\">https://relayscan.io/</a></p>\n<p>bloxRoute is a blockchain distribution network that gave a presentation at Rocket Pool’s Denver Lift-Off event. That video can be viewed <a href=\"https://youtu.be/JQU722fd_s0?si=OBrpklpLChqVXQej\">here</a>.</p>\n<p><strong>Validator Gateway</strong> (<a href=\"https://docs.bloxroute.com/gateway/validator-gateway\" class=\"inline-onebox\">Validator Gateway | bloXroute Documentation</a>)</p>\n<ul>\n<li><strong>Relay Proxy</strong> A free service co-locating the relay with the node operator, streaming block bids to node operators in real-time. You can set the timing for accepting bids within a slot.</li>\n<li><strong>Blockchain Distribution Network (BDN)</strong> A paid service utilizing data stripping to send data via direct routes. Once a validator node accepts a block bid, the BDN ensures rapid propagation across the network. For duties like attestations or sync committees, the BDN Gateway helps keep nodes synchronized with the current head slot, enhancing validator effectiveness and increasing high-paying attestations within block proposals. The BDN Gateway aims for near 100% effectiveness.</li>\n</ul>\n<p><strong>Some Questions That Were Answered</strong></p>\n<ul>\n<li>\n<p>How would it work for small solo stakers?<br>\nRelays can be set up regionally, and they can be purchased in various locations.</p>\n</li>\n<li>\n<p>How many relays would make sense for the entire US?<br>\nPossibly one per state, or fewer if that is excessive.</p>\n</li>\n<li>\n<p>What happens if a relay goes down?<br>\nThere is no risk, as connectivity to other relays remains.</p>\n</li>\n<li>\n<p>Is it only profitable when maximizing timing games?<br>\nNode operators can manage risk by setting delays.</p>\n</li>\n</ul>\n<p><strong>Payment and Billing</strong><br>\nThe GMC is interested in the fixed price per pubkey option. bloXroute is willing to accept RPL as payment.</p>\n<p>The GMC is seeking the pDao’s input. Please ask any questions you have below, or provide any feedback.</p>\n<p>–</p>\n<p><strong>Should the Smart Node integrate the bloXroute Validator Gateway?</strong></p>\n<p><a href=\"https://dao.rocketpool.net/t/bloxroute-validator-gateway/3187/1\">Click to view the poll.</a></p>\n            <p><small>19 posts - 8 participants</small></p>\n            <p><a href=\"https://dao.rocketpool.net/t/bloxroute-validator-gateway/3187\">Read full topic</a></p>","link":"https://dao.rocketpool.net/t/bloxroute-validator-gateway/3187","pubDate":"Thu, 08 Aug 2024 21:01:06 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"dao.rocketpool.net-topic-3187"},"source":{"@url":"https://dao.rocketpool.net/t/bloxroute-validator-gateway/3187.rss","#text":"bloXroute Validator Gateway"}},{"title":"Round 16 - GMC Call for Retrospective Applications - Deadline is September 7","dc:creator":"ShfRyn","category":"Grants / Bounties","description":"<p>This thread is for applications for Rocket Pool’s August 7, 2024 - September 7, 2024 retrospective awards. Please only post retrospective award applications in this thread. If you would like to discuss and/or ask questions about any applications you see in this thread, we ask that you do so in this <a href=\"https://dao.rocketpool.net/t/round-16-gmc-community-discussion-of-submitted-applications/3182\">separate forum thread</a> which has been established for all community discussions related to this round of applications. Only those grant applications that are posted in this thread and timestamped by September 7, 2024 at 23:59 (11:59 PM) UTC will be considered. Any retrospective award applications posted after that deadline will be carried over to the next award period.</p>\n<p>This is the expected schedule for round 16:</p>\n<ul>\n<li>Application Period (August 7 - September 7)</li>\n<li>Scoring Deadline (September 24)</li>\n<li>Final Voting Amendments, Discussion and Finalization (September 25 - September 28)</li>\n<li>Award Announcement (September 29)</li>\n</ul>\n<p>To guide you in your application, the GMC has established the following goals and the following scoring rubric:</p>\nGMC Goals <a href=\"https://dao.rocketpool.net/t/round-16-gmc-call-for-retrospective-applications-deadline-is-september-7/3184/1\">(click for more details)</a>\nRetrospective Award Rubric <a href=\"https://dao.rocketpool.net/t/round-16-gmc-call-for-retrospective-applications-deadline-is-september-7/3184/1\">(click for more details)</a>\n<h2><a name=\"p-9582-retrospective-award-application-template-1\" class=\"anchor\" href=\"https://dao.rocketpool.net#p-9582-retrospective-award-application-template-1\"></a>Retrospective Award Application Template</h2>\n<p>Please copy paste the template below into a reply. Answer the questions there, feel free to remove or add sections based on relevance.</p>\n<pre><code class=\"lang-auto\">## Name of Retrospective Award\n\n### Who is the proposed retrospective award recipient?\n\n### What specific project or work is the retrospective award in recognition of? Please detail what the project or work entailed and the duration over which it took place.\n\n### Are the subjects of this award entirely open source ([MIT](https://opensource.org/licenses/MIT), [GPL](https://www.gnu.org/licenses/gpl-3.0.en.html), [Apache](https://www.apache.org/licenses/LICENSE-2.0), [CC BY](https://creativecommons.org/licenses/by/4.0/) license or similar)? If not, which parts will not be, why, and under what license will they be published?\n\n\n\n## Benefit\n\n&lt;please enter N/A where appropriate&gt;\n\n| Group | Benefits |\n|---|---|\n| Potential rETH holders | How did the project or work for which the retrospective award would be given help people looking to stake ETH for rETH? |\n| rETH holders | How did the project or work for which the retrospective award would be given help rETH holders? |\n| Potential NOs | How did the project or work for which the retrospective award would be given help people looking to run a Rocket Pool node for the first time? |\n| NOs | How did the project or work for which the retrospective award would be given help people already running a Rocket Pool node? |\n| Community |  How did the project or work for which the retrospective award would be given how does this help the Rocket Pool community? |\n| RPL holders |  How did the project or work for which the retrospective award would be given how does this help RPL holders? |\n\n\n\n## Costs\n\n### How much USD $ is the applicant requesting be awarded to the recipient?\n\n### Is the applicant requesting RPL or LUSD?\n\n\n\n## Conflict of Interest\n\n### Does the person or persons requesting the retrospective award have any conflicts of interest to disclose? (Please disclose here if you are a member of the GMC or if you have nominated a member of the GMC for this retrospective award).\n</code></pre>\n            <p><small>4 posts - 2 participants</small></p>\n            <p><a href=\"https://dao.rocketpool.net/t/round-16-gmc-call-for-retrospective-applications-deadline-is-september-7/3184\">Read full topic</a></p>","link":"https://dao.rocketpool.net/t/round-16-gmc-call-for-retrospective-applications-deadline-is-september-7/3184","pubDate":"Thu, 08 Aug 2024 00:14:23 +0000","discourse:topicPinned":"No","discourse:topicClosed":"Yes","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"dao.rocketpool.net-topic-3184"},"source":{"@url":"https://dao.rocketpool.net/t/round-16-gmc-call-for-retrospective-applications-deadline-is-september-7/3184.rss","#text":"Round 16 - GMC Call for Retrospective Applications - Deadline is September 7"}},{"title":"Round 16 - GMC Call for Bounty Applications - Deadline is September 7","dc:creator":"ShfRyn","category":"Grants / Bounties","description":"<p>This thread is for applications for Rocket Pool’s August 7, 2024 - September 7, 2024 bounties. Please only post bounty applications in this thread. If you would like to discuss and/or ask questions about any applications you see in this thread, we ask that you do so in this <a href=\"https://dao.rocketpool.net/t/round-16-gmc-community-discussion-of-submitted-applications/3182\">separate forum thread</a> which has been established for all community discussions related to this round of applications. Only those grant applications that are posted in this thread and timestamped by September 7, 2024 at 23:59 (11:59 PM) UTC will be considered. Any bounties posted after that deadline will be carried over to the next award period.</p>\n<p>This is the expected schedule for round 16:</p>\n<ul>\n<li>Application Period (August 7 - September 7)</li>\n<li>Scoring Deadline (September 24)</li>\n<li>Final Voting Amendments, Discussion and Finalization (September 25 - September 28)</li>\n<li>Award Announcement (September 29)</li>\n</ul>\nDifferences Between Grants and Bounties <a href=\"https://dao.rocketpool.net/t/round-16-gmc-call-for-bounty-applications-deadline-is-september-7/3183/1\">(click for more details)</a>\n<p>To guide you in your application, the GMC has established the following goals and the following scoring rubric:</p>\nGMC Goals <a href=\"https://dao.rocketpool.net/t/round-16-gmc-call-for-bounty-applications-deadline-is-september-7/3183/1\">(click for more details)</a>\nBounties Rubric <a href=\"https://dao.rocketpool.net/t/round-16-gmc-call-for-bounty-applications-deadline-is-september-7/3183/1\">(click for more details)</a>\n<h1><a name=\"p-9581-bounty-proposal-template-1\" class=\"anchor\" href=\"https://dao.rocketpool.net#p-9581-bounty-proposal-template-1\"></a>Bounty Proposal Template</h1>\n<h2><a name=\"p-9581-guidelines-2\" class=\"anchor\" href=\"https://dao.rocketpool.net#p-9581-guidelines-2\"></a>Guidelines</h2>\n<ul>\n<li>The goals of the Bounty Proposal are:\n<ul>\n<li>to communicate your bounty idea clearly, in general terms, such that the GMC can decide if it’s worth pursuing.</li>\n<li>to estimate the benefits and costs attached to your proposal.</li>\n<li>to disclose any relevant conflicts of interest.</li>\n</ul>\n</li>\n<li>Answers to the template questions do not need to be highly detailed. Estimates or ranges are acceptable. Brief answers are also fine.</li>\n</ul>\n<h2><a name=\"p-9581-template-3\" class=\"anchor\" href=\"https://dao.rocketpool.net#p-9581-template-3\"></a>Template</h2>\n<pre><code class=\"lang-auto\"># Bounty Name\n\n## General Information\n\n### What is the nature of the proposed bounty?\n\n### Why are you writing this bounty proposal?\n\n\n## Benefit\n\n&lt;please enter N/A where appropriate&gt;\n\n| Group | Benefits |\n|---|---|\n| Potential rETH holders | If the bounty is successfully completed, how does this help people looking to stake ETH for rETH? |\n| rETH holders | If the bounty is successfully completed, how does this help rETH holders? |\n| Potential NOs |  If the bounty is successfully completed, how does this help people looking to run a Rocket Pool node for the first time? |\n| NOs | If the bounty is successfully completed, how does this help people already running a Rocket Pool node? |\n| Community |  If the bounty is successfully completed, how does this help the Rocket Pool community? |\n| RPL holders |  If the bounty is successfully completed, how does this help RPL holders? |\n\n### Which other non-RPL protocols, DAOs, projects, or individuals would stand to benefit from the bounty being successfully completed?\n\n\n\n## Work\n\n### What steps would be entailed in completing the bounty? Do successful examples of such work exist elsewhere? What skillsets or knowledge will be required?\n\n### What advice would you give a bounty hunter working on this bounty?\n\n### Should the output of this bounty be available under an open source license?\n\n\n\n## Costs\n\n### How much do you think the completion of this bounty worth to Rocket Pool (in USD)?\n\n### How much work will be needed to verify this bounty has been completed? What skillsets or knowledge will be required?\n\n\n## Structure\n\n### How would you structure this bounty, and why? \n* A single payout to single team on completion? \n* Divided into milestones? \n* Multiple payouts to multiple teams? \n* Should this be written up as multiple bounty definitions?\n* Something else?\n\n### Is this bounty repeatable?\n\n### Are there any reasonable circumstances under which this bounty should be withdrawn? Should it expire?\n\n\n## Conflicts of Interest\n\n### Does the person or persons proposing the bounty have any conflicts of interest to disclose? (Please disclose here if you are a member of the GMC or if any member of the GMC would benefit directly financially from the successful completion of the bounty).\n\n### Will the applicant, or any protocol or project in which the applicant has a vested interest (other than Rocket Pool), benefit financially if the bounty is successfully completed?\n</code></pre>\n<h1><a name=\"p-9581-bounty-definition-template-4\" class=\"anchor\" href=\"https://dao.rocketpool.net#p-9581-bounty-definition-template-4\"></a>Bounty Definition Template</h1>\n<h2><a name=\"p-9581-guidelines-5\" class=\"anchor\" href=\"https://dao.rocketpool.net#p-9581-guidelines-5\"></a>Guidelines</h2>\n<ul>\n<li>When a single proposal bounty proposal has parts that must be completed by different groups, it should become multiple definitions.</li>\n<li>Where reasonably possible, bountiy definitions should limit the number of distinct skillsets required for completion of the bounty.</li>\n<li>Bounties should be defined in terms of the smallest worthwhile unit of work. IE: $25 to add/update a single relevant FAQ question rather than $5,000 to update the FAQ.</li>\n<li>Include any information or resources that might reasonably help a bounty hunter complete the bounty.</li>\n<li>Think carefully about which tasks are required, and which can be optional.</li>\n<li>Clearly list any dependencies, if the bounty cannot be completed in all circumstances.</li>\n<li>Only include multiple milestones for large bounties with natural points of division.</li>\n</ul>\n<h2><a name=\"p-9581-template-6\" class=\"anchor\" href=\"https://dao.rocketpool.net#p-9581-template-6\"></a>Template</h2>\n<pre><code class=\"lang-auto\"># Bounty Name \n\n## Data\n* Repeatable?\n* Expiring?\n* Skillsets for completion? (See existing bounties and reuse where possible, new skillsets are recommended if sufficiently distinct)\n* Relevant tags? (See existing bounties and reuse where possible, new tags are recommended if sufficiently distinct)\n* Min reward (USD)?\n* Max reward (USD)?\n* Any linked definitions? (e.g. if a single bounty proposal becomes multiple definitions.)\n* Any dependencies? \n\n## Summary \nShort 1-3 sentences describing the bounty.\n\n## Dependencies\nIs there anything that must happen (outside of a bounty hunter's control) before it is possible to complete this bounty? This may be other bounties that must be completed first, an upcoming event or change or a regular occurance that triggers a valid bounty. This section is optional. May be later removed from the definition if the dependency becomes permanently met. \n\n## Required Milestones\nWhat _must_ be completed for a bounty hunter to claim some amount of bounty. Described per milestone.\n\n### Milestone A - &lt;Name of Milestone&gt;\n**Payout: ** &lt;payout amount&gt;\nClear bulleted list or subheadings covering the items that must be completed and/or adhered to for this milestone to be valid.\n\n### Milestone B - &lt;Name of Milestone&gt;\n**Payout: ** &lt;payout amount&gt;\nClear bulleted list or subheadings covering the items that must be completed and/or adhered to for this milestone to be valid.\n\n### Milestone C - &lt;Name of Milestone&gt;...\n\n## Optional Milestones\nWhat tasks _may_ be completed for a bounty hunter to earn extra bounty rewards. Described per milestone. This section is optional.\n\nOptional milestones may be less strictly defined than required milestones. You may aggregate multiple minor considerations that would contribute to a payout. \n\n### Milestone D - &lt;Name of Milestone&gt;\n**Maximum Payout: ** &lt;maximum payout amount&gt;\nClear bulleted list of the items that would contribute to payout for this milestone.\n\n### Milestone E - &lt;Name of Milestone&gt;...\n\n\n## Further Notes\nAnything you think that would be beneficial for a bounty hunter to know when working on this bounty. Maybe be divided into subsections as needed.\n\n## Resources\nLinks to repositories, web pages, forum discussions, etc. Anything that the bounty hunter may be able to use to do a better job on the bounty work. \n\n## Contacts\nIndividuals that have agreed to act as contacts for this bounty. Include usernames + contact details for any platform on which the contact is willing to respond to requests. Any contacts are expected to fully understand the bounty definition. This section is optional. \n\nContacts:\n* MAY be eligible for incentives.\n* SHOULD NOT assist the bounty hunter directly with the bounty work.\n* SHOULD assist bounty hunters via feedback, direction and oversight upon request.\n\n## Verification\nWho is expected to verify that the work delivered meets the relevant milestones? This person or group must have agreed to do this in advance of this definition being published. This person or group should have any relevant skillsets needed to properly verify the bounty work.\n\n\n</code></pre>\n            <p><small>3 posts - 1 participant</small></p>\n            <p><a href=\"https://dao.rocketpool.net/t/round-16-gmc-call-for-bounty-applications-deadline-is-september-7/3183\">Read full topic</a></p>","link":"https://dao.rocketpool.net/t/round-16-gmc-call-for-bounty-applications-deadline-is-september-7/3183","pubDate":"Thu, 08 Aug 2024 00:11:50 +0000","discourse:topicPinned":"No","discourse:topicClosed":"Yes","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"dao.rocketpool.net-topic-3183"},"source":{"@url":"https://dao.rocketpool.net/t/round-16-gmc-call-for-bounty-applications-deadline-is-september-7/3183.rss","#text":"Round 16 - GMC Call for Bounty Applications - Deadline is September 7"}},{"title":"Round 16 - GMC Community Discussion of Submitted Applications","dc:creator":"ShfRyn","category":"Grants / Bounties","description":"<p>In order to keep the application threads clear of discussions (to make it easier for committee members to read and score them), please use this thread for any and all questions and discussions of round 16 period of grant, bounty, and retrospective award applications.</p>\n            <p><small>11 posts - 8 participants</small></p>\n            <p><a href=\"https://dao.rocketpool.net/t/round-16-gmc-community-discussion-of-submitted-applications/3182\">Read full topic</a></p>","link":"https://dao.rocketpool.net/t/round-16-gmc-community-discussion-of-submitted-applications/3182","pubDate":"Thu, 08 Aug 2024 00:07:01 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"dao.rocketpool.net-topic-3182"},"source":{"@url":"https://dao.rocketpool.net/t/round-16-gmc-community-discussion-of-submitted-applications/3182.rss","#text":"Round 16 - GMC Community Discussion of Submitted Applications"}},{"title":"Round 16 - GMC Call for Grant Applications - Deadline is September 7","dc:creator":"ShfRyn","category":"Grants / Bounties","description":"<p>This thread is for applications for Rocket Pool’s August 7, 2024 - September 7, 2024 grants. Please only post grant applications in this thread. If you would like to discuss and/or ask questions about any applications you see in this thread, we ask that you do so in this <a href=\"https://dao.rocketpool.net/t/round-16-gmc-community-discussion-of-submitted-applications/3182\">separate forum thread</a> which has been established for all community discussions related to this round of applications. Only those grant applications that are posted in this thread and timestamped by September 7, 2024 at 23:59 (11:59 PM) UTC will be considered. Any grants posted after that deadline will be carried over to the next award period.</p>\n<p>This is the expected schedule for round 16:</p>\n<ul>\n<li>Application Period (August 7 - September 7)</li>\n<li>Scoring Deadline (September 24)</li>\n<li>Final Voting Amendments, Discussion and Finalization (September 25 - September 28)</li>\n<li>Award Announcement (September 29)</li>\n</ul>\nDifferences Between Grants and Bounties <a href=\"https://dao.rocketpool.net/t/round-16-gmc-call-for-grant-applications-deadline-is-september-7/3181/1\">(click for more details)</a>\n<p>To guide you in your application, the GMC has established the following goals and the following scoring rubric:</p>\nGMC Goals <a href=\"https://dao.rocketpool.net/t/round-16-gmc-call-for-grant-applications-deadline-is-september-7/3181/1\">(click for more details)</a>\nGrants Rubric <a href=\"https://dao.rocketpool.net/t/round-16-gmc-call-for-grant-applications-deadline-is-september-7/3181/1\">(click for more details)</a>\n<h2><a name=\"p-9579-grant-application-template-1\" class=\"anchor\" href=\"https://dao.rocketpool.net#p-9579-grant-application-template-1\"></a>Grant Application Template</h2>\n<p>Please copy paste the template below into a reply. Answer the questions there, feel free to remove or add sections based on relevance.</p>\n<pre><code class=\"lang-auto\">## Name of Grant\n\n### What is the work being proposed?\n\n### Is there any related work this builds off of?\n\n### Will the results of this project be entirely open source ([MIT](https://opensource.org/licenses/MIT), [GPL](https://www.gnu.org/licenses/gpl-3.0.en.html), [Apache](https://www.apache.org/licenses/LICENSE-2.0), [CC BY](https://creativecommons.org/licenses/by/4.0/) license or similar)? If not, which parts will not be, why, and under what license will they be published?\n\n## Benefit\n\n&lt;please enter N/A where appropriate&gt;\n\n| Group | Benefits |\n\n|---|---|\n\n| Potential rETH holders | If the grant is successfully completed, how does this help people looking to stake ETH for rETH? |\n\n| rETH holders | If the grant is successfully completed, how does this help rETH holders? |\n\n| Potential NOs | If the grant is successfully completed, how does this help people looking to run a Rocket Pool node for the first time? |\n\n| NOs | If the grant is successfully completed, how does this help people already running a Rocket Pool node? |\n\n| Community | If the grant is successfully completed, how does this help the Rocket Pool community? |\n\n| RPL holders | If the grant is successfully completed, how does this help RPL holders? |\n\n### Which other non-RPL protocols, DAOs, projects, or individuals, would stand to benefit from this grant?\n\n## Work\n\n### Who is doing the work?\n\n### What is the background of the person(s) doing the work? What experience do they have with such projects in the past?\n\n### What is the breakdown of the proposed work, in terms of milestones and/or deadlines?\n\n### How is the work being tested? Is testing included in the schedule?\n\n### How will the work be maintained after delivery?\n\n## Costs\n\n### What is the acceptance criteria?\n\n### What is the proposed payment schedule for the grant? How much USD $ and over what period of time is the applicant requesting?\n\n### Is the applicant requesting RPL or LUSD?\n\n### How will the GMC verify that the work delivered matches the proposed cadence?\n\n### What alternatives or options have been considered in order to save costs for the proposed project?\n\n## Conflict of Interest\n\n### Does the person or persons proposing the grant have any conflicts of interest to disclose? (Please disclose here if you are a member of the GMC or if any member of the GMC would benefit directly financially from the grant).\n\n### Will the recipient of the grant, or any protocol or project in which the recipient has a vested interest (other than Rocket Pool), benefit financially if the grant is successful?\n\n</code></pre>\n            <p><small>7 posts - 5 participants</small></p>\n            <p><a href=\"https://dao.rocketpool.net/t/round-16-gmc-call-for-grant-applications-deadline-is-september-7/3181\">Read full topic</a></p>","link":"https://dao.rocketpool.net/t/round-16-gmc-call-for-grant-applications-deadline-is-september-7/3181","pubDate":"Thu, 08 Aug 2024 00:06:13 +0000","discourse:topicPinned":"No","discourse:topicClosed":"Yes","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"dao.rocketpool.net-topic-3181"},"source":{"@url":"https://dao.rocketpool.net/t/round-16-gmc-call-for-grant-applications-deadline-is-september-7/3181.rss","#text":"Round 16 - GMC Call for Grant Applications - Deadline is September 7"}},{"title":"RFC: Implement RPL Buyback Using DAO-owned Enzyme Vault","dc:creator":"Enzyme","category":"Uncategorized","description":"<p>Hi all, this is Moss writing from Enzyme.</p>\n<p><em>We invite the Rocket Pool community to provide feedback on this initial proposal. Your insights and suggestions are valuable to ensure that this initial idea meets your collective goals and expectations. Please share your thoughts and comments to help refine and improve this proposal.</em></p>\n<p><strong>Context</strong><br>\nHere are the governance proposals on the RP forum by <a class=\"mention\" href=\"https://dao.rocketpool.net/u/valdorff\">@Valdorff</a> that inspired the creation of this RFC.</p>\n<p>RPIP-45: <a href=\"https://rpips.rocketpool.net/RPIPs/RPIP-45\" class=\"inline-onebox\" rel=\"noopener nofollow ugc\">RPIP-45: RPL Burn</a><br>\nRPIP-50: <a href=\"https://rpips.rocketpool.net/RPIPs/RPIP-50\" class=\"inline-onebox\" rel=\"noopener nofollow ugc\">RPIP-50: RPL Buy &amp; LP</a></p>\n<p><strong>TL;DR</strong></p>\n<ol>\n<li>\n<p>Non-custodial Trustless Execution: Ensures that buyback and liquidity/burn operations are executed without manual intervention or trust/custodial requirements.</p>\n</li>\n<li>\n<p>Automation: Reduces the operational burden on Rocket Pool’s development team by leveraging Enzyme’s automation capabilities.</p>\n</li>\n<li>\n<p>Regulatory Compliance: Minimises regulatory risks through systematic, automated processes.</p>\n</li>\n<li>\n<p>Decentralisation: Aligns with Rocket Pool’s ethos by utilising a decentralised, transparent approach to managing protocol revenues.</p>\n</li>\n<li>\n<p>Security: Built on a secure, time-tested protocol, minimising risk and ensuring robustness.</p>\n</li>\n<li>\n<p>Community Transparency: White-labelled vault provides visibility and accountability to the Rocket Pool community.</p>\n</li>\n</ol>\n<p><strong>Proposal Summary</strong><br>\nThe use of a dedicated Enzyme vault supports the “RPL Buy &amp; LP” and/or the “RPL Burn” concepts as outlined in recent governance discussions. Here’s a detailed breakdown of the proposal:</p>\n<p><strong>Vault Setup</strong></p>\n<ul>\n<li>Ownership: Establish a new vault owned and controlled by Rocket Pool DAO.</li>\n<li>Access: The vault is accessible only to a single whitelisted address, ensuring security and controlled access. It will not be a public vault.</li>\n</ul>\n<p><strong>Program Operations</strong></p>\n<ul>\n<li>Revenue Flow: Protocol revenues will be directed into the Enzyme vault in accordance with Rocket Pool’s tokenomics design.</li>\n<li>Allocation: Funds in the vault will be allocated based on the chosen strategy (buyback and liquidity provision, or buyback and burn).</li>\n</ul>\n<p><strong>Automation</strong></p>\n<ul>\n<li>Deposit Handling: Upon receiving deposits, the vault will trigger custom automation scripts:</li>\n<li>RPL Purchase: Acquire RPL on the open market via DEX/DEX aggregators like 1inch, Paraswap, Uniswap, etc.</li>\n<li>Liquidity Provision: Allocate a % of RPL to provide liquidity on platforms like Curve, Balancer, Uni v3, etc.</li>\n<li>RPL Burn: Send a specified percentage of RPL to a burn address to reduce supply.</li>\n</ul>\n<p><strong>Security and Verification</strong></p>\n<p>Security is a top priority for Enzyme. Here are some key considerations:</p>\n<ul>\n<li>\n<p>Time-Testing: The protocol has been live on mainnet for about 6 years, demonstrating stability and reliability.</p>\n</li>\n<li>\n<p>Audits: Every adapter/integration is audited by Chain Security, one of the top security firms in the space.</p>\n</li>\n<li>\n<p>Bug Bounty: Enzyme has a large bug bounty program on Immunefi, incentivizing the discovery and resolution of potential vulnerabilities.</p>\n</li>\n<li>\n<p>Protocol Upgrades: Enzyme does not force users to upgrade to a new version. Vault owners can review upgrade features and decide not to opt-in to new protocol versions, ensuring control over their operations.</p>\n</li>\n<li>\n<p>Automations: Use the OpenZeppelin stack for secure and verifiable automation, ensuring no additional trust assumptions are necessary.</p>\n</li>\n</ul>\n<p><strong>Regulatory Risk Mitigation</strong></p>\n<ul>\n<li>Systematic Automation: By implementing a systematic and automated buyback, Rocket Pool can reduce regulatory risks that may be associated with a discretionary manual process. This ensures that buyback operations are consistent, transparent, and compliant with evolving regulatory standards.</li>\n</ul>\n<p><strong>Alignment with Tokenomics Rework</strong></p>\n<ul>\n<li>Outsourcing RPL Management: This approach is in line with the overall philosophy of the tokenomics rework, which aims to keep the core functions within the Rocket Pool protocol (such as the bonding curve) while outsourcing the management and infrastructure of the RPL token. This strategy creates operational efficiency and allows the Rocket Pool dev team to focus on core protocol development.</li>\n</ul>\n<p><strong>White Labelling</strong></p>\n<ul>\n<li>\n<p>Customization: The vault can be white-labelled and accessible via a custom URL, e.g. https: //rocketpool . net / buyback</p>\n</li>\n<li>\n<p>Visibility: This enhances transparency and allows the community to track buyback operations.</p>\n</li>\n</ul>\n<p><strong>Cost</strong></p>\n<ul>\n<li>Open Terms: a unique fee structure can be discussed to ensure a mutually beneficial arrangement for both Rocket Pool and Enzyme.</li>\n</ul>\n<p><strong>Conclusion</strong></p>\n<p>Implementing the RPL Buyback program using an Enzyme vault can be a strategic move that offers automation, security, and transparency. It supports Rocket Pool’s decentralised governance model, mitigates regulatory risks, and requires minimal effort from the Rocket Pool team, allowing you to focus on core development activities. We believe this proposal aligns with the long-term vision of Rocket Pool and enhances its operational efficiency.</p>\n<p>We are excited to hear your feedback and remain available for questions.</p>\n            <p><small>1 post - 1 participant</small></p>\n            <p><a href=\"https://dao.rocketpool.net/t/rfc-implement-rpl-buyback-using-dao-owned-enzyme-vault/3177\">Read full topic</a></p>","link":"https://dao.rocketpool.net/t/rfc-implement-rpl-buyback-using-dao-owned-enzyme-vault/3177","pubDate":"Wed, 07 Aug 2024 15:28:18 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"dao.rocketpool.net-topic-3177"},"source":{"@url":"https://dao.rocketpool.net/t/rfc-implement-rpl-buyback-using-dao-owned-enzyme-vault/3177.rss","#text":"RFC: Implement RPL Buyback Using DAO-owned Enzyme Vault"}},{"title":"A poll for node operators to gauge sentiment","dc:creator":"NeverAnIsland","category":"Node Operator Experience","description":"<p>This poll is for node operators and is <em>anonymous</em>.</p>\n<p>At the moment several community members are working on enabling ETH only LEB8 minipools accessible to everyone long ahead of Saturn (next RP release with new tokenomics). It is necessary to get some input from NOs to make better informed design decisions.</p>\n<p>Please, answer the following question:</p>\n<p><a href=\"https://dao.rocketpool.net/t/a-poll-for-node-operators-to-gauge-sentiment/3172/1\">Click to view the poll.</a></p>\n            <p><small>4 posts - 3 participants</small></p>\n            <p><a href=\"https://dao.rocketpool.net/t/a-poll-for-node-operators-to-gauge-sentiment/3172\">Read full topic</a></p>","link":"https://dao.rocketpool.net/t/a-poll-for-node-operators-to-gauge-sentiment/3172","pubDate":"Fri, 02 Aug 2024 13:27:28 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"dao.rocketpool.net-topic-3172"},"source":{"@url":"https://dao.rocketpool.net/t/a-poll-for-node-operators-to-gauge-sentiment/3172.rss","#text":"A poll for node operators to gauge sentiment"}},{"title":"GMC 2024/07/01 - 2024/07/31 Treasury Report","dc:creator":"ShfRyn","category":"Grants / Bounties","description":"<p>Here is a link to the treasury sheet - <a href=\"https://docs.google.com/spreadsheets/d/1dMtHJ4sffBidSN5RphLYC9A5HrsRNqHfqLVn-nJR104/\">GMC Treasury Sheet - Google Sheets </a></p>\n<p>The GMC is working on an updated treasury report to better categorize funding categories and allocations.</p>\n<div class=\"md-table\">\n<table>\n<thead>\n<tr>\n<th>Funds at Start</th>\n<th>Inflows</th>\n<th>Payments</th>\n<th>Diversification (LUSD)</th>\n<th>Outflows (Total)</th>\n<th>Funds at End</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>59,133.60</td>\n<td>4478.65</td>\n<td>1,456.63</td>\n<td>895.73</td>\n<td>2,352.36</td>\n<td>61,259.89</td>\n</tr>\n</tbody>\n</table>\n</div><div class=\"md-table\">\n<table>\n<thead>\n<tr>\n<th>LUSD Funds at Start</th>\n<th>LUSD Inflows</th>\n<th>LUSD Payments</th>\n<th>LUSD Funds at End</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>$ 123,716.44</td>\n<td>$ 14,980.08</td>\n<td>$ 11,193.00</td>\n<td>$ 127,503.52</td>\n</tr>\n</tbody>\n</table>\n</div><p>The GMC has some large expenses coming up with the recently approved tokenomics applications and Rocketlend.</p>\n            <p><small>1 post - 1 participant</small></p>\n            <p><a href=\"https://dao.rocketpool.net/t/gmc-2024-07-01-2024-07-31-treasury-report/3170\">Read full topic</a></p>","link":"https://dao.rocketpool.net/t/gmc-2024-07-01-2024-07-31-treasury-report/3170","pubDate":"Thu, 01 Aug 2024 17:06:38 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"dao.rocketpool.net-topic-3170"},"source":{"@url":"https://dao.rocketpool.net/t/gmc-2024-07-01-2024-07-31-treasury-report/3170.rss","#text":"GMC 2024/07/01 - 2024/07/31 Treasury Report"}},{"title":"pDAO 2024/07/04-2024/08/01 Treasury Report","dc:creator":"vacalaranja","category":"Governance","description":"<h4><a name=\"p-9546-hello-rocket-pool-1\" class=\"anchor\" href=\"https://dao.rocketpool.net#p-9546-hello-rocket-pool-1\"></a>Hello, Rocket Pool!</h4>\n<p>If you need an intro to how pDAO treasury works, check <a href=\"https://dao.rocketpool.net/t/pdao-2022-9-29-2022-12-22-treasury-report/1314/1\">(this post)</a>.</p>\n<p>This period the pDAO reserve received 6,444.90 RPL from inflation, its balance is now 66,531.01 RPL. The IMC and GMC were paid 10,923.56 RPL and 4,478.66 RPL, respectively. Same as last year, August will be the month with two reward periods this year, so the committees’ reserves will get a boost.</p>\n<p>You can keep up with pDAO treasury with the following spreadsheets:<br>\n(<a href=\"https://docs.google.com/spreadsheets/d/1b8ZtXBzh2TkwrdyGYMPtjZNPB4jzErhp0z29rwb2ByQ/edit?usp=sharing\" rel=\"noopener nofollow ugc\">RP Treasury Report - Google Sheets </a>)<br>\n(<a href=\"https://docs.google.com/spreadsheets/d/1Zo9iFJ2YZNAkgNo53yJGSCnz8XAYuLJ7SeiwJx6oF0A/edit?usp=sharing\" rel=\"noopener nofollow ugc\">pDAO Treasury Summary - Google Sheets </a>).</p>\n<h4><a name=\"p-9546-thank-you-for-reading-see-you-next-period-2\" class=\"anchor\" href=\"https://dao.rocketpool.net#p-9546-thank-you-for-reading-see-you-next-period-2\"></a>Thank you for reading, see you next period!</h4>\n            <p><small>1 post - 1 participant</small></p>\n            <p><a href=\"https://dao.rocketpool.net/t/pdao-2024-07-04-2024-08-01-treasury-report/3167\">Read full topic</a></p>","link":"https://dao.rocketpool.net/t/pdao-2024-07-04-2024-08-01-treasury-report/3167","pubDate":"Thu, 01 Aug 2024 03:38:02 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"dao.rocketpool.net-topic-3167"},"source":{"@url":"https://dao.rocketpool.net/t/pdao-2024-07-04-2024-08-01-treasury-report/3167.rss","#text":"pDAO 2024/07/04-2024/08/01 Treasury Report"}},{"title":"Round 14 (Jun 7 - Jul 7) Grants / Bounties / Retrospective Awards Results)","dc:creator":"ShfRyn","category":"Grants / Bounties","description":"<p>The GMC has concluded discussions and scoring for the Round 14 (June 7 - July 7) Grants/Bounties/RA Award Round.</p>\n<p><em>This post also begins the fourteen-day clock during which, according to RPIP-15, “[a]nyone MAY file an RPIP disputing a grant, bounty, or retrospective award within two weeks of the announcement of recipients. Such an RPIP SHALL be subject to a snapshot vote.” Any awards not subject to such a challenge will become official on August 11, 2024 at 23:59 UTC.</em></p>\n<p>This round, all applications were deliberated by all subcommittees. This is due to the low number of applications, Rocketlend being deferred, and three applications having conflicts of interest.</p>\n\nCurrent GMC Roster <a href=\"https://dao.rocketpool.net/t/round-14-jun-7-jul-7-grants-bounties-retrospective-awards-results/3161/1\">(click for more details)</a>\n\nApplication Breakdown <a href=\"https://dao.rocketpool.net/t/round-14-jun-7-jul-7-grants-bounties-retrospective-awards-results/3161/1\">(click for more details)</a>\n\nAwards, Average Overall Scores <a href=\"https://dao.rocketpool.net/t/round-14-jun-7-jul-7-grants-bounties-retrospective-awards-results/3161/1\">(click for more details)</a>\n\nDetailed Award Results <a href=\"https://dao.rocketpool.net/t/round-14-jun-7-jul-7-grants-bounties-retrospective-awards-results/3161/1\">(click for more details)</a>\n\nBounties That Need Definitions <a href=\"https://dao.rocketpool.net/t/round-14-jun-7-jul-7-grants-bounties-retrospective-awards-results/3161/1\">(click for more details)</a>\n\nMember Participation <a href=\"https://dao.rocketpool.net/t/round-14-jun-7-jul-7-grants-bounties-retrospective-awards-results/3161/1\">(click for more details)</a>\n\nFinal Voting Stages <a href=\"https://dao.rocketpool.net/t/round-14-jun-7-jul-7-grants-bounties-retrospective-awards-results/3161/1\">(click for more details)</a>\n            <p><small>1 post - 1 participant</small></p>\n            <p><a href=\"https://dao.rocketpool.net/t/round-14-jun-7-jul-7-grants-bounties-retrospective-awards-results/3161\">Read full topic</a></p>","link":"https://dao.rocketpool.net/t/round-14-jun-7-jul-7-grants-bounties-retrospective-awards-results/3161","pubDate":"Sun, 28 Jul 2024 19:07:24 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"dao.rocketpool.net-topic-3161"},"source":{"@url":"https://dao.rocketpool.net/t/round-14-jun-7-jul-7-grants-bounties-retrospective-awards-results/3161.rss","#text":"Round 14 (Jun 7 - Jul 7) Grants / Bounties / Retrospective Awards Results)"}},{"title":"I can’t join Discord server","dc:creator":"Drikkx","category":"Start Here","description":"<p>Hello, I am the founder of For Loot And Glory. We have built a game on the Skale Network where the core economy is based on rETH. I tried to come and talk about it on your Discord, but I got banned.</p>\n<p>Drikkx</p>\n            <p><small>2 posts - 2 participants</small></p>\n            <p><a href=\"https://dao.rocketpool.net/t/i-can-t-join-discord-server/3151\">Read full topic</a></p>","link":"https://dao.rocketpool.net/t/i-can-t-join-discord-server/3151","pubDate":"Thu, 25 Jul 2024 10:01:32 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"dao.rocketpool.net-topic-3151"},"source":{"@url":"https://dao.rocketpool.net/t/i-can-t-join-discord-server/3151.rss","#text":"I can’t join Discord server"}},{"title":"RPIP-49 Tokenomics Rework Update 2 - Sentiment Poll","dc:creator":"LongForWisdom","category":"Governance","description":"<p>Hi all, we’re here again to share an update about the tokenomics rework. Related threads on the topic can be found <a href=\"https://dao.rocketpool.net/tag/tokenomics-rework\">here</a>.</p>\n<h2><a name=\"where-are-we-at-1\" class=\"anchor\" href=\"https://dao.rocketpool.net#where-are-we-at-1\"></a>Where are we at?</h2>\n<p>The exciting news is that we’re at a stage where we feel comfortable to start the official governance process on the RPIP-49 tokenomics rework.</p>\n<p>This has come after a period of outreach, seeking feedback from stakeholders, discussing alternative directions, and polishing the RPIP specifications. More information on this proposal can be found at <a href=\"https://rpl.rehab\" rel=\"noopener nofollow ugc\">rpl.rehab</a>. This rework includes an informational overview in RPIP-49 as well as a number of RPIPs (42-47, 59, 60) used to specify the various aspects.</p>\n<h3><a name=\"sentiment-poll-2\" class=\"anchor\" href=\"https://dao.rocketpool.net#sentiment-poll-2\"></a>Sentiment Poll</h3>\n<p>The headline item here is that we’ve posted a sentiment poll below where you vote on whether to move the RPIP-49 tokenomics rework to a snapshot vote.</p>\n<p>The snapshot vote would be a vote on the tokenomics rework package as a whole. This means you will be voting on the direction and general contents of the rework, and the specific contents of the included RPIPs as written.</p>\n<p>However, we think it’s valuable to keep the RPIPs in a Living state rather than Finalized at this time. This will provide the flexibility to make <strong>minor</strong> adjustments in response to any issues discovered by the core team during implementation.</p>\n<p>There are several <a href=\"https://rpips.rocketpool.net/RPIPs/RPIP-49#still-to-ratify-prior-to-saturn-1\" rel=\"noopener nofollow ugc\">specific items</a> we are intentionally leaving flexible at this time, these items will be ratified prior to the launch of Saturn 1. They are:</p>\n<ul>\n<li>\n<p><strong>Saturn 2 Surplus Share Strategy</strong> - Determine how to manage surplus share in Saturn 2: Buy+Burn, Buy+LP, or higher voter_share?</p>\n</li>\n<li>\n<p><strong>Deposit Strategy</strong> - A small amount of UX and gas research to help determine if we want a 2TX or 3TX deposit strategy for validator creation</p>\n</li>\n<li>\n<p><strong>Penalty System</strong> - Research and specify a MEV theft detection and penalizing system</p>\n</li>\n<li>\n<p><strong>Security Council NO commission changes</strong> - Determine when and how the council should use their limited power to change no_commission.</p>\n</li>\n</ul>\n<p>We foresee at least 2 follow-on votes - one for Surplus Share strategy and one to ratify the final states of the RPIPs. The other items on the list may be bundled with the ratification or get their own votes.</p>\n<h3><a name=\"h-1kx-proposal-3\" class=\"anchor\" href=\"https://dao.rocketpool.net#h-1kx-proposal-3\"></a>1kx proposal</h3>\n<p>1kx has proposed an alternative direction, which retains the RPL collateral requirement and introduces delegated staking. You can read the details of their proposal <a href=\"https://dao.rocketpool.net/t/1kx-tokenomics-proposal/3119\">here</a>.</p>\n<p>Our position on this is that while some of the contents of the 1kx proposal are complementary, the core elements are not compatible with the RPIP-49 rework.</p>\n<p>Note that this proposal doesn’t currently have specifications (RPIPs) to vote on. This is normal – all proposals have a design phase that precedes specifications.</p>\n<p>Voters should vote to oppose moving to snapshot if they prefer the direction outlined in the 1kx proposal.</p>\n<h3><a name=\"ib1gymnast-proposal-4\" class=\"anchor\" href=\"https://dao.rocketpool.net#ib1gymnast-proposal-4\"></a>ib1gymnast proposal</h3>\n<p>Ib1gymnast has also proposed an alternative direction, which reduces the RPL bond requirement, uses smaller ETH bonds and maintains the 14% commission. You can read the details of their proposal <a href=\"https://dao.rocketpool.net/t/an-alternative-and-simple-tokenomics-proposal/3130\">here</a>.</p>\n<p>Note that this proposal doesn’t currently have specifications (RPIPs) to vote on. This is normal – all proposals have a design phase that precedes specifications.</p>\n<p>Voters should vote to oppose moving to snapshot if they prefer the direction outlined in the ib1gymnast proposal.</p>\n<h2><a name=\"how-can-you-help-us-5\" class=\"anchor\" href=\"https://dao.rocketpool.net#how-can-you-help-us-5\"></a>How can you help us?</h2>\n<p>Please read through at least the <a href=\"https://rpips.rocketpool.net/tokenomics-2024\" rel=\"noopener nofollow ugc\">intro explainers</a>. Reading more and/or asking questions is highly encouraged! Then, make an informed vote on the future of Rocket Pool!</p>\n<p>Thanks from all the authors and contributors (including but not limited to <a class=\"mention\" href=\"https://dao.rocketpool.net/u/valdorff\">@Valdorff</a> <a class=\"mention\" href=\"https://dao.rocketpool.net/u/samus\">@samus</a> <a class=\"mention\" href=\"https://dao.rocketpool.net/u/longforwisdom\">@LongForWisdom</a> <a class=\"mention\" href=\"https://dao.rocketpool.net/u/knoshua\">@knoshua</a> <a class=\"mention\" href=\"https://dao.rocketpool.net/u/sckuzzle\">@sckuzzle</a>)</p>\n<hr>\n<h2><a name=\"rpip-49-rework-sentiment-poll-6\" class=\"anchor\" href=\"https://dao.rocketpool.net#rpip-49-rework-sentiment-poll-6\"></a>RPIP-49 Rework Sentiment Poll</h2>\n<p><strong>This poll will lead to a snapshot vote if it shows promising community sentiment after 14 days.</strong></p>\n<p><a href=\"https://dao.rocketpool.net/t/rpip-49-tokenomics-rework-update-2-sentiment-poll/3136/1\">Click to view the poll.</a></p>\n<hr>\n\nLFW’s Metagovernance Comments <a href=\"https://dao.rocketpool.net/t/rpip-49-tokenomics-rework-update-2-sentiment-poll/3136/1\">(click for more details)</a>\n            <p><small>49 posts - 43 participants</small></p>\n            <p><a href=\"https://dao.rocketpool.net/t/rpip-49-tokenomics-rework-update-2-sentiment-poll/3136\">Read full topic</a></p>","link":"https://dao.rocketpool.net/t/rpip-49-tokenomics-rework-update-2-sentiment-poll/3136","pubDate":"Tue, 23 Jul 2024 14:51:18 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"dao.rocketpool.net-topic-3136"},"source":{"@url":"https://dao.rocketpool.net/t/rpip-49-tokenomics-rework-update-2-sentiment-poll/3136.rss","#text":"RPIP-49 Tokenomics Rework Update 2 - Sentiment Poll"}},{"title":"An Alternative (and simple) Tokenomics Proposal","dc:creator":"ib1gymnast","category":"Uncategorized","description":"<p>Hey Everyone!</p>\n<p>I’m hoping to propose an alternative tokenomics approach which is far simpler than a few of the other options that have been discussed here thus far.</p>\n<p>It is simple to implement, easy to understand, and also allows Node Operators to earn multiples of the Solo Staking APR.</p>\n<h2><a name=\"introduction-1\" class=\"anchor\" href=\"https://dao.rocketpool.net#introduction-1\"></a>Introduction</h2>\n<p>I had a great discussion about my ideas in detail with Waq and Samus here (<a href=\"https://www.youtube.com/watch?v=wBJpaMikJJ8\" rel=\"noopener nofollow ugc\">Rocket Fuel - Evan’s Tokenomics Proposal - Samus’ Feedback</a>) on Rocket Fuel and would highly recommend taking a listen!</p>\n<p>Today Rocket Pool only has about 4% of the liquid staking market. Rocket Pool needs to get serious about gaining market share.</p>\n<p>However, Rocket Pool is bottle-necked by the ability for its set of Node Operators to mint rETH.</p>\n<p>The market has made it clear that the return for Node Operators is not attractive enough, and too heavily reliant on RPL, which is a highly volatile token. The deposit pool has been full for a significant percent of the time since August of last year. Rocket Pool’s largest periods of growth have been <strong>when the deposit pool was not full.</strong></p>\n<p><strong></strong></p><div class=\"lightbox-wrapper\"><strong><a class=\"lightbox\" href=\"https://dao.rocketpool.net/uploads/default/original/2X/7/79d1d49bac055860a3c95fc3d9db1b6e442da0ad.png\" data-download-href=\"https://dao.rocketpool.net/uploads/default/79d1d49bac055860a3c95fc3d9db1b6e442da0ad\" title=\"\"><img src=\"https://dao.rocketpool.net/uploads/default/original/2X/7/79d1d49bac055860a3c95fc3d9db1b6e442da0ad.png\" alt=\"\" data-base62-sha1=\"hnFkGJA59EwtL7MSYp9GlLAyVhr\" width=\"624\" height=\"200\" role=\"presentation\" data-dominant-color=\"F9F7F6\"></a></strong></div><p></p>\n<p><strong></strong></p><div class=\"lightbox-wrapper\"><strong><a class=\"lightbox\" href=\"https://dao.rocketpool.net/uploads/default/original/2X/5/50260bc749fb7fffb49d616005c166e182944fe0.png\" data-download-href=\"https://dao.rocketpool.net/uploads/default/50260bc749fb7fffb49d616005c166e182944fe0\" title=\"|679.221238938053x129\"><img src=\"https://dao.rocketpool.net/uploads/default/optimized/2X/5/50260bc749fb7fffb49d616005c166e182944fe0_2_690x130.png\" alt=\"|679.221238938053x129\" data-base62-sha1=\"br1I4s2TwPRFdF5HP8n2Ga2wucw\" width=\"690\" height=\"130\" srcset=\"https://dao.rocketpool.net/uploads/default/optimized/2X/5/50260bc749fb7fffb49d616005c166e182944fe0_2_690x130.png, https://dao.rocketpool.net/uploads/default/optimized/2X/5/50260bc749fb7fffb49d616005c166e182944fe0_2_1035x195.png 1.5x, https://dao.rocketpool.net/uploads/default/optimized/2X/5/50260bc749fb7fffb49d616005c166e182944fe0_2_1380x260.png 2x\" data-dominant-color=\"ECDADC\"></a></strong></div><p></p>\n<p>rETH is the product that Rocket Pool sells; Rocket Pool should strive so that <strong>Node Operators are never the bottle neck</strong>. This also has the added benefit of avoiding the drag on APY the deposit pool has on rETH when it is full.</p>\n<p>To solve this, my proposal is quite simple and has two parts:</p>\n<ul>\n<li>\n<p>Continue down the LEB curve while maintaining the 14% commission.</p>\n<ul>\n<li>Reduce the ETH bond for Node Operators - starting with LEB4, then progressing to LEB 1.5s with forced exits.</li>\n</ul>\n</li>\n<li>\n<p>Reduce the RPL minimum bond to 10% of Node Operator ETH</p>\n</li>\n</ul>\n<h2><a name=\"profitability-2\" class=\"anchor\" href=\"https://dao.rocketpool.net#profitability-2\"></a>Profitability:</h2>\n<p>A Node Operator’s commission is derived from the borrowed ETH that comes from rETH depositors. This is the primary source of a Rocket Pool Node Operator’s commission. As the eth_bond is reduced for Node Operators, a Node Operator’s profitability vastly increases.</p>\n<p>The following graph is denominated in multiples of solo staker APR.</p>\n<p>Notably, at LEB4, a RP NO earns twice as much as a solo staker in pure ETH rewards - before accounting for any RPL inflation.</p>\n<p>At LEB1.5 with forced exits, a RP NO would earn 3.85 times as much as a solo staker in pure ETH rewards, without accounting for RPL inflation at all!</p>\n<p><strong></strong></p><div class=\"lightbox-wrapper\"><strong><a class=\"lightbox\" href=\"https://dao.rocketpool.net/uploads/default/original/2X/5/5a871e94cf4b6641434075b792c0abd6b801a9f2.png\" data-download-href=\"https://dao.rocketpool.net/uploads/default/5a871e94cf4b6641434075b792c0abd6b801a9f2\" title=\"\"><img src=\"https://dao.rocketpool.net/uploads/default/original/2X/5/5a871e94cf4b6641434075b792c0abd6b801a9f2.png\" alt=\"\" data-base62-sha1=\"cUQsNk6nXR83bRUfA05MAHnxiM2\" width=\"624\" height=\"347\" role=\"presentation\" data-dominant-color=\"FDFDFD\"></a></strong></div><p></p>\n<p>Zooming in on this same graph at the LEB4 position:</p>\n<p><strong></strong></p><div class=\"lightbox-wrapper\"><strong><a class=\"lightbox\" href=\"https://dao.rocketpool.net/uploads/default/original/2X/5/5cd51f893bc6279656b9062df9849b2d4f2096c5.png\" data-download-href=\"https://dao.rocketpool.net/uploads/default/5cd51f893bc6279656b9062df9849b2d4f2096c5\" title=\"\"><img src=\"https://dao.rocketpool.net/uploads/default/optimized/2X/5/5cd51f893bc6279656b9062df9849b2d4f2096c5_2_497x286.png\" alt=\"\" data-base62-sha1=\"dfexzVGILxRIAiLIGt1o3PkEwkd\" width=\"497\" height=\"286\" role=\"presentation\" srcset=\"https://dao.rocketpool.net/uploads/default/optimized/2X/5/5cd51f893bc6279656b9062df9849b2d4f2096c5_2_497x286.png, https://dao.rocketpool.net/uploads/default/optimized/2X/5/5cd51f893bc6279656b9062df9849b2d4f2096c5_2_745x429.png 1.5x, https://dao.rocketpool.net/uploads/default/optimized/2X/5/5cd51f893bc6279656b9062df9849b2d4f2096c5_2_994x572.png 2x\" data-dominant-color=\"FCFDFD\"></a></strong></div><p></p>\n<p>And also on the LEB1.5 position:</p>\n<p><strong></strong></p><div class=\"lightbox-wrapper\"><strong><a class=\"lightbox\" href=\"https://dao.rocketpool.net/uploads/default/original/2X/c/ce97f9869ab201e68ddb9de5054417107504593e.png\" data-download-href=\"https://dao.rocketpool.net/uploads/default/ce97f9869ab201e68ddb9de5054417107504593e\" title=\"\"><img src=\"https://dao.rocketpool.net/uploads/default/optimized/2X/c/ce97f9869ab201e68ddb9de5054417107504593e_2_624x344.png\" alt=\"\" data-base62-sha1=\"ttBXIE2CBnHXxAB9i1GORtqX8fk\" width=\"624\" height=\"344\" role=\"presentation\" srcset=\"https://dao.rocketpool.net/uploads/default/optimized/2X/c/ce97f9869ab201e68ddb9de5054417107504593e_2_624x344.png, https://dao.rocketpool.net/uploads/default/original/2X/c/ce97f9869ab201e68ddb9de5054417107504593e.png 1.5x, https://dao.rocketpool.net/uploads/default/original/2X/c/ce97f9869ab201e68ddb9de5054417107504593e.png 2x\" data-dominant-color=\"FCFDFD\"></a></strong></div><p></p>\n<h3><a name=\"a-derivation-of-the-math-for-the-above-graphs-follows-3\" class=\"anchor\" href=\"https://dao.rocketpool.net#a-derivation-of-the-math-for-the-above-graphs-follows-3\"></a>A derivation of the math for the above graphs follows:</h3>\n<p>We want to know how profitable being a Rocket Pool Node Operator is relative to being a solo staker on a per ETH basis.</p>\n<p>So, that would be the Rocket Pool Node Operator returns, per ETH invested, divided by the solo staker returns, per ETH invested.</p>\n<p>Let’s start with the denominator, solo staker returns per ETH invested.</p>\n<p>For one year’s worth of returns, we have 32 times the yield, but since we want to know what the returns are per ETH, we divide by 32 and are left with the yield. This makes sense, since that is the definition of yield: returns per unit of account.</p>\n<p><strong><img src=\"https://dao.rocketpool.net/uploads/default/original/2X/5/5190735fa057e53319ffa9b4fb2f579de6e85361.png\" alt=\"\" data-base62-sha1=\"bDy9SbgxLbi3MRjF3vjJAs86U0N\" width=\"332\" height=\"38\" role=\"presentation\"></strong></p>\n<p>Next, we want to know how much a Rocket Pool Node Operator earns on a per ETH basis.<br>\nTo calculate this, it would be the eth_bond provided by the Node Operator times the standard staking yield, plus the yield earned by the borrowed ETH multiplied by the commission rate, where the “borrowed ETH” is just 32 ETH minus the ETH provided by the NO.</p>\n<p><strong><img src=\"https://dao.rocketpool.net/uploads/default/original/2X/8/8256aadf7f89706d2d13b7ba735b9041fc34b0b2.png\" alt=\"\" data-base62-sha1=\"iB1KPC2fbEs7cYDOcSHAx7vZx7k\" width=\"408\" height=\"38\" role=\"presentation\"></strong></p>\n<p>However, we want to know how much is earned per ETH invested, so we would divide this by the ETH provided by the Node Operator, which is the eth_bond.</p>\n<p>We now have our numerator and our denominator. Dividing our numerator by our denominator, we are left with the following:</p>\n<p><strong><img src=\"https://dao.rocketpool.net/uploads/default/original/2X/a/a2753698e7075988a956e2389338696f65c9c7ec.png\" alt=\"\" data-base62-sha1=\"nbatFiOa7RekFNcGB6O28L7eu9C\" width=\"514\" height=\"225\" role=\"presentation\"></strong></p>\n<p>Checking our boundary conditions, when the NO eth_bond is 16 ETH, we have:</p>\n<p>((32/16) - 1)*0.14 + 1 = 1.14</p>\n<p>This is what we expect - we have recovered the 14% commission Rocket Pool Node Operators receive for their 16 ETH bonded minipools.</p>\n<p>What about for LEB8s? We have:</p>\n<p>((32/8) - 1)*0.14 + 1 = 1.42</p>\n<p>Again, this is what we expect - we recover the 42% increased ETH rewards which was used to advertise LEB8s.</p>\n<p>How about when the eth_bond is very small, say, 0.01 ETH?</p>\n<p>((32/0.01) - 1)*0.14 + 1 = ~ 448</p>\n<p>Again, this is what we expect, as per the above graph.</p>\n<p>As the eth_bond gets small, the 32/eth_bond term dominates, and the function looks like a 32/x function, where x is our independent variable - the Node Operator’s eth_bond.</p>\n<h2><a name=\"hurdle-rate-4\" class=\"anchor\" href=\"https://dao.rocketpool.net#hurdle-rate-4\"></a>Hurdle Rate</h2>\n<p>Lido’s CSM is advertising at least 50% more returns for Node Operators compared to solo staking. To continue to be relevant in the liquid staking market, <strong>Rocket Pool must achieve returns that are more competitive than 1.5x the solo staking yield for its Node Operators,<br>\non a per ETH basis.</strong></p>\n<p>As you can see from the above, LEB4 at 14% commission achieves this goal, returning ~ 2x the solo staking return in pure ETH rewards, without accounting for the RPL income from RPL inflation.</p>\n<p>Once the protocol gets forced exits, the eth_bond can be reduced to 1.5 ETH, which would increase the ETH denominated yield to 3.85 times the solo staking yield!</p>\n<p>Another way to think about the above graph is - on the <strong>far right of the graph</strong> when eth_bond = 16, it <strong>maximizes value accrual for the RPL/ETH ratio.</strong></p>\n<p>On the far left of the graph, where we get into LEB range - <strong>it maximizes for protocol TVL</strong> - while also exposing Node Operators to much more borrowed ETH, and hence ETH denominated revenue.</p>\n<p><strong>LEB8 was smack dab in the middle of these two positions</strong> - optimizing for neither one.</p>\n<p>So <strong>what is the tradeoff space that Rocket Pool should be operating in?</strong></p>\n<p>Pay Node Operators in ETH by exposing them to more of the ETH yield through <strong>borrowed ETH, without overly constraining the size of the Node Operator set.</strong> This is the true commission for Node Operators.<br>\nIf we run out of demand for rETH (this is a long runway, in my opinion) then we reduce the rETH commission from 14% → 10%.</p>\n<p>Even at 10% commission for Node Operators, they would still be earning ~ 3x pure ETH rewards compared to solo stakers for LEB1.5s!</p>\n<h2><a name=\"part-2-rpl-5\" class=\"anchor\" href=\"https://dao.rocketpool.net#part-2-rpl-5\"></a>Part 2: RPL</h2>\n<p>The second part of my proposal is to change the RPL collateral requirement from 10% of “borrowed eth”, to 10% of the “eth_bond”, or the ETH brought to the protocol by the Node Operator.</p>\n<p>This would represent a reduction in the RPL collateral required for LEB minipools. The reason for this reduction is simple. Node Operators have made it clear that they want to earn ETH, not RPL.</p>\n<p>By reducing the Node Operator’s required exposure to RPL, the ETH rewards that I detail above will dominate - making being a Rocket Pool NO far more attractive.</p>\n<p>I model what these returns would look like in various RPL performance situations below.</p>\n<p>The bottom line is Node Operators would be significantly more profitable in this proposal relative to solo stakers in pure ETH rewards.</p>\n<h3><a name=\"so-why-rpl-at-all-6\" class=\"anchor\" href=\"https://dao.rocketpool.net#so-why-rpl-at-all-6\"></a>So, why RPL at all?</h3>\n<p>RPL has served, and still would with this proposal, as a “shield” of decentralization for Rocket Pool, to put it a bit dramatically.</p>\n<p>RPL would still serve to help keep the protocol decentralized.</p>\n<p>This is likely due to ambiguity surrounding legal RPL’s status, and also large corporations’ unwillingness to go that far out on the risk curve by owning RPL, which is a requirement to be a Node Operator.</p>\n<p>The result is that quite a significant portion of Rocket Pool’s Node Operator set are home stakers, who have the freedom to invest their own funds however they wish.</p>\n<p>The other aspect is governance. RPL still has utility as a governance token.</p>\n<p>RPL would retain the same functionality and utility it has today, the only difference is Node Operators would now derive the vast majority of their returns from the commission on borrowed ETH - and not their exposure to RPL.</p>\n<p>Would this be negative for the RPL/ETH ratio?</p>\n<p>Potentially in the short term, but I do not think so in the long term. Prioritizing TVL growth for the protocol will have a greatly positive effect on the RPL/ETH ratio in the longer term horizon.</p>\n<p>Empirically, LDO is worth 5 times as much as RPL in ETH market cap terms. This is likely in part due to holders’ belief that owning LDO is a call option on Lido’s willingness to turn on the fee switch in the future.</p>\n<p>The take-away is this: <strong>if Rocket Pool had 22% market share - empirically, RPL/ETH ratio would be significantly higher than it is today.</strong></p>\n<p>I am not necessarily against turning on the fee switch for RPL - but turning it on today, when the protocol only has 4% of the liquid staking market, would be incredibly pre-mature.</p>\n<p>Rocket Pool should instead <strong>prioritize TVL growth</strong> by maintaining the 14% rETH commission (for now) and lowering the eth_bond for Node Operators, unlocking multiples of pure ETH yield relative to solo staking.</p>\n<p>An additional important point is that by turning on the fee switch for RPL, RPL’s valuation would then become sensitive to the ETH staking yield, which will likely continue to compress over time.</p>\n<p>The benefit of the proposal that I have detailed above is that it is not sensitive to the staking yield (as long as it remains positive!).</p>\n<h2><a name=\"so-what-do-returns-look-like-for-this-proposal-7\" class=\"anchor\" href=\"https://dao.rocketpool.net#so-what-do-returns-look-like-for-this-proposal-7\"></a>So, what do returns look like for this proposal?</h2>\n<p>I have put together a model of forward looking returns, denominated in ETH.</p>\n<p>I make two assumptions.</p>\n<p>The first is that the vanilla ETH staking yield starts at 3.5% and declines to 2% linearly over the next five years, then remains at 2% terminally.</p>\n<p>The next assumption I make is that the RPL yield is 8%, which is what it was when I made this tool a year ago, although it has since climbed to 9% today. But to be conservative, I will keep it at 8% for the purposes of the model below.</p>\n<p>With that out of the way, modeling is below.</p>\n<p>Relative to solo staking, the ETH denominated returns are quite good.</p>\n<p>The below scenario is “best case”, where the Node Operator is operating an LEB1.5 and has 0.15 ETH’s worth of RPL staked.</p>\n<p>I also assume the RPL/ETH ratio declines by 75% in the first two years of staking.</p>\n<p>Despite the RPL/ETH ratio drop, the Node Operator is still significantly more profitable than a solo staker!</p>\n<p>(Rocket Pool NO returns in Orange, vanilla Solo staker in blue)</p>\n<p><strong></strong></p><div class=\"lightbox-wrapper\"><strong><a class=\"lightbox\" href=\"https://dao.rocketpool.net/uploads/default/original/2X/9/96a0e0bc91b4befc8bdbbce1a6dccf36469c8887.png\" data-download-href=\"https://dao.rocketpool.net/uploads/default/96a0e0bc91b4befc8bdbbce1a6dccf36469c8887\" title=\"\"><img src=\"https://dao.rocketpool.net/uploads/default/optimized/2X/9/96a0e0bc91b4befc8bdbbce1a6dccf36469c8887_2_592x500.png\" alt=\"\" data-base62-sha1=\"luwiAxRtCuamoDuxArAlZGBiXm7\" width=\"592\" height=\"500\" role=\"presentation\" srcset=\"https://dao.rocketpool.net/uploads/default/optimized/2X/9/96a0e0bc91b4befc8bdbbce1a6dccf36469c8887_2_592x500.png, https://dao.rocketpool.net/uploads/default/optimized/2X/9/96a0e0bc91b4befc8bdbbce1a6dccf36469c8887_2_888x750.png 1.5x, https://dao.rocketpool.net/uploads/default/original/2X/9/96a0e0bc91b4befc8bdbbce1a6dccf36469c8887.png 2x\" data-dominant-color=\"FCFCFC\"></a></strong></div><p></p>\n<p>What about if the Node Operator is collateralized at 20%?</p>\n<p>Still, the returns are very attractive, <em>even if the RPL/ETH ratio craters by 75%.</em></p>\n<p><strong></strong></p><div class=\"lightbox-wrapper\"><strong><a class=\"lightbox\" href=\"https://dao.rocketpool.net/uploads/default/original/2X/d/d659c9c094addeef289621e6e7fccf38f8194385.png\" data-download-href=\"https://dao.rocketpool.net/uploads/default/d659c9c094addeef289621e6e7fccf38f8194385\" title=\"\"><img src=\"https://dao.rocketpool.net/uploads/default/optimized/2X/d/d659c9c094addeef289621e6e7fccf38f8194385_2_590x500.png\" alt=\"\" data-base62-sha1=\"uAey1w7hgljXfxfc9w19XnUSDUF\" width=\"590\" height=\"500\" role=\"presentation\" srcset=\"https://dao.rocketpool.net/uploads/default/optimized/2X/d/d659c9c094addeef289621e6e7fccf38f8194385_2_590x500.png, https://dao.rocketpool.net/uploads/default/optimized/2X/d/d659c9c094addeef289621e6e7fccf38f8194385_2_885x750.png 1.5x, https://dao.rocketpool.net/uploads/default/original/2X/d/d659c9c094addeef289621e6e7fccf38f8194385.png 2x\" data-dominant-color=\"FCFCFC\"></a></strong></div><p></p>\n<p>The fun thing about this code is that you get to pick the scenario you would like to see and project forwards.</p>\n<p>Here is the mathematica code, you can convert it to python using your favorite LLM if you would like: <a href=\"https://drive.google.com/file/d/1Y2Er_D49e4sVcOPEtiAr7RuZEZF2D7Xh/view?usp=sharing\" rel=\"noopener nofollow ugc\">mathematica code</a></p>\n<h2><a name=\"to-wrap-up-8\" class=\"anchor\" href=\"https://dao.rocketpool.net#to-wrap-up-8\"></a>To wrap up:</h2>\n<p>Rocket Pool should continue down the LEB path by <strong>lowering the eth_bond,</strong> maintain the 14% commission in order to make being a Rocket Pool Node Operator extremely attractive compared to the Lido CSM, and <strong>change the RPL bond requirement to 10% of Node Operator bonded ETH.</strong></p>\n<p>~fin~</p>\n            <p><small>9 posts - 5 participants</small></p>\n            <p><a href=\"https://dao.rocketpool.net/t/an-alternative-and-simple-tokenomics-proposal/3130\">Read full topic</a></p>","link":"https://dao.rocketpool.net/t/an-alternative-and-simple-tokenomics-proposal/3130","pubDate":"Mon, 22 Jul 2024 00:13:24 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"dao.rocketpool.net-topic-3130"},"source":{"@url":"https://dao.rocketpool.net/t/an-alternative-and-simple-tokenomics-proposal/3130.rss","#text":"An Alternative (and simple) Tokenomics Proposal"}},{"title":"SmartNode on DietPi","dc:creator":"0xb0a7","category":"Education","description":"<p>DietPi is a lightweight Debian based distro with images available for RaspberryPi, Odroid, NanoPi, OrangePi, etc (and as I’m reviewing the supported hardware list, even x86!)<br>\nBeing so lightweight, there were just a couple of things missing that I needed to install in order to get the RocketPool SmartNode installer to run on an OrangePi5+ (on DietPi v9.5.1)</p>\n<ul>\n<li>sudo apt install lsb-release</li>\n<li>sudo apt install xz-utils<br>\nThen install as per <a href=\"https://docs.rocketpool.net/guides/node/docker\" class=\"inline-onebox\" rel=\"noopener nofollow ugc\">Rocket Pool</a> following the Linux arm64 sections.  Enjoy!</li>\n</ul>\n            <p><small>1 post - 1 participant</small></p>\n            <p><a href=\"https://dao.rocketpool.net/t/smartnode-on-dietpi/3128\">Read full topic</a></p>","link":"https://dao.rocketpool.net/t/smartnode-on-dietpi/3128","pubDate":"Sat, 20 Jul 2024 01:28:39 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"dao.rocketpool.net-topic-3128"},"source":{"@url":"https://dao.rocketpool.net/t/smartnode-on-dietpi/3128.rss","#text":"SmartNode on DietPi"}}]}}}