{"rss":{"@version":"2.0","@xmlns:discourse":"http://www.discourse.org/","@xmlns:atom":"http://www.w3.org/2005/Atom","@xmlns:dc":"http://purl.org/dc/elements/1.1/","channel":{"title":"Frax Finance Governance - Latest topics","link":"https://gov.frax.finance/latest","description":"Latest topics","lastBuildDate":"Tue, 02 Jul 2024 16:48:35 +0000","atom:link":{"@href":"https://gov.frax.finance/latest.rss","@rel":"self","@type":"application/rss+xml"},"item":[{"title":"Use FXTL to redistribute Fraxtal revenue to users","dc:creator":"wolfehr","category":"Governance Proposals","description":"<p><strong>Authors</strong></p>\n<p><a class=\"mention\" href=\"https://gov.frax.finance/u/wolfehr\">@wolfehr</a></p>\n<p><strong>Summary</strong></p>\n<ul>\n<li>Treat Fraxtal as a new Frax product that distributes 90% of revenue back to users, with the remaining 10% going to veFXS and insurance.</li>\n</ul>\n<p><strong>Key Principals</strong></p>\n<ul>\n<li>The FXTL system should incentivize Fraxtal usage, Fraxtal TVL, and building/innovating on Fraxtal.</li>\n<li>Revenue that Fraxtal generates should be users redistributed to users who add value to the ecosystem (as measured by FXTL)</li>\n<li>FXTL should not produce FXS inflation</li>\n<li>FXS should charge a fee for building and maintaining Fraxtal.</li>\n<li>FXS should remain the governance token and value sink for all Frax products.</li>\n</ul>\n<p><strong>Option 1</strong></p>\n<p>Mechanism:</p>\n<ol>\n<li>Use revenue Fraxtal generates via sequencer fees and MEV to purchase FXS.</li>\n<li>Deposit 90% of FXS into a vault, distribute 8% to veFXS, and reserve 2% for insurance.</li>\n<li>FXTL holders can burn FXTL in exchange for a prorated share of what’s in the vault.</li>\n</ol>\n<p>Scenario:</p>\n<ul>\n<li>There are 10,000,000 FXTL and 1,000,000 FXS in the contract.</li>\n<li>Alice burns 1000 FXL and claims 100 FXS (1,000/10,000,000*1,000,000). There are now 9,999,000 FXL and $999,900 in the contract.</li>\n<li>Bob then burns 1,000,000 FXTL and claims 100,000 FXS (1,000,000/9,999,000*999,900).</li>\n</ul>\n<p><strong>Option 2</strong></p>\n<p>Mechanism:</p>\n<ol>\n<li>Use revenue Fraxtal generates via sequencer fees and MEV to purchase ETH.</li>\n<li>Use ETH to mint frxETH</li>\n<li>Deposit 90% frxETH into a vault, distribute 8% to veFXS (can also convert to FXS first), and reserve 2% for insurance.</li>\n<li>FXTL holders can burn FXTL in exchange for a prorated share of what’s in the vault.</li>\n</ol>\n<p>Scenario:</p>\n<p>Same as option 1, replace FXS with frxETH</p>\n<p><strong>Pros</strong></p>\n<ul>\n<li>Does not dilute FXS</li>\n<li>Does not introduce a new token (except keeping FXTL as the accounting system for ownership of the vault holding Fraxtal revenue).</li>\n<li>Maintains FXS as the center of the Frax ecosystem, which now includes Fraxtal.</li>\n<li>Redistributes Fraxtal revenue to those adding value to the ecosystem, providing an incentive to use and build on the chain. Since the flox mechanism gives more FXTL to users/contracts, adding more value, more FXTL means the holder added more value.</li>\n<li>Allows users to speculate on the future value of Fraxtal. For example, someone can buy FXTL for more than the current revenue suggests.</li>\n<li>[Option 2] Grows frxETH TVL</li>\n</ul>\n<p><strong>Cons</strong></p>\n<ul>\n<li>Fraxtal revenue might not be a sufficient incentive, particularly at first</li>\n<li>Limits the value veFXS captures from Fraxtal to 8%. However, this is in line with other Frax products such as sfrxETH.</li>\n</ul>\n<p><strong>Potential Future Considerations (separate proposals/votes)</strong></p>\n<ul>\n<li>Should veFXS subsidize FXTL to help bootstrap the ecosystem? For example, veFXS can redirect 25% of veFXS revenue to the Fraxtal vault for the first year.</li>\n<li>Can Frax use the assets in the vault to earn revenue until they’re claimed? For example, stake the frxETH or deploy in defi.</li>\n</ul>\n<p><strong>Vote</strong></p>\n<ul>\n<li>Approve Option 1</li>\n<li>Approve Option 2, with veFXS receiving frxETH</li>\n<li>Approve Option 2, with veFXS receiving FXS</li>\n<li>Reject</li>\n</ul>\n<p>Pending Updates:</p>\n<ul>\n<li>Additional options for the fee split (e.g., 90/10, 80/20)</li>\n<li>The details for purchasing fxs or frxeth (depending on the option selected) are TBD. For example, are fees used to buy fxs or frxeth and deposit into the vault every block? Every day? Weekly? Is it automated or manual? I think I’d want to better understand the mechanism for collecting that revenue before making a recommendation. However, I think that doesn’t have a large impact on if the community likes the overall fxtl mechanism.</li>\n</ul>\n            <p><small>3 posts - 3 participants</small></p>\n            <p><a href=\"https://gov.frax.finance/t/use-fxtl-to-redistribute-fraxtal-revenue-to-users/3125\">Read full topic</a></p>","link":"https://gov.frax.finance/t/use-fxtl-to-redistribute-fraxtal-revenue-to-users/3125","pubDate":"Tue, 02 Jul 2024 16:48:35 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"gov.frax.finance-topic-3125"},"source":{"@url":"https://gov.frax.finance/t/use-fxtl-to-redistribute-fraxtal-revenue-to-users/3125.rss","#text":"Use FXTL to redistribute Fraxtal revenue to users"},"filter":false},{"title":"Proposal to introduce external funding for $FXTL development","dc:creator":"messi","category":"Governance Proposals","description":"<p>Following the proposal to separate $FXS and $FXTL, it makes sense to introducing external funding for FXTL development. The Frax team is top-notch, but always building on a tight budget.</p>\n<ul>\n<li>More funding is required to attract more talents, in engineering as well as marketing.</li>\n<li>The greater community will be incentivized to join FXTL, which will make it faster to grow</li>\n<li>The incentive is aligned. $FXS holders will benefit from this move since they will get $FXTL allocations.</li>\n</ul>\n            <p><small>1 post - 1 participant</small></p>\n            <p><a href=\"https://gov.frax.finance/t/proposal-to-introduce-external-funding-for-fxtl-development/3120\">Read full topic</a></p>","link":"https://gov.frax.finance/t/proposal-to-introduce-external-funding-for-fxtl-development/3120","pubDate":"Tue, 02 Jul 2024 11:55:27 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"gov.frax.finance-topic-3120"},"source":{"@url":"https://gov.frax.finance/t/proposal-to-introduce-external-funding-for-fxtl-development/3120.rss","#text":"Proposal to introduce external funding for $FXTL development"},"filter":false},{"title":"Proposal to Tokenize FXTL into a Separate Token Independent of FXS","dc:creator":"Oldpaul","category":"Governance Proposals","description":"<p>Title: Proposal to Tokenize FXTL into a Separate Token Independent of FXS</p>\n<p><strong>Proposal</strong>:</p>\n<p>The objective of this proposal is to initiate a discussion regarding the possibility of tokenizing FXTL into an entirely separate token distribution, distinct from FXS. If this idea gains broad community support, it could potentially lead to significant gains for FXS, driven by improved governance and more focused utility.</p>\n<p>If passed, this proposal would require the Frax Core Developers (“the team”) to submit a further governance proposal for an FXTL token distribution that is completely separate from FXS and not convertible or dilutive to FXS supply in any way. The team would be required to submit a governance proposal for the full supply, allocation, time to tokenization, and details of FXTL no later than 90 days after passing.</p>\n<p><strong>Rationale</strong>:</p>\n<ol>\n<li><strong>Simplified Governance</strong>:</li>\n</ol>\n<ul>\n<li><strong>Streamlined Decision-Making</strong>: Separating FXTL from FXS could streamline governance by reducing the complexity associated with managing multiple functions under a single token. This separation would enable more straightforward, transparent, and efficient governance processes.</li>\n<li><strong>Focused Governance</strong>: With FXTL as a separate token, FXS holders can concentrate on decisions directly affecting FXS, while FXTL holders can focus on matters pertinent to FXTL. This specialization could lead to better-informed decisions and more effective governance overall.</li>\n</ul>\n<ol start=\"2\">\n<li><strong>Increased Utility</strong>:</li>\n</ol>\n<ul>\n<li><strong>Targeted Enhancements</strong>: A dedicated token for FXTL would enable more targeted enhancements and utility, catering specifically to FXTL holders. This could include exclusive features, staking rewards, and incentives designed to drive engagement and value within the FXTL ecosystem.</li>\n<li><strong>Flexibility in Development</strong>: A separate FXTL token allows for more flexibility in developing and deploying features specific to FXTL without being constrained by the broader FXS framework.</li>\n</ul>\n<ol start=\"3\">\n<li><strong>Market Differentiation</strong>:</li>\n</ol>\n<ul>\n<li><strong>Attracting Diverse Investors</strong>: Distinct tokens for different functionalities could attract more investors and users, thereby increasing the overall market performance of both FXTL and FXS. Investors specifically interested in the utility and potential of FXTL can invest in it directly without being influenced by FXS market dynamics.</li>\n<li><strong>Enhanced Clarity</strong>: Clear differentiation between FXS and FXTL can enhance market clarity, helping potential investors and users understand the unique value propositions of each token.</li>\n</ul>\n<ol start=\"4\">\n<li><strong>Economic Synergy</strong>:</li>\n</ol>\n<ul>\n<li><strong>Optimized Token Economics</strong>: By tokenizing FXTL separately, the economic models of both tokens can be optimized to better serve their respective communities. This could lead to more robust and sustainable growth for both tokens.</li>\n<li><strong>Risk Mitigation</strong>: Segregating FXTL from FXS reduces the risk of one token’s issues adversely affecting the other, thus providing a more stable and resilient economic environment for both tokens.</li>\n</ul>\n<p><strong>FRAXTAL and the Importance of an Independent L2 Token</strong>:</p>\n<ol>\n<li><strong>FRAXTAL Overview</strong>:</li>\n</ol>\n<ul>\n<li><strong>What is FRAXTAL</strong>: FRAXTAL (FRAX’s Layer 2 solution) aims to enhance scalability, reduce transaction costs, and improve the overall user experience for FRAX ecosystem participants.</li>\n<li><strong>Benefits of L2</strong>: As an L2 solution, FRAXTAL can process transactions faster and cheaper than the Ethereum mainnet, making it an essential component for the future growth and usability of the FRAX ecosystem.</li>\n</ul>\n<ol start=\"2\">\n<li><strong>Need for a Separate Token</strong>:</li>\n</ol>\n<ul>\n<li><strong>Operational Autonomy</strong>: An independent FXTL token would provide FRAXTAL with the operational autonomy needed to develop and expand without being tied to the broader FXS token’s governance and economic constraints.</li>\n<li><strong>Specialized Incentives</strong>: A separate token allows FRAXTAL to create specific incentives and reward mechanisms tailored to its unique needs and objectives, thereby fostering a vibrant and engaged community.</li>\n<li><strong>Improved Security and Compliance</strong>: With its own token, FRAXTAL can implement security and compliance measures optimized for its specific environment, enhancing overall system integrity and trust.</li>\n</ul>\n<p><strong>Process</strong>:</p>\n<ol>\n<li><strong>Discussion</strong>: Open this proposal for community discussion on the FRAX forum to gauge interest and gather feedback.</li>\n<li><strong>Drafting Final Proposal</strong>: Based on the community’s feedback, revise the proposal for clarity and comprehensiveness.</li>\n<li><strong>Voting</strong>: Submit the final proposal for a vote by veFXS holders. As per governance protocols, any proposal must undergo a three-day discussion period followed by a five-day off-chain voting period on Snapshot, with results determined by a simple majority and a 7.2m veFXS quorum requirement.</li>\n<li><strong>Implementation</strong>: If approved, work with the core team to implement the tokenization and ensure a smooth transition and integration.</li>\n</ol>\n<p><strong>Conclusion</strong>:</p>\n<p>By tokenizing FXTL into a separate token, we can simplify governance, increase utility, and enhance market performance for FXTL and FXS. This strategic decision is aimed at fostering a more robust, efficient, and focused ecosystem for both tokens. We encourage community members to participate in this discussion and share their thoughts.</p>\n<p>We welcome all feedback and look forward to a constructive discussion.</p>\n<p>Thank you</p>\n            <p><small>13 posts - 10 participants</small></p>\n            <p><a href=\"https://gov.frax.finance/t/proposal-to-tokenize-fxtl-into-a-separate-token-independent-of-fxs/3117\">Read full topic</a></p>","link":"https://gov.frax.finance/t/proposal-to-tokenize-fxtl-into-a-separate-token-independent-of-fxs/3117","pubDate":"Tue, 02 Jul 2024 09:50:29 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"gov.frax.finance-topic-3117"},"source":{"@url":"https://gov.frax.finance/t/proposal-to-tokenize-fxtl-into-a-separate-token-independent-of-fxs/3117.rss","#text":"Proposal to Tokenize FXTL into a Separate Token Independent of FXS"},"filter":false},{"title":"[FIP-3XX] Standardize ragequit proposals","dc:creator":"Sharkysnakefish","category":"FIPs","description":"<p>Authors: Lyule67 &amp; Q. Shinchan</p>\n<p>Due to recent increases in ragequit proposals and people not being happy with their own action of being locked, we propose that Frax standardize the ragequit proposals for users who wants their funds back early. This proposal aims to make governance more effective while establishing clear and transparent expectations, with fairness that does not differentiate.</p>\n<p>Solve:</p>\n<ul>\n<li>This proposal makes sure users who are unhappy with their position have a clear way to get their funds/LP position back with standardized costs.</li>\n<li>It makes future governance for FRAX more effective with less need for discussion and less proposals</li>\n<li>It protects the interest of our protocols liquidity system with a standardized fee which is intended to make it unattractive to ragequit</li>\n<li>It protects the protocol from lowering the collateralization ratio below 100% from ragequit proposals.</li>\n</ul>\n<p>This proposal does not in any way or form talk about unlocks, which is another topic best judged from case to case in regards to situation.</p>\n<p>We propose the following algorithmic solution for a standardized ragequit:<br>\n“USD value of LP position” × Multiplier = “virtual USD Value of Boosted Position”<br>\nL M B<br>\n“LP Staked + Boost [FraxStats]” × “LP Price [FraxStats]” = “virtual USD Value of entire Pool”<br>\nP A N<br>\nnote [FraxStats] refers to the value indicated by app.frax.finance for the equivalently named statistic of any given gauged LP pool during any given period.</p>\n<p>G = “virtual USD Value of Boosted Position” ÷ “virtual USD Value of entire Pool”<br>\nB N<br>\nG = decimal percentage (virtual) USD Value of position relative to (virtual) boosted value of entire pool<br>\nA = LP Price [FraxStats]<br>\nD = LP Amount Staked per position<br>\nL = USD Value of LP Position<br>\nL = A x D<br>\nM= (veFXS-stake-weight-boost + time-lock-boost)<br>\nM = Multiplier<br>\nP = “LP Staked + Boost”[FraxStats]<br>\nB = “virtual USD Value of Boosted Position”<br>\nB = L × M<br>\nP × A = “virtual USD Value of entire Pool”<br>\nP x A = N<br>\nG = (B ÷ N)<br>\nG = (L × M) ÷ (P × A)<br>\nR = FXS allocated to pool per epoch [FraxStats]<br>\nF = FXS Price per epoch [FraxStats]<br>\nF = cumulative avg FXS price of relative epochs (use 3 daily averages [morning/noon/night])<br>\nE = F^y × veFXS (user staked)<br>\nM = “FXS rewarded to LP Position per Epoch”<br>\nM = G × R<br>\nV = “USD Value of FXS rewarded to LP Position per Epoch”<br>\nV = M × F<br>\nV^n = M × F per epoch<br>\n^n = sequential numerical identity of epoch, NOT an exponent (used only as epoch identifier)<br>\n^y = most recent ^n<br>\nT = “Total USD Value of FXS received per (lifetime of) position”<br>\nT = (V^n) + (V^n) … + (V^y)<br>\nC = Function derived from<br>\nvalue of Collateral Ratio %<br>\nIf C=0 unlocks are not permitted.<br>\nC =<br>\n{ CR% ≥ 103% =1<br>\nCR% ≤ 103% = 0}</p>\n<p>Y = Days Remaining til unlock of LP Position<br>\nU = “USD Value of LP Position” – T<br>\nU = L – T<br>\nU = amount due to users after unlock, [post-fxs-repay, pre-fee] (no discount applied)</p>\n<p>D = USD fee discount for cvxFXS and veFXS stakers<br>\nD = (((days-since-veFXS(or cvxFXS)-lockup ÷ (365.25 × 4)) × 50)%) × E<br>\nD ≠ &gt;(50% × T)<br>\nX = Amount Owed minus Discount</p>\n<p>X= ((“Total USD Value of all FXS rewarded to LP” + “0.06844627% of (U) per Day of Lock Remaining[2.5% a year]”) minus D) × function of C</p>\n<p>X = ((T + ((((Y/1461)×10)%)U)) - D) × C<br>\nZ = L – X<br>\nZ = Amount received by User post fees + deductions</p>\n<p>Loop (Z - X) back through CR calculation to ensure CR% ≥ 103% before finalizing unlock</p>\n<p>We propose that all new gauges/locks have this option from start, so that this will be optional without going through governance. This means that contracts should have a easy to use front end for ragequitting, which may lead to more development work. The work for the front-end should be prioritized at the core teams discretion, to not distract for more short/mid term important matters. That may even mean a delay for new pairs to get the ragequit function. For old pairs, one have go through governance to enable a ragequit function. It is important to clearify that this proposal will still be relevant, and the terms outlined in this proposal will still apply in ragequitting of those old pairs. The proposals for old pairs will simply be if one should activate the ragequit function or not.</p>\n<p>We propose LP the protocol takes in fees from the ragequit be added to the FLE, so that the protocol can continue operating the pair or in other ways increase our revenue and liquidity. The protocol will then manage to keep the pair more stable, even during ragequits. It also benefits from the ragequit because it adds value to the balance sheet.</p>\n<p>For voting, the following voting suggestion is proposed:</p>\n<ol>\n<li>Yes to algorithmic solution</li>\n<li>Alternative solution with new discussion phase</li>\n<li>No standardization of ragequit proposals.</li>\n</ol>\n<p>As for other alternatives, the original discussion can be found in a link under. However the authors want to emphasize that we believe the current proposal is the most fair and best solution. Original discussion: <a href=\"https://gov.frax.finance/t/standardize-ragequit-proposals-and-make-it-a-feature-and-not-a-bug/3016/27\" class=\"inline-onebox\">Standardize ragequit proposals and make it a feature and not a bug - #27 by lyule67</a></p>\n            <p><small>3 posts - 3 participants</small></p>\n            <p><a href=\"https://gov.frax.finance/t/fip-3xx-standardize-ragequit-proposals/3115\">Read full topic</a></p>","link":"https://gov.frax.finance/t/fip-3xx-standardize-ragequit-proposals/3115","pubDate":"Mon, 01 Jul 2024 05:50:48 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"gov.frax.finance-topic-3115"},"source":{"@url":"https://gov.frax.finance/t/fip-3xx-standardize-ragequit-proposals/3115.rss","#text":"[FIP-3XX] Standardize ragequit proposals"},"filter":false},{"title":"[FIP - 3XX] Create a new Fraxlend pair (WETH/FRAX) on Ethereum Mainnet","dc:creator":"Westwood","category":"Fraxlend","description":"<h3><a name=\"authors-1\" class=\"anchor\" href=\"https://gov.frax.finance#authors-1\"></a>Authors:</h3>\n<p><a class=\"mention\" href=\"https://gov.frax.finance/u/westwood\">@Westwood</a></p>\n<h3><a name=\"summary-2\" class=\"anchor\" href=\"https://gov.frax.finance#summary-2\"></a>Summary:</h3>\n<p>Propose the creation of a new Fraxlend pair on the Ethereum mainnet: WETH/FRAX with a Loan-to-Value (LTV) ratio of 82%.</p>\n<h3><a name=\"details-3\" class=\"anchor\" href=\"https://gov.frax.finance#details-3\"></a>Details:</h3>\n<ul>\n<li><strong>Fraxlend Pair Name:</strong> WETH/FRAX - Variable Rate V2</li>\n<li><strong>Chain:</strong> Ethereum Mainnet</li>\n<li><strong>Max Authorized Allocation:</strong> 10,000,000 FRAX</li>\n<li><strong>Loan-to-Value (LTV):</strong> 82%</li>\n</ul>\n<h3><a name=\"background-and-motivation-4\" class=\"anchor\" href=\"https://gov.frax.finance#background-and-motivation-4\"></a>Background and Motivation:</h3>\n<p>Fraxlend is a lending platform that enables the creation of markets between pairs of ERC-20 tokens. Each pair functions as an isolated, permission-less market, allowing users to engage in lending and borrowing activities. This protocol is designed to generate new financial opportunities for the FRAX community.</p>\n<p>Automated Market Operations (AMOs) enhance FRAX’s capabilities as a leading stablecoin protocol by offering maximum flexibility and opportunities without compromising its core stability mechanisms. To date, multiple AMOs have been deployed on platforms such as Fraxlend, Aave, and Rari.</p>\n<p>Introducing the WETH/FRAX pair into the Fraxlend AMO on Ethereum Mainnet aligns with this strategic vision. It will facilitate the minting of FRAX, secured by over-collateralized debt, further strengthening the ecosystem. Additionally, increasing the LTV to 82% makes this pair more competitive with similar offerings on Maker and Aave, thereby attracting more users and liquidity to Fraxlend.</p>\n<h3><a name=\"voting-5\" class=\"anchor\" href=\"https://gov.frax.finance#voting-5\"></a>Voting:</h3>\n<ul>\n<li><strong>For:</strong> Approve the creation of the WETH/FRAX Fraxlend pair on Ethereum Mainnet with the specified LTV and max authorized allocation.</li>\n<li><strong>Against:</strong> Do not approve the creation of the new Fraxlend pair.</li>\n</ul>\n            <p><small>1 post - 1 participant</small></p>\n            <p><a href=\"https://gov.frax.finance/t/fip-3xx-create-a-new-fraxlend-pair-weth-frax-on-ethereum-mainnet/3113\">Read full topic</a></p>","link":"https://gov.frax.finance/t/fip-3xx-create-a-new-fraxlend-pair-weth-frax-on-ethereum-mainnet/3113","pubDate":"Sat, 29 Jun 2024 20:38:38 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"gov.frax.finance-topic-3113"},"source":{"@url":"https://gov.frax.finance/t/fip-3xx-create-a-new-fraxlend-pair-weth-frax-on-ethereum-mainnet/3113.rss","#text":"[FIP - 3XX] Create a new Fraxlend pair (WETH/FRAX) on Ethereum Mainnet"},"filter":false},{"title":"[FIP - 3XX] Sell FXB and Purchase FXS/wfrxETH for FLE","dc:creator":"wolfehr","category":"Miscellaneous","description":"<p><strong>Authors:</strong></p>\n<p><a class=\"mention\" href=\"https://gov.frax.finance/u/wolfehr\">@wolfehr</a></p>\n<p><strong>Summary:</strong></p>\n<ul>\n<li>Auction $10m worth of FXB. Use the proceeds to purchase $10m FXS/FrxETH for FLE.</li>\n</ul>\n<p><strong>Motivation:</strong></p>\n<ul>\n<li>Leverage FXB to exchange weaker assets for stronger assets and increase TVL and FLE liquidity. In other words, trade USD based debt (i.e., frax) for assets like eth, btc, and fxs with the goal of building a strong treasury of high quality crypto native assets.</li>\n<li>Pilot to see if it makes sense to implement something more structured and repeatable. For example, sell bonds whenever a designated asset is X% below it’s trailing average over the past Y weeks as long as the CR is above 100%.</li>\n</ul>\n<p><strong>Mechanism:</strong></p>\n<ol>\n<li>Sell FXB. I don’t know exactly how this works, but the auctions would be created using the existing FXB mechanism. The core team has the best knowledge and experience on appropriate parameters (e.g., duration and interest rate), so it would be left to them to determine those details.</li>\n<li>Use 50% of the proceeds to purchase FXS and 50% to purchase ETH. The core team can determine the best purchase strategy (e.g., market buy all at once, two-week twamm) but should keep in mind a goal is to take advantage of beneficial market conditions.</li>\n<li>Use the ETH to mint frxETH</li>\n<li>Deposit the FXS/frxETH into the FLE FXS/wfrxETH [Fraxtal] pool.</li>\n</ol>\n<p><strong>Pros:</strong></p>\n<ul>\n<li>Exchanges USD debt (i.e., frax) for FXS and ETH (i.e., trade a weak asset for a strong one), helping build a strong treasury of high quality crypto native assets.</li>\n<li>Increases frxETH TVL</li>\n<li>Increases FXS/wfrxETH liquidity</li>\n<li>Improve sfrxETH returns. The ETH purchased will used to mint frxETH, but won’t be staked. This should decrease the % of frxETH staked (all else being equal) and, therefore improve the returns for sfrxETH holders.</li>\n<li>Removes FXS from the market. The only way FLE would enter the market is via buy-pressure</li>\n</ul>\n<p><strong>Cons:</strong></p>\n<ul>\n<li>Assets are volatile compared to how the debt is denominated, increasing the risk that Frax won’t be able to cover the FXB at maturity without impacting the CR.</li>\n<li>Less impact on FXS price than buy and burn.</li>\n</ul>\n<p><strong>Parameters For Debate:</strong></p>\n<ul>\n<li>Size of the auction for this pilot. Is $10m right</li>\n<li>Duration and interest for FXB to be auctioned</li>\n<li>Duration of the FXS and ETH purchases. Is two weeks the right duration?</li>\n</ul>\n            <p><small>2 posts - 1 participant</small></p>\n            <p><a href=\"https://gov.frax.finance/t/fip-3xx-sell-fxb-and-purchase-fxs-wfrxeth-for-fle/3112\">Read full topic</a></p>","link":"https://gov.frax.finance/t/fip-3xx-sell-fxb-and-purchase-fxs-wfrxeth-for-fle/3112","pubDate":"Sat, 29 Jun 2024 18:38:59 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"gov.frax.finance-topic-3112"},"source":{"@url":"https://gov.frax.finance/t/fip-3xx-sell-fxb-and-purchase-fxs-wfrxeth-for-fle/3112.rss","#text":"[FIP - 3XX] Sell FXB and Purchase FXS/wfrxETH for FLE"},"filter":true},{"title":"[FIP - 3XX] Authorize Fraxlend AMO for a new pair (wBTC/FRAX)","dc:creator":"Westwood","category":"AMOs","description":"<h3><a name=\"authors-1\" class=\"anchor\" href=\"https://gov.frax.finance#authors-1\"></a><strong>Authors:</strong></h3>\n<p><a class=\"mention\" href=\"https://gov.frax.finance/u/westwood\">@Westwood</a></p>\n<h3><a name=\"summary-2\" class=\"anchor\" href=\"https://gov.frax.finance#summary-2\"></a><strong>Summary:</strong></h3>\n<p>Authorize Fraxlend AMO to deposit minted FRAX into the wBTC/FRAX lending pair on Fraxtal.</p>\n<h3><a name=\"details-3\" class=\"anchor\" href=\"https://gov.frax.finance#details-3\"></a><strong>Details:</strong></h3>\n<ul>\n<li><strong>Fraxlend Pair Name:</strong> wBTC/FRAX - Variable Rate V2</li>\n<li><strong>Chain:</strong> Fraxtal</li>\n<li><strong>Max Authorized Allocation:</strong> 5,000,000 FRAX</li>\n</ul>\n<h3><a name=\"background-and-motivation-4\" class=\"anchor\" href=\"https://gov.frax.finance#background-and-motivation-4\"></a><strong>Background and Motivation:</strong></h3>\n<p>Fraxlend is a lending platform that allows anyone to create a market between a pair of ERC-20 tokens. Each pair is an isolated, permission-less market that allows anyone to create and participate in lending and borrowing activities. This protocol is creating new financial opportunities for the FRAX community.</p>\n<p>Automated Market Operations (AMOs) make FRAX one of the most potent stablecoin protocols, creating maximum flexibility and opportunity without altering the base stability mechanism that made FRAX a leader in the stablecoin space. So far, we have deployed multiple AMOs, including lending AMOs on the Fraxlend, Aave, and Rari protocols.</p>\n<p>Adding the wBTC/FRAX pair into Fraxlend AMO on Fraxtal is the next step in this vision, allowing the protocol to mint FRAX backed by over-collateralized debt.</p>\n<h3><a name=\"voting-5\" class=\"anchor\" href=\"https://gov.frax.finance#voting-5\"></a><strong>Voting:</strong></h3>\n<ul>\n<li><strong>For:</strong> Authorize Fraxlend AMO to deposit minted FRAX into the mentioned Fraxlend pair with the mentioned max authorized allocation.</li>\n<li><strong>Against:</strong> Do nothing.</li>\n</ul>\n            <p><small>1 post - 1 participant</small></p>\n            <p><a href=\"https://gov.frax.finance/t/fip-3xx-authorize-fraxlend-amo-for-a-new-pair-wbtc-frax/3111\">Read full topic</a></p>","link":"https://gov.frax.finance/t/fip-3xx-authorize-fraxlend-amo-for-a-new-pair-wbtc-frax/3111","pubDate":"Sat, 29 Jun 2024 14:21:52 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"gov.frax.finance-topic-3111"},"source":{"@url":"https://gov.frax.finance/t/fip-3xx-authorize-fraxlend-amo-for-a-new-pair-wbtc-frax/3111.rss","#text":"[FIP - 3XX] Authorize Fraxlend AMO for a new pair (wBTC/FRAX)"},"filter":false},{"title":"[FIP - 373] Symbiosis - FRAX DAO Proposal: Allocate FRAX as initial liquidity for Octopool (Symbiosis cross-chain pool) #2","dc:creator":"Symbiote","category":"Liquidity Providing","description":"<h4><a name=\"authors-1\" class=\"anchor\" href=\"https://gov.frax.finance#authors-1\"></a>Authors:</h4>\n<p>Symbiosis Core team</p>\n<h4><a name=\"background-2\" class=\"anchor\" href=\"https://gov.frax.finance#background-2\"></a>Background:</h4>\n<p>Symbiosis is one of the leading cross-chain solutions within the market and it offers a decentralized environment ensuring multichain liquidity protocol, which provides its users with features like swapping digital assets between multiple chains without changing the owners of the funds.</p>\n<p>The platform is non-custodial and has a simple interface, which makes it user-friendly and users can participate in consensus and sign transactions by staking SIS tokens to run a node within the relayer network. Symbiosis finance can facilitate cross-chain liquidity on a limitless basis where token pairs across different blockchains guarantee that they provide the best price for swapping their asset between any two arbitrary token pairs owing to constant monitoring.</p>\n<p>Symbiosis is a portfolio company of <strong>Binance Labs, DWF Labs, Blockchain. com, Spartan Group</strong> and more investors.</p>\n<p>List of chain supported on Symbiosis:</p>\n<ul>\n<li>Tron</li>\n<li>Ethereum</li>\n<li>native Bitcoin</li>\n<li>Polygon</li>\n<li>zkSync Era</li>\n<li>Base</li>\n<li>Mantle</li>\n<li>BNB</li>\n<li>Polygon zkEVM</li>\n<li>Linea</li>\n<li>Arbitrum One</li>\n<li>Arbitrum Nova</li>\n<li>Avalanche</li>\n<li>Scroll</li>\n<li>Optimism</li>\n<li>BOBA ETH</li>\n<li>BOBA BNB</li>\n<li>KAVA</li>\n<li>Telos</li>\n<li>Manta</li>\n<li>Metis</li>\n<li>Merlin</li>\n<li>Rootstock</li>\n<li>zkLink</li>\n<li>Mode</li>\n<li>Blast</li>\n<li>SEI</li>\n<li>Taiko</li>\n<li>Core DAO</li>\n</ul>\n<h4><a name=\"summary-3\" class=\"anchor\" href=\"https://gov.frax.finance#summary-3\"></a>Summary:</h4>\n<p>Symbiosis is asking for an amount of liquidity from FRAX DAO to deploy FRAX Octopool (Symbiosis singe-sided cross-chain pool) among different chains to provide the ability to move FRAX among all supported chains including Fraxtal.</p>\n<p>Currently Symbiosis has 6 type of Octopools across 30 chains:</p>\n<ul>\n<li>Stable (includes USDT and USDC)</li>\n<li>ETH (Includes wETH)</li>\n<li>BTC (Includes wBTC, BTCB, RBTC…)</li>\n<li>SIS</li>\n<li>LADYS</li>\n<li>pufETH</li>\n</ul>\n<p>All pools can be checked here: <a href=\"https://app.symbiosis.finance/liquidity-v2/pools\" rel=\"noopener nofollow ugc\">Symbiosis </a></p>\n<p>Symbiosis is looking to deploy FRAX Octopool among 6 supported chains: Ethereum, Arbitrum One, Avalanche, Polygon POS, Fraxtal.</p>\n<p>Besides that, Symbiosis will integrate Fraxtal as a new chain on Symbiosis and deploy wETH pool there where Symbiosis will provide their own liquidity.</p>\n<p>On top of that, Symbiosis will connect 1inch, OpenOcean, Izumi and other DEXs to provide routing to get any assets on those chains including frxETH, sfrxETH, FPI, sFRAX and others.</p>\n<p>Symbiosis partners such as Li. fi (Jumper), Socket (Bungee), Rubic, Rango, OKX DEX and more will be able to integrate these pools for FRAX cross-chain transfers between different chains.</p>\n<p>Benefits for FRAX and Fraxtal:</p>\n<ol>\n<li>Symbiosis will provide solution to easily move FRAX between all popular chains similar how Circle CCTP works</li>\n<li>Symbiosis will integrate Fraxtal a new chain and connect it to 30 chains that we support</li>\n<li>Symbiosis will create wETH on Fraxtal and add their own liquidity there</li>\n<li>Symbiosis will be core provider in Li. fi (Jumper) OP-stack chains cross-chain campaign</li>\n<li>Symbiosis will connect FRAX Octopool with all popular on-chain aggregators and DEXs on chains supported by FRAX Octopool</li>\n<li>Symbiosis partners such as Li. fi (Jumper), Socket (Bungee), Rubic, Rango, OKX DEX will be able to use this liquidity in their systems and apps</li>\n</ol>\n<h4><a name=\"proposal-details-4\" class=\"anchor\" href=\"https://gov.frax.finance#proposal-details-4\"></a>Proposal Details:</h4>\n<p>Symbiosis is asking for initial liquidity that should be provided in these single-sided liquidity pools:</p>\n<ul>\n<li>FRAX Ethereum pool: $80,000 of FRAX</li>\n<li>FRAX Polygon POS pool: $50,000 of FRAX</li>\n<li>FRAX Arbitrum One pool: $50,000 of FRAX</li>\n<li>FRAX Fraxtal pool: $80,000 of FRAX</li>\n</ul>\n<p>Below you can see how it will look like:</p>\n<p></p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://global.discourse-cdn.com/standard11/uploads/frax1/original/2X/a/a045985a9eaf041343732fef6a2525cbfe82c79a.png\" data-download-href=\"/uploads/short-url/mRPv8hR74GC0N6qqf3wvMMQGOP8.png?dl=1\" title=\"\" rel=\"noopener nofollow ugc\"><img src=\"https://global.discourse-cdn.com/standard11/uploads/frax1/optimized/2X/a/a045985a9eaf041343732fef6a2525cbfe82c79a_2_493x500.png\" alt=\"\" data-base62-sha1=\"mRPv8hR74GC0N6qqf3wvMMQGOP8\" role=\"presentation\" width=\"493\" height=\"500\" srcset=\"https://global.discourse-cdn.com/standard11/uploads/frax1/optimized/2X/a/a045985a9eaf041343732fef6a2525cbfe82c79a_2_493x500.png, https://global.discourse-cdn.com/standard11/uploads/frax1/optimized/2X/a/a045985a9eaf041343732fef6a2525cbfe82c79a_2_739x750.png 1.5x, https://global.discourse-cdn.com/standard11/uploads/frax1/optimized/2X/a/a045985a9eaf041343732fef6a2525cbfe82c79a_2_986x1000.png 2x\" data-dominant-color=\"F1F1F1\"></a></div><p></p>\n<h4><a name=\"integration-roadmap-5\" class=\"anchor\" href=\"https://gov.frax.finance#integration-roadmap-5\"></a>Integration Roadmap:</h4>\n<ol>\n<li>\n<ul>\n<li>Whitelist FRAX token on Ethereum, Polygon POS, Arbitrum One and create to <a href=\"https://docs.symbiosis.finance/crosschain-liquidity-engine/symbiosis-octopool\" rel=\"noopener nofollow ugc\">Octopool</a> (cross-chain pool)</li>\n</ul>\n</li>\n<li>Configure the relayers network to handle requests from Fraxtal in multi-chain mode</li>\n<li>Connect Fraxtal to Symbiosis front-end, API and SDK</li>\n<li>Integrate wETH and FRAX pools on Fraxtal. Add Fraxtal to FRAX Octopool and wETH to ETH Octoopool</li>\n<li>\n<ul>\n<li>Integrate Fraxtal DEX for any-to-any routing on Symbiosis in main app.</li>\n</ul>\n</li>\n</ol>\n<ul>\n<li>Integrate 1inch and OpenOcean to FRAX Octopool on Ethereum, Polygon POS, Arbitrum One</li>\n</ul>\n<ol start=\"6\">\n<li>Launch marketing campaign (cross-chain quest) with Li. fi to popularize cross-chain swaps to Fraxtal and FRAX</li>\n<li>Ask Symbiosis partners to integrate Fraxtal to their protocols and apps</li>\n</ol>\n<p><strong>Symbiosis benefits:</strong></p>\n<ol>\n<li>Any-to-any tokens swaps (E.g. users will be able to swap any token from chain A to any token on Fraxtal)</li>\n<li>Integrated by Li. fi; Socket; Rubic; DODO; Etherdrops and more. All of these aggregators will be able to integrate Fraxtal and FRAX pools through Symbiosis</li>\n<li>More than 30 chains integrated including all popular L2s and L1 chains</li>\n<li>On-chain swaps supported through on-chain DEXs and aggregators</li>\n<li>Opportunity to provide liquidity and earn additional APR on Fraxtal</li>\n<li>Low fees and fast transaction speed</li>\n</ol>\n<p><strong>Team Members and Qualifications:</strong></p>\n<ul>\n<li>Alexey Lushnikov, CTO &amp; Co-Founder - <a href=\"https://www.linkedin.com/in/alexey-lushnikov\" rel=\"noopener nofollow ugc\">https://www.linkedin.com/in/alexey-lushnikov</a></li>\n<li>Nick Avramov, CBDO &amp; Co-Founder - <a href=\"https://www.linkedin.com/in/nickavramov\" class=\"inline-onebox\" rel=\"noopener nofollow ugc\">Nick Avramov - Symbiosis | LinkedIn</a></li>\n</ul>\n<p><strong>Links:</strong></p>\n<p>Twitter: <a href=\"https://twitter.com/symbiosis_fi\" class=\"inline-onebox\" rel=\"noopener nofollow ugc\">x.com</a><br>\nSymbiosis App: <a href=\"https://app.symbiosis.finance\" rel=\"noopener nofollow ugc\">https://app.symbiosis.finance</a><br>\nGithub: <a href=\"https://github.com/symbiosis-finance\" class=\"inline-onebox\" rel=\"noopener nofollow ugc\">Symbiosis · GitHub</a><br>\nTelegram:<a href=\"https://t.me/symbiosis_finance\" class=\"inline-onebox\" rel=\"noopener nofollow ugc\">Telegram: Contact @symbiosis_finance</a><br>\nMedium: <a href=\"https://blog.symbiosis.finance\" rel=\"noopener nofollow ugc\">https://blog.symbiosis.finance</a><br>\nAudits: <a href=\"https://github.com/symbiosis-finance/audits\" class=\"inline-onebox\" rel=\"noopener nofollow ugc\">GitHub - symbiosis-finance/audits</a><br>\nDocs: <a href=\"https://docs.symbiosis.finance\" rel=\"noopener nofollow ugc\">https://docs.symbiosis.finance</a><br>\nDeFiLama: <a href=\"https://defillama.com/protocol/symbiosis\" rel=\"noopener nofollow ugc\">https://defillama.com/protocol/symbiosis</a><br>\nExplorer: <a href=\"https://explorer.symbiosis.finance/\" rel=\"noopener nofollow ugc\">https://explorer.symbiosis.finance/</a><br>\nDune Dashboard (only supports 6/31 chains): <a href=\"https://dune.com/symbiosisdash/symbiosisv2\" rel=\"noopener nofollow ugc\">https://dune.com/symbiosisdash/symbiosisv2</a></p>\n            <p><small>2 posts - 2 participants</small></p>\n            <p><a href=\"https://gov.frax.finance/t/fip-373-symbiosis-frax-dao-proposal-allocate-frax-as-initial-liquidity-for-octopool-symbiosis-cross-chain-pool-2/3110\">Read full topic</a></p>","link":"https://gov.frax.finance/t/fip-373-symbiosis-frax-dao-proposal-allocate-frax-as-initial-liquidity-for-octopool-symbiosis-cross-chain-pool-2/3110","pubDate":"Wed, 26 Jun 2024 08:07:22 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"gov.frax.finance-topic-3110"},"source":{"@url":"https://gov.frax.finance/t/fip-373-symbiosis-frax-dao-proposal-allocate-frax-as-initial-liquidity-for-octopool-symbiosis-cross-chain-pool-2/3110.rss","#text":"[FIP - 373] Symbiosis - FRAX DAO Proposal: Allocate FRAX as initial liquidity for Octopool (Symbiosis cross-chain pool) #2"},"filter":false},{"title":"[FIP - 369, ... , 372] Authorize Fraxlend AMO for new pairs on Fraxtal","dc:creator":"amirnader","category":"AMOs","description":"<h2><a name=\"authors-1\" class=\"anchor\" href=\"https://gov.frax.finance#authors-1\"></a>Authors</h2>\n<p>Frax Core Team</p>\n<h1><a name=\"summary-2\" class=\"anchor\" href=\"https://gov.frax.finance#summary-2\"></a>Summary</h1>\n<p>Authorize Fraxlend AMO to deposit minted FRAX into the following Fraxlend pairs with the mentioned maximum authorized allocation.</p>\n<div class=\"md-table\">\n<table>\n<thead>\n<tr>\n<th>Fraxlend Pair Name</th>\n<th>Chain</th>\n<th>Fraxlend Pair</th>\n<th>Max Authorized Allocation</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>FXS/FRAX - Variable Rate V2</td>\n<td>Fraxtal</td>\n<td><a href=\"https://fraxscan.com/address/0x8eda613ec96992d3c42bcd9ac2ae58a92929ceb2\">Link</a></td>\n<td>1,000,000 FRAX</td>\n</tr>\n<tr>\n<td>sfrxETH/FRAX - Variable Rate V2</td>\n<td>Fraxtal</td>\n<td><a href=\"https://fraxscan.com/address/0x4f968317721b9c300afbff3fd37365637318271d\">Link</a></td>\n<td>10,000,000 FRAX</td>\n</tr>\n<tr>\n<td>FXB20241231/FRAX - Variable Rate V2</td>\n<td>Fraxtal</td>\n<td><a href=\"https://fraxscan.com/address/0x6154334A7D0E7f5f0479599D15F462B200C721E1#code\">Link</a></td>\n<td>5,000,000 FRAX</td>\n</tr>\n<tr>\n<td>FXB20261231/FRAX - Variable Rate V2</td>\n<td>Fraxtal</td>\n<td><a href=\"https://fraxscan.com/address/0x032578d99b1070682a5E171012BE1756a50a17d4#code\">Link</a></td>\n<td>5,000,000 FRAX</td>\n</tr>\n</tbody>\n</table>\n</div><h1><a name=\"background-and-motivation-3\" class=\"anchor\" href=\"https://gov.frax.finance#background-and-motivation-3\"></a>Background and Motivation</h1>\n<p>Fraxlend is a lending platform that allows anyone to create a market between a pair of ERC-20 tokens. Each pair is an isolated, permission-less market that allows anyone to create and participate in lending and borrowing activities. This protocol is creating new financial opportunities for the FRAX community.</p>\n<p>Automated Market Operations (AMOs) make FRAX one of the most potent stablecoin protocols, creating maximum flexibility and opportunity without altering the base stability mechanism that made FRAX a leader in the stablecoin space. So far, we have deployed multiple AMOs, including lending AMOs on the Fraxlend, Aave, and Rari protocols.</p>\n<p>Adding more pairs into Fraxlend AMO on Fraxtal is the next step in this vision, allowing the protocol to mint FRAX backed by over-collateralized debt.</p>\n<h1><a name=\"voting-4\" class=\"anchor\" href=\"https://gov.frax.finance#voting-4\"></a>Voting</h1>\n<ul>\n<li>For: Authorize Fraxlend AMO to deposit minted FRAX into the mentioned Fraxlend pair with the mentioned max authorized allocation.</li>\n<li>Against: Do nothing.</li>\n</ul>\n            <p><small>2 posts - 1 participant</small></p>\n            <p><a href=\"https://gov.frax.finance/t/fip-369-372-authorize-fraxlend-amo-for-new-pairs-on-fraxtal/3109\">Read full topic</a></p>","link":"https://gov.frax.finance/t/fip-369-372-authorize-fraxlend-amo-for-new-pairs-on-fraxtal/3109","pubDate":"Tue, 25 Jun 2024 20:14:33 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"gov.frax.finance-topic-3109"},"source":{"@url":"https://gov.frax.finance/t/fip-369-372-authorize-fraxlend-amo-for-new-pairs-on-fraxtal/3109.rss","#text":"[FIP - 369, ... , 372] Authorize Fraxlend AMO for new pairs on Fraxtal"},"filter":false},{"title":"[FIP - 368] Create Balancer AMO on Fraxtal","dc:creator":"lipman","category":"AMOs","description":"<h2><a name=\"summary-1\" class=\"anchor\" href=\"https://gov.frax.finance#summary-1\"></a>Summary</h2>\n<p>This proposal advocates for the allocation of Frax Protocol-Owned-Liquidity (POL) on Balancer v2 on Fraxtal. Frax will deposit into Balancer with the ability to stake their pool tokens in their preferred rewards contracts (e.g. Aura).</p>\n<div class=\"md-table\">\n<table>\n<thead>\n<tr>\n<th>Pool</th>\n<th>Address</th>\n<th>Child Gauge</th>\n<th>Root Gauge</th>\n<th>Max Allocation</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>sFRAX / sDAI</td>\n<td>0xA0b92B33BeafcE388Ce0092afDcd0cA77323Eb12</td>\n<td>0x34E040bC0342EbBfBC7a6306EB1B8E6579185c94</td>\n<td>0x58e71Af9CE4378b79dAAf2C4E7be9765c442dFC2</td>\n<td>$15,000,000</td>\n</tr>\n<tr>\n<td>FRAX / USDe</td>\n<td>0xa0Af0B88796C1aA67e93db89FEAd2Ab7aA3D6747</td>\n<td>0xf99d875Dd868277cf3780f51D69c6E1F8522a1e9</td>\n<td>0x259371cA8AC5E7F3163704Ce58B0dA58820173ed</td>\n<td>$15,000,000</td>\n</tr>\n<tr>\n<td>sFRAX / sUSDe / sDAI</td>\n<td>0x33251abeCb0364Df98a27A8D5d7b5CCddc774c42</td>\n<td>0x275e8514b83479f526673327B279753aBC666a05</td>\n<td>0xEA8Ba6b0cB5908A5d803b01CeAea5a6E65D33508</td>\n<td>$15,000,000</td>\n</tr>\n<tr>\n<td>sFRAX / sfrxETH</td>\n<td>0x1570315476480fA80ceC1FFF07A20c1df1aDfD53</td>\n<td>0x71c365fB739faFdba44B1564558849216de69958</td>\n<td>0x5f0a99997ab2AcC5097dc5349aDF6985761336ac</td>\n<td>$10,000,000</td>\n</tr>\n</tbody>\n</table>\n</div><p>As members of the Frax team have mentioned, Fraxtal’s vision is to become the ‘M2 chain’ (e.g. yield bearing assets such as sFRAX are native and foundational), whereas Ethereum mainnet is akin to an ‘M1 chain’ (e.g. ETH isn’t inherently yield bearing). Balancer has solidified its position as a primary liquidity hub for yield bearing assets across the EVM ecosystem evident with over <a href=\"https://dune.com/balancer/lst\" rel=\"noopener nofollow ugc\">$500m in LST and LRT TVL</a>. Its unique, yet battle-tested, AMM design makes Balancer well positioned to support Fraxtal as an integral part of Fraxtal’s liquidity layer for both yield bearing assets and core strategic liquidity.</p>\n<p>While Balancer and Frax have a longstanding and meaningful relationship, this proposal further solidifies that relationship for the betterment of both protocols by establishing the Balancer AMO on Fraxtal with the authorization of Frax POL for certain initial strategic pools on Balancer.</p>\n<h2><a name=\"proposal-details-2\" class=\"anchor\" href=\"https://gov.frax.finance#proposal-details-2\"></a>Proposal Details</h2>\n<p>Allocate a portion of Frax’s POL of sfrxETH, sFRAX, sDAI, FRAX, USDe, and sUSDe into Balancer pools on Fraxtal. The sFRAX / sDAI, sFRAX / sUSDe / sDAI, and sFRAX / sfrxETH pools will be considered <a href=\"https://docs.balancer.fi/concepts/governance/protocol-fees.html#core-pool-fee-redirection\" rel=\"noopener nofollow ugc\">core pools on Balancer.</a></p>\n<p>All four pools will be eligible for BAL and AURA rewards.</p>\n<h2><a name=\"voting-3\" class=\"anchor\" href=\"https://gov.frax.finance#voting-3\"></a>Voting</h2>\n<ul>\n<li>For: Authorize Frax to allocate the specified POL in Balancer Pools on Fraxtal</li>\n<li>Against: Do nothing</li>\n</ul>\n            <p><small>2 posts - 2 participants</small></p>\n            <p><a href=\"https://gov.frax.finance/t/fip-368-create-balancer-amo-on-fraxtal/3107\">Read full topic</a></p>","link":"https://gov.frax.finance/t/fip-368-create-balancer-amo-on-fraxtal/3107","pubDate":"Fri, 21 Jun 2024 13:19:55 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"gov.frax.finance-topic-3107"},"source":{"@url":"https://gov.frax.finance/t/fip-368-create-balancer-amo-on-fraxtal/3107.rss","#text":"[FIP - 368] Create Balancer AMO on Fraxtal"},"filter":false},{"title":"[FIP - 366, 367] Authorize Fraxlend AMO for new pairs ( MATIC/FRAX, cbETH/FRAX )","dc:creator":"amirnader","category":"AMOs","description":"<h2><a name=\"authors-1\" class=\"anchor\" href=\"https://gov.frax.finance#authors-1\"></a>Authors</h2>\n<p>Frax Core Team</p>\n<h1><a name=\"summary-2\" class=\"anchor\" href=\"https://gov.frax.finance#summary-2\"></a>Summary</h1>\n<p>Authorize Fraxlend AMO to deposit minted FRAX into the following Fraxlend pairs with the mentioned max authorized allocation.</p>\n<div class=\"md-table\">\n<table>\n<thead>\n<tr>\n<th>Fraxlend Pair Name</th>\n<th>Chain</th>\n<th>Fraxlend Pair Address</th>\n<th>Max Authorized Allocation</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>MATIC/FRAX - Variable Rate V2</td>\n<td>Ethereum</td>\n<td>TBD</td>\n<td>5,000,000 FRAX</td>\n</tr>\n<tr>\n<td>cbETH/FRAX - Variable Rate V2</td>\n<td>Ethereum</td>\n<td>TBD</td>\n<td>5,000,000 FRAX</td>\n</tr>\n</tbody>\n</table>\n</div><h1><a name=\"background-and-motivation-3\" class=\"anchor\" href=\"https://gov.frax.finance#background-and-motivation-3\"></a>Background and Motivation</h1>\n<p>Fraxlend is a lending platform that allows anyone to create a market between a pair of ERC-20 tokens. Each pair is an isolated, permission-less market that allows anyone to create and participate in lending and borrowing activities. This protocol is creating new financial opportunities for the FRAX community.</p>\n<p>Automated Market Operations (AMOs) make FRAX one of the most potent stablecoin protocols, creating maximum flexibility and opportunity without altering the base stability mechanism that made FRAX a leader in the stablecoin space. So far, we have deployed multiple AMOs, including lending AMOs on the Fraxlend, Aave, and Rari protocols.</p>\n<p>Adding more pairs into Fraxlend AMO is the next step in this vision, allowing the protocol to mint FRAX backed by over-collateralized debt.</p>\n<h1><a name=\"voting-4\" class=\"anchor\" href=\"https://gov.frax.finance#voting-4\"></a>Voting</h1>\n<ul>\n<li>For: Authorize Fraxlend AMO to deposit minted FRAX into the mentioned Fraxlend pair with the mentioned max authorized allocation.</li>\n<li>Against: Do nothing.</li>\n</ul>\n            <p><small>3 posts - 2 participants</small></p>\n            <p><a href=\"https://gov.frax.finance/t/fip-366-367-authorize-fraxlend-amo-for-new-pairs-matic-frax-cbeth-frax/3101\">Read full topic</a></p>","link":"https://gov.frax.finance/t/fip-366-367-authorize-fraxlend-amo-for-new-pairs-matic-frax-cbeth-frax/3101","pubDate":"Tue, 18 Jun 2024 22:02:19 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"gov.frax.finance-topic-3101"},"source":{"@url":"https://gov.frax.finance/t/fip-366-367-authorize-fraxlend-amo-for-new-pairs-matic-frax-cbeth-frax/3101.rss","#text":"[FIP - 366, 367] Authorize Fraxlend AMO for new pairs ( MATIC/FRAX, cbETH/FRAX )"},"filter":false},{"title":"[FIP - 365] Symbiosis - FRAX DAO Proposal: Allocate FRAX as initial liquidity for Octopool (Symbiosis cross-chain pool)","dc:creator":"Symbiote","category":"Liquidity Providing","description":"<h4><a name=\"authors-1\" class=\"anchor\" href=\"https://gov.frax.finance#authors-1\"></a>Authors:</h4>\n<p>Symbiosis Core team</p>\n<h4><a name=\"background-2\" class=\"anchor\" href=\"https://gov.frax.finance#background-2\"></a>Background:</h4>\n<p>Symbiosis is one of the leading cross-chain solutions within the market and it offers a decentralized environment ensuring multichain liquidity protocol, which provides its users with features like swapping digital assets between multiple chains without changing the owners of the funds.</p>\n<p>The platform is non-custodial and has a simple interface which makes it user-friendly and users can participate in consensus and sign transactions by staking SIS tokens to run a node within the relayer network. Symbiosis finance can facilitate cross-chain liquidity on a limitless basis where token pairs across different blockchains guarantee that they provide the best price for swapping their asset between any two arbitrary token pairs owing to constant monitoring.</p>\n<p>Symbiosis is a portfolio company of <strong>Binance Labs, DWF Labs, Blockchain. com, Spartan Group</strong> and more investors.</p>\n<p>List of chain supported on Symbiosis:</p>\n<ul>\n<li>Tron</li>\n<li>Ethereum</li>\n<li>native Bitcoin</li>\n<li>Polygon</li>\n<li>zkSync Era</li>\n<li>Base</li>\n<li>Mantle</li>\n<li>BNB</li>\n<li>Polygon zkEVM</li>\n<li>Linea</li>\n<li>Arbitrum One</li>\n<li>Arbitrum Nova</li>\n<li>Avalanche</li>\n<li>Scroll</li>\n<li>Optimism</li>\n<li>BOBA ETH</li>\n<li>BOBA BNB</li>\n<li>KAVA</li>\n<li>Telos</li>\n<li>Manta</li>\n<li>Metis</li>\n<li>Merlin</li>\n<li>Rootstock</li>\n<li>zkLink</li>\n<li>Mode</li>\n<li>Blast</li>\n<li>SEI</li>\n<li>Taiko</li>\n<li>Core DAO</li>\n</ul>\n<h4><a name=\"summary-3\" class=\"anchor\" href=\"https://gov.frax.finance#summary-3\"></a>Summary:</h4>\n<p>Symbiosis is asking for an amount of liquidity from FRAX DAO to deploy FRAX Octopool (Symbiosis singe-sided cross-chain pool) among different chains to provide the ability to move FRAX among all supported chains including Fraxtal.</p>\n<p>Currently Symbiosis has 6 type of Octopools across 30 chains:</p>\n<ul>\n<li>Stable (includes USDT and USDC)</li>\n<li>ETH (Includes wETH)</li>\n<li>BTC (Includes wBTC, BTCB, RBTC…)</li>\n<li>SIS</li>\n<li>LADYS</li>\n<li>pufETH</li>\n</ul>\n<p>All pools can be checked here: <a href=\"https://app.symbiosis.finance/liquidity-v2/pools\" class=\"inline-onebox\" rel=\"noopener nofollow ugc\">Symbiosis</a></p>\n<p>Symbiosis is looking to deploy FRAX Octopool among 6 supported chains: Ethereum, Arbitrum One, Avalanche, Polygon POS, Fraxtal.</p>\n<p>Besides that, Symbiosis will integrate Fraxtal as a new chain on Symbiosis and deploy wETH pool there where Symbiosis will provide their own liquidity.</p>\n<p>On top of that, Symbiosis will connect 1inch, OpenOcean, Izumi and other DEXs to provide routing to get any assets on those chains including frxETH, sfrxETH, FPI, sFRAX and others.</p>\n<p>Symbiosis partners such as Li. fi (Jumper), Socket (Bungee), Rubic, Rango, OKX DEX and more will be able to integrate these pools for FRAX cross-chain transfers between different chains.</p>\n<p>Benefits for FRAX and Fraxtal:</p>\n<ol>\n<li>Symbiosis will provide solution to easily move FRAX between all popular chains similar how Circle CCTP works</li>\n<li>Symbiosis will integrate Fraxtal a new chain and connect it to 30 chains that we support</li>\n<li>Symbiosis will create wETH on Fraxtal and add their own liquidity there</li>\n<li>Symbiosis will be core provider in Li. fi (Jumper) OP-stack chains cross-chain campaign</li>\n<li>Symbiosis will connect FRAX Octopool with all popular on-chain aggregators and DEXs on chains supported by FRAX Octopool</li>\n<li>Symbiosis partners such as Li. fi (Jumper), Socket (Bungee), Rubic, Rango, OKX DEX will be able to use this liquidity in their systems and apps</li>\n</ol>\n<h4><a name=\"proposal-details-4\" class=\"anchor\" href=\"https://gov.frax.finance#proposal-details-4\"></a>Proposal Details:</h4>\n<p>Symbiosis is asking for initial liquidity that should be provided in these single-sided liquidity pools:</p>\n<ul>\n<li>FRAX Ethereum pool: $100,000 of FRAX</li>\n<li>FRAX Polygon POS pool: $70,000 of FRAX</li>\n<li>FRAX Avalanche pool: $50,000 of FRAX</li>\n<li>FRAX Arbitrum One pool: $70,000 of FRAX</li>\n<li>FRAX Fraxtal pool: $100,000 of FRAX</li>\n</ul>\n<p>Below you can see how it will look like:</p>\n<p></p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://global.discourse-cdn.com/standard11/uploads/frax1/original/2X/a/a045985a9eaf041343732fef6a2525cbfe82c79a.png\" data-download-href=\"/uploads/short-url/mRPv8hR74GC0N6qqf3wvMMQGOP8.png?dl=1\" title=\"\" rel=\"noopener nofollow ugc\"><img src=\"https://global.discourse-cdn.com/standard11/uploads/frax1/optimized/2X/a/a045985a9eaf041343732fef6a2525cbfe82c79a_2_492x500.png\" alt=\"\" data-base62-sha1=\"mRPv8hR74GC0N6qqf3wvMMQGOP8\" width=\"492\" height=\"500\" role=\"presentation\" srcset=\"https://global.discourse-cdn.com/standard11/uploads/frax1/optimized/2X/a/a045985a9eaf041343732fef6a2525cbfe82c79a_2_492x500.png, https://global.discourse-cdn.com/standard11/uploads/frax1/optimized/2X/a/a045985a9eaf041343732fef6a2525cbfe82c79a_2_738x750.png 1.5x, https://global.discourse-cdn.com/standard11/uploads/frax1/optimized/2X/a/a045985a9eaf041343732fef6a2525cbfe82c79a_2_984x1000.png 2x\" data-dominant-color=\"F1F1F1\"></a></div><p></p>\n<h4><a name=\"integration-roadmap-5\" class=\"anchor\" href=\"https://gov.frax.finance#integration-roadmap-5\"></a>Integration Roadmap:</h4>\n<ol>\n<li>\n<ul>\n<li>Whitelist FRAX token on Ethereum, Polygon POS, Avalanche, Arbitrum One and create  Octopool (cross-chain pool) of FRAX</li>\n</ul>\n</li>\n<li>Configure the relayers network to handle requests from Fraxtal in multi-chain mode</li>\n<li>Connect Fraxtal to Symbiosis front-end, API and SDK</li>\n<li>Integrate wETH and FRAX pools on Fraxtal. Add Fraxtal to FRAX Octopool and wETH to ETH Octoopool</li>\n<li></li>\n</ol>\n<ul>\n<li>\n<p>Integrate Fraxtal DEX for any-to-any routing on Symbiosis in <a href=\"https://app.symbiosis.finance/swap\" rel=\"noopener nofollow ugc\">main app</a>.</p>\n</li>\n<li>\n<p>Integrate 1inch and OpenOcean to FRAX Octopool on Ethereum, Polygon POS, Avalanche, Arbitrum One</p>\n</li>\n</ul>\n<ol start=\"6\">\n<li>Launch marketing campaign (cross-chain quest) with Li. fi to popularize cross-chain swaps to Fraxtal and FRAX</li>\n<li>Ask other Symbiosis partners to integrate Fraxtal to their protocols and apps</li>\n</ol>\n<h4><a name=\"team-members-and-qualifications-6\" class=\"anchor\" href=\"https://gov.frax.finance#team-members-and-qualifications-6\"></a>Team Members and Qualifications:</h4>\n<p>Alexey Lushnikov, CTO &amp; Co-Founder - <a href=\"https://www.linkedin.com/in/alexey-lushnikov\" rel=\"noopener nofollow ugc\">https://www.linkedin.com/in/alexey-lushnikov</a></p>\n<p>Nick Avramov, CBDO &amp; Co-Founder - <a href=\"https://www.linkedin.com/in/nickavramov\" class=\"inline-onebox\" rel=\"noopener nofollow ugc\">Nick Avramov - Symbiosis | LinkedIn</a></p>\n<h4><a name=\"links-7\" class=\"anchor\" href=\"https://gov.frax.finance#links-7\"></a>Links:</h4>\n<p>Twitter: <a href=\"https://twitter.com/symbiosis_fi\" class=\"inline-onebox\" rel=\"noopener nofollow ugc\">x.com</a></p>\n<p>Symbiosis App: <a href=\"https://app.symbiosis.finance\" rel=\"noopener nofollow ugc\">https://app.symbiosis.finance</a></p>\n<p>Github: <a href=\"https://github.com/symbiosis-finance\" class=\"inline-onebox\" rel=\"noopener nofollow ugc\">Symbiosis · GitHub</a></p>\n<p>Telegram:<a href=\"https://t.me/symbiosis_finance\" class=\"inline-onebox\" rel=\"noopener nofollow ugc\">Telegram: Contact @symbiosis_finance</a></p>\n<p>Medium: <a href=\"https://blog.symbiosis.finance\" rel=\"noopener nofollow ugc\">https://blog.symbiosis.finance</a></p>\n<p>Audits: <a href=\"https://github.com/symbiosis-finance/audits\" class=\"inline-onebox\" rel=\"noopener nofollow ugc\">GitHub - symbiosis-finance/audits</a></p>\n<p>Docs: <a href=\"https://docs.symbiosis.finance\" rel=\"noopener nofollow ugc\">https://docs.symbiosis.finance</a></p>\n<p>DeFiLama: <a href=\"https://defillama.com/protocol/symbiosis\" rel=\"noopener nofollow ugc\">https://defillama.com/protocol/symbiosis</a></p>\n<p>Explorer: <a href=\"https://explorer.symbiosis.finance/\" rel=\"noopener nofollow ugc\">https://explorer.symbiosis.finance/</a></p>\n<p>Dune Dashboard (only supports 6/31 chains): <a href=\"https://dune.com/symbiosisdash/symbiosisv2\" rel=\"noopener nofollow ugc\">https://dune.com/symbiosisdash/symbiosisv2</a></p>\n<h3><a name=\"vote-8\" class=\"anchor\" href=\"https://gov.frax.finance#vote-8\"></a>Vote</h3>\n<ul>\n<li>For: Allocate 390,000 FRAX as initial liquidity for Octopool (Symbiosis cross-chain pool)</li>\n<li>Against: Do nothing</li>\n</ul>\n            <p><small>2 posts - 2 participants</small></p>\n            <p><a href=\"https://gov.frax.finance/t/fip-365-symbiosis-frax-dao-proposal-allocate-frax-as-initial-liquidity-for-octopool-symbiosis-cross-chain-pool/3097\">Read full topic</a></p>","link":"https://gov.frax.finance/t/fip-365-symbiosis-frax-dao-proposal-allocate-frax-as-initial-liquidity-for-octopool-symbiosis-cross-chain-pool/3097","pubDate":"Thu, 13 Jun 2024 20:16:34 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"gov.frax.finance-topic-3097"},"source":{"@url":"https://gov.frax.finance/t/fip-365-symbiosis-frax-dao-proposal-allocate-frax-as-initial-liquidity-for-octopool-symbiosis-cross-chain-pool/3097.rss","#text":"[FIP - 365] Symbiosis - FRAX DAO Proposal: Allocate FRAX as initial liquidity for Octopool (Symbiosis cross-chain pool)"},"filter":false},{"title":"[FIP - 364] Add a new market into Fraxlend on Ethereum (wOETH/frxETH)","dc:creator":"pete","category":"Fraxlend","description":"<h3><a name=\"author-1\" class=\"anchor\" href=\"https://gov.frax.finance#author-1\"></a>Author</h3>\n<p>Peter, Origin Protocol core team</p>\n<h2><a name=\"summary-2\" class=\"anchor\" href=\"https://gov.frax.finance#summary-2\"></a>Summary</h2>\n<p>The proposal aims to incorporate a new market into Fraxlend on Ethereum mainnet with the following specifications:</p>\n<div class=\"md-table\">\n<table>\n<thead>\n<tr>\n<th>Asset</th>\n<th>Collateral</th>\n<th>Rate Type</th>\n<th>Chain</th>\n<th>Max LTV</th>\n<th>Fraxlend Pair Address</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>frxETH</td>\n<td>wOETH</td>\n<td>Variable Rate V2</td>\n<td>Ethereum</td>\n<td>TBD</td>\n<td>TBD</td>\n</tr>\n</tbody>\n</table>\n</div><h2><a name=\"motivation-3\" class=\"anchor\" href=\"https://gov.frax.finance#motivation-3\"></a>Motivation</h2>\n<p>The proposal seeks to introduce a new market into Fraxlend on Ethereum for wOETH.<br>\nThe new market would lead to increased TVL for Fraxlend, additional revenue to the Frax Protocol and DAO from active loans and liquidations, and will attract a wider user base.</p>\n<h2><a name=\"background-4\" class=\"anchor\" href=\"https://gov.frax.finance#background-4\"></a>Background</h2>\n<p><a href=\"https://originprotocol.eth.limo/#/oeth\" rel=\"noopener nofollow ugc\">Origin Ether</a> (OETH) was launched in May 2023 and is an ERC20 that generates yield while sitting in your wallet. Similar to stETH, OETH yield is paid out daily and automatically (sometimes multiple times per day) through a positive rebase in the form of additional OETH, proportional to the amount of OETH held.</p>\n<p>Until a recent proposal, OETH was an LST aggregator that earned yield by tapping into blue-chip protocols while being collateralized by other LSTs. Over the next few weeks, OETH LST collateral will be divested back to ETH, as OETH will be transitioned into a full-fledged LST. OETH will soon become a superior LST with an extremely tight peg (1:1 redemptions to ETH thru Origin’s ARM) and high yields thanks to a combination of the OETH AMO and DVT direct staking through SSV/P2p.</p>\n<p>OETH is heavily audited by OpenZeppelin, with audits being conducted quarterly. Previous audits can be found in the OETH docs <a href=\"https://docs.originprotocol.com/security-and-risk/audits\" rel=\"noopener nofollow ugc\">here</a>. OETH pricing can be determined using the OETH/ETH Chainlink, Dia, or Tellor oracles.</p>\n<p>wOETH is a ERC-4626 tokenized vault designed to accrue yield in price rather than in quantity. When you wrap OETH, you get back a fixed number of wOETH tokens. This number will not go up - you will have the same number of wOETH tokens tomorrow as you have today. However, the number of OETH tokens that you can unwrap to will go up over time, as wOETH earns yield at the same rate as standard OETH. The wOETH to OETH exchange rate can be read from the contract (function number 16), or via the OETH dapp.</p>\n<p>wOETH contract address: 0xDcEe70654261AF21C44c093C300eD3Bb97b78192</p>\n<p>Current exchange rate as of 6/5/24: 1 wOETH = 1.09228118 OETH</p>\n<p>A frxETH/OETH Curve pool is currently available with $250k+ of available liquidity: <code>curve.fi/#/ethereum/pools/factory-v2-353/deposit</code></p>\n<h2><a name=\"options-5\" class=\"anchor\" href=\"https://gov.frax.finance#options-5\"></a>Options</h2>\n<ul>\n<li>\n<p>For: Deploy mentioned lending pair on Fraxlend in Ethereum mainnet</p>\n</li>\n<li>\n<p>Against: Do nothing</p>\n</li>\n</ul>\n            <p><small>5 posts - 3 participants</small></p>\n            <p><a href=\"https://gov.frax.finance/t/fip-364-add-a-new-market-into-fraxlend-on-ethereum-woeth-frxeth/3090\">Read full topic</a></p>","link":"https://gov.frax.finance/t/fip-364-add-a-new-market-into-fraxlend-on-ethereum-woeth-frxeth/3090","pubDate":"Wed, 05 Jun 2024 21:09:10 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"gov.frax.finance-topic-3090"},"source":{"@url":"https://gov.frax.finance/t/fip-364-add-a-new-market-into-fraxlend-on-ethereum-woeth-frxeth/3090.rss","#text":"[FIP - 364] Add a new market into Fraxlend on Ethereum (wOETH/frxETH)"},"filter":false},{"title":"[FIP - 363] Fraxlend Pilot Program with Oval on sUSDe/FRAX and USDe/FRAX","dc:creator":"Lee-UMA","category":"Fraxlend","description":"<h3><a name=\"simple-summary-1\" class=\"anchor\" href=\"https://gov.frax.finance#simple-summary-1\"></a>Simple Summary</h3>\n<p>This proposal seeks to implement Oval into the sUSDe/FRAX and USDe/FRAX Fraxlend markets as a pilot program. Oval will enable Fraxlend to recapture liquidation MEV that is currently lost to block builders and proposers. After evaluating Oval’s effectiveness, Fraxlend can consider whether to enable Oval on other markets.</p>\n<h3><a name=\"abstract-2\" class=\"anchor\" href=\"https://gov.frax.finance#abstract-2\"></a>Abstract:</h3>\n<p>This proposal seeks to implement Oval into the sUSDe/FRAX and USDe/FRAX markets as a pilot program.</p>\n<p>Oval is a liquidation MEV recapture tool composed of 2 parts:</p>\n<ol>\n<li>A simple, audited smart contract that wraps an oracle price feed. This contract wrapper can not change or delay the price feed data. It only allows for new prices that create liquidation opportunities to be auctioned off to liquidators.</li>\n<li>Offchain infrastructure that executes the auction. This is built on top of Flashbot’s MEV-Share which is a trusted MEV infrastructure leader.</li>\n</ol>\n<p>Integrating Oval will allow Frax to recapture a portion of the MEV that is currently being lost on liquidations. Frax can decide what to do with their portion of the recaptured MEV (ie. return to lenders or borrowers, protocol revenue).</p>\n<p>The sUSDe and USDe markets have been chosen as they use a single price feed that is mutable via governance and Chainlink has a USDe/USD price feed available. Oval already has pre-written and audited Chainlink adaptors, so only minor revisions are required to the Fraxlend smart oracle contract. The integration process is simple and will require minimal developer time from the Fraxlend. This pilot program will allow Frax to evaluate the effectiveness and potential scalability of Oval for broader application within its markets.</p>\n<h3><a name=\"motivation-3\" class=\"anchor\" href=\"https://gov.frax.finance#motivation-3\"></a>Motivation:</h3>\n<p>When a liquidation occurs on Fraxlend (and most other lending protocols), the liquidated user is charged a liquidation fee. These fees go to the 3rd party liquidator and ensure that it is profitable for liquidations to occur in market conditions that are unfavorable to liquidators. However, this often overpays for the liquidation. In these scenarios, liquidators participate in MEV by competitively bidding in an auction for first access to the profitable liquidation. The ultimate beneficiary of this is block proposers who can take up to 90% of the Liquidation Fee.</p>\n<p>By integrating Oval, Fraxlend can run a similar competitive auction where they are the main beneficiaries, thereby recapturing the value that would have gone to the block proposer through MEV. Frax is then free to decide what to do with their portion of the recaptured MEV (ie. return to lenders or borrowers, protocol revenue).</p>\n<h3><a name=\"specification-rationale-4\" class=\"anchor\" href=\"https://gov.frax.finance#specification-rationale-4\"></a>Specification &amp; Rationale:</h3>\n<h4><a name=\"what-is-oval-5\" class=\"anchor\" href=\"https://gov.frax.finance#what-is-oval-5\"></a>What is Oval?</h4>\n<p>Oval enables liquidation MEV capture by wrapping oracle price updates as they are pushed onchain so that MEV cannot be extracted without the consent of the protocol.</p>\n<p>With Oval, when searchers perform a liquidation on Fraxlend an order flow auction is triggered using Flashbots’ MEV Share—a battle tested tool that allows MEV searchers to compete for MEV extraction offchain.</p>\n<p>To extract the liquidation MEV created by an update, searchers must submit a winning bid, most of which is paid to the protocol as revenue. The winner of the auction gets the right to backrun the oracle update transaction—performing the liquidation by adding their transaction to the block immediately after the price update.</p>\n<p>If no bid is received by the end of the auction window, the oracle price is automatically released and Fraxlend liquidations function as normal. This approach utilizes the solid foundation of Chainlink price feeds and MEV-Share to extract MEV from liquidations.</p>\n<p>The diagram below showcases, at a high level, a comparison between current liquidations and liquidations with Oval.</p>\n<p></p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://global.discourse-cdn.com/standard11/uploads/frax1/original/2X/d/d684041a34a1532bc295921449cb4d3291bc3ad4.png\" data-download-href=\"/uploads/short-url/uBH1lqT5ZQ9ZxXF3q8T4NYYbWnO.png?dl=1\" title=\"\" rel=\"noopener nofollow ugc\"><img src=\"https://global.discourse-cdn.com/standard11/uploads/frax1/optimized/2X/d/d684041a34a1532bc295921449cb4d3291bc3ad4_2_624x339.png\" alt=\"\" data-base62-sha1=\"uBH1lqT5ZQ9ZxXF3q8T4NYYbWnO\" width=\"624\" height=\"339\" role=\"presentation\" srcset=\"https://global.discourse-cdn.com/standard11/uploads/frax1/optimized/2X/d/d684041a34a1532bc295921449cb4d3291bc3ad4_2_624x339.png, https://global.discourse-cdn.com/standard11/uploads/frax1/optimized/2X/d/d684041a34a1532bc295921449cb4d3291bc3ad4_2_936x508.png 1.5x, https://global.discourse-cdn.com/standard11/uploads/frax1/optimized/2X/d/d684041a34a1532bc295921449cb4d3291bc3ad4_2_1248x678.png 2x\" data-dominant-color=\"ECECEC\"></a></div><p></p>\n<h4><a name=\"oracles-oval-6\" class=\"anchor\" href=\"https://gov.frax.finance#oracles-oval-6\"></a>Oracles &amp; Oval</h4>\n<p>Oval is not a price feed oracle</p>\n<ul>\n<li>Oval wraps incoming prices from oracle price feeds, shielding them from MEV searchers.</li>\n<li>The Oval contract will use the Oracle price feed and initiate an auction for the MEV searchers to bid for access to liquidations.</li>\n<li>If no one participates in the auction, the price update will be released after 12 seconds (1 block).</li>\n<li>All Fraxlend logic checks on the price feed are downstream of Oval and can remain as is.</li>\n</ul>\n<h4><a name=\"implementation-7\" class=\"anchor\" href=\"https://gov.frax.finance#implementation-7\"></a>Implementation</h4>\n<p>Deploying Oval requires two simple steps:</p>\n<ol>\n<li>Deploy Oval smart contracts for the sUSDe and USDe markets</li>\n<li>Reference the Oval wrapped contracts in a new Fraxlend oracle smart contract</li>\n<li>Update the markets oracle addresses to the new Fraxlend oracle</li>\n</ol>\n<p>We recommend that Fraxlend receives their Oval revenue to a Frax treasury or governance controlled multi-sig for the pilot program. After the pilot program, Frax governance can decide how these funds should be handled and develop a smart contract solution for distributing the funds if desired.</p>\n<p>These steps are further detailed in our <a href=\"https://docs.oval.xyz/integration\" rel=\"noopener nofollow ugc\">docs</a>. UMA is committed to providing ongoing support to ensure a successful implementation of Oval.</p>\n<h4><a name=\"security-8\" class=\"anchor\" href=\"https://gov.frax.finance#security-8\"></a>Security</h4>\n<ul>\n<li>To ensure the security of this system, Oval has completed an <a href=\"https://blog.openzeppelin.com/uma-oval-audit\" rel=\"noopener nofollow ugc\">audit</a> by Open Zeppelin and has an additional security bounty of <a href=\"https://docs.oval.xyz/audit-and-bug-bounty\" rel=\"noopener nofollow ugc\">up to $1M</a> for any vulnerabilities that are identified.</li>\n<li>UMA has worked closely with Flashbots to develop Oval. Flashbots has updated the MEV-Share design to add support for Oval.</li>\n</ul>\n<h3><a name=\"options-9\" class=\"anchor\" href=\"https://gov.frax.finance#options-9\"></a>Options:</h3>\n<p>Yes: Integrate Oval into the sUSDe and USDe Fraxlend Markets</p>\n<p>No: Do not Integrate Oval into the sUSDe and USDe Fraxlend Markets</p>\n            <p><small>5 posts - 4 participants</small></p>\n            <p><a href=\"https://gov.frax.finance/t/fip-363-fraxlend-pilot-program-with-oval-on-susde-frax-and-usde-frax/3086\">Read full topic</a></p>","link":"https://gov.frax.finance/t/fip-363-fraxlend-pilot-program-with-oval-on-susde-frax-and-usde-frax/3086","pubDate":"Wed, 05 Jun 2024 16:26:36 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"gov.frax.finance-topic-3086"},"source":{"@url":"https://gov.frax.finance/t/fip-363-fraxlend-pilot-program-with-oval-on-susde-frax-and-usde-frax/3086.rss","#text":"[FIP - 363] Fraxlend Pilot Program with Oval on sUSDe/FRAX and USDe/FRAX"},"filter":false},{"title":"[FIP - 362] Velodrome on Fraxtal - Proposal for Incentives for Liquidity Growth","dc:creator":"Ace","category":"Miscellaneous","description":"<p><strong>Executive Summary:</strong></p>\n<p>This proposal aims to develop an impactful liquidity program to support <a href=\"https://velodrome.finance/\" rel=\"noopener nofollow ugc\">Velodrome</a>’s expansion on Fraxtal. Velodrome’s vision to expand the <a href=\"https://medium.com/@VelodromeFi/velodrome-the-metadex-48e4af1ef9a4\" rel=\"noopener nofollow ugc\">MetaDEX</a> across the Superchain is an ideal fit for Fraxtal’s goals to rapidly grow its ecosystem.</p>\n<p>This proposal asks for $1M in incentives to build deep liquidity on strategic pools for Fraxtal. Liquidity incentives are critical for bootstrapping a new ecosystem, and getting emissions flowing early will kickstart the flywheel. Deep liquidity is essential for ecosystem development, and Velodrome has a proven track record of attracting users, boosting economic activity, and retaining TVL. From there, organic activity from new DApps, users, and protocol integrations will sustain Fraxtal network activity.</p>\n<p><strong>Introduction to Velodrome and Superchain Vision</strong></p>\n<p>Velodrome’s MetaDEX design is a powerful tool for bootstrapping liquidity at both the protocol level and chain layer. By bringing multiple primitives under the same roof, Velodrome provides a seamless, interactive experience for traders, protocols, and governance participants.</p>\n<p>Velodrome has a unique flywheel design (<a href=\"https://velodrome.finance/docs#\" rel=\"noopener nofollow ugc\">docs</a>). veVELO holders vote each week to direct $VELO emissions to liquidity pools. In exchange, voters receive 100% of swap fees and protocol incentives from the pools they vote for, creating a self-balancing mechanism that drives $VELO rewards to the most productive pools. Protocols and chains can bootstrap liquidity for their pools by depositing voting incentives. The trading volume supported by the pools will attract additional $VELO by capturing fees for veVELO voters.</p>\n<p>Velodrome launched in June, 2022 on Optimism and has since attracted over $150M in TVL and <a href=\"https://dune.com/0xkhmer/velodrome\" rel=\"noopener nofollow ugc\">generated &gt;$9.2b</a> in trading volume. Optimism has granted <a href=\"https://docs.google.com/spreadsheets/d/1Ul8iMTsOFUKUmqz6MK0zpgt8Ki8tFtoWKGlwXj-Op34/edit#gid=970075255\" rel=\"noopener nofollow ugc\">&gt;5M OP grants </a>to Velodrome to help grow liquidity and tooling for the expanding Superchain ecosystem. Velodrome has one of the most engaged and educated DeFi communities, with over 13,000 veVELO addresses who participate in weekly governance.</p>\n<p>With its <a href=\"https://medium.com/@VelodromeFi/velodrome-superchain-30161eb0ad6b\" rel=\"noopener nofollow ugc\">Superchain</a> vision, Velodrome is developing the architecture to provide a liquidity layer for the interoperable, scalable Optimism stack ecosystem. Velodrome launched its first multichain implementation on <a href=\"https://twitter.com/VelodromeFi/status/1787824312893993028\" rel=\"noopener nofollow ugc\">Mode</a>, reaching a TVL of ~$4.5m before VELO incentives are live. Velodrome has also announced plans to service BOB, Lisk, Metal and many other unannounced Superchain L2 deployments.</p>\n<p><strong>Proposal</strong></p>\n<p>Velodrome requests $1M to provide voting incentives to be allocated across the pools with the Fraxtal team’s guidance. Each $1 of voting incentives would lead to roughly 1.5X VELO rewards for LPs. The incentives will be deployed over a period of 12 months, prioritizing liquidity for strategic pairs for the Fraxtal ecosystem. A draft model for the first month of liquidity incentives and pool <a href=\"https://docs.google.com/spreadsheets/d/e/2PACX-1vQTE17CQCToPMq9D4hOP4B_XMRrYmJKBNBUiWQj38AWZt98eyB2sP_XJ0Cw7N7CLWw7qIcoZ8hT9YVo/pubhtml\" rel=\"noopener nofollow ugc\">details can be found here.</a></p>\n<p><strong>Milestones</strong></p>\n<p><em>Initial Velodrome Deployment on Fraxtal</em></p>\n<ul>\n<li>Velodrome Superchain Beta or Superchain 1.0 (whichever is code complete) will launch on Fraxtal. Abovementioned pools will be created and liquidity will be seeded by a combination of the Fraxtal and Velodrome teams.</li>\n</ul>\n<p><em>Emissions Go Live</em></p>\n<ul>\n<li>Rewards will either be deposited directly or directed by veVELO voters to the original list of pools to generate the expected APRs for LPs.</li>\n<li>$5m TVL is the goal by the end of the first epoch following the start of LP emissions.</li>\n</ul>\n<p><em>Expansion</em></p>\n<ul>\n<li>Marketing - Velodrome will regularly highlight the APRs available for LPs on Fraxtal in order to increase awareness and bring in greater liquidity to the ecosystem. Velodrome has an active Discord server and X account with over 238,000 followers.</li>\n<li>Business Development - Velodrome will actively seek out our existing liquidity partners that make a good fit for Fraxtal. We regularly coordinate with &gt;100 liquidity partners (DeFi, RWAs, Perps, memecoins, etc) across the Optimism Superchain and many are interested in going multichain.</li>\n<li>Direct voting - The Frax and Fraxtal teams can deposit POL to accrue VELO and increase veVELO voting power and boost LP rewards for select pools.</li>\n<li>$10m TVL is the goal by the end of the first month following the start of LP emissions.</li>\n</ul>\n<p><em>Future</em></p>\n<ul>\n<li>Velodrome’s concentrated liquidity pools, Slipstream, will be deployed for maximum capital efficiency for LPs and order execution for traders</li>\n<li>DEX aggregator integration</li>\n<li>Maintenance with liquidity partners on Fraxtal - coordinate weekly incentives strategy to ensure satisfactory TVLs for all stakeholders (protocols, chain, traders)</li>\n</ul>\n<p><strong>About the Velodrome Core Team</strong></p>\n<ul>\n<li><a href=\"https://twitter.com/wagmiAlexander\" rel=\"noopener nofollow ugc\">Alexander</a>: Background in politics, technology, and consulting, including time working for the Obama campaign, Apple Inc, and consulting with numerous Fortune 500s.</li>\n<li><a href=\"https://twitter.com/wagmiAlexander\" rel=\"noopener nofollow ugc\">Tao</a>: Background in economics and finance; experience as strategy lead for a large asset manager in Switzerland and at Big Three consulting firm.</li>\n<li><a href=\"https://twitter.com/jack_anorak\" rel=\"noopener nofollow ugc\">Jack</a>: Optimism delegate and growth grants committee member</li>\n<li>Stas: Open Source contributor to Ubuntu, Mozilla, WordPress. Tech lead and maintainer of multiple open source projects on Github. Prior to Velodrome I led the architecture and integrated <a href=\"http://able.com/\" rel=\"noopener nofollow ugc\">able.com</a> with multiple banking/fintech services and wrote their initial US tax calculator.</li>\n<li><a href=\"https://twitter.com/ZoomerAnon\" rel=\"noopener nofollow ugc\">ZoomerAnon</a>: Software developer working in crypto on dapps, analytics, and open source tools since 2019. Maintaining free wallet tracking software and publicizing information about smart contract exploits.</li>\n<li><a href=\"https://twitter.com/0xmethodic\" rel=\"noopener nofollow ugc\">Methodic</a>: Enterprise tech sales background; experience across the full sales cycle, sales development team management and recruitment.</li>\n<li><a href=\"https://twitter.com/0x_DanW\" rel=\"noopener nofollow ugc\">Dan</a>: Data strategist with experience in the U.S. education sector at public, non-profit and private organizations. Educational background in economics and public policy.</li>\n<li><a href=\"https://twitter.com/Ace_da_Book\" rel=\"noopener nofollow ugc\">Ace</a>: Co-founder of <a href=\"https://twitter.com/fourmoonsllc\" rel=\"noopener nofollow ugc\">Four Moons</a>. Experience in liquid fund management and crypto startup advisory. Previously executive in renewable energy project development and operations.</li>\n</ul>\n<h2><a name=\"vote-1\" class=\"anchor\" href=\"https://gov.frax.finance#vote-1\"></a>Vote</h2>\n<ul>\n<li>For: Allocate $1M worth of FXS in incentives to build deep liquidity on strategic pools for Fraxtal on Veloderome for period of 12 months</li>\n<li>Against: Do nothing</li>\n</ul>\n            <p><small>14 posts - 7 participants</small></p>\n            <p><a href=\"https://gov.frax.finance/t/fip-362-velodrome-on-fraxtal-proposal-for-incentives-for-liquidity-growth/3083\">Read full topic</a></p>","link":"https://gov.frax.finance/t/fip-362-velodrome-on-fraxtal-proposal-for-incentives-for-liquidity-growth/3083","pubDate":"Tue, 04 Jun 2024 18:39:52 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"gov.frax.finance-topic-3083"},"source":{"@url":"https://gov.frax.finance/t/fip-362-velodrome-on-fraxtal-proposal-for-incentives-for-liquidity-growth/3083.rss","#text":"[FIP - 362] Velodrome on Fraxtal - Proposal for Incentives for Liquidity Growth"},"filter":true},{"title":"[FIP - 361] Integrate RedStone sfrxETH / ETH Price Feed into Fraxlend on Ethereum","dc:creator":"Marcin_RedStone","category":"Fraxlend","description":"<p>Hello, Marcin here from <a href=\"https://twitter.com/redstone_defi\" rel=\"noopener nofollow ugc\">RedStone</a>. We’ve been the major Oracle provider for Fraxtal since April 2024. Currently, our price feeds are integrated by Fraxlend, Glyph and Trinity on Fraxtal. The aim of this proposal is to help Fraxlend gain further market share and enhance its resiliency.</p>\n<p><strong>BACKGROUND</strong></p>\n<p>RedStone is the major Oracle on Fraxtal. As the only price feeds provider, RedStone offers the two major oracle implementations:</p>\n<ol>\n<li>RedStone Classic - Traditional Push model, supporting 5 major pairs at the time of writing (<a href=\"https://docs.redstone.finance/docs/smart-contract-devs/price-feeds\" rel=\"noopener nofollow ugc\">Here</a>).</li>\n<li><a href=\"https://docs.redstone.finance/docs/smart-contract-devs/get-started/redstone-core\" rel=\"noopener nofollow ugc\">RedStone Core</a> - Pull oracle model allowing for gas efficiency, and low-latency of price feed updates, based on attaching signed data packages to transaction call-data. The model that allowed i.e. Gearbox to grow its TVL by 10x, reaching over $400M.</li>\n</ol>\n<p>Our team would like to enhance Fraxlend’s resiliency by incorporating RedStone price feeds and enabling future expansions with new markets powered by RedStone (we are often the first Oracle to provide trending assets like with LRTs, Ethena, etc.).</p>\n<p><strong>ABOUT REDSTONE</strong></p>\n<p>RedStone is the quickest-growing Modular Oracle with clients including Venus, ListaDAO, Kinza, Pendle, Morpho, Ethena, Etherfi, Renzo, Puffer, Silo, Sommelier, Gearbox, Frax, Swell, Angle and 70+ other companies. Our Oracles are available on 50+ chains including Fraxtal, Arbitrum, BNB Chain, Ethereum, Merlin Chain, BOB, Blast, TON, Mode and many more.</p>\n<p>RedStone’s mission is to enable DeFi protocols and dApp’s builders to reach their full potential with versatile, gas-optimized and robust price feeds delivered cross-chain. Our team consists of seasoned engineers with an average of 15+ years of dev experience and a hard-working BD &amp; Marketing team supporting partner protocols at every step: conferences, Twitter spaces, targeted intros, etc. Our technology has been acknowledged by the leading figures in the crypto space, we are proud to be backed by the most renowned Web3 Entrepreneurs such as Sandeep Nailwal (Polygon), Alex Gluchovski (zkSync), Emin Gün Sirer (Avalanche), Richard Ma (Quantstamp) and VCs like Lemniscap, Coinbase Ventures, Blockchain Capital, Maven11, Distributed Global, Lattice Fund and others.</p>\n<p>Our tech-first approach allows us to be a leader in LRT &amp; LST price feeds and provide Oracles for blue chip assets, LP and staked tokens and numerous trending tokens. We are the first oracle to create price feeds for weETH (Etherfi) and ezETH (Renzo), STONE (StakeStone) and numerous other assets.</p>\n<p><strong>PROPOSAL</strong></p>\n<p>Integrating <a href=\"https://etherscan.io/address/0xdd60c54115C19e0c6360AD4762B88BB8076D50a8#readProxyContract\" rel=\"noopener nofollow ugc\">sfrxETH / ETH</a> price feed on Ethereum mainnet into Fraxlend. The feed is configured with a 0.5% deviation threshold and 6 hours heartbeat. The price discovery is set by multiplying the frxETH / ETH market price by the sfrxETH / frxETH contract’s ratio provided by Frax.</p>\n<p><strong>BENEFITS TO FRAXLEND</strong></p>\n<p>By accepting the proposal Fraxlend is going to benefit in a number of ways:</p>\n<ol>\n<li>Integrating the feed would increase Fraxlend’s oracle robustness (currently it uses only a single Curve AMM to derive the frxETH / ETH rate, whereas RedStone takes all reliable sources).</li>\n<li>RedStone would enable new markets as Fraxlend evolves.</li>\n<li>The RedStone team will support the further cross-chain expansion of Fraxlend.</li>\n<li>The integration would be a step for Frax DAO eligibility for the possible future RedStone rewards after TGE.</li>\n<li>Further supporting Fraxlend on the marketing and Go-To-Market front with new assets.</li>\n</ol>\n<p>The RedStone team is dedicated to continuing to help the Frax ecosystem in successful expansion horizontally (i.e support for Fraxtal and cross-chain deployments) and vertically (new assets at Fraxlend).</p>\n<p><strong>VOTE</strong><br>\nFor: Integrate RedStone sfrxETH / ETH Price Feed into Fraxlend on Ethereum.</p>\n<p>Against: Do nothing.</p>\n            <p><small>3 posts - 3 participants</small></p>\n            <p><a href=\"https://gov.frax.finance/t/fip-361-integrate-redstone-sfrxeth-eth-price-feed-into-fraxlend-on-ethereum/3078\">Read full topic</a></p>","link":"https://gov.frax.finance/t/fip-361-integrate-redstone-sfrxeth-eth-price-feed-into-fraxlend-on-ethereum/3078","pubDate":"Tue, 28 May 2024 16:48:50 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"gov.frax.finance-topic-3078"},"source":{"@url":"https://gov.frax.finance/t/fip-361-integrate-redstone-sfrxeth-eth-price-feed-into-fraxlend-on-ethereum/3078.rss","#text":"[FIP - 361] Integrate RedStone sfrxETH / ETH Price Feed into Fraxlend on Ethereum"},"filter":false},{"title":"Proposal to Frax - Enhancing Security and Trust with ChainPatrol","dc:creator":"DaveScalzo","category":"Miscellaneous","description":"<p>Date: 24.05.2024</p>\n<h3><a name=\"requested-amount-1\" class=\"anchor\" href=\"https://gov.frax.finance#requested-amount-1\"></a>Requested Amount:</h3>\n<ul>\n<li>36,000 USD ($3,000 USD/mo) for 1 Year Contract</li>\n</ul>\n<h3><a name=\"objective-2\" class=\"anchor\" href=\"https://gov.frax.finance#objective-2\"></a><img src=\"https://emoji.discourse-cdn.com/twitter/clipboard.png?v=12\" title=\":clipboard:\" class=\"emoji\" alt=\":clipboard:\" loading=\"lazy\" width=\"20\" height=\"20\"> Objective:</h3>\n<hr>\n<p>ChainPatrol is a Real-Time Security Platform that aims to detect, block and manage takedowns of active malicious threats targeting Frax Finance, keeping the community and organization safe from bad actors.</p>\n<h3><a name=\"description-3\" class=\"anchor\" href=\"https://gov.frax.finance#description-3\"></a><img src=\"https://emoji.discourse-cdn.com/twitter/clipboard.png?v=12\" title=\":clipboard:\" class=\"emoji\" alt=\":clipboard:\" loading=\"lazy\" width=\"20\" height=\"20\"> <strong>Description:</strong></h3>\n<hr>\n<p>As Frax continues to grow and scale, bad actors have an increasing incentive to target the community, organization, and staff members. Online threats vary in nature across each platform and ChainPatrol specializes in detecting, blocking, and taking down these active threats (impersonations, phishing links, wallet drainers).</p>\n<p>Our aim is to get the support of Frax Governance to become a valued security partner that works closely with Frax to protect its community, users, and builders through all of the key roadmap events, mitigating the impact of these potential threats on community members.</p>\n<h3><a name=\"background-4\" class=\"anchor\" href=\"https://gov.frax.finance#background-4\"></a><img src=\"https://emoji.discourse-cdn.com/twitter/shield.png?v=12\" title=\":shield:\" class=\"emoji\" alt=\":shield:\" loading=\"lazy\" width=\"20\" height=\"20\"> Background:</h3>\n<hr>\n<p>My name is Dave Scalzo and I am the BD Lead and Head of Customer Success for ChainPatrol (a Web3 Cybersecurity company). We started our company approximately 2 years ago with the vision of making the Web3 Space safer.</p>\n<p>Everyday, there are new online threats targeting organizations and users in the crypto industry. Our mission is to constantly adapt to these new threat vectors and ensure that our customers and their communities are protected from a variety of different threats across platforms.</p>\n<p>ChainPatrol is a very accessible and transparent team supporting security 24/7 across all timezones.</p>\n<p>Website:  <a href=\"https://chainpatrol.io/\" rel=\"noopener nofollow ugc\">https://chainpatrol.io</a></p>\n<p>This proposal will serve as the next step in complementing the security efforts of Frax Finance.</p>\n<h3><a name=\"service-offering-5\" class=\"anchor\" href=\"https://gov.frax.finance#service-offering-5\"></a><img src=\"https://emoji.discourse-cdn.com/twitter/purple_circle.png?v=12\" title=\":purple_circle:\" class=\"emoji\" alt=\":purple_circle:\" loading=\"lazy\" width=\"20\" height=\"20\"> Service Offering:</h3>\n<hr>\n<p><em>Platform</em></p>\n<p>ChainPatrol’s Security Platform will support the Frax team in responding to threats and mitigating their impact by blocking within minutes of detection and managing takedowns.</p>\n<p><em>Reporting Staff</em></p>\n<p>ChainPatrols Reporting team will safeguard the Frax ecosystem. Our comprehensive security suite offers a robust dashboard and auto-detection system to report online threats targeting your brand across domains, social platforms, and marketplaces.</p>\n<p><em>Service Excellence</em></p>\n<p>By mitigating the risks of phishing, impersonation, and fake advertisements, ChainPatrol employs blocking approaches and takedown expertise to protect your community from malicious actors. Our proven success with leading projects such as Arbitrum, The Graph, Starknet, CoW Swap, Linea, and Curve Finance underscores our capability to prevent the loss of community funds swiftly and effectively. ChainPatrol can block malicious domains within 15 minutes across 20 leading crypto wallets, including Metamask, Coinbase Wallet, and Phantom.</p>\n<p><em>Security Dashboard</em></p>\n<p>Implementing ChainPatrol’s Security Suite will make Frax’s Web3 community significantly safer, increasing the operational costs for bad actors over time. Our enterprise protection features include the ChainPatrol Dashboard for viewing reports, active threats, metrics, and takedowns, as well as 24/7 automated monitoring for new threats across domains and social platforms.</p>\n<p>Our takedown service covers domains, social platforms, and app stores, with social takedowns spanning across X, Discord, Telegram, Reddit, Instagram, YouTube, LinkedIn, TikTok, Facebook, and decentralized social platforms. Additionally, ChainPatrol Reporting Bots (for Discord and Slack) facilitate easy reporting from your team and community. By partnering with ChainPatrol, Frax can ensure a secure, trusted environment for its users and stakeholders.</p>\n<h3><a name=\"arbitrum-safeguarding-the-arb-token-launch-6\" class=\"anchor\" href=\"https://gov.frax.finance#arbitrum-safeguarding-the-arb-token-launch-6\"></a><img src=\"https://emoji.discourse-cdn.com/twitter/hammer_and_wrench.png?v=12\" title=\":hammer_and_wrench:\" class=\"emoji\" alt=\":hammer_and_wrench:\" loading=\"lazy\" width=\"20\" height=\"20\"> Arbitrum: Safeguarding the ARB Token Launch</h3>\n<hr>\n<p><em>Arbitrum is a leading Layer 2 technology that empowers you to explore and build in the largest Layer 1 ecosystem: Ethereum.</em></p>\n<p>Arbitrum Foundation approached us to ensure a secure and successful ARB token launch in March 2023. Our team immediately began detecting a surge of impersonation attempts and implemented a multi-layered security strategy to protect the Arbitrum community and brand in the wider ecosystem.</p>\n<p><strong>ARB Token Launch</strong></p>\n<hr>\n<p></p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://global.discourse-cdn.com/standard11/uploads/frax1/original/2X/2/2e7554568baf07fe7e241c0d3d07c223712189a0.jpeg\" data-download-href=\"/uploads/short-url/6CZl86AjDVgPxSOX4LOaNuZj6fK.jpeg?dl=1\" title=\"image\" rel=\"noopener nofollow ugc\"><img src=\"https://global.discourse-cdn.com/standard11/uploads/frax1/optimized/2X/2/2e7554568baf07fe7e241c0d3d07c223712189a0_2_690x183.jpeg\" alt=\"image\" data-base62-sha1=\"6CZl86AjDVgPxSOX4LOaNuZj6fK\" width=\"690\" height=\"183\" srcset=\"https://global.discourse-cdn.com/standard11/uploads/frax1/optimized/2X/2/2e7554568baf07fe7e241c0d3d07c223712189a0_2_690x183.jpeg, https://global.discourse-cdn.com/standard11/uploads/frax1/original/2X/2/2e7554568baf07fe7e241c0d3d07c223712189a0.jpeg 1.5x, https://global.discourse-cdn.com/standard11/uploads/frax1/original/2X/2/2e7554568baf07fe7e241c0d3d07c223712189a0.jpeg 2x\" data-dominant-color=\"6C46A5\"></a></div><p></p>\n<p>During the first twelve days of the ARB token launch, ChainPatrol effectively blocked 1200+ online threats across leading crypto wallets. The fast response protection at wallets was critical to preventing widespread losses from impersonation, and speeding up takedowns from several days to just a few minutes.</p>\n<hr>\n<p>Arbitrum shines as an industry leader, recognizing the overwhelming pain point of malicious domains and the direct impact threats have on the growth of its online community.</p>\n<p>“Keeping the Arbitrum community safe is an interative and ongoing process that ChainPatrol has helped to simplify, as well as improve, with the removal of over 4000 threats and scams”  - <span class=\"mention\">@Eli_Defi</span>, Community Lead, Arbitrum Foundation</p>\n<hr>\n<h3><a name=\"next-steps-7\" class=\"anchor\" href=\"https://gov.frax.finance#next-steps-7\"></a><img src=\"https://emoji.discourse-cdn.com/twitter/footprints.png?v=12\" title=\":footprints:\" class=\"emoji\" alt=\":footprints:\" loading=\"lazy\" width=\"20\" height=\"20\"> Next Steps:</h3>\n<hr>\n<p>Once approved, ChainPatrol’s first action with Frax will be to work closely with staff to add all of the required assets necessary to train our systems.</p>\n<p>Below are the initial key steps to the onboarding process:</p>\n<hr>\n<ol>\n<li>Collect Legal Documents</li>\n</ol>\n<ul>\n<li>Power of Attorney</li>\n<li>Letter of Authorization</li>\n<li>Trademarks Details</li>\n</ul>\n<ol start=\"2\">\n<li>Add all brand assets and URLs to the dashboard</li>\n<li>Add Social Profiles of key Frax Staff Members</li>\n<li>Add Discord or Slack Reporting Bot for the Community.</li>\n</ol>\n<ul>\n<li>Staff and community members will be able to both check and report suspected malicious assets, using the /check and /report commands</li>\n</ul>\n<h3><a name=\"ongoing-support-in-2024-8\" class=\"anchor\" href=\"https://gov.frax.finance#ongoing-support-in-2024-8\"></a><img src=\"https://emoji.discourse-cdn.com/twitter/dizzy.png?v=12\" title=\":dizzy:\" class=\"emoji\" alt=\":dizzy:\" loading=\"lazy\" width=\"20\" height=\"20\"> Ongoing Support in 2024</h3>\n<hr>\n<p>The success of our service comes from ensuring that we maintain an open and honest flow of communication between our team and the Frax community and staff. As such, after completion of onboarding, ChainPatrol will provide continuous support through the following actions:</p>\n<ul>\n<li>24/7 Triaging of Threats Shared through Communication Channels (Telegram, Discord, Slack)\n<ul>\n<li>Our team will maintain open daily communication with Astar to address threats detected by community and staff</li>\n</ul>\n</li>\n<li>Monthly Threat Snapshot Reports\n<ul>\n<li>Provides transparency to the metrics associated with our protection efforts</li>\n</ul>\n</li>\n<li>Regular Touchpoint Meetings\n<ul>\n<li>Stay up-to-date on key roadmap events upcoming, ensuring any new brand assets are appropriately added to our systems</li>\n</ul>\n</li>\n</ul>\n<h3><a name=\"links-contact-info-9\" class=\"anchor\" href=\"https://gov.frax.finance#links-contact-info-9\"></a><img src=\"https://emoji.discourse-cdn.com/twitter/mega.png?v=12\" title=\":mega:\" class=\"emoji\" alt=\":mega:\" loading=\"lazy\" width=\"20\" height=\"20\"> Links &amp; Contact Info:</h3>\n<hr>\n<p>E-mail - <a href=\"mailto:davide@chainpatrol.io\">davide@chainpatrol.io</a><br>\nTelegram - <span class=\"mention\">@dschainpatrol</span></p>\n<p><strong>ChainPatrol looks forward to being a trusted security partner of Frax!</strong></p>\n<p>Thank you all for your consideration!</p>\n            <p><small>1 post - 1 participant</small></p>\n            <p><a href=\"https://gov.frax.finance/t/proposal-to-frax-enhancing-security-and-trust-with-chainpatrol/3074\">Read full topic</a></p>","link":"https://gov.frax.finance/t/proposal-to-frax-enhancing-security-and-trust-with-chainpatrol/3074","pubDate":"Fri, 24 May 2024 13:57:12 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"gov.frax.finance-topic-3074"},"source":{"@url":"https://gov.frax.finance/t/proposal-to-frax-enhancing-security-and-trust-with-chainpatrol/3074.rss","#text":"Proposal to Frax - Enhancing Security and Trust with ChainPatrol"},"filter":true},{"title":"[FIP - 360] Authorize Fraxlend AMO for a new pair (sDOLA/FRAX - Variable Rate)","dc:creator":"patb","category":"AMOs","description":"<h1><a name=\"summary-1\" class=\"anchor\" href=\"https://gov.frax.finance#summary-1\"></a>Summary</h1>\n<p>Authorize Fraxlend AMO to deposit minted FRAX into the following Fraxlend pair with mentioned max authorized allocation.</p>\n<div class=\"md-table\">\n<table>\n<thead>\n<tr>\n<th>Fraxlend Pair Name</th>\n<th>Fraxlend Pair Address</th>\n<th>Max Authorized Allocation</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>sDOLA/FRAX - Variable Rate V2</td>\n<td>TBD</td>\n<td>10,000,000 FRAX</td>\n</tr>\n</tbody>\n</table>\n</div><h1><a name=\"background-and-motivation-2\" class=\"anchor\" href=\"https://gov.frax.finance#background-and-motivation-2\"></a>Background and Motivation</h1>\n<p>Fraxlend is a lending platform that allows anyone to create a market between a pair of ERC-20 tokens. Any token with an approved data feed can be lent to borrowers or used as collateral. Each pair is an isolated, permission-less market that allows anyone to create and participate in lending and borrowing activities. This protocol is creating new financial opportunities for the FRAX community.</p>\n<p>Automated Market Operations (AMOs) make FRAX one of the most potent stablecoin protocols, creating maximum flexibility and opportunity without altering the base stability mechanism that made FRAX a leader in the stablecoin space. So far, Frax has deployed multiple AMOs, including lending AMOs on the Fraxlend, Aave, and Rari protocols.</p>\n<p>Adding more pairs into Fraxlend AMO is the next step in this vision, allowing the protocol to mint FRAX backed by over-collateralized debt.</p>\n<p>Inverse Finance is the decentralized autonomous organization that develops and manages the FiRM fixed rate lending protocol, DOLA, its debt-backed, decentralized stablecoin, and sDOLA, the yield-bearing version of DOLA. Originally founded by Nour Haridy in late 2020, the protocol is governed by the Inverse Finance DAO, a collective of crypto enthusiasts. Our code base is open source and maintained by the community.</p>\n<p>sDOLA is a yield-bearing version of Inverse Finance’s DOLA stablecoin which currently generates a 30-day average yield of over 12.52% via revenues from its FiRM fixed rate lending market. sDOLA uses a custom price feed that utilizes the DOLA/FraxPyusd pool and Curve EMA to price DOLA. By adding it to Fraxlend, we can enable the minting and backing of even more FRAX and expand DOLA lending capacity against sFRAX on FiRM.</p>\n<h1><a name=\"voting-3\" class=\"anchor\" href=\"https://gov.frax.finance#voting-3\"></a>Voting</h1>\n<ul>\n<li>For: Authorize Fraxlend AMO to deposit minted FRAX into the mentioned Fraxlend pair with the mentioned max authorized allocation.</li>\n<li>Against: Do nothing.</li>\n</ul>\n            <p><small>2 posts - 2 participants</small></p>\n            <p><a href=\"https://gov.frax.finance/t/fip-360-authorize-fraxlend-amo-for-a-new-pair-sdola-frax-variable-rate/3071\">Read full topic</a></p>","link":"https://gov.frax.finance/t/fip-360-authorize-fraxlend-amo-for-a-new-pair-sdola-frax-variable-rate/3071","pubDate":"Tue, 21 May 2024 19:54:24 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"gov.frax.finance-topic-3071"},"source":{"@url":"https://gov.frax.finance/t/fip-360-authorize-fraxlend-amo-for-a-new-pair-sdola-frax-variable-rate/3071.rss","#text":"[FIP - 360] Authorize Fraxlend AMO for a new pair (sDOLA/FRAX - Variable Rate)"},"filter":false},{"title":"Frax DAO Grant for THE DEFI CLUB May 2024","dc:creator":"FraxGod.eth","category":"Miscellaneous","description":"<h3><a name=\"h-1-overview-1\" class=\"anchor\" href=\"https://gov.frax.finance#h-1-overview-1\"></a>1. Overview</h3>\n<p><strong>Project Title:</strong> Frax DAO Grant for THE DEFI CLUB</p>\n<p><strong>Submission Date:</strong> May 17 2024</p>\n<p><strong>Applicant:</strong> THE DEFI CLUB</p>\n<p><strong>Website:</strong> <a href=\"https://www.0xdeficlub.com/\" rel=\"noopener nofollow ugc\">https://www.0xdeficlub.com/</a></p>\n<p><strong>Members:</strong> Dimitri Orga (FraxGod), Samuel McCulloch, Anicet0, Lewy</p>\n<h3><a name=\"h-2-applicant-information-2\" class=\"anchor\" href=\"https://gov.frax.finance#h-2-applicant-information-2\"></a>2. Applicant Information</h3>\n<p>At THE DEFI CLUB, we are pioneering the creation of the first educational hub within the Fraxtal ecosystem.</p>\n<p>Similar to how major protocols like Chainlink dedicate an annual budget to education through various bootcamps, events, and hackathons, and run comprehensive ambassador programs, we recognize the power of these initiatives to increase crypto awareness and foster a strong sense of community belonging.</p>\n<p>By addressing the current educational void in the Frax ecosystem, we aim to leverage these proven strategies to enhance DeFi education and deepen community engagement, building on the foundation set by previous community outreach efforts.</p>\n<h3><a name=\"h-3-project-description-3\" class=\"anchor\" href=\"https://gov.frax.finance#h-3-project-description-3\"></a>3. Project Description</h3>\n<p>THE DEFI CLUB serves as a central point for learning and development, equipped with resources, tutorials, and interactive tools designed to simplify complex DeFi concepts. Our goal is to lower the entry barriers for newcomers, ensuring they can navigate and leverage the full potential of DeFi Protocols.</p>\n<p>Our first release will be a 14-week paid DeFi Bootcamp, built for those who want to master the art of investing in decentralized finance. In each 2 hour lesson, one of our instructors will comprehensively teach and demonstrate various DeFi protocols (Frax, Curve, Convex, f(x) Protocol, Stake DAO, Prisma Finance, EigenLayer, Wombat Exchange, PancakeSwap, Pendle Finance &amp; IQ.wiki). Each lesson will be interactive and allow for students to engage, ask questions, and learn functional training on how to use DeFi applications.</p>\n<p>At the end of the Bootcamp, each student will be evaluated through an on-chain exam built on Fraxtal, with stablecoin rewards for top performers funded by the revenue from the bootcamp sales, which are deployed in DeFi protocols used throughout the course.</p>\n<p>This is part of an EdTech primitive called Learn2Earn that FraxGod introduced with his previous LYTRYUM Academy, which successfully attracted talent to the Spanish-speaking community. The proof of concept, deployed on Polygon, can be viewed on Binance Live at this <a href=\"https://www.binance.com/es/live/video?roomId=2152116\" rel=\"noopener nofollow ugc\">link</a>.</p>\n<p>Considering this concept and based on their scores, participants will receive an exclusive NFT Certification on Fraxtal, which demonstrates their completion of the program and validates their skills.</p>\n<p>All of the educational materials have already been made in Spanish by FraxGod &amp; Anicet0, and we are currently converting them for an English Audience. Some of the lessons taught live in Spanish can be found in this <a href=\"https://drive.google.com/drive/u/1/folders/1VkJHj7XnZ5rWMGZ9Hdre1sNjWJV52SSZ\" rel=\"noopener nofollow ugc\">folder</a>.</p>\n<p>THE DEFI CLUB will also serve as a community gathering. Our goal is to empower and expand the Frax community.</p>\n<p><strong>Deliverables:</strong></p>\n<ul>\n<li>Free Training Program on Frax Suite Products.</li>\n<li>Advanced Training Program on Decentralized Finance.</li>\n<li>On-Chain Certification and Exams on Fraxtal.</li>\n<li>Weekly Live Summary of Decentralized Finance Ecosystem including Frax protocol, new partnerships, products and everything related to Fraxtal.</li>\n<li>Weekly Newsletters and Community Engagement through Discord.</li>\n</ul>\n<h3><a name=\"h-4-benefits-to-frax-4\" class=\"anchor\" href=\"https://gov.frax.finance#h-4-benefits-to-frax-4\"></a>4. Benefits to Frax</h3>\n<p>THE DEFI CLUB will address several critical areas for Frax:</p>\n<ul>\n<li>\n<p><strong>User Onboarding:</strong> Simplifying the learning curve associated with Frax protocols.</p>\n</li>\n<li>\n<p><strong>Clarifying Use Cases:</strong> Increasing awareness of the utilities and benefits of Frax assets.</p>\n</li>\n<li>\n<p><strong>Building Trust:</strong> Providing reliable information to counteract misinformation in the DeFi space.</p>\n</li>\n<li>\n<p><strong>Ambassadorship Training:</strong> Empower community members to promote Frax and educate others. Ambassadors will receive training, resources, and support to become effective advocates within their networks. Also they will Organize virtual and in-person events like seminars, hackathons, and workshops to increase community interaction, provide hands-on learning experiences, and showcase real-world applications of Frax technologies.</p>\n</li>\n</ul>\n<p>Our <span class=\"hashtag-raw\">#1</span> goal is to educate, train and increase the user base of Frax and its associated products. We are committed to being the <span class=\"hashtag-raw\">#1</span> community for DeFi education and growth, helping onboard the next million users to crypto.</p>\n<h3><a name=\"h-5-project-strategy-and-execution-5\" class=\"anchor\" href=\"https://gov.frax.finance#h-5-project-strategy-and-execution-5\"></a>5. Project Strategy and Execution</h3>\n<p><strong>Educational Approach:</strong></p>\n<ul>\n<li>Free content will be hosted on <a href=\"https://www.youtube.com/@0xdeficlub/streams\" rel=\"noopener nofollow ugc\">YouTube</a> while the Advanced Training Programs will be on our website <a href=\"https://www.0xdeficlub.com\" rel=\"noopener nofollow ugc\">https://www.0xdeficlub.com</a></li>\n<li>We adopt a flexible approach, listening to the needs of the market and community, and based on that, we prepare our content</li>\n<li>We are building a user base that contributes to the DeFi space, equipped with knowledge gained through our bootcamps and skills validated by our on-chain exams.</li>\n<li>The creation of certificates encourages users to take action and start building their own reputation and resume.</li>\n</ul>\n<p><strong>Community and Outreach:</strong></p>\n<ul>\n<li>We know community is an important part and we will develop a Global Ambassador Program in next phases</li>\n<li>Implement a multi-channel marketing strategy to promote educational content and community events, leveraging platforms like YouTube, Twitter, and specialized DeFi forums.</li>\n<li>Collaborate with other DeFi projects and platforms to cross-promote activities, enhancing the visibility and reach of Frax-related educational initiatives.</li>\n</ul>\n<p><strong>Path to Profitability:</strong></p>\n<ul>\n<li>Introduce paid features for advanced courses and professional coaching.</li>\n<li>Develop a comprehensive marketing strategy targeting social media platforms and DeFi communities.</li>\n<li>We are looking to be a self-sustained project that keeps delivering educational content in the future without the need of funding.</li>\n</ul>\n<h3><a name=\"h-6-kpis-6\" class=\"anchor\" href=\"https://gov.frax.finance#h-6-kpis-6\"></a>6. KPIs</h3>\n<p>We will develop a correlation model between the number of weekly active users in THE DEFI CLUB and the Total Value Locked in Frax and Fraxtal, as well as the number of unique daily active accounts. To achieve this, a weekly mapping of these metrics will be conducted:</p>\n<p>(TVL, DAA) = function (Weekly Active Users THE DEFI CLUB)</p>\n<p>Another key metric for THE DEFI CLUB will be the revenue from selling paid training programs, initially focused on two specific bootcamps. These will cover ‘Mastering the Art of Investing in Decentralized Finance Applications’ and ‘Programming Smart Contracts in the EVM Environment’</p>\n<h3><a name=\"h-7-budget-and-funding-requirements-7\" class=\"anchor\" href=\"https://gov.frax.finance#h-7-budget-and-funding-requirements-7\"></a>7. Budget and Funding Requirements</h3>\n<p>The following is a disclosure of the annual cost of Human Resources and Community events.</p>\n<p>To minimize risk for the Frax community, we are requesting funding for one quarter, totaling <strong>USD 53,750</strong>. This will provide an initial demonstration of what THE DEFI CLUB can deliver, allowing the community to decide whether to continue funding in subsequent grants.</p>\n<p>Some of the impact of the activities of THE DEFI CLUB will be visible in the long term such as formation and development of the Ambassador Program, Conference events, Meetups and Hackathons.</p>\n<p></p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://global.discourse-cdn.com/standard11/uploads/frax1/original/2X/8/8a0bcc27eb9e37cec7fc65135fdfb397e01f9af6.jpeg\" data-download-href=\"/uploads/short-url/jHdalCyuJQEW6MePlPZj3wfQYPs.jpeg?dl=1\" title=\"img1\" rel=\"noopener nofollow ugc\"><img src=\"https://global.discourse-cdn.com/standard11/uploads/frax1/optimized/2X/8/8a0bcc27eb9e37cec7fc65135fdfb397e01f9af6_2_690x388.jpeg\" alt=\"img1\" data-base62-sha1=\"jHdalCyuJQEW6MePlPZj3wfQYPs\" width=\"690\" height=\"388\" srcset=\"https://global.discourse-cdn.com/standard11/uploads/frax1/optimized/2X/8/8a0bcc27eb9e37cec7fc65135fdfb397e01f9af6_2_690x388.jpeg, https://global.discourse-cdn.com/standard11/uploads/frax1/optimized/2X/8/8a0bcc27eb9e37cec7fc65135fdfb397e01f9af6_2_1035x582.jpeg 1.5x, https://global.discourse-cdn.com/standard11/uploads/frax1/optimized/2X/8/8a0bcc27eb9e37cec7fc65135fdfb397e01f9af6_2_1380x776.jpeg 2x\" data-dominant-color=\"292929\"></a></div><p></p>\n<p></p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://global.discourse-cdn.com/standard11/uploads/frax1/original/2X/f/fd29bf30788d09566b5adf621647666f01f0dd40.jpeg\" data-download-href=\"/uploads/short-url/A7Af11pRd36r1yqMC0rLMg1lx7y.jpeg?dl=1\" title=\"img2\" rel=\"noopener nofollow ugc\"><img src=\"https://global.discourse-cdn.com/standard11/uploads/frax1/optimized/2X/f/fd29bf30788d09566b5adf621647666f01f0dd40_2_690x389.jpeg\" alt=\"img2\" data-base62-sha1=\"A7Af11pRd36r1yqMC0rLMg1lx7y\" width=\"690\" height=\"389\" srcset=\"https://global.discourse-cdn.com/standard11/uploads/frax1/optimized/2X/f/fd29bf30788d09566b5adf621647666f01f0dd40_2_690x389.jpeg, https://global.discourse-cdn.com/standard11/uploads/frax1/optimized/2X/f/fd29bf30788d09566b5adf621647666f01f0dd40_2_1035x583.jpeg 1.5x, https://global.discourse-cdn.com/standard11/uploads/frax1/optimized/2X/f/fd29bf30788d09566b5adf621647666f01f0dd40_2_1380x778.jpeg 2x\" data-dominant-color=\"2A2A29\"></a></div><p></p>\n<p></p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://global.discourse-cdn.com/standard11/uploads/frax1/original/2X/3/3d3d33b6be21f7c4c388cef214ce35cf096631fe.jpeg\" data-download-href=\"/uploads/short-url/8JKfwvFGLyXH3vFNpPd5GIDn5b8.jpeg?dl=1\" title=\"img3\" rel=\"noopener nofollow ugc\"><img src=\"https://global.discourse-cdn.com/standard11/uploads/frax1/optimized/2X/3/3d3d33b6be21f7c4c388cef214ce35cf096631fe_2_690x386.jpeg\" alt=\"img3\" data-base62-sha1=\"8JKfwvFGLyXH3vFNpPd5GIDn5b8\" width=\"690\" height=\"386\" srcset=\"https://global.discourse-cdn.com/standard11/uploads/frax1/optimized/2X/3/3d3d33b6be21f7c4c388cef214ce35cf096631fe_2_690x386.jpeg, https://global.discourse-cdn.com/standard11/uploads/frax1/optimized/2X/3/3d3d33b6be21f7c4c388cef214ce35cf096631fe_2_1035x579.jpeg 1.5x, https://global.discourse-cdn.com/standard11/uploads/frax1/optimized/2X/3/3d3d33b6be21f7c4c388cef214ce35cf096631fe_2_1380x772.jpeg 2x\" data-dominant-color=\"282928\"></a></div><p></p>\n<p></p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://global.discourse-cdn.com/standard11/uploads/frax1/original/2X/7/7d0e97e93eb23a344d2f67c1cc94994487bbbb96.jpeg\" data-download-href=\"/uploads/short-url/hQiWTU84iYV1tMe1Z5d6ih9yphQ.jpeg?dl=1\" title=\"img4\" rel=\"noopener nofollow ugc\"><img src=\"https://global.discourse-cdn.com/standard11/uploads/frax1/optimized/2X/7/7d0e97e93eb23a344d2f67c1cc94994487bbbb96_2_690x385.jpeg\" alt=\"img4\" data-base62-sha1=\"hQiWTU84iYV1tMe1Z5d6ih9yphQ\" width=\"690\" height=\"385\" srcset=\"https://global.discourse-cdn.com/standard11/uploads/frax1/optimized/2X/7/7d0e97e93eb23a344d2f67c1cc94994487bbbb96_2_690x385.jpeg, https://global.discourse-cdn.com/standard11/uploads/frax1/optimized/2X/7/7d0e97e93eb23a344d2f67c1cc94994487bbbb96_2_1035x577.jpeg 1.5x, https://global.discourse-cdn.com/standard11/uploads/frax1/optimized/2X/7/7d0e97e93eb23a344d2f67c1cc94994487bbbb96_2_1380x770.jpeg 2x\" data-dominant-color=\"2D2D2D\"></a></div><p></p>\n<p></p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://global.discourse-cdn.com/standard11/uploads/frax1/original/2X/9/924076e4484afd92ad433d9dcdc0fe11a715cc64.jpeg\" data-download-href=\"/uploads/short-url/kRNP9zk9x8yskdHNMCuGAdMT1rK.jpeg?dl=1\" title=\"img5\" rel=\"noopener nofollow ugc\"><img src=\"https://global.discourse-cdn.com/standard11/uploads/frax1/optimized/2X/9/924076e4484afd92ad433d9dcdc0fe11a715cc64_2_690x388.jpeg\" alt=\"img5\" data-base62-sha1=\"kRNP9zk9x8yskdHNMCuGAdMT1rK\" width=\"690\" height=\"388\" srcset=\"https://global.discourse-cdn.com/standard11/uploads/frax1/optimized/2X/9/924076e4484afd92ad433d9dcdc0fe11a715cc64_2_690x388.jpeg, https://global.discourse-cdn.com/standard11/uploads/frax1/optimized/2X/9/924076e4484afd92ad433d9dcdc0fe11a715cc64_2_1035x582.jpeg 1.5x, https://global.discourse-cdn.com/standard11/uploads/frax1/optimized/2X/9/924076e4484afd92ad433d9dcdc0fe11a715cc64_2_1380x776.jpeg 2x\" data-dominant-color=\"2C2D2C\"></a></div><p></p>\n<p></p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://global.discourse-cdn.com/standard11/uploads/frax1/original/2X/e/e1a36f9ec9c83f62f818c5789c5a93981d096216.jpeg\" data-download-href=\"/uploads/short-url/wc5ADqrSbejlBjPbEdTjjVS4ABM.jpeg?dl=1\" title=\"img6\" rel=\"noopener nofollow ugc\"><img src=\"https://global.discourse-cdn.com/standard11/uploads/frax1/optimized/2X/e/e1a36f9ec9c83f62f818c5789c5a93981d096216_2_690x389.jpeg\" alt=\"img6\" data-base62-sha1=\"wc5ADqrSbejlBjPbEdTjjVS4ABM\" width=\"690\" height=\"389\" srcset=\"https://global.discourse-cdn.com/standard11/uploads/frax1/optimized/2X/e/e1a36f9ec9c83f62f818c5789c5a93981d096216_2_690x389.jpeg, https://global.discourse-cdn.com/standard11/uploads/frax1/optimized/2X/e/e1a36f9ec9c83f62f818c5789c5a93981d096216_2_1035x583.jpeg 1.5x, https://global.discourse-cdn.com/standard11/uploads/frax1/optimized/2X/e/e1a36f9ec9c83f62f818c5789c5a93981d096216_2_1380x778.jpeg 2x\" data-dominant-color=\"292A2A\"></a></div><p></p>\n<p></p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://global.discourse-cdn.com/standard11/uploads/frax1/original/2X/3/389515ac7c20d1a6fd4284fb5177ae58bc45a559.jpeg\" data-download-href=\"/uploads/short-url/84y9lx0A8x731MYb19taqn31eqd.jpeg?dl=1\" title=\"img7\" rel=\"noopener nofollow ugc\"><img src=\"https://global.discourse-cdn.com/standard11/uploads/frax1/optimized/2X/3/389515ac7c20d1a6fd4284fb5177ae58bc45a559_2_690x388.jpeg\" alt=\"img7\" data-base62-sha1=\"84y9lx0A8x731MYb19taqn31eqd\" width=\"690\" height=\"388\" srcset=\"https://global.discourse-cdn.com/standard11/uploads/frax1/optimized/2X/3/389515ac7c20d1a6fd4284fb5177ae58bc45a559_2_690x388.jpeg, https://global.discourse-cdn.com/standard11/uploads/frax1/optimized/2X/3/389515ac7c20d1a6fd4284fb5177ae58bc45a559_2_1035x582.jpeg 1.5x, https://global.discourse-cdn.com/standard11/uploads/frax1/optimized/2X/3/389515ac7c20d1a6fd4284fb5177ae58bc45a559_2_1380x776.jpeg 2x\" data-dominant-color=\"2C2C2C\"></a></div><p></p>\n<p></p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://global.discourse-cdn.com/standard11/uploads/frax1/original/2X/6/6591fdaf98c88cb0cce49c0ba4d3a2c9e1632169.jpeg\" data-download-href=\"/uploads/short-url/eux0xsSDC9rXjLpbWMbb1ZJqgt3.jpeg?dl=1\" title=\"img8\" rel=\"noopener nofollow ugc\"><img src=\"https://global.discourse-cdn.com/standard11/uploads/frax1/optimized/2X/6/6591fdaf98c88cb0cce49c0ba4d3a2c9e1632169_2_690x388.jpeg\" alt=\"img8\" data-base62-sha1=\"eux0xsSDC9rXjLpbWMbb1ZJqgt3\" width=\"690\" height=\"388\" srcset=\"https://global.discourse-cdn.com/standard11/uploads/frax1/optimized/2X/6/6591fdaf98c88cb0cce49c0ba4d3a2c9e1632169_2_690x388.jpeg, https://global.discourse-cdn.com/standard11/uploads/frax1/optimized/2X/6/6591fdaf98c88cb0cce49c0ba4d3a2c9e1632169_2_1035x582.jpeg 1.5x, https://global.discourse-cdn.com/standard11/uploads/frax1/optimized/2X/6/6591fdaf98c88cb0cce49c0ba4d3a2c9e1632169_2_1380x776.jpeg 2x\" data-dominant-color=\"2A2A2A\"></a></div><p></p>\n<p></p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://global.discourse-cdn.com/standard11/uploads/frax1/original/2X/9/9f9bc2a7d9d9af5bc6ad621fb710ce62a751bf96.jpeg\" data-download-href=\"/uploads/short-url/mLXDeIY29oLe3jbZ12ButS8xDRI.jpeg?dl=1\" title=\"img9\" rel=\"noopener nofollow ugc\"><img src=\"https://global.discourse-cdn.com/standard11/uploads/frax1/optimized/2X/9/9f9bc2a7d9d9af5bc6ad621fb710ce62a751bf96_2_690x392.jpeg\" alt=\"img9\" data-base62-sha1=\"mLXDeIY29oLe3jbZ12ButS8xDRI\" width=\"690\" height=\"392\" srcset=\"https://global.discourse-cdn.com/standard11/uploads/frax1/optimized/2X/9/9f9bc2a7d9d9af5bc6ad621fb710ce62a751bf96_2_690x392.jpeg, https://global.discourse-cdn.com/standard11/uploads/frax1/optimized/2X/9/9f9bc2a7d9d9af5bc6ad621fb710ce62a751bf96_2_1035x588.jpeg 1.5x, https://global.discourse-cdn.com/standard11/uploads/frax1/optimized/2X/9/9f9bc2a7d9d9af5bc6ad621fb710ce62a751bf96_2_1380x784.jpeg 2x\" data-dominant-color=\"282928\"></a></div><p></p>\n<h3><a name=\"h-8-conclusion-8\" class=\"anchor\" href=\"https://gov.frax.finance#h-8-conclusion-8\"></a>8. Conclusion</h3>\n<p>By funding this project, Frax will invest in a strategic educational initiative that not only broadens its user base but also strengthens the overall ecosystem. THE DEFI CLUB is committed to fostering a knowledgeable community that is well-equipped to utilize and advocate for Frax and other DeFi protocols.</p>\n<h3><a name=\"h-9-proposal-9\" class=\"anchor\" href=\"https://gov.frax.finance#h-9-proposal-9\"></a>9. Proposal</h3>\n<ul>\n<li>For: Approve THE DEFI CLUB Funding of $53,750 for 3 months activity</li>\n<li>Against: Do Nothing</li>\n</ul>\n            <p><small>2 posts - 2 participants</small></p>\n            <p><a href=\"https://gov.frax.finance/t/frax-dao-grant-for-the-defi-club-may-2024/3064\">Read full topic</a></p>","link":"https://gov.frax.finance/t/frax-dao-grant-for-the-defi-club-may-2024/3064","pubDate":"Fri, 17 May 2024 17:42:54 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"gov.frax.finance-topic-3064"},"source":{"@url":"https://gov.frax.finance/t/frax-dao-grant-for-the-defi-club-may-2024/3064.rss","#text":"Frax DAO Grant for THE DEFI CLUB May 2024"},"filter":true},{"title":"[FIP - 359] Add Re7 FRAX on Ethereum to the FXS Gauge Controller","dc:creator":"Re7-Labs","category":"Gauges","description":"<h2><a name=\"author-1\" class=\"anchor\" href=\"https://gov.frax.finance#author-1\"></a>Author</h2>\n<p>Re7 Labs</p>\n<h2><a name=\"summary-2\" class=\"anchor\" href=\"https://gov.frax.finance#summary-2\"></a>Summary</h2>\n<p>Proposal to add Re7FRAX MetaMorpho vault to the FXS gauge controller.</p>\n<h2><a name=\"background-and-motivation-3\" class=\"anchor\" href=\"https://gov.frax.finance#background-and-motivation-3\"></a>Background And Motivation</h2>\n<p>Morpho Blue is a decentralized protocol that facilitates overcollateralized lending and borrowing crypto assets (ERC20 Tokens) on the Ethereum Virtual Machine. The protocol, designed as an immutable smart contract, serves as a trustless base layer for lenders, borrowers, and applications, with risk management layers provided by <a href=\"https://docs.morpho.org/concepts/morpho-blue/core-concepts/externalized-risk-management\" rel=\"noopener nofollow ugc\">MetaMorpho</a>.</p>\n<p>Re7 Labs, specializing in DeFi R&amp;D and liquid crypto investment strategies has deployed the initial set of USDe/FRAX and sUSDE/FRAX markets and added them to the new Re7FRAX MetaMorpho vault.</p>\n<p>Adding the Re7FRAX vault to the FXS gauge controller on Ethereum will allow depositors to get additional FXS rewards, increasing the supply and leading to higher borrow demand for FRAX within the Morpho Blue system. Additionally Morpho will provide MORPHO token incentives to vault depositors, contingent on a successful gauge vote.</p>\n<h2><a name=\"pool-details-4\" class=\"anchor\" href=\"https://gov.frax.finance#pool-details-4\"></a>Pool Details</h2>\n<p>Re7FRAX</p>\n<p>Pool/Token: <a href=\"https://etherscan.io/address/0xBE40491F3261Fd42724F1AEb465796eb11c06ddF\" rel=\"noopener nofollow ugc\">0xBE40491F3261Fd42724F1AEb465796eb11c06ddF</a></p>\n<h2><a name=\"vote-5\" class=\"anchor\" href=\"https://gov.frax.finance#vote-5\"></a>Vote</h2>\n<p>・For: Add Re7FRAX on Ethereum to the FXS gauge controller<br>\n・Against: Do nothing</p>\n            <p><small>3 posts - 3 participants</small></p>\n            <p><a href=\"https://gov.frax.finance/t/fip-359-add-re7-frax-on-ethereum-to-the-fxs-gauge-controller/3063\">Read full topic</a></p>","link":"https://gov.frax.finance/t/fip-359-add-re7-frax-on-ethereum-to-the-fxs-gauge-controller/3063","pubDate":"Tue, 14 May 2024 15:19:12 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"gov.frax.finance-topic-3063"},"source":{"@url":"https://gov.frax.finance/t/fip-359-add-re7-frax-on-ethereum-to-the-fxs-gauge-controller/3063.rss","#text":"[FIP - 359] Add Re7 FRAX on Ethereum to the FXS Gauge Controller"},"filter":true},{"title":"Tracking sfrxeth rewards on fraxtal","dc:creator":"Mamabear","category":"General Discussion","description":"<p>Hello everyone!</p>\n<p>I recently brigded sfrxeth to Fraxtal from mainnet eth and from that date the rewards no longer show up on <a href=\"https://app.frax.finance/frxeth/rewards\" class=\"inline-onebox\" rel=\"noopener nofollow ugc\">Frax Finance</a>. Is this because you only get rewards on mainnet or that it just doesn’t track on fraxtal?</p>\n<p>Best regards and love the frax ecosystem!!</p>\n            <p><small>4 posts - 3 participants</small></p>\n            <p><a href=\"https://gov.frax.finance/t/tracking-sfrxeth-rewards-on-fraxtal/3052\">Read full topic</a></p>","link":"https://gov.frax.finance/t/tracking-sfrxeth-rewards-on-fraxtal/3052","pubDate":"Fri, 10 May 2024 12:10:59 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"gov.frax.finance-topic-3052"},"source":{"@url":"https://gov.frax.finance/t/tracking-sfrxeth-rewards-on-fraxtal/3052.rss","#text":"Tracking sfrxeth rewards on fraxtal"},"filter":false},{"title":"Rename Frax the stablecoin to FrxUSD","dc:creator":"Jason_xiii","category":"General Discussion","description":"<p>Hello Everyone,</p>\n<p>I am putting this out to get feedback on renaming the flagship product Frax to FrxUSD.</p>\n<p>The idea is very simple, to make it easier to differentiate  Frax the stablecoin from Frax Share and to align the names with other stablecoin products ie FrxETH and FrxBTC.</p>\n<p>I believe this will bring more synergy to the overall ecosystem and less confusion.</p>\n<p>Let me know what are your feedbacks and perhaps we can put it for vote.</p>\n            <p><small>16 posts - 7 participants</small></p>\n            <p><a href=\"https://gov.frax.finance/t/rename-frax-the-stablecoin-to-frxusd/3047\">Read full topic</a></p>","link":"https://gov.frax.finance/t/rename-frax-the-stablecoin-to-frxusd/3047","pubDate":"Wed, 08 May 2024 19:06:21 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"gov.frax.finance-topic-3047"},"source":{"@url":"https://gov.frax.finance/t/rename-frax-the-stablecoin-to-frxusd/3047.rss","#text":"Rename Frax the stablecoin to FrxUSD"},"filter":false},{"title":"Private Pools and swaps. Oasis - Frax","dc:creator":"Emrah","category":"Miscellaneous","description":"<p>Hey Frax team. I am Emrah, BD Specialist at Oasis. I am writing to see if you would be interested in having confidentiality through private pools, which can as the title says allow private swaps. Our confidential EVM run-time Oasis Sapphire is in production, and we also have a messaging bridge that can access the features of Sapphire and act as a plug-in to Frax for ease of use for both developers and users.</p>\n<p>Would love to talk more, feel free to book a slot on my calendly: <a href=\"https://calendly.com/emrah-2lw/30min\" class=\"inline-onebox\" rel=\"noopener nofollow ugc\">Calendly - Emrah Bir</a></p>\n            <p><small>1 post - 1 participant</small></p>\n            <p><a href=\"https://gov.frax.finance/t/private-pools-and-swaps-oasis-frax/3045\">Read full topic</a></p>","link":"https://gov.frax.finance/t/private-pools-and-swaps-oasis-frax/3045","pubDate":"Mon, 29 Apr 2024 11:41:50 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"gov.frax.finance-topic-3045"},"source":{"@url":"https://gov.frax.finance/t/private-pools-and-swaps-oasis-frax/3045.rss","#text":"Private Pools and swaps. Oasis - Frax"},"filter":true},{"title":"[FIP - 355, ... ,357] Launching new FXBs and Authorizing Fraxlend AMO for new pairs ( FXB_20251231, FXB_20291231, FXB_20551231)","dc:creator":"amirnader","category":"Governance Proposals","description":"<h2><a name=\"authors-1\" class=\"anchor\" href=\"https://gov.frax.finance#authors-1\"></a>Authors</h2>\n<p>Frax Core Team</p>\n<h1><a name=\"summary-2\" class=\"anchor\" href=\"https://gov.frax.finance#summary-2\"></a>Summary</h1>\n<p>Request authorization for the protocol to issue FXB_20251231, FXB_20291231, and FXB_20551231 with a 30 million cap for each bond. Additionally, authorize Fraxlend AMO to deposit minted FRAX into the specified Fraxlend pairs with the mentioned max authorized allocation.</p>\n<div class=\"md-table\">\n<table>\n<thead>\n<tr>\n<th>Fraxlend Pair Name</th>\n<th>Chain</th>\n<th>Fraxlend Pair Address</th>\n<th>Max Authorized Allocation</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>FXB_20251231/FRAX - Variable Rate V2</td>\n<td>Ethereum, Fraxtal</td>\n<td>TBD</td>\n<td>25,000,000 FRAX</td>\n</tr>\n<tr>\n<td>FXB_20291231/FRAX - Variable Rate V2</td>\n<td>Ethereum, Fraxtal</td>\n<td>TBD</td>\n<td>25,000,000 FRAX</td>\n</tr>\n<tr>\n<td>FXB_20551231/FRAX - Variable Rate V2</td>\n<td>Ethereum, Fraxtal</td>\n<td>TBD</td>\n<td>25,000,000 FRAX</td>\n</tr>\n</tbody>\n</table>\n</div><h1><a name=\"background-and-motivation-3\" class=\"anchor\" href=\"https://gov.frax.finance#background-and-motivation-3\"></a>Background and Motivation</h1>\n<p>FXB tokens are simple, trustless tokens that resemble a zero-coupon bond that converts to the FRAX stablecoin on maturity. FXBs are debt tokens denominated in FRAX stablecoins, not a claim on any other asset or collateral. FXBs allow the formation of a yield curve to price the time value of lending FRAX back to the protocol itself.</p>\n<p>Fraxlend is a lending platform that allows anyone to create a market between a pair of ERC-20 tokens. Each pair is an isolated, permission-less market that allows anyone to create and participate in lending and borrowing activities. This protocol is creating new financial opportunities for the FRAX community.</p>\n<p>Automated Market Operations (AMOs) make FRAX one of the most potent stablecoin protocols, creating maximum flexibility and opportunity without altering the base stability mechanism that made FRAX a leader in the stablecoin space. So far, we have deployed multiple AMOs, including lending AMOs on the Fraxlend, Aave, and Rari protocols.</p>\n<p>Adding new FXBs is beneficial as it expands the FRAX ecosystem’s offerings, enhances liquidity, and provides users with additional tools for managing risk and optimizing investment strategies. Adding more pairs into Fraxlend AMO is the next step in this vision, allowing the protocol to mint FRAX backed by over-collateralized debt.</p>\n<h1><a name=\"voting-4\" class=\"anchor\" href=\"https://gov.frax.finance#voting-4\"></a>Voting</h1>\n<ul>\n<li>\n<p>For: Authorize the issuance of FXBs with a 30 million cap for each bond and authorize Fraxlend AMO to deposit minted FRAX into the specified Fraxlend pairs with the mentioned max authorized allocation.</p>\n</li>\n<li>\n<p>Against: Do nothing.</p>\n</li>\n</ul>\n            <p><small>2 posts - 1 participant</small></p>\n            <p><a href=\"https://gov.frax.finance/t/fip-355-357-launching-new-fxbs-and-authorizing-fraxlend-amo-for-new-pairs-fxb-20251231-fxb-20291231-fxb-20551231/3043\">Read full topic</a></p>","link":"https://gov.frax.finance/t/fip-355-357-launching-new-fxbs-and-authorizing-fraxlend-amo-for-new-pairs-fxb-20251231-fxb-20291231-fxb-20551231/3043","pubDate":"Fri, 26 Apr 2024 19:40:00 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"gov.frax.finance-topic-3043"},"source":{"@url":"https://gov.frax.finance/t/fip-355-357-launching-new-fxbs-and-authorizing-fraxlend-amo-for-new-pairs-fxb-20251231-fxb-20291231-fxb-20551231/3043.rss","#text":"[FIP - 355, ... ,357] Launching new FXBs and Authorizing Fraxlend AMO for new pairs ( FXB_20251231, FXB_20291231, FXB_20551231)"},"filter":false},{"title":"[FIP - 358] Authorize Strategic POL frxETH/ETH L1 Allocation to YieldNest's ynETH 7x booster vault","dc:creator":"DeoBrands","category":"AMOs","description":"<h2><a name=\"authors-1\" class=\"anchor\" href=\"https://gov.frax.finance#authors-1\"></a>Authors</h2>\n<p>YieldNest Core Team</p>\n<h2><a name=\"summary-2\" class=\"anchor\" href=\"https://gov.frax.finance#summary-2\"></a>Summary</h2>\n<p>This proposal advocates for the allocation of Protocol-Owned Liquidity (POL) in frxETH/ETH L1 to the YieldNest <a href=\"https://docs.yieldnest.finance/protocol-design/yieldnests-nlrts-and-lrts/yneth\" rel=\"noopener nofollow ugc\">ynETH</a> (<a href=\"https://docs.yieldnest.finance/security/audits\" rel=\"noopener nofollow ugc\">Audited by Chain Security</a>) 7x boosted vault. YieldNest will create a gnosis-safe multisig wallet where the frxETH/ETH will be received, and the ynETH will be distributed to the original deposit address from FRAX. The objective is to cement and expand the collaboration and alignment between FRAX and YieldNest. YieldNest is offering a 7x boost on <a href=\"https://docs.yieldnest.finance/governance-and-tokenomics/seeds-and-loyalty-program\" rel=\"noopener nofollow ugc\">YieldNest points (seeds)</a> (EPOCH 01) for any ETH transferred to ynETH from FRAX (Standard boost is 5x). All ynETH is also earning ETH staking rewards on top of the boosted seeds. The frxETH/ETH POL is open-ended; it is up to the team/comptroller’s discretion what amount of allocation is given.</p>\n<p>YieldNest is a Liquid Restaking Protocol (LRP) that provides simple-to-understand, risk-adjusted restaking strategies that offer user-controlled, liquid, and risk-adjusted exposure to curated AVS categories. YieldNest aims to build a long-term relationship with FRAX, explore various restaking strategies, and deploy the LRTflywheel on the Fraxtal chain for full integration with the FRAX ecosystem. See below ynETH and ynDeFi as an example AVS category that can be built with the YiledNest protocol. Try <a href=\"https://holesky.yieldnest.finance/\" rel=\"noopener nofollow ugc\">our testnet</a> to experience the protocol.</p>\n<p></p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://global.discourse-cdn.com/standard11/uploads/frax1/original/2X/7/7934c36b9f64bfa40702d002be0b8f42c7658e73.png\" data-download-href=\"/uploads/short-url/hieOLRHBEp2PDCjk3btL709wfyH.png?dl=1\" title=\"\" rel=\"noopener nofollow ugc\"><img src=\"https://global.discourse-cdn.com/standard11/uploads/frax1/optimized/2X/7/7934c36b9f64bfa40702d002be0b8f42c7658e73_2_330x348.png\" alt=\"\" data-base62-sha1=\"hieOLRHBEp2PDCjk3btL709wfyH\" width=\"330\" height=\"348\" role=\"presentation\" srcset=\"https://global.discourse-cdn.com/standard11/uploads/frax1/optimized/2X/7/7934c36b9f64bfa40702d002be0b8f42c7658e73_2_330x348.png, https://global.discourse-cdn.com/standard11/uploads/frax1/optimized/2X/7/7934c36b9f64bfa40702d002be0b8f42c7658e73_2_495x522.png 1.5x, https://global.discourse-cdn.com/standard11/uploads/frax1/optimized/2X/7/7934c36b9f64bfa40702d002be0b8f42c7658e73_2_660x696.png 2x\" data-dominant-color=\"F4F3EF\"></a></div><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://global.discourse-cdn.com/standard11/uploads/frax1/original/2X/3/3c9517c78b3ec7b0ee8b73c39434092f19a33c20.png\" data-download-href=\"/uploads/short-url/8DW4QRkkI1TmlrMddu4BWWXbdMQ.png?dl=1\" title=\"\" rel=\"noopener nofollow ugc\"><img src=\"https://global.discourse-cdn.com/standard11/uploads/frax1/optimized/2X/3/3c9517c78b3ec7b0ee8b73c39434092f19a33c20_2_246x348.png\" alt=\"\" data-base62-sha1=\"8DW4QRkkI1TmlrMddu4BWWXbdMQ\" width=\"246\" height=\"348\" role=\"presentation\" srcset=\"https://global.discourse-cdn.com/standard11/uploads/frax1/optimized/2X/3/3c9517c78b3ec7b0ee8b73c39434092f19a33c20_2_246x348.png, https://global.discourse-cdn.com/standard11/uploads/frax1/optimized/2X/3/3c9517c78b3ec7b0ee8b73c39434092f19a33c20_2_369x522.png 1.5x, https://global.discourse-cdn.com/standard11/uploads/frax1/optimized/2X/3/3c9517c78b3ec7b0ee8b73c39434092f19a33c20_2_492x696.png 2x\" data-dominant-color=\"F5F3EF\"></a></div><p></p>\n<h3><a name=\"proposal-details-3\" class=\"anchor\" href=\"https://gov.frax.finance#proposal-details-3\"></a>Proposal Details:</h3>\n<p>Allocate a portion of FRAX’s POL in frxETH/ETH (YieldNest will create a gnosis-safe multisig wallet where the frxETH/ETH will be received, and the ynETH will be distributed to the original deposit address from FRAX) to be deposited into the YieldNest ynETH vault for an initial period of 3 months. This will leverage the boosted yield opportunities provided by YieldNest’s unique <a href=\"https://docs.yieldnest.finance/governance-and-tokenomics/seeds-and-loyalty-program\" rel=\"noopener nofollow ugc\">seeds program</a> offered to FRAX. In EPOCH 01, during the first seven days, FRAX will get a 7x boost (Standard boost 5x); afterward, FRAX will get the standard two seeds per hour and potential other boosts moving forward.</p>\n<h2><a name=\"background-and-motivation-4\" class=\"anchor\" href=\"https://gov.frax.finance#background-and-motivation-4\"></a>Background and Motivation</h2>\n<p>YieldNest is a Liquid Restaking Protocol (LRP) that provides simple-to-understand, risk-adjusted restaking strategies that offer user-controlled, liquid, and risk-adjusted exposure to curated AVS categories. YieldNest aims to build a long-term relationship with FRAX, explore various restaking strategies, deploy the LRTflywheel on Fraxtal for full integration with the FRAX ecosystem, and develop protocol-specific Active Validated Services (AVSs) to enhance decentralization and increase capital efficiency for the FRAX protocol.</p>\n<p>The strategic allocation to YieldNest’s ynETH vault is in line with FRAX’s objectives to maximize returns on its POL by engaging in collaborative and high-yield strategies. This initiative promises substantial returns across various market conditions and will fortify the partnership between FRAX and YieldNest, enhancing the market positions of both protocols.</p>\n<p><strong>Links:</strong><br>\n<a href=\"https://docs.yieldnest.finance/\" rel=\"noopener nofollow ugc\">YieldNest Doc’s</a><br>\n<a href=\"https://holesky.yieldnest.finance/\" rel=\"noopener nofollow ugc\">YieldNest Testnet<br>\n</a><a href=\"https://docs.yieldnest.finance/security/audits\" rel=\"noopener nofollow ugc\">Security Audits</a><br>\n<img src=\"https://emoji.discourse-cdn.com/twitter/earth_americas.png?v=12\" title=\":earth_americas:\" class=\"emoji only-emoji\" alt=\":earth_americas:\" loading=\"lazy\" width=\"20\" height=\"20\"><a href=\"https://www.yieldnest.finance/\" rel=\"noopener nofollow ugc\"> Website</a><br>\n<img src=\"https://emoji.discourse-cdn.com/twitter/speech_balloon.png?v=12\" title=\":speech_balloon:\" class=\"emoji only-emoji\" alt=\":speech_balloon:\" loading=\"lazy\" width=\"20\" height=\"20\"><a href=\"https://discord.com/invite/ayAZuQgFaE\" rel=\"noopener nofollow ugc\"> Discord</a><br>\n<img src=\"https://emoji.discourse-cdn.com/twitter/mega.png?v=12\" title=\":mega:\" class=\"emoji only-emoji\" alt=\":mega:\" loading=\"lazy\" width=\"20\" height=\"20\"><a href=\"https://t.me/YieldNest\" rel=\"noopener nofollow ugc\"> Telegram</a><br>\n<img src=\"https://emoji.discourse-cdn.com/twitter/bird.png?v=12\" title=\":bird:\" class=\"emoji only-emoji\" alt=\":bird:\" loading=\"lazy\" width=\"20\" height=\"20\"><a href=\"https://twitter.com/YieldNestFi\" rel=\"noopener nofollow ugc\"> Twitter</a></p>\n<h2><a name=\"voting-5\" class=\"anchor\" href=\"https://gov.frax.finance#voting-5\"></a>Voting</h2>\n<p><a href=\"https://gov.frax.finance/t/fip-358-authorize-strategic-pol-frxeth-eth-l1-allocation-to-yieldnests-yneth-7x-booster-vault/3039/1\">Click to view the poll.</a></p>\n            <p><small>3 posts - 2 participants</small></p>\n            <p><a href=\"https://gov.frax.finance/t/fip-358-authorize-strategic-pol-frxeth-eth-l1-allocation-to-yieldnests-yneth-7x-booster-vault/3039\">Read full topic</a></p>","link":"https://gov.frax.finance/t/fip-358-authorize-strategic-pol-frxeth-eth-l1-allocation-to-yieldnests-yneth-7x-booster-vault/3039","pubDate":"Thu, 25 Apr 2024 09:22:47 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"gov.frax.finance-topic-3039"},"source":{"@url":"https://gov.frax.finance/t/fip-358-authorize-strategic-pol-frxeth-eth-l1-allocation-to-yieldnests-yneth-7x-booster-vault/3039.rss","#text":"[FIP - 358] Authorize Strategic POL frxETH/ETH L1 Allocation to YieldNest's ynETH 7x booster vault"},"filter":false},{"title":"Implement Ragequit for Uniswap v3 FRAX/USDC LP","dc:creator":"q23","category":"Gauges","description":"<p>I propose the implementation of a ragequit function for the FRAX/USDC Uniswap v3  liquidity pool to address the needs of community members who wish to re-allocate their capital. This function will provide community members with greater flexibility and freedom in managing their capital while ensuring that the underlying protocol is not exposed to significant risk. The proposal also aims to generate profits for the protocol if passed.</p>\n<p>Two years ago I entered a locked position that continues to yield below inflation APY%. This means that I am losing purchasing power due to inflation and the opportunity cost of capital allocation in this liquidity cycle.</p>\n<p>The proposed solution is a ragequit function that will allow community members to exit their positions in the FRAX/USDC Uniswap v3 liquidity pool with a fee. Should the <a href=\"https://gov.frax.finance/t/standardize-ragequit-proposals-and-make-it-a-feature-and-not-a-bug/3016\">ragequit standard</a> be ratified I will accept these fees.</p>\n<p>Vote</p>\n<p>• For: Implement the ragequit function for the FRAX/USDC Uniswap v3 pool with a standard ragequit exit fee<br>\n• Against: Do Nothing</p>\n            <p><small>17 posts - 4 participants</small></p>\n            <p><a href=\"https://gov.frax.finance/t/implement-ragequit-for-uniswap-v3-frax-usdc-lp/3036\">Read full topic</a></p>","link":"https://gov.frax.finance/t/implement-ragequit-for-uniswap-v3-frax-usdc-lp/3036","pubDate":"Tue, 23 Apr 2024 12:09:11 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"gov.frax.finance-topic-3036"},"source":{"@url":"https://gov.frax.finance/t/implement-ragequit-for-uniswap-v3-frax-usdc-lp/3036.rss","#text":"Implement Ragequit for Uniswap v3 FRAX/USDC LP"},"filter":true},{"title":"[FIP - 354] Add Aave V3 aEthFRAX on Ethereum to the FXS Gauge Controller","dc:creator":"SaucyBlock","category":"Gauges","description":"<h2><a name=\"author-1\" class=\"anchor\" href=\"https://gov.frax.finance#author-1\"></a>Author</h2>\n<p><a class=\"mention\" href=\"https://gov.frax.finance/u/0xlide\">@0xlide</a> - Saucy Block</p>\n<h2><a name=\"summary-2\" class=\"anchor\" href=\"https://gov.frax.finance#summary-2\"></a>Summary</h2>\n<p>Proposal to add Aave V3 aFRAX pools on Ethereum to the FXS gauge controller.</p>\n<h2><a name=\"background-and-motivation-3\" class=\"anchor\" href=\"https://gov.frax.finance#background-and-motivation-3\"></a>Background And Motivation</h2>\n<p>Adding the Aave V3 aEthFRAX pools to the FXS gauge controller on Ethereum is a strategic move by Frax Finance to enhance its liquidity and market presence.</p>\n<h2><a name=\"pool-details-4\" class=\"anchor\" href=\"https://gov.frax.finance#pool-details-4\"></a>Pool Details</h2>\n<p><strong>Aave V3 aFRAX pools on Ethereum:</strong><br>\nAave Pool Address: <a href=\"https://app.aave.com/reserve-overview/?underlyingAsset=0x853d955acef822db058eb8505911ed77f175b99e&amp;marketName=proto_mainnet_v3\" class=\"inline-onebox\" rel=\"noopener nofollow ugc\">Aave - Open Source Liquidity Protocol</a></p>\n<p>Pool/Token: <a href=\"https://etherscan.io/token/0xd4e245848d6E1220DBE62e155d89fa327E43CB06\" rel=\"noopener nofollow ugc\">0xd4e245848d6E1220DBE62e155d89fa327E43CB06</a></p>\n<h2><a name=\"vote-5\" class=\"anchor\" href=\"https://gov.frax.finance#vote-5\"></a>Vote</h2>\n<p>・For: Add Aave V3 aFRAX on Ethereum to the FXS gauge controller<br>\n・Against: Do nothing</p>\n            <p><small>2 posts - 2 participants</small></p>\n            <p><a href=\"https://gov.frax.finance/t/fip-354-add-aave-v3-aethfrax-on-ethereum-to-the-fxs-gauge-controller/3033\">Read full topic</a></p>","link":"https://gov.frax.finance/t/fip-354-add-aave-v3-aethfrax-on-ethereum-to-the-fxs-gauge-controller/3033","pubDate":"Mon, 22 Apr 2024 04:35:33 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"gov.frax.finance-topic-3033"},"source":{"@url":"https://gov.frax.finance/t/fip-354-add-aave-v3-aethfrax-on-ethereum-to-the-fxs-gauge-controller/3033.rss","#text":"[FIP - 354] Add Aave V3 aEthFRAX on Ethereum to the FXS Gauge Controller"},"filter":true},{"title":"Frax Analytics Proposal","dc:creator":"DODO","category":"Governance Proposals","description":"<p>Hey,</p>\n<p>I work with PYOR, a blockchain analytics firm backed by Coinbase and Castle Island Ventures. We have worked with protocols like Compound, Tezos, Quickswap, and ICP to build custom analytics dashboards and research reports.</p>\n<p>We have worked very closely with the foundation/community to cater to their data needs, as we’ve realized that there is no one-size-fits-all solution, it varies based on the protocol’s stage and needs.</p>\n<p>Wanted to check with the Frax community/foundation to understand what metrics/data points you track or would like to track, so we can build dashboards/reports that cover these metrics. Happy to share our past work as well so you can gauge our capabilities.</p>\n<p>Cheers,</p>\n            <p><small>4 posts - 2 participants</small></p>\n            <p><a href=\"https://gov.frax.finance/t/frax-analytics-proposal/3031\">Read full topic</a></p>","link":"https://gov.frax.finance/t/frax-analytics-proposal/3031","pubDate":"Wed, 17 Apr 2024 11:17:50 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"gov.frax.finance-topic-3031"},"source":{"@url":"https://gov.frax.finance/t/frax-analytics-proposal/3031.rss","#text":"Frax Analytics Proposal"},"filter":false},{"title":"[Temp Check] Proposal to integrate thirdparty solutions into Frax DeFi directly","dc:creator":"Sharkysnakefish","category":"General Discussion","description":"<p>Background:<br>\nDuring the proposal to standardize ragequiting, it became obvious that there already are third-party solutions that might be an attractive option for users. In the ethos of Frax being positive-sum, I propose that we help projects that builds solutions on-top of our products to be integrated or featured directly on the relevant Frax-app site. This proposal was made to outline who can be eligible, in what way they can be integrated or informed about and lastly what information should be given to the users and in what way.</p>\n<p>Solve:</p>\n<ul>\n<li>Helps grow the Frax ecosystem</li>\n<li>Shows in action Frax is positive sum</li>\n<li>Can help Frax grow TVL</li>\n<li>Users become more aware of their options</li>\n</ul>\n<p>Proposal 1:<br>\nInform/market directly on the relevant product pages of third-party solutions, so that users can see they have more options. Include a disclaimer that third-party option can have more risk.</p>\n<p>Pros: Easy to implement<br>\nCons: Less alignment with other protocols and do not help in the same degree.</p>\n<p>Proposal 2:<br>\nDirectly integrate third-party solutions into the relevant product pages, strictly as a opt-in option. Each new project that wants to be integrated has to have a proposal with a discussion-phase where they answer out all requirements. Failure to fulfil all requirements leads to automatic disqualification.</p>\n<p>Requirements needed to be fulfilled to qualify for implementation:</p>\n<ul>\n<li>It has to be relevant for the product site it wants to be integrated with.</li>\n<li>Protocol has to be over 2 years old.</li>\n<li>Core members of the protocol should be doxxed (At the minimum to our core team).</li>\n<li>They have audits for all contract upgrades/changes.</li>\n<li>A fee will be taken by the Frax protocol and put into a security fund in case of hacks. This fund will only be used towards users using the directly integrated solution, as a extra security. There is also an expectation that every protocol integrated have a plan in case a hack should happen, and already now take steps to mitigate damage. The fee taken has to reflect the protocols risk and economics. The fee % will be decided on a per-integration basis, and will be a crucial part of the integration proposal and discussion per project proposal.</li>\n<li>There has to be ELI5 explanations made by the protocol on how their system works, with clear pros and cons given to the user. Risks must also be made clear.</li>\n</ul>\n<p>Pros: Stronger alignment with protocols eligible. Helping them is helping ourself.<br>\nCons: Hard to implement. Requires a lot of work and maintenance. More governance proposals.</p>\n<p>Proposal 3:<br>\nCombine the two proposals. For projects unable to fulfil the requirements of proposal 2, will be showcased as proposed in proposal 1.</p>\n<p>Pros: Maximum alignment and cooperation with other protocols.<br>\nCons: Even harder to implement and maintain.</p>\n<p>TEMP CHECK: Integrate third-party solutions into Frax DeFi</p>\n<p><a href=\"https://gov.frax.finance/t/temp-check-proposal-to-integrate-thirdparty-solutions-into-frax-defi-directly/3028/1\">Click to view the poll.</a></p>\n            <p><small>4 posts - 3 participants</small></p>\n            <p><a href=\"https://gov.frax.finance/t/temp-check-proposal-to-integrate-thirdparty-solutions-into-frax-defi-directly/3028\">Read full topic</a></p>","link":"https://gov.frax.finance/t/temp-check-proposal-to-integrate-thirdparty-solutions-into-frax-defi-directly/3028","pubDate":"Tue, 16 Apr 2024 15:52:15 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"gov.frax.finance-topic-3028"},"source":{"@url":"https://gov.frax.finance/t/temp-check-proposal-to-integrate-thirdparty-solutions-into-frax-defi-directly/3028.rss","#text":"[Temp Check] Proposal to integrate thirdparty solutions into Frax DeFi directly"},"filter":false},{"title":"[FIP - 352] Authorize lending AMO for new pairs on Morpho Blue ( sUSDe/FRAX, USDe/FRAX )","dc:creator":"amirnader","category":"AMOs","description":"<h3><a name=\"authors-1\" class=\"anchor\" href=\"https://gov.frax.finance#authors-1\"></a>Authors</h3>\n<p>Frax Core Team</p>\n<h2><a name=\"summary-2\" class=\"anchor\" href=\"https://gov.frax.finance#summary-2\"></a>Summary</h2>\n<p>This proposal is to onboard and activate an AMO that lends FRAX to <a href=\"https://morpho.org/\">Morpho</a> Blue. Authorize lending AMO to deposit minted FRAX into the following Morpho Blue pairs with the mentioned max authorized allocation.</p>\n<div class=\"md-table\">\n<table>\n<thead>\n<tr>\n<th>Asset</th>\n<th>Collaterals</th>\n<th>Max Authorized Allocation</th>\n<th>Lending Market</th>\n<th>Risk Manager</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>FRAX</td>\n<td>sUSDe, USDe</td>\n<td>200,000,000 FRAX</td>\n<td>Morpho Blue / MetaMorpho</td>\n<td><a href=\"https://www.re7.capital/\">Re7</a> and TBD</td>\n</tr>\n</tbody>\n</table>\n</div><h2><a name=\"background-and-motivation-3\" class=\"anchor\" href=\"https://gov.frax.finance#background-and-motivation-3\"></a>Background and Motivation</h2>\n<p>Morpho Blue is a decentralized protocol that facilitates overcollateralized lending and borrowing crypto assets (ERC20 Tokens) on the Ethereum Virtual Machine. The protocol, designed as an immutable smart contract, serves as a trustless base layer for lenders, borrowers, and applications, with risk management layers provided by <a href=\"https://docs.morpho.org/concepts/morpho-blue/core-concepts/externalized-risk-management\">MetaMorpho</a>.</p>\n<p>Re7 Labs, specializing in DeFi R&amp;D and liquid crypto investment strategies, and other firms (to be determined) are collaborating with Morpho Blue to provide risk management services through the MetaMorpho vault system, enhancing risk management and lending vault capabilities.</p>\n<p>Algorithmic Market Operations (AMOs) make FRAX one of the most potent stablecoin protocols, creating maximum flexibility and opportunity without altering the base stability mechanism that made FRAX a leader in the stablecoin space. So far, we have deployed multiple AMOs, including lending AMOs on the Fraxlend, Aave, and Gearbox protocols.</p>\n<h2><a name=\"proposal-details-4\" class=\"anchor\" href=\"https://gov.frax.finance#proposal-details-4\"></a>Proposal Details</h2>\n<p>This proposal involves minting FRAX and depositing it into designated MetaMorpho Vaults that exclusively use sUSDe and USDe as collateral assets. The maximum authorized allocation for this action is set at 200 million FRAX. Frax AMO will initiate this process by allocating FRAX into the Re7 Vault within MetaMorpho, starting the integration of FRAX into Morpho Blue’s lending markets. This strategic allocation aims to enhance liquidity and utility for FRAX within the Morpho Blue ecosystem while leveraging Re7 Labs and other future risk management firms’ capabilities within the MetaMorpho vault system.</p>\n<p>This integration will expose FRAX to the high demand for borrowing against sUSDe and USDe within Morpho Blue’s lending markets, thereby increasing Frax’s market share and further solidifying its position as a leading stablecoin protocol.</p>\n<h2><a name=\"voting-5\" class=\"anchor\" href=\"https://gov.frax.finance#voting-5\"></a>Voting</h2>\n<ul>\n<li>\n<p>For: Authorize the Lending AMO to deposit minted FRAX into the Morpho Blue pairs through MetaMorpho Vaults with the max authorized allocation mentioned.</p>\n</li>\n<li>\n<p>Against: Do nothing.</p>\n</li>\n</ul>\n            <p><small>7 posts - 3 participants</small></p>\n            <p><a href=\"https://gov.frax.finance/t/fip-352-authorize-lending-amo-for-new-pairs-on-morpho-blue-susde-frax-usde-frax/3026\">Read full topic</a></p>","link":"https://gov.frax.finance/t/fip-352-authorize-lending-amo-for-new-pairs-on-morpho-blue-susde-frax-usde-frax/3026","pubDate":"Mon, 15 Apr 2024 03:55:14 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"gov.frax.finance-topic-3026"},"source":{"@url":"https://gov.frax.finance/t/fip-352-authorize-lending-amo-for-new-pairs-on-morpho-blue-susde-frax-usde-frax/3026.rss","#text":"[FIP - 352] Authorize lending AMO for new pairs on Morpho Blue ( sUSDe/FRAX, USDe/FRAX )"},"filter":false}]}}}