{"rss":{"@version":"2.0","@xmlns:discourse":"http://www.discourse.org/","@xmlns:atom":"http://www.w3.org/2005/Atom","@xmlns:dc":"http://purl.org/dc/elements/1.1/","channel":{"title":"Lido Governance - Latest topics","link":"https://research.lido.fi/latest","description":"Latest topics","lastBuildDate":"Thu, 20 Jun 2024 19:18:12 +0000","atom:link":{"@href":"https://research.lido.fi/latest.rss","@rel":"self","@type":"application/rss+xml"},"item":[{"title":"Discussion: The Decentralized Validator Vault","dc:creator":"KimonSh","category":"General","description":"<p>This post serves as a forum to discuss a potential strategy that could be implemented to increase the pace of adoption of Distributed Validators via the Simple DVT Module by utilizing incentives from DVT Infrastructure providers. Given the timelines of other parties that will potentially be involved, if the Vault moves forward, it is expected that the implementation will occur in an expedited manner.</p>\n<h2><a name=\"background-1\" class=\"anchor\" href=\"https://research.lido.fi#background-1\"></a>Background</h2>\n<p>In light of the <a href=\"https://research.lido.fi/t/regoose-updated-goals-for-lido-in-the-light-of-mvi-and-restaking/7462\">recently updated ReGOOSE goals</a> and as mentioned in the <a href=\"https://research.lido.fi/t/proposal-expanding-the-simple-dvt-module/7549\">Simple DVT Expansion proposal</a>, research has been underway in regards to a strategy that could be used to increase the decentralization of the Lido Node Operator set and by leveraging the addition of DVT based validators from Obol &amp; SSV Network.</p>\n<p>Since SSV Network’s mainnet launch, the protocol has seen significant success, partially boosted by its mainnet incentives program. Currently, SSV Network has 24,992 active validators representing over $2.8B of ETH staked, all of which are eligible to receive SSV token incentives.</p>\n<p>In the coming weeks, the Obol team plans to announce a contributions program in conjunction with their <a href=\"https://blog.obol.tech/1-percent-for-decentralisation/\">1% for Decentralization retroactive funding initiative</a>. Stake that is deployed on Obol DVs will contribute 1% of their staking rewards to the retroactive fund. The expectation for Liquid Staking Protocols is that potential future Obol incentives will be allocated to stakers by taking into account the contributions made on the relevant staking platform.</p>\n<p>Within Lido Simple DVT, <a href=\"https://research.lido.fi/t/staking-router-module-proposal-simple-dvt/5625/41\">Obol clusters</a> are about to start the process of scaling their validators while the <a href=\"https://research.lido.fi/t/staking-router-module-proposal-simple-dvt/5625/38\">first SSV Network clusters</a> are expected to go live in the coming weeks, with scaling to follow soon after.</p>\n<p>The Snapshot vote for Expanding the Simple DVT Module <a href=\"https://snapshot.org/#/lido-snapshot.eth/proposal/0xaca2da3c932542e030db8bf5b6e4420bf4aa98bd57bd62b9b8008a4b7398abb2\">successfully passed through governance</a>, and an on-chain Aragon vote to raise the share limit of the module to 4% is expected in the next two weeks. This proposal has also greenlit the creation of Super Simple DVT clusters, that would allow for quicker scaling of both Obol- and SSV-based DVT clusters via the Simple DVT Module over the next two months.</p>\n<h2><a name=\"proposal-2\" class=\"anchor\" href=\"https://research.lido.fi#proposal-2\"></a>Proposal</h2>\n<p>Given the additional capacity soon to be available within the Simple DVT Module, the upcoming launch of Obol’s contributions program, and recent revamp of SSV’s incentive program, an opportunity has been presented that can 1. Quicken the adoption pace of DVT via the Simple DVT module, leading to a more <a href=\"https://research.lido.fi/t/proposal-expanding-the-simple-dvt-module/7549/9\">secure, resilient, and decentralized</a> Node Operator set and 2. Drive net-new deposits to the protocol.</p>\n<p>One way to manage the process is to use some intermediary “vault” solution to serve as a focal point for both user deposits and DVT provider incentives.</p>\n<p>The vault strategy would offer capital allocators (stakers) the ability to deposit ETH or WETH into what would be called the Decentralized Validator Vault. This (W)ETH would be staked via Lido, with stakers earning the normal staking rewards from the protocol. 90% of the incentives generated via the Lido protocol Obol &amp; SSV Network validators could be allocated to depositors of the vault, with the remaining 10% allocated to the Node Operators in their corresponding SSV &amp; Obol Simple DVT clusters.</p>\n<h2><a name=\"why-do-this-3\" class=\"anchor\" href=\"https://research.lido.fi#why-do-this-3\"></a>Why Do This?</h2>\n<p>The combination of the expansion of the Simple DVT Module, the launch of Obol’s contribution program, and re-work of SSV’s incentive program presents an opportunity for the DAO to increase the resilience of the Lido Node Operator set via DVT, drive a material amount of net-new deposits into the protocol, and offer capital allocators access to incentives that they otherwise would not receive (as SSV &amp; Obol incentives are based on running validators).</p>\n<p>With the Simple DVT Module expanded to 4%, there will be capacity for 11,868 validators evenly split between Obol and SSV over the coming months. Excluding the 60 active validators running through Simple DVT currently, this suggests capacity for an incremental 377,856 ETH of deposits into the protocol to fill the capacity of the Simple DVT Module.</p>\n<h2><a name=\"vault-mechanics-4\" class=\"anchor\" href=\"https://research.lido.fi#vault-mechanics-4\"></a>Vault Mechanics</h2>\n<h3><a name=\"structure-5\" class=\"anchor\" href=\"https://research.lido.fi#structure-5\"></a>Structure</h3>\n<p>The vault could be introduced and curated by a DeFi protocol, integrating functionality to drive deposits to the Lido protocol and the ability to show monthly snapshots of the allocated points to individual stakers utilizing the vault.</p>\n<p>The capacity of the vault would be controlled via the administrator of the vault (depending on the vault design), reflecting the current depositable capacity of the Simple DVT Module, with an up to 10% additional buffer. These parameter changes would reflect when key limits of clusters within the Simple DVT Module are raised, as explained in the <a href=\"https://research.lido.fi/t/staking-router-module-proposal-simple-dvt/5625/1\">Simple DVT Proposal</a> and <a href=\"https://research.lido.fi/t/proposal-expanding-the-simple-dvt-module/7549/7\">Expansion Proposal</a>.</p>\n<h4><a name=\"incentives-eligibility-6\" class=\"anchor\" href=\"https://research.lido.fi#incentives-eligibility-6\"></a>Incentives Eligibility</h4>\n<p>Similar to the current <a href=\"https://research.lido.fi/t/rewards-share-program-2024/6812\">rewards share program</a>, and in order to dissuade possibly deleterious effects to the protocol due to farming incentives, it is suggested that analysis be conducted on vault depositors. In order to be eligible to receive full vault incentives for the capital provided, depositors must:</p>\n<ol>\n<li>\n<p>Hold a position for a minimum of 3 days in the vault through the conclusion of the Snapshot period.</p>\n</li>\n<li>\n<p>Not unstake existing stETH or wstETH that is then re-staked via the vault from the moment of vault launch. The incentives are calculated on the base of ETH deposited to and persisting within the vault during the relevant snapshot period minus any stETH withdrawn after the launch of the vault.</p>\n</li>\n<li>\n<p>Not sell existing stETH on DEXs/CEXs: this condition does not expel a depositor from all incentives, but reduce corresponding amount of capital provided by the volume of sold ETH. Similar to the above, the incentives would be calculated on the base of non-swapped ETH deposited to and persisting within the vault during the relevant snapshot period.</p>\n</li>\n</ol>\n<h2><a name=\"summary-7\" class=\"anchor\" href=\"https://research.lido.fi#summary-7\"></a>Summary</h2>\n<p>With the expansion of the Simple DVT module imminent, it is an opportune time to consider utilizing both Obol and SSV’s mainnet contributions and incentivization programs to quicken the pace of DVT based validators being added to the protocol.</p>\n<p>This strategy would allow for a faster flow of Simple DVT validators being activated, for capital allocators to access DVT provider incentives, and most importantly, hasten the pace that DVT is rolled out across the expanded Simple DVT Module.</p>\n<p>Parties interested in providing the infrastructure required for such a DVT vault are asked to respond to this post, noting that there is an expedited timeline due to the estimated launch of DVT provider incentive programs.</p>\n<p>As a member of the Lido Alliance with relevant infrastructure capabilities, the Mellow team has been made aware of this discussion post and asked to provide a public showing of interest if they believe they are capable of providing a solution that would cover the above listed requirements. However, this does not preclude another party from expressing interest.</p>\n            <p><small>3 posts - 3 participants</small></p>\n            <p><a href=\"https://research.lido.fi/t/discussion-the-decentralized-validator-vault/7729\">Read full topic</a></p>","link":"https://research.lido.fi/t/discussion-the-decentralized-validator-vault/7729","pubDate":"Thu, 20 Jun 2024 19:18:12 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"research.lido.fi-topic-7729"},"source":{"@url":"https://research.lido.fi/t/discussion-the-decentralized-validator-vault/7729.rss","#text":"Discussion: The Decentralized Validator Vault"},"filter":false},{"title":"RockLogic Monthly Notes - 06/2024","dc:creator":"Vithya","category":"Node Operators","description":"<p>Dear Lido Community,</p>\n<p>Welcome to our monthly news, where we provide you with updates on our efforts to establish a secure Ethereum environment. Here’s a summary of notable developments since our last update.</p>\n<h2><a name=\"implementation-of-centralized-log-management-system-1\" class=\"anchor\" href=\"https://research.lido.fi#implementation-of-centralized-log-management-system-1\"></a>Implementation of Centralized Log Management System:</h2>\n<p>Enhanced log collection, storage, and analysis capabilities to improve operational insights.</p>\n<p>Advancements &amp; Result:</p>\n<ul>\n<li>Implemented a centralized log management solution for efficient collection and storage of logs from various sources across the infrastructure.</li>\n<li>Enabled advanced search and filtering capabilities, empowering faster troubleshooting and root cause analysis of incidents.</li>\n</ul>\n<h2><a name=\"lido-testnet-stereum-support-2\" class=\"anchor\" href=\"https://research.lido.fi#lido-testnet-stereum-support-2\"></a>Lido Testnet: Stereum Support</h2>\n<p>Ongoing support for Stereum on Lido Testnet environment.</p>\n<p>Advancements &amp; Result:</p>\n<ul>\n<li>Monitored and maintained node health to ensure optimal testnet performance.</li>\n<li>Provided technical assistance and troubleshooting support for participants using the Stereum.</li>\n</ul>\n<p>Next Steps:</p>\n<ul>\n<li>Continue to monitor and optimize the Stereum testnet environment to ensure a seamless user experience.</li>\n</ul>\n<h2><a name=\"lighthouse-memory-issues-investigation-3\" class=\"anchor\" href=\"https://research.lido.fi#lighthouse-memory-issues-investigation-3\"></a>Lighthouse Memory Issues Investigation</h2>\n<p>Troubleshooting memory exhaustion on Lighthouse instances.</p>\n<p>Advancements &amp; Result:</p>\n<ul>\n<li>Identified instances of Lighthouse experiencing crashes due to running out of memory.</li>\n</ul>\n<p>Next Steps:</p>\n<ul>\n<li>Conducting in-depth analysis to determine root cause and implement mitigation strategies.</li>\n</ul>\n<h2><a name=\"beacon-node-load-optimization-4\" class=\"anchor\" href=\"https://research.lido.fi#beacon-node-load-optimization-4\"></a>Beacon Node Load Optimization</h2>\n<p>Adjusted validator client connections to reduce load on beacon nodes.</p>\n<p>Advancements &amp; Result:</p>\n<ul>\n<li>Identified excessive validator client connections as a contributing factor to high beacon node load.</li>\n<li>Successfully redistributed validator clients across beacon nodes to achieve a more balanced load distribution.</li>\n</ul>\n<p>Next Steps:</p>\n<ul>\n<li>Monitoring beacon node performance and adjusting validator client connections as needed to maintain optimal load levels.</li>\n</ul>\n<h2><a name=\"lido-general-5\" class=\"anchor\" href=\"https://research.lido.fi#lido-general-5\"></a>Lido General</h2>\n<p>Maintain optimal node performance and security through proactive maintenance and troubleshooting.</p>\n<p>Advancements &amp; Results:</p>\n<ul>\n<li>Completed scheduled node and operating system upgrades to ensure compatibility and security.</li>\n<li>Investigated and resolved any reported issues, leading to improved performance and reliability.</li>\n</ul>\n<p>Next Steps:</p>\n<ul>\n<li>Continue regular monitoring of node services to proactively identify and address potential issues.</li>\n</ul>\n<p>Best Regards,<br>\nRockLogic Team</p>\n            <p><small>1 post - 1 participant</small></p>\n            <p><a href=\"https://research.lido.fi/t/rocklogic-monthly-notes-06-2024/7725\">Read full topic</a></p>","link":"https://research.lido.fi/t/rocklogic-monthly-notes-06-2024/7725","pubDate":"Thu, 20 Jun 2024 07:23:15 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"research.lido.fi-topic-7725"},"source":{"@url":"https://research.lido.fi/t/rocklogic-monthly-notes-06-2024/7725.rss","#text":"RockLogic Monthly Notes - 06/2024"},"filter":false},{"title":"Proposal: Onboard Bolt to the Lido Alliance","dc:creator":"Chainbound","category":"Alliance","description":"<h1><a name=\"bolt-mev-boost-compatible-proposer-commitments-enabling-trustless-preconfirmations-1\" class=\"anchor\" href=\"https://research.lido.fi#bolt-mev-boost-compatible-proposer-commitments-enabling-trustless-preconfirmations-1\"></a>BOLT: MEV-boost Compatible Proposer-Commitments Enabling Trustless Preconfirmations</h1>\n<h2><a name=\"proposal-2\" class=\"anchor\" href=\"https://research.lido.fi#proposal-2\"></a>Proposal</h2>\n<ul>\n<li>Bolt allows proposers to make <strong>credible commitments,</strong> starting from preconfirmations. This new feature enhances network censorship resistance and user experience, aiming to increase Ethereum usage.</li>\n<li>Bolt will be <strong>open-source</strong> and <strong>PBS compatible</strong>, with permissionless access on both the demand and supply side. Most importantly, it will be <strong>trustless</strong>, primarily <strong>relying on staked</strong> capital as economic collateral for commitments.</li>\n<li>Bolt protocol is built by Chainbound, a <strong>research and development organization</strong> specializing in optimized infrastructure and networking solutions on Ethereum.</li>\n<li><strong>Chainbound is proposing to consider Bolt for the Lido Alliance.</strong> The team believes that the software aligns with Lido’s values and requirements. In addition, the Alliance will support the bootstrapping stages of the new primitive enabled by Bolt, retaining the vision and alignment with Ethereum, Lido, and the community.</li>\n</ul>\n<h2><a name=\"protocol-overview-3\" class=\"anchor\" href=\"https://research.lido.fi#protocol-overview-3\"></a>Protocol Overview</h2>\n<p>Bolt Protocol enables Ethereum block proposers to provide credible commitments about their block contents. The system aims to improve Ethereum’s UX and censorship resistance by unlocking new primitives such as preconfirmations and inclusion lists. Ultimately, this will increase block-space value and yield for stakers, resulting in a more resilient Ethereum.</p>\n<p>Bolt is implemented out-of-protocol, leveraging staked collateral for economic assurances. It is compatible with the existing block production pipeline, making it easy to integrate with existing systems.</p>\n<p>Bolt will come to market via the phased approach outlined below:</p>\n<p></p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://europe1.discourse-cdn.com/business20/uploads/lido/original/2X/f/f8a2f87fa2c177aa44595c5dabb5517460928464.png\" data-download-href=\"/uploads/short-url/ztxzHiDjfCxENdv8yX6EvfEPmGo.png?dl=1\" title=\"Untitled (1)\" rel=\"noopener nofollow ugc\"><img src=\"https://europe1.discourse-cdn.com/business20/uploads/lido/optimized/2X/f/f8a2f87fa2c177aa44595c5dabb5517460928464_2_690x317.png\" alt=\"Untitled (1)\" data-base62-sha1=\"ztxzHiDjfCxENdv8yX6EvfEPmGo\" width=\"690\" height=\"317\" srcset=\"https://europe1.discourse-cdn.com/business20/uploads/lido/optimized/2X/f/f8a2f87fa2c177aa44595c5dabb5517460928464_2_690x317.png, https://europe1.discourse-cdn.com/business20/uploads/lido/optimized/2X/f/f8a2f87fa2c177aa44595c5dabb5517460928464_2_1035x475.png 1.5x, https://europe1.discourse-cdn.com/business20/uploads/lido/optimized/2X/f/f8a2f87fa2c177aa44595c5dabb5517460928464_2_1380x634.png 2x\" data-dominant-color=\"F5F5F4\"></a></div><p></p>\n<p><strong>Bolt Design Principles:</strong></p>\n<ol>\n<li><strong>Trust-minimized</strong>: No new trusted entities are introduced. Commitments are backed by economic assurances, not by trusted intermediaries.</li>\n<li><strong>Credible</strong>: Because Bolt is proposer-centric, they can be fully held accountable for their commitments. In case of breaches, proposers can be penalized, which ensures the credibility of the commitments.</li>\n<li><strong>Permissionless</strong>: Any proposer can opt-in to the protocol, and any user can request commitments from them. No central authority is needed.</li>\n<li><strong>Compatible</strong>: Bolt is designed to be compatible with the existing PBS pipeline, and eventually ePBS. From the proposer’s perspective, the only change needed is an additional sidecar.</li>\n</ol>\n<p><strong>Guided by these principles, we believe Bolt is an effective preconf solution for Lido Node Operators and Ethereum as a whole.</strong></p>\n<p><strong>For Ethereum:</strong></p>\n<ol>\n<li><strong>Bolt accelerates Ethereum’s roadmap</strong> towards stronger censorship resistance properties (Inclusion Lists, PEPC), de-fragmentation (based sequencing), and fast UX (preconfs), without relying on trusted intermediaries.</li>\n<li>Bolt’s <strong>permissionless nature makes it unopinionated</strong> in the current relay and builder market competition. Having an opinionated solution that could potentially favor specific relays or builders is fundamentally unhealthy for Ethereum.</li>\n<li>Bolt’s <strong>proposer-centric credibility</strong> ensures Ethereum does not increase its reliance on trusted entities within the block-production pipeline. This is important so as not to add to existing centralizing pressures.</li>\n</ol>\n<p><strong>For Lido Node Operators:</strong></p>\n<ol>\n<li><strong>Bolt is economical and easy to integrate for node operators.</strong> Bolt is implemented out-of-protocol and is compatible with the existing block production pipeline.</li>\n<li><strong>Bolt is expressive and future-proof.</strong> Bolt is designed to cover multiple block-space use-cases, while also remaining compatible with the potential transition towards ePBS.</li>\n<li><strong>Bolt is fault-tolerant.</strong> Bolt has an embedded fallback block building mechanism as a last resort to ensure that relays and builders aren’t critical to the proposers’ operation.</li>\n<li><strong>Validators do not need to rely on trusted relationships</strong> to make commitments to further monetize their blockspace.</li>\n</ol>\n<h2><a name=\"bolt-v1-4\" class=\"anchor\" href=\"https://research.lido.fi#bolt-v1-4\"></a>Bolt V1</h2>\n<p>Bolt V1 will support inclusion preconfirmations. Inclusion preconfirmations are commitments about the inclusion in a certain slot.</p>\n<p><strong>Architecture</strong></p>\n<p>By default, the software stack for proposers will be extended with a new component called <code>bolt-sidecar</code> that implements the default <code>builder-API</code>. The <code>bolt-sidecar</code> will serve like a proxy for the modified <code>mev-boost</code> client, which implements the <code>constraints-API</code>. Users interact with the <code>bolt-sidecar</code>, turning commitments into constraints and communicating them to the PBS pipeline through the <code>constraints-API</code></p>\n<p><strong>Component Table</strong></p>\n<div class=\"md-table\">\n<table>\n<thead>\n<tr>\n<th>Component</th>\n<th>Placement</th>\n<th>Description</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>Bolt RPC</td>\n<td>Off-chain</td>\n<td>RPC proxy server that propagates preconfirmation requests to opted-in proposers in the lookahead</td>\n</tr>\n<tr>\n<td>Bolt sidecar</td>\n<td>Off-chain</td>\n<td>The entrypoint for Bolt. Implements the <code>commitments-API</code> and turns commitments into constraints</td>\n</tr>\n<tr>\n<td>MEV-Boost</td>\n<td>Off-chain</td>\n<td>Modified MEV-Boost client that implements the <code>constraints-API</code> and verifies constraint proofs</td>\n</tr>\n<tr>\n<td>Registry</td>\n<td>On-chain</td>\n<td>The registry smart contract that keeps track of the opted-in proposer set and their associated stake</td>\n</tr>\n</tbody>\n</table>\n</div><p><strong>Proposer Software Stack</strong></p>\n<p><img src=\"https://europe1.discourse-cdn.com/business20/uploads/lido/original/2X/9/9aa819a7eb08b59bd6806d7693e7904fd5505709.png\" alt=\"Untitled (3)\" data-base62-sha1=\"m49GnoFKKIiffNRCITUGpQoGSCd\" width=\"478\" height=\"449\"></p>\n<h3><a name=\"bolt-sidecar-5\" class=\"anchor\" href=\"https://research.lido.fi#bolt-sidecar-5\"></a><code>bolt-sidecar</code></h3>\n<p>The Bolt sidecar is the off-chain entrypoint for Bolt. To enable it, proposers must point their beacon node <code>builder-api</code> to the sidecar’s endpoint. From the perspective of the beacon node, the sidecar will look like a regular external block builder.</p>\n<p>The sidecar is responsible for the following tasks:</p>\n<ul>\n<li>Receiving &amp; validating commitment requests from users through the <code>commitments-API</code></li>\n<li>Turning commitments into constraints and communicating them downstream</li>\n<li>Proposing a safe fallback block in case of any faults</li>\n</ul>\n<h3><a name=\"modified-mev-boost-6\" class=\"anchor\" href=\"https://research.lido.fi#modified-mev-boost-6\"></a>Modified <code>mev-boost</code></h3>\n<p>The modified <code>mev-boost</code> client will implement the <code>constraints-API</code> and verify those constraints against incoming builder bids, which will have proofs attached. For more information on how proofs and verification will work, see the <a href=\"https://chainbound.github.io/bolt-docs/security/proofs\" rel=\"noopener nofollow ugc\">proofs</a> section.</p>\n<h3><a name=\"registry-7\" class=\"anchor\" href=\"https://research.lido.fi#registry-7\"></a>Registry</h3>\n<p>The Bolt Registry is the smart contract that keeps track of opted-in proposers and their associated stake. The responsibilities of the registry include:</p>\n<ul>\n<li>Registering new proposers via an EOA, verifying their authenticity cryptographically (see the unfinalized <a href=\"https://chainbound.github.io/bolt-docs/architecture#opt-in-procedure-for-proposers\" rel=\"noopener nofollow ugc\">opt-in procedure</a> below)</li>\n<li>Accounting for the proposer’s stake/collateral, potentially including restaked capital</li>\n<li>Removing proposers that no longer wish to participate in Bolt (with a cooldown period)</li>\n<li>Providing read access to the proposer set (useful for the Bolt RPC and Challenger components)</li>\n</ul>\n<h3><a name=\"bolt-rpc-8\" class=\"anchor\" href=\"https://research.lido.fi#bolt-rpc-8\"></a>Bolt RPC</h3>\n<p>The Bolt RPC will be a public RPC endpoint that will proxy requests from users to opted in proposers according to the lookahead and provide additional functionality like DoS protection and rate limiting. The Bolt RPC will be a separate process from the proposer, and anyone can run one. Proposers can configure the Bolt sidecar to point to their preferred Bolt RPC</p>\n<p>Please refer to our <a href=\"https://chainbound.github.io/bolt-docs/\" rel=\"noopener nofollow ugc\">technical documentation</a> for more details about Bolt’s architecture, commitment types, use cases, and more!</p>\n<h3><a name=\"delegation-9\" class=\"anchor\" href=\"https://research.lido.fi#delegation-9\"></a>Delegation</h3>\n<p>Bolt’s architecture allows proposers to delegate the task of providing commitments to a trusted third party. This can be achieved by signing a permit message that allows the third party to submit commitments on their behalf. They then have to point their <code>builder-API</code> to the third party’s <code>bolt-sidecar</code> endpoint.</p>\n<p>We defer to individual validators, larger node operators, and staking pools on their own policies towards delegation. For example, the allowance of delegation can be addressed within Lido’s <a href=\"https://hackmd.io/No2SULzlSVytoWOJ2Wqa7g?view\" rel=\"noopener nofollow ugc\">Ethereum Block Proposer Reward Policy.</a> It should be noted that delegation leads to a fully trusted relationship. If the operator commits a fault, the proposerr will get penalized.</p>\n<h3><a name=\"onboarding-process-10\" class=\"anchor\" href=\"https://research.lido.fi#onboarding-process-10\"></a>Onboarding Process</h3>\n<p>The onboarding process requires proposers to opt-into the Bolt protocol. This has two parts:</p>\n<ol>\n<li>\n<p><strong>Off-chain Validator signature Authentication</strong></p>\n<p>Validators need a signature to validate preconfirmation requests. The exact authentication method is still an open research topic, but <strong>Bolt plans to support a variety of signing methods, such as the Commit Boost signing manager.</strong> Proposers, and their respective key managers, will interact with a commit-boost’s signing manager and proxy key scheme to both authorize respective validators and authenticate commitments.</p>\n</li>\n<li>\n<p><strong>Opt-in Procedure</strong></p>\n<p>Once registered, proposers must post some form of collateral to guarantee economic credibility behind their preconfirmations. The specific method in which this is achieved is left as an open point for now.</p>\n</li>\n</ol>\n<p>We are actively looking for validators to take part in Cohort 1 for testing and demoing Bolt. We believe Lido node operators would make ideal partners here. Please reach out if you would like to participate.</p>\n<p><em>Side-note: An experimental (not part of the poc) on-chain registration process could work as follows:</em></p>\n<ol>\n<li><em>The Proposer signs a message with their withdrawal address private key to signify that they are requesting to opt-in. The message will need to contain the Ethereum address that the proposer intends to use as signer to authenticate individual preconfirmation requests. This way, proposers in Bolt will have a separate identity from their validators private key.</em></li>\n<li><em>The Proposer sends a transaction to the Registry, requesting to opt-in to Bolt. The transaction must be sent from the same address that was specified in the signed message, which must be passed in the transaction’s data. This way, the ownership of this new ECDSA key-pair is proven on-chain.</em></li>\n</ol>\n<h2><a name=\"security-culture-11\" class=\"anchor\" href=\"https://research.lido.fi#security-culture-11\"></a>Security Culture</h2>\n<p>The Bolt protocol will be open-sourced and audited allowing for rigorous internal and external examination of all Bolt components. Bolt is designed to be simple and minimal. Along with a modified mev-boost client, Bolt only introduces 2 additional off-chain components: a sidecar and an RPC.</p>\n<p>Chainbound will collaborate with external parties for both on-chain and off-chain components. For example, Bolt can utilize existing battle-tested restaking modules.</p>\n<p><strong>Additionally, Bolt’s interface and standards will be a collaborative output from many teams thinking about similar solutions.</strong> Chainbound will provide maintenance, monitoring and, analytics for continued transparency, integrity, and security of Bolt.</p>\n<h2><a name=\"lido-alliance-chainbound-12\" class=\"anchor\" href=\"https://research.lido.fi#lido-alliance-chainbound-12\"></a>Lido Alliance &lt;&gt; Chainbound</h2>\n<p>Lido’s reGOOSE states:</p>\n<blockquote>\n<p><em>Internalize validator services that align with Ethereum’s roadmap, starting with preconfirmations, without exposing stakers to additional risk</em></p>\n</blockquote>\n<p>Bolt is not only: (1) a generalized proposer commitments protocol that can facilitate a variety of potential validator services, but also (2) designed with preconfirmations as the primary use case, and (3) aligned with Ethereum’s roadmap towards stronger censorship resistance guarantees, better UX, and defragmentation.</p>\n<p>Bolt does, however, rely on economic security, placing additional slashing risk on proposers. We find this path necessary when introducing proposer-centric commitments so as not to rely on trusted intermediaries. With that said, there are ways to either reduce proposer risk (which can come in the form of insurance funds) or increase rewards (yield) to compensate for said risk.</p>\n<h3><a name=\"lido-alliance-support-for-chainbound-13\" class=\"anchor\" href=\"https://research.lido.fi#lido-alliance-support-for-chainbound-13\"></a>Lido Alliance Support for Chainbound</h3>\n<p>Acceptance into the Lido alliance would be a direct endorsement for Chainbound and Bolt. With this endorsement, Chainbound would appreciate the convergence from Lido stakeholders around Bolt as one of the preconfirmation solutions to test and iterate over. For the Lido working group, Chainbound would appreciate direct collaboration and feedback on Bolt’s design choices, suggestions around auditors and firms, and continuous testing of the software.</p>\n<p>Helping bootstrap Validator Cohort 1, in particular with Lido Node Operators, would be an incredible help, along with ongoing assistance around validator adoption down the line.</p>\n<h3><a name=\"lido-alliance-alignment-collateral-14\" class=\"anchor\" href=\"https://research.lido.fi#lido-alliance-alignment-collateral-14\"></a>Lido Alliance Alignment Collateral</h3>\n<p>We at Chainbound are open to discussing the possibilities here.</p>\n<h2><a name=\"towards-a-proposer-centric-future-15\" class=\"anchor\" href=\"https://research.lido.fi#towards-a-proposer-centric-future-15\"></a>Towards a Proposer-centric Future</h2>\n<p>We hope the design decisions around our protocol reflect our desire to support and grow Ethereum, and therefore, help support Lido, a key steward of the Ethereum community. Proposer agency and trustless proposer commitments are core towards making Ethereum more censorship-resistant and usable.</p>\n<p>We are excited for Ethereum and Lido’s future and hope Bolt can play a part in that!</p>\n            <p><small>2 posts - 2 participants</small></p>\n            <p><a href=\"https://research.lido.fi/t/proposal-onboard-bolt-to-the-lido-alliance/7724\">Read full topic</a></p>","link":"https://research.lido.fi/t/proposal-onboard-bolt-to-the-lido-alliance/7724","pubDate":"Tue, 18 Jun 2024 19:56:14 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"research.lido.fi-topic-7724"},"source":{"@url":"https://research.lido.fi/t/proposal-onboard-bolt-to-the-lido-alliance/7724.rss","#text":"Proposal: Onboard Bolt to the Lido Alliance"},"filter":false},{"title":"EIP-7251: Effects on Rewards & Risks","dc:creator":"Aleksandr_V","category":"General","description":"<p>Hi there!</p>\n<p><strong>The purpose</strong> of this thread is to collect discussion and community alignment with regards to support <code>EIP-7251: Increase the MAX_EFFECTIVE_BALANCE</code> in Lido protocol.</p>\n<p>Initially, <a class=\"mention\" href=\"https://research.lido.fi/u/mol_eliza\">@Mol_Eliza</a> and me conducted a study to evaluate the potential impact of this EIP on changes in APR and to assess how consolidation might influence the likelihood of penalties.</p>\n<p><strong>Analysis and Key Findings</strong></p>\n<ol>\n<li><strong>Impact on APR:</strong></li>\n</ol>\n<ul>\n<li>In the event of EIP implementation, we may observe a slight increase in APR from 0.000094% to 0.001958%, depending on various network parameters and validator’s size. This translates to approximately 9.4ETH to 195.8ETH per 10 million in quantitative terms.</li>\n<li>Under normal network conditions, validators of type 0x02 with a volume less than 1700ETH will marginally decrease the APR.</li>\n<li>If the network experiences huge stake inflow and validator activation queue or TX mempool overloading, then 0x02 validators will be more effective.</li>\n</ul>\n<ol start=\"2\">\n<li><strong>Slashing Risks:</strong></li>\n</ol>\n<ul>\n<li>Consolidating to &gt;100 Validators under same host is not impactful in terms of expected losses, therefore could be utilized by large staking actors. However consolidation leads to increase in variance for whole interval under consideration (1500 → 1), therefore increasing uncertainty, even with almost the same expected values</li>\n<li>Consolidating to low amount of validators leads to significant increase in expected losses due to increase in expected initial losses</li>\n<li>In harsh network conditions or long reaction time negative effect of consolidating decreases (and could became insignificant)</li>\n</ul>\n<p>The approach details, analyses, and conclusions are detailed here: <a href=\"https://docs.google.com/document/d/137mwwR9SZ1fZTp2yGAOB8aRYuL9uvUOWVHCiiIUjKmk/edit?usp=sharing\" rel=\"noopener nofollow ugc\">EIP-7251: Risks &amp; Rewards </a> and were presented during <a href=\"https://www.youtube.com/live/SPAdYRfug8U\" rel=\"noopener nofollow ugc\">Node Operator Community Call #18</a>.</p>\n<p>Based on the conducted research, there is no clear evidence to suggest that immediate support for EIP and the transition to type 0x02 validators is necessary. The risks of incurring penalties increase with the consolidation of validators.</p>\n<p>Thank you, feedback &amp; suggestions are highly appreciated!</p>\n            <p><small>1 post - 1 participant</small></p>\n            <p><a href=\"https://research.lido.fi/t/eip-7251-effects-on-rewards-risks/7718\">Read full topic</a></p>","link":"https://research.lido.fi/t/eip-7251-effects-on-rewards-risks/7718","pubDate":"Tue, 18 Jun 2024 08:16:42 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"research.lido.fi-topic-7718"},"source":{"@url":"https://research.lido.fi/t/eip-7251-effects-on-rewards-risks/7718.rss","#text":"EIP-7251: Effects on Rewards & Risks"},"filter":false},{"title":"Tané - Lido community education in APAC","dc:creator":"Tane","category":"Community Grants / Initiatives","description":"<p>Dear Lido Community,</p>\n<p>We prepared a grant proposal for community education in the Asia Pacific region to support these initiatives.</p>\n<ol>\n<li>Simple DVT</li>\n<li>Community Staking Module</li>\n<li>Lido Community Lifeguards Initiative</li>\n</ol>\n<p>This proposal has already been approved by the LEGO Council.</p>\n<p>We highly appreciate any kind of comments, feedback and contributions.</p>\n<h2><a name=\"overview-1\" class=\"anchor\" href=\"https://research.lido.fi#overview-1\"></a>Overview</h2>\n<p>Education and empowerment for the community to drive decentralization.</p>\n<p>We, Tané, wholeheartedly support the initiative mentioned above and aim to contribute as much as possible driven by our belief in the fundamental values of Lido,</p>\n<blockquote>\n<p>Keep Ethereum decentralized, accessible to all, and resistant to censorship</p>\n</blockquote>\n<p>We express our utmost gratitude to those who have worked on or supported these initiatives. At the same time, we recognize the challenges in achieving broader outreach and have been considering how we can contribute to addressing this issue.</p>\n<p>In this proposal, we suggest using the funds received as a grant to increase the number of individuals and community members who get involved in decentralizing Lido by introducing ways to contribute to it, putting a strong emphasis on CSM and Simple DVT. This will be done via various channels; podcasts, articles and events.</p>\n<h2><a name=\"objectives-2\" class=\"anchor\" href=\"https://research.lido.fi#objectives-2\"></a>Objectives</h2>\n<p>The importance of Simple DVT and CSM in enhancing the decentralization of Lido, and by extension Ethereum, is significant. The goal of this initiative is to introduce various ways to get involved in the decentralization of Ethereum through Lido, with the introduction of Simple DVT and CSM being crucial components.</p>\n<p>More specifically, the aim is for individuals and community members who engage with the educational content created within this initiative or participate in the events held to set up their nodes and become solo stakers themselves, or if not, to contribute to Lido’s decentralization from different aspects.</p>\n<p>We are presenting a focused, short-term segment of a larger, long-term plan. Our intention is to start quickly and efficiently by requesting a more modest grant size, which will allow us to initiate our project with agility. We believe this approach will enable us to demonstrate the potential of our broader vision while ensuring a streamlined and effective implementation of the initial phase.</p>\n<h2><a name=\"key-activities-3\" class=\"anchor\" href=\"https://research.lido.fi#key-activities-3\"></a>Key Activities</h2>\n<p>These activities will continue to be executed in an appropriate form throughout all phases.</p>\n<h3><a name=\"educational-contents-4\" class=\"anchor\" href=\"https://research.lido.fi#educational-contents-4\"></a>Educational contents</h3>\n<p>Create educational content aimed at individuals and organizations to understand Lido.</p>\n<ul>\n<li>Podcast series that covers topics below.</li>\n<li>Article series that covers topics below.</li>\n<li>Tutorials and detailed guides for setting up nodes using CSM/ Simple DVT.</li>\n</ul>\n<h3><a name=\"organizing-events-5\" class=\"anchor\" href=\"https://research.lido.fi#organizing-events-5\"></a>Organizing events</h3>\n<p>Organize an educational event that covers the topics below.</p>\n<ul>\n<li>Introduction of Lido and its underlying technology</li>\n<li>Simple DVT explained</li>\n</ul>\n<h3><a name=\"activities-by-numbers-6\" class=\"anchor\" href=\"https://research.lido.fi#activities-by-numbers-6\"></a>Activities by numbers</h3>\n<ul>\n<li>offline event: 1</li>\n<li>podcast: 6+\n<ul>\n<li>every week updates over 2 months</li>\n<li>several Lido-focused episodes</li>\n</ul>\n</li>\n<li>article : 3</li>\n<li>tutorial/setup guide: 1</li>\n</ul>\n<h3><a name=\"topics-to-be-covered-7\" class=\"anchor\" href=\"https://research.lido.fi#topics-to-be-covered-7\"></a>Topics to be covered</h3>\n<ol>\n<li>Introduction of Lido</li>\n</ol>\n<ul>\n<li>Provide basic information for listeners with varying levels of understanding of Lido, ensuring a consistent foundational comprehension.</li>\n<li>A brief review of Liquid Staking / The significance and benefits of Liquid Staking / Differences from other LSTs / Lido’s value, etc.</li>\n</ul>\n<ol start=\"2\">\n<li>Introducing (Re)GOOSE <span class=\"hashtag-raw\">#1:</span> The background</li>\n</ol>\n<ul>\n<li>Focus on the reasons why ReGOOSE was needed.</li>\n<li>What is ReGOOSE in a nutshell? / Why was ReGOOSE needed? (Changes in the environment surrounding ETH staking: Restaking / Preconfirmations / MVI)</li>\n</ul>\n<ol start=\"3\">\n<li>Introducing (Re)GOOSE <span class=\"hashtag-raw\">#2:</span> Strategy (Lido Alliance)</li>\n</ol>\n<ul>\n<li>We will discuss what ReGOOSE aims to achieve, one aspect at a time. Mainly focus on the content of <a href=\"https://blog.lido.fi/regoose-an-update-to-goose/amp/\" rel=\"noopener nofollow ugc\">this blog</a>.</li>\n<li>We will also discuss the current landscape of Lido Alliance.</li>\n</ul>\n<ol start=\"4\">\n<li>Why is Lido good for Ethereum: Path to decentralization</li>\n</ol>\n<ul>\n<li>Introduce Lido’s strategy related to non-technical decentralization.</li>\n<li>Dual governance / <a href=\"https://research.lido.fi/t/ldo-steth-dual-governance/2382/15\">ossification</a> / <a href=\"https://research.lido.fi/t/hasus-goose-submission-proposed-goals-for-lido-dao-to-consider/5590\">others</a> (from GOOSE’s topic)</li>\n</ul>\n<ol start=\"5\">\n<li>Overview of technical decentralization — introducing the SimpleDVT, and CSM</li>\n</ol>\n<ul>\n<li>Share the initiatives related to technical decentralization one by one.</li>\n</ul>\n<ol start=\"6\">\n<li>Deeper dive into the CSM: how to participate in the early adoption period and how communities can work with Lido via the Community Lifeguards</li>\n</ol>\n<h2><a name=\"budget-and-duration-8\" class=\"anchor\" href=\"https://research.lido.fi#budget-and-duration-8\"></a>Budget and duration</h2>\n<p>We have received 10,000 DAI for this initiative.<br>\nHere’s the budget breakdown.</p>\n<ul>\n<li>Podcast $4,000</li>\n<li>Writings (3 articles + 1 guide) $2,000</li>\n<li>Event cost $4,000\n<ul>\n<li>Labour cost $2,500</li>\n<li>Venue fee $1,500</li>\n</ul>\n</li>\n</ul>\n<p>We will organize and complete all these activities by the end of August.</p>\n<h2><a name=\"conclusion-9\" class=\"anchor\" href=\"https://research.lido.fi#conclusion-9\"></a>Conclusion</h2>\n<p>We have received 10,000 DAI to educate the APAC community, especially in Japan, to get them involved in decentralizing Lido. We will introduce ways to contribute, with a strong emphasis on CSM and Simple DVT.</p>\n<p>We will provide podcast content, written materials, and an on-site event.</p>\n<p>We’ve already started working on this. We recorded and shared the 1st episode of our podcast containing Lido’s topic. We will keep on working as proposed here.</p>\n<p>Reports will be shared after finishing all these activities, supposedly by the end of August.</p>\n<h2><a name=\"about-tan-10\" class=\"anchor\" href=\"https://research.lido.fi#about-tan-10\"></a>About Tané</h2>\n<ul>\n<li>Tané is a crypto investment and research firm backed by major Japanese enterprises such as SoftBank.</li>\n<li>Our mission is to enhance the blockchain ecosystem through decentralization and credible neutrality, empowering individuals globally.</li>\n<li>We want to achieve the mission by doing network operations that contribute to blockchain networks by running validators, participating in DAO governance, etc.</li>\n<li>We also got a delegation of $OP from a16z to participate in DAO governance.</li>\n<li>Our Website: <a href=\"https://tanelabs.com/\" rel=\"noopener nofollow ugc\">https://tanelabs.com/</a></li>\n<li>Our Network activities: <a href=\"https://networkoperations.tanelabs.com/\" rel=\"noopener nofollow ugc\">https://networkoperations.tanelabs.com/</a></li>\n</ul>\n<h3><a name=\"our-previous-work-11\" class=\"anchor\" href=\"https://research.lido.fi#our-previous-work-11\"></a>Our previous work:</h3>\n<p>We held a side event at ETHGlobal Tokyo. April, 2023.<br>\n</p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://europe1.discourse-cdn.com/business20/uploads/lido/original/2X/5/50fab5ece290a5bee0db4f8a5d0706f94ac4a5d9.jpeg\" data-download-href=\"/uploads/short-url/bynlfp8lRczvAGve4aACTIjbb6x.jpeg?dl=1\" title=\"image\" rel=\"noopener nofollow ugc\"><img src=\"https://europe1.discourse-cdn.com/business20/uploads/lido/optimized/2X/5/50fab5ece290a5bee0db4f8a5d0706f94ac4a5d9_2_666x500.jpeg\" alt=\"image\" data-base62-sha1=\"bynlfp8lRczvAGve4aACTIjbb6x\" width=\"666\" height=\"500\" srcset=\"https://europe1.discourse-cdn.com/business20/uploads/lido/optimized/2X/5/50fab5ece290a5bee0db4f8a5d0706f94ac4a5d9_2_666x500.jpeg, https://europe1.discourse-cdn.com/business20/uploads/lido/optimized/2X/5/50fab5ece290a5bee0db4f8a5d0706f94ac4a5d9_2_999x750.jpeg 1.5x, https://europe1.discourse-cdn.com/business20/uploads/lido/optimized/2X/5/50fab5ece290a5bee0db4f8a5d0706f94ac4a5d9_2_1332x1000.jpeg 2x\" data-dominant-color=\"615D58\"></a></div><p></p>\n<p>MEV workshop in Tokyo. June, 2023.<br>\n</p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://europe1.discourse-cdn.com/business20/uploads/lido/original/2X/5/53730cc27e1852e39d4ed47fc05b646ffff5835f.jpeg\" data-download-href=\"/uploads/short-url/bUe7DzEezwN079gjEypxiCJqwrl.jpeg?dl=1\" title=\"image\" rel=\"noopener nofollow ugc\"><img src=\"https://europe1.discourse-cdn.com/business20/uploads/lido/optimized/2X/5/53730cc27e1852e39d4ed47fc05b646ffff5835f_2_666x500.jpeg\" alt=\"image\" data-base62-sha1=\"bUe7DzEezwN079gjEypxiCJqwrl\" width=\"666\" height=\"500\" srcset=\"https://europe1.discourse-cdn.com/business20/uploads/lido/optimized/2X/5/53730cc27e1852e39d4ed47fc05b646ffff5835f_2_666x500.jpeg, https://europe1.discourse-cdn.com/business20/uploads/lido/optimized/2X/5/53730cc27e1852e39d4ed47fc05b646ffff5835f_2_999x750.jpeg 1.5x, https://europe1.discourse-cdn.com/business20/uploads/lido/optimized/2X/5/53730cc27e1852e39d4ed47fc05b646ffff5835f_2_1332x1000.jpeg 2x\" data-dominant-color=\"767066\"></a></div><p></p>\n<p>Infra+DeFi Meetup in Tokyo. March, 2024<br>\n</p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://europe1.discourse-cdn.com/business20/uploads/lido/original/2X/b/b6cc0ef0a2977bd3e0897c145b278c0cc86d5f7a.jpeg\" data-download-href=\"/uploads/short-url/q565K6KXYKE7ieBLuGeMVYXbgFQ.jpeg?dl=1\" title=\"image\" rel=\"noopener nofollow ugc\"><img src=\"https://europe1.discourse-cdn.com/business20/uploads/lido/optimized/2X/b/b6cc0ef0a2977bd3e0897c145b278c0cc86d5f7a_2_666x500.jpeg\" alt=\"image\" data-base62-sha1=\"q565K6KXYKE7ieBLuGeMVYXbgFQ\" width=\"666\" height=\"500\" srcset=\"https://europe1.discourse-cdn.com/business20/uploads/lido/optimized/2X/b/b6cc0ef0a2977bd3e0897c145b278c0cc86d5f7a_2_666x500.jpeg, https://europe1.discourse-cdn.com/business20/uploads/lido/optimized/2X/b/b6cc0ef0a2977bd3e0897c145b278c0cc86d5f7a_2_999x750.jpeg 1.5x, https://europe1.discourse-cdn.com/business20/uploads/lido/original/2X/b/b6cc0ef0a2977bd3e0897c145b278c0cc86d5f7a.jpeg 2x\" data-dominant-color=\"796649\"></a></div><p></p>\n<p>Podcasts (in Japanese)</p>\n<ul>\n<li><a href=\"https://open.spotify.com/episode/3EUhl8PAkslPWd4HlNefJS\" rel=\"noopener nofollow ugc\">Ethereum roadmap and light client</a></li>\n<li><a href=\"https://open.spotify.com/episode/5amS721QSg01EHV1htbvHu\" rel=\"noopener nofollow ugc\">DAO governance and its issues</a></li>\n<li><a href=\"https://open.spotify.com/episode/7kiAAC07aljnoybZcmGFUF\" rel=\"noopener nofollow ugc\">The role of rollups and shared sequencer/Blockchain’s trilemma</a></li>\n<li>For more topics, visit <a href=\"https://open.spotify.com/show/2NSn04u903UWTniEOYFymf\" rel=\"noopener nofollow ugc\">our Spotify channel</a></li>\n</ul>\n<p>Writings on MEV, intent, modular blockchain etc.</p>\n<ul>\n<li><a href=\"https://writing.tanelabs.com/mev-guide-for-beginners\" rel=\"noopener nofollow ugc\">MEV guide for beginners</a></li>\n<li><a href=\"https://writing.tanelabs.com/why-decentralization-matters\" rel=\"noopener nofollow ugc\">Why Decentralization Matters</a></li>\n<li><a href=\"https://writing.tanelabs.com/modular-blockchain-thesis\" rel=\"noopener nofollow ugc\">Modular Blockchain Thesis</a></li>\n<li>More writings can be found <a href=\"https://writing.tanelabs.com/\" rel=\"noopener nofollow ugc\">here</a></li>\n</ul>\n<h3><a name=\"representatives-and-contacts-12\" class=\"anchor\" href=\"https://research.lido.fi#representatives-and-contacts-12\"></a>Representatives and contacts</h3>\n<p><a href=\"https://twitter.com/ikuma\" rel=\"noopener nofollow ugc\">Ikuma Mutobe</a> : Founding Partner<br>\n<a href=\"https://twitter.com/ohishi\" rel=\"noopener nofollow ugc\">Takeshi Ohishi</a>: Co-founder, Head of Network Operations<br>\n<a href=\"https://twitter.com/0xshj\" rel=\"noopener nofollow ugc\">Shoji Tateno</a>: BD and Research</p>\n            <p><small>1 post - 1 participant</small></p>\n            <p><a href=\"https://research.lido.fi/t/tane-lido-community-education-in-apac/7716\">Read full topic</a></p>","link":"https://research.lido.fi/t/tane-lido-community-education-in-apac/7716","pubDate":"Tue, 18 Jun 2024 02:29:08 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"research.lido.fi-topic-7716"},"source":{"@url":"https://research.lido.fi/t/tane-lido-community-education-in-apac/7716.rss","#text":"Tané - Lido community education in APAC"},"filter":false},{"title":"Dune error on lido extended","dc:creator":"gdr1123","category":"General","description":"<p>Dune query shows this, I believe that it is inaccurate<br>\n</p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://europe1.discourse-cdn.com/business20/uploads/lido/original/2X/8/880b0e889dda0fc8e68981dc2639e94fdadf6dac.png\" data-download-href=\"/uploads/short-url/jpuCKwrpUrKGJ6Qo8MXSwZKvexK.png?dl=1\" title=\"image\" rel=\"noopener nofollow ugc\"><img src=\"https://europe1.discourse-cdn.com/business20/uploads/lido/optimized/2X/8/880b0e889dda0fc8e68981dc2639e94fdadf6dac_2_646x500.png\" alt=\"image\" data-base62-sha1=\"jpuCKwrpUrKGJ6Qo8MXSwZKvexK\" width=\"646\" height=\"500\" srcset=\"https://europe1.discourse-cdn.com/business20/uploads/lido/optimized/2X/8/880b0e889dda0fc8e68981dc2639e94fdadf6dac_2_646x500.png, https://europe1.discourse-cdn.com/business20/uploads/lido/optimized/2X/8/880b0e889dda0fc8e68981dc2639e94fdadf6dac_2_969x750.png 1.5x, https://europe1.discourse-cdn.com/business20/uploads/lido/original/2X/8/880b0e889dda0fc8e68981dc2639e94fdadf6dac.png 2x\" data-dominant-color=\"FDFCFC\"></a></div><p></p>\n            <p><small>3 posts - 2 participants</small></p>\n            <p><a href=\"https://research.lido.fi/t/dune-error-on-lido-extended/7714\">Read full topic</a></p>","link":"https://research.lido.fi/t/dune-error-on-lido-extended/7714","pubDate":"Mon, 17 Jun 2024 23:37:51 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"research.lido.fi-topic-7714"},"source":{"@url":"https://research.lido.fi/t/dune-error-on-lido-extended/7714.rss","#text":"Dune error on lido extended"},"filter":false},{"title":"About the CSM Support category","dc:creator":"kethfinex","category":"CSM Support","description":"<p>This is the section for public discussions raised by participants of the community staking module.</p>\n<p>The main communication channel is the Lido Discord server, where CSM participants can ask for advice and guidance from the community. This section is meant to be a place for broader discussion that require more visibility for the DAO members.</p>\n            <p><small>1 post - 1 participant</small></p>\n            <p><a href=\"https://research.lido.fi/t/about-the-csm-support-category/7712\">Read full topic</a></p>","link":"https://research.lido.fi/t/about-the-csm-support-category/7712","pubDate":"Mon, 17 Jun 2024 13:15:42 +0000","discourse:topicPinned":"Yes","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"research.lido.fi-topic-7712"},"source":{"@url":"https://research.lido.fi/t/about-the-csm-support-category/7712.rss","#text":"About the CSM Support category"},"filter":false},{"title":"Lido DAO ZKSync ZK Token Airdrop Acceptance","dc:creator":"kenx3495","category":"Proposals","description":"<p>Kenneth here, Defi Protocol Relations Contributor at Lido DAO.</p>\n<p>ZKSync has announced the launch of <a href=\"https://blog.zknation.io/introducing-zk-nation/\" rel=\"noopener nofollow ugc\">ZKNation</a>, a DAO-based governance system that will drive the development of the ZKSync Protocol. As part of its path to decentralized governance, they have also announced the airdrop of the ZK token.</p>\n<p>Part of the airdrop was allocated to protocols that have deployed and built on their ecosystem with Lido DAO receiving an amount of <a href=\"https://github.com/ZKsync-Association/zknation-data/blob/main/zksync_native_project_list.csv#L52\" rel=\"noopener nofollow ugc\">8301475 ZK tokens</a>.</p>\n<p>There are no specified instructions for the DAO on how the airdrop should be distributed. Liquidity Observation Labs’ (LOL) intent is to best use it the way the DAO deems fit to grow Lido’s footprint and participation in the zkSync ecosystem.</p>\n<p><strong>How Will The Airdrop Be Utilized</strong></p>\n<p>Lido DAO contributors firmly believe that zkSync has a thriving Defi ecosystem that will grow even more with other protocols also being aligned to the growth of it. The DAO contributors want wstETH to play a big part in what could be the start of ZK Summer.</p>\n<p>As such, the airdrop will be distributed for the purposes of:</p>\n<ol>\n<li>\n<p>Increasing the liquidity of wstETH in zkSync Era Dexes, enabling a seamless experience for users to use wstETH as interchangeably as ETH</p>\n</li>\n<li>\n<p>Increase the number of integrations possible on zkSync Era’s Defi dApps from Lending Markets to Derivative protocols</p>\n</li>\n<li>\n<p>Be a part of bootstrapping and kickstarting LST/LRT-fi on zkSync’s ecosystem</p>\n</li>\n</ol>\n<p>Currently, Lido DAO has already established a strong footprint in the zkSync ecosystem, being the LST with the highest TVL bridged over - at an amount of around 1200 wstETH. wstETH is also widely available on various DEXes on zkSync, with sufficient liquidity for most users to swap in and out of.</p>\n<p><strong>Distribution of the Airdrop</strong></p>\n<p>As stated in a prior <a href=\"https://snapshot.org/#/lido-snapshot.eth/proposal/0xd460ea50072deb6bc428064a118dfd499714d4a7865552b4047eba3199663596\" rel=\"noopener nofollow ugc\">Lido DAO snapshot vote</a>, LOL (Liquidity Observation Labs) will be the representative for Lido DAO in claiming and distributing the ZK airdropped to the DAO. Preliminarily, the airdrop will be proposed to be used in this manner:</p>\n<ul>\n<li>80% of ZK token received goes to DEXes for wstETH denominated pools (wstETH/ETH, wstETH/ZK, wstETH/LRTs etc.)</li>\n<li>20% of the ZK tokens received will go to protocols adopting and integrating wstETH such as lending markets and derivatives.</li>\n</ul>\n<p>The allocation and timeframe where the airdrop is utilized will be subject to change and is up to the discretion of LOL to utilize however it deems fit.</p>\n<p><strong>Multi-sig Signers and Wallet Addresses</strong></p>\n<p>The LOL <a href=\"https://app.safe.global/home?safe=zksync:0xf7169E14CDEF99403BE9114c9303887f760B1913\" rel=\"noopener nofollow ugc\">zkSync Ops wallet</a> (4/8 multisig) will be the recipient of the ZK airdrop. This address can be found in the list of <a href=\"https://docs.lido.fi/deployed-contracts/#liquidity-observation-lab-formerly-known-as-rewards-committee-multisigs\" rel=\"noopener nofollow ugc\">LOL multisigs</a> in the Lido DAO documentation page. Listed below are the signers:</p>\n<p><a class=\"mention\" href=\"https://research.lido.fi/u/smiles\">@smiles</a> 0x90D07d4c4801f275217de42Dca67c552Da0295Af</p>\n<p><a class=\"mention\" href=\"https://research.lido.fi/u/alex_l\">@Alex_L</a> 0xB339918e75664a07BB650513427559920C0A0F6C</p>\n<p><a class=\"mention\" href=\"https://research.lido.fi/u/puffy325\">@Puffy325</a> 0x1Fa1134a8eF43F0C98C1657a95276ae611FAd619</p>\n<p><a class=\"mention\" href=\"https://research.lido.fi/u/grstepanov\">@GrStepanov</a> 0x8D0855047b59a5f11262f095ee724b5A59a89710</p>\n<p><a class=\"mention\" href=\"https://research.lido.fi/u/marin\">@Marin</a> 0x04e7C0350241b818eE5c92cc260008C9898F41cf</p>\n<p><a class=\"mention\" href=\"https://research.lido.fi/u/defiyaco\">@DeFiYaco</a> 0x59d07dc34B135B17b87840a86BFF7302039E7EDf</p>\n<p><a class=\"mention\" href=\"https://research.lido.fi/u/mcnut\">@McNut</a> 0xc7a8DE05264442A318189f2bd160d2830902C8CD</p>\n<p><a class=\"mention\" href=\"https://research.lido.fi/u/adcv\">@adcv</a> 0xcC692077C65dd464cAA7e7ae614328914f8469b3</p>\n<p><strong>Disclosures:</strong><br>\nSome contributors of the DAO who are contracted with Argo Tech Consulting received a separate ZK allocation from zkSync.</p>\n            <p><small>2 posts - 2 participants</small></p>\n            <p><a href=\"https://research.lido.fi/t/lido-dao-zksync-zk-token-airdrop-acceptance/7701\">Read full topic</a></p>","link":"https://research.lido.fi/t/lido-dao-zksync-zk-token-airdrop-acceptance/7701","pubDate":"Fri, 14 Jun 2024 19:15:33 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"research.lido.fi-topic-7701"},"source":{"@url":"https://research.lido.fi/t/lido-dao-zksync-zk-token-airdrop-acceptance/7701.rss","#text":"Lido DAO ZKSync ZK Token Airdrop Acceptance"},"filter":false},{"title":"[EGG] st2024 v2: Continuity Grant Funding to Achieve GOOSE Goals","dc:creator":"steakhouse","category":"Proposals","description":"<p></p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://europe1.discourse-cdn.com/business20/uploads/lido/original/2X/f/f594d03a3283db490cfbd00042f25093bfe865d9.jpeg\" data-download-href=\"/uploads/short-url/z2vOjiPT07EVO710nSs7rz1saUh.jpeg?dl=1\" title=\"image\"><img src=\"https://europe1.discourse-cdn.com/business20/uploads/lido/original/2X/f/f594d03a3283db490cfbd00042f25093bfe865d9.jpeg\" alt=\"image\" data-base62-sha1=\"z2vOjiPT07EVO710nSs7rz1saUh\" width=\"690\" height=\"395\" data-dominant-color=\"5E647E\"></a></div><p></p>\n<p><em>Source: Archival photograph of a stETH token (2024, colorized)</em></p>\n<h2><a name=\"tldr-1\" class=\"anchor\" href=\"https://research.lido.fi#tldr-1\"></a>tldr</h2>\n<ul>\n<li>Continue grant approvals to the Lido Contributors Group to advance towards hasu’s <a href=\"https://research.lido.fi/t/hasus-goose-submission-proposed-goals-for-lido-dao-to-consider/\">GOOSE</a> and <a href=\"https://research.lido.fi/t/regoose-updated-goals-for-lido-in-the-light-of-mvi-and-restaking/\">reGOOSE</a> Goals</li>\n<li>Development, audit and deployment of multiple Staking Router modules, Dual Governance, Layer 2 integrations and reviews and zkOracles and integrations for stETH in restaking</li>\n<li>Best-before date: 2024-12-31</li>\n<li>24.6m DAI + 180k LDO in grant continuity for the Lido Contributor’s Group</li>\n<li>7.1m DAI in grant continuity for the Liquidity Observation Lab</li>\n<li>400k DAI for the <a href=\"https://research.lido.fi/t/egg-establishing-the-community-lifeguards-initiative-cli-sub-committee/\">Community Lifeguard</a> initiative</li>\n</ul>\n<h2><a name=\"basic-data-2\" class=\"anchor\" href=\"https://research.lido.fi#basic-data-2\"></a>Basic Data</h2>\n<div class=\"md-table\">\n<table>\n<thead>\n<tr>\n<th>Field</th>\n<th>Description</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td><strong>Proposal Name</strong></td>\n<td>st2024 v2</td>\n</tr>\n<tr>\n<td><strong>Which of the following GOOSE goals is your proposal advancing?</strong></td>\n<td>1: Lido has effective and decentralized governance, 2: Lido attracts the best validator set in the market, 3: stETH is the most used token in the Ethereum ecosystem</td>\n</tr>\n<tr>\n<td><strong>Proposed scope of work</strong></td>\n<td>Engineering Coordination, stETH Core Protocol Engineering, Validator Set Engineering for the Staking Router, Alerting and Monitoring Tooling, Community Module, Governance Core Protocol Engineering, API &amp; Components</td>\n</tr>\n<tr>\n<td><strong>Objectives</strong></td>\n<td>Significantly advance all three GOOSE goals by focusing on expanding the validator set through Community Staking Module, growing stETH adoption in restaking and launching dual governance implementations</td>\n</tr>\n<tr>\n<td><strong>Total Budget Request</strong></td>\n<td>31.8m DAI, 180k LDO</td>\n</tr>\n<tr>\n<td><strong>Best-before date</strong></td>\n<td>2024-12-31</td>\n</tr>\n</tbody>\n</table>\n</div><h2><a name=\"review-of-st2024-v1-3\" class=\"anchor\" href=\"https://research.lido.fi#review-of-st2024-v1-3\"></a>Review of st2024 v1</h2>\n<p></p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://europe1.discourse-cdn.com/business20/uploads/lido/original/2X/a/adf9ee337dbe218acfd6a0e37e57d6f045bf9798.png\" data-download-href=\"/uploads/short-url/oP44HYF2zHy9xdkgkJu7P1qPA3C.png?dl=1\" title=\"image\"><img src=\"https://europe1.discourse-cdn.com/business20/uploads/lido/optimized/2X/a/adf9ee337dbe218acfd6a0e37e57d6f045bf9798_2_690x96.png\" alt=\"image\" data-base62-sha1=\"oP44HYF2zHy9xdkgkJu7P1qPA3C\" width=\"690\" height=\"96\" srcset=\"https://europe1.discourse-cdn.com/business20/uploads/lido/optimized/2X/a/adf9ee337dbe218acfd6a0e37e57d6f045bf9798_2_690x96.png, https://europe1.discourse-cdn.com/business20/uploads/lido/optimized/2X/a/adf9ee337dbe218acfd6a0e37e57d6f045bf9798_2_1035x144.png 1.5x, https://europe1.discourse-cdn.com/business20/uploads/lido/original/2X/a/adf9ee337dbe218acfd6a0e37e57d6f045bf9798.png 2x\" data-dominant-color=\"EEEEEE\"></a></div><p></p>\n<p>In line with recurring underspends, the st2024 v1 EGG has a positive variance of ca. $12m. This excludes the last half of May and the month of June, but do not expect significant grants in this period.</p>\n<p>Thanks to the EasyTrack process, DAO grantees do not receive the full, upfront budget requested through an EGG, but realize any variances on a rolling basis.</p>\n<h2><a name=\"st2024-v2-4\" class=\"anchor\" href=\"https://research.lido.fi#st2024-v2-4\"></a>st2024 v2</h2>\n<p></p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://europe1.discourse-cdn.com/business20/uploads/lido/original/2X/0/07ee4450f902fc78df40cac6268c632385b54b2a.png\" data-download-href=\"/uploads/short-url/189PfMMKRfmz8yxl1EwN6kad1a2.png?dl=1\" title=\"image\"><img src=\"https://europe1.discourse-cdn.com/business20/uploads/lido/optimized/2X/0/07ee4450f902fc78df40cac6268c632385b54b2a_2_690x127.png\" alt=\"image\" data-base62-sha1=\"189PfMMKRfmz8yxl1EwN6kad1a2\" width=\"690\" height=\"127\" srcset=\"https://europe1.discourse-cdn.com/business20/uploads/lido/optimized/2X/0/07ee4450f902fc78df40cac6268c632385b54b2a_2_690x127.png, https://europe1.discourse-cdn.com/business20/uploads/lido/original/2X/0/07ee4450f902fc78df40cac6268c632385b54b2a.png 1.5x, https://europe1.discourse-cdn.com/business20/uploads/lido/original/2X/0/07ee4450f902fc78df40cac6268c632385b54b2a.png 2x\" data-dominant-color=\"F0EFF0\"></a></div><p></p>\n<p>st2024 v2 is a 6mo grant request to advance all three of the GOOSE goals approved by the DAO earlier this year and to double down on reGOOSE objectives approved earlier this year. All these goals are crucial for realizing decentralization objectives around governance minimization, validator diversity and stETH utility.</p>\n<p>Continuity for ongoing projects being outsourced to Pool Maintenance Labs Ltd., Argo Technology Consulting Ltd. or serviced by RCC, to collect functions relating to protocol execution, sponsorships and development support for the DAO. These existing contributor channels can mitigate present business continuity risks while advancing decentralised protocol governance.</p>\n<p>This proposal would ratify the below budget request that will continue grantee funding for a further 6 months through EasyTrack contracts into three multi-signature addresses</p>\n<p>DAI 24.6m and LDO 180,000 will be approved for the period Jul-2024 to Dec-2024, distributed across the below grant approvals.</p>\n<p>Approval of a continuation of the previous <a href=\"https://research.lido.fi/t/lido-v2-may-1-2023-december-31-2023-lido-ongoing-grant-request/\">grant</a> to Pool Maintenance Labs Ltd., an independent not-for-profit staking advocacy and technical services company and existing contributor in the British Virgin Islands, transferred to a company-authorized 4/7 multi-sig wallet with signers listed below: <code>0x17F6b2C738a63a8D3A113a228cfd0b373244633D</code></p>\n<p>adcv: <code>0xcC692077C65dd464cAA7e7ae614328914f8469b3</code><br>\nfolkyatina: <code>0x75E01e1B7a4Ac280fB744A8153beE668A7e83abd</code><br>\nkadmil: <code>0x9A3f38AF97b791C85c043D46a64f56f87E0283D4</code><br>\nAzat: <code>0xA14BFfd91fb571bF1D9Bec70f273CAc13CA127Fa</code><br>\nkrogla: <code>0x000000DfE832ccD7a4011a1Fca34602C9a598353</code><br>\nskozin: <code>0x181dbb1E8156518a58Cbb83AF4D3C41E731c6bdF</code><br>\nrotorless: <code>0xF6E9a144D727C239cC2A7C64C48B8b9A0E39b3dc</code></p>\n<p>Approval of a continuation of the previous <a href=\"https://research.lido.fi/t/lido-v2-may-1-2023-december-31-2023-lido-ongoing-grant-request/\">grant</a> to Argo Technology Consulting Ltd, an independent Panamanian software development company operated as a not-for-profit, funded through a company-authorized 4/7 wallet with signers listed below: <code>0x9B1cebF7616f2BC73b47D226f90b01a7c9F86956</code></p>\n<ul>\n<li>adcv: <code>0xcC692077C65dd464cAA7e7ae614328914f8469b3</code></li>\n<li>dgusakov: <code>0x992Ce4eEc8288274f60880c7770DdA265fCCe610</code></li>\n<li>Marin: <code>0x04e7C0350241b818eE5c92cc260008C9898F41cf</code></li>\n<li>ShardYaco: <code>0x59d07dc34B135B17b87840a86BFF7302039E7EDf</code></li>\n<li>madlabman: <code>0xA8815bc0B541D0a28dA7b8f759EB7E157e8fF8b0</code></li>\n<li>Alex_L: <code>0xB339918e75664a07BB650513427559920C0A0F6C</code></li>\n<li>Juanbug: <code>0xB8Dcad009E533066F12e408075E10E3a30F1f15A</code></li>\n</ul>\n<p>Approval of a continuation to fund the <a href=\"https://research.lido.fi/t/lido-v2-may-1-2023-december-31-2023-lido-ongoing-grant-request/\">RCC</a> 4/7 multi-sig wallet with signers listed below: <code>0xDE06d17Db9295Fa8c4082D4f73Ff81592A3aC437</code></p>\n<ul>\n<li>Marin: <code>0x04e7C0350241b818eE5c92cc260008C9898F41cf</code></li>\n<li>Alex_L: <code>0xB339918e75664a07BB650513427559920C0A0F6C</code></li>\n<li>irina: <code>0x8CeD94df9ddba8E38b6cb36639B6635F19Eb25C6</code></li>\n<li>UniteTheClans: <code>0x81ca68f085282434D15c09619360D6513710a979</code></li>\n<li>zuzu_eeka: <code>0x004812da927b5dcd07e7329609edd75e25d2d295</code></li>\n<li>adcv: <code>0xcC692077C65dd464cAA7e7ae614328914f8469b3</code></li>\n<li>Mol_Eliza: <code>0x21b82AA7149c8Fd0562E78b740937442FfD43094</code></li>\n</ul>\n<p>If the proposal is approved, the first funding for disbursement to finance protocol operations would be requested from the DAO via EasyTrack 5 motions.</p>\n<p>Pool Maintenance Labs Ltd. <code>0x17F6b2C738a63a8D3A113a228cfd0b373244633D</code><br>\nArgo Technology Consulting Ltd. <code>0x9B1cebF7616f2BC73b47D226f90b01a7c9F86956</code><br>\nRCC <code>0xDE06d17Db9295Fa8c4082D4f73Ff81592A3aC437</code></p>\n<p>Multisig signers &amp; addresses may be rotated by specified multisig after signalling the change to DAO on the governance forum. Number of signers can’t be lowered, and the threshold must be at least 50% of the signers.</p>\n<p>A further 7.1m DAI in wstETH at market value would be approved for the Liquidity Observation Lab to continue a previous <a href=\"https://research.lido.fi/t/liquidity-observation-lab-lol-liquidity-strategy-and-application-to-curve-steth-eth-pool/\">grant</a> to further liquidity incentivization, experimentation and research. LOL will continue to work to deliver public resources on stETH liquidity.</p>\n<p>To deliver on hasu’s <a href=\"https://research.lido.fi/t/hasus-goose-submission-proposed-goals-for-lido-dao-to-consider/\">GOOSE</a> and <a href=\"https://research.lido.fi/t/regoose-updated-goals-for-lido-in-the-light-of-mvi-and-restaking/\">reGOOSE</a> goals, areas of focus during the budget period will include:</p>\n<ul>\n<li>Engineering Coordination</li>\n<li>stETH Core Protocol Engineering</li>\n<li>Validator Set Engineering for the Staking Router</li>\n<li>Alerting and Monitoring Tooling</li>\n<li>Community Module</li>\n<li>Governance Core Protocol Engineering</li>\n<li>API &amp; Components</li>\n</ul>\n<p>At the end of the budget period, if GOOSE goals can be advanced further, the Lido Contributors Group may request another grant from the DAO to continue their contributions.</p>\n<h2><a name=\"transparency-5\" class=\"anchor\" href=\"https://research.lido.fi#transparency-5\"></a>Transparency</h2>\n<p>As with the previous EGG, a mid-period review will be held to recap on the progress to date and report on variances. Publicly available information on the state of the DAO economics continue to be available <a href=\"https://dune.com/steakhouse/lido-safu\">here</a> (though the dashboard is being reworked over the coming weeks to update for Stonks and distinguish between new Staking Router modules</p>\n            <p><small>2 posts - 2 participants</small></p>\n            <p><a href=\"https://research.lido.fi/t/egg-st2024-v2-continuity-grant-funding-to-achieve-goose-goals/7697\">Read full topic</a></p>","link":"https://research.lido.fi/t/egg-st2024-v2-continuity-grant-funding-to-achieve-goose-goals/7697","pubDate":"Thu, 13 Jun 2024 16:05:54 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"research.lido.fi-topic-7697"},"source":{"@url":"https://research.lido.fi/t/egg-st2024-v2-continuity-grant-funding-to-achieve-goose-goals/7697.rss","#text":"[EGG] st2024 v2: Continuity Grant Funding to Achieve GOOSE Goals"},"filter":false},{"title":"Where is my stETH? My stake succeeded, but I cannot find my stETH","dc:creator":"timothy28","category":"General","description":"<p>I staked successful, as shown on etherscan, but I cannot find my stETH. Can anyone help please?</p>\n            <p><small>6 posts - 3 participants</small></p>\n            <p><a href=\"https://research.lido.fi/t/where-is-my-steth-my-stake-succeeded-but-i-cannot-find-my-steth/7657\">Read full topic</a></p>","link":"https://research.lido.fi/t/where-is-my-steth-my-stake-succeeded-but-i-cannot-find-my-steth/7657","pubDate":"Sun, 09 Jun 2024 10:45:45 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"research.lido.fi-topic-7657"},"source":{"@url":"https://research.lido.fi/t/where-is-my-steth-my-stake-succeeded-but-i-cannot-find-my-steth/7657.rss","#text":"Where is my stETH? My stake succeeded, but I cannot find my stETH"},"filter":false},{"title":"SEEDGov Delegate Thread","dc:creator":"SEEDLatam","category":"Department of Decentralisation","description":"<h1><a name=\"delegate-introduction-1\" class=\"anchor\" href=\"https://research.lido.fi#delegate-introduction-1\"></a><strong>Delegate Introduction</strong></h1>\n<p><strong>Name</strong>: <a class=\"mention\" href=\"https://research.lido.fi/u/seedlatam\">@SEEDLatam</a></p>\n<p><strong>Wallet Address</strong>: 0xc1c2e8a21b86e41d1e706c232a2db5581b3524f8</p>\n<p><strong>RRSS</strong>:</p>\n<ul>\n<li>Twitter:\n<ul>\n<li><a href=\"https://twitter.com/SEEDLatam\" rel=\"noopener nofollow ugc\">https://twitter.com/SEEDLatam</a></li>\n<li><a href=\"https://twitter.com/SEEDLatam\" rel=\"noopener nofollow ugc\">https://twitter.com/SEEDOrg_</a></li>\n<li><a href=\"https://twitter.com/SEEDGov\" rel=\"noopener nofollow ugc\">https://twitter.com/SEEDGov</a></li>\n</ul>\n</li>\n<li>Supersite: <a href=\"https://seedorg.super.site/home\" rel=\"noopener nofollow ugc\">https://seedorg.super.site/home</a></li>\n<li>Telegram: <a href=\"https://t.me/seed_latam\" rel=\"noopener nofollow ugc\">@seed_latam</a></li>\n</ul>\n<p>Our delegation is excited about the opportunity to join Lido Governance, where we hope to contribute significantly to the leading liquid staking protocol in the ecosystem. We’ll do so by maintaining active and meaningful participation with a dedicated team backed by the entire SEEDOrg and ad hoc consultants.</p>\n<h2><a name=\"what-is-seedgov-2\" class=\"anchor\" href=\"https://research.lido.fi#what-is-seedgov-2\"></a><strong>What is SEEDGov?</strong></h2>\n<p><a href=\"https://twitter.com/SEEDGov\" rel=\"noopener nofollow ugc\">SEEDGov</a> is a dynamic and evolving vertical within the <a href=\"https://seedorg.super.site/\" rel=\"noopener nofollow ugc\">SEED Org</a> ecosystem, dedicated to shaping the future of decentralized governance in the web3 space through active participation, community engagement, decision-making and experimentation. Our approach stands for minimizing governance where appropriate and professionalize it where necessary.</p>\n<p>We are the first Latam based Delegate Platform actively engaging in various governance activities. Rooted in community values, we’ve shifted from educational models to a participatory approach, driving a new chapter in how individuals collaborate, coordinate, and decide in the ever-changing landscape of Web3.</p>\n<p>Our scope of work across various projects and protocols includes managing grant and allocation programs, designing and implementing governance infrastructure, creating and overseeing incentive programs, and onboarding builders to align with protocol needs.</p>\n<h2><a name=\"how-we-work-3\" class=\"anchor\" href=\"https://research.lido.fi#how-we-work-3\"></a><strong>How we work</strong></h2>\n<p>As a professional delegate platform SEEDGov collaborates with communities and partners to ensure credible representation of all interested in Web3’s future. Since its inception, SEEDGov has advocated for critical thinking through education. We do not endorse scams or collaborate with blockchains, projects, or protocols that are not aligned with our core values.</p>\n<p>The members selected to be part of our delegation will collaborate both directly and indirectly with other SEEDGov members. Any decisions made by this delegation regarding governance will be thoroughly discussed and communicated to all stakeholders through our discussion channels and properly executed through specialized units.</p>\n<p></p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://europe1.discourse-cdn.com/business20/uploads/lido/original/2X/a/a95f11dde64d586789ee0ef8b1c5e2968c97519e.jpeg\" data-download-href=\"/uploads/short-url/oakntk4ZO7OjGP2vKOSqKcsET14.jpeg?dl=1\" title=\"Captura de pantalla 2024-05-22 103007\" rel=\"noopener nofollow ugc\"><img src=\"https://europe1.discourse-cdn.com/business20/uploads/lido/optimized/2X/a/a95f11dde64d586789ee0ef8b1c5e2968c97519e_2_689x220.jpeg\" alt=\"Captura de pantalla 2024-05-22 103007\" data-base62-sha1=\"oakntk4ZO7OjGP2vKOSqKcsET14\" width=\"689\" height=\"220\" srcset=\"https://europe1.discourse-cdn.com/business20/uploads/lido/optimized/2X/a/a95f11dde64d586789ee0ef8b1c5e2968c97519e_2_689x220.jpeg, https://europe1.discourse-cdn.com/business20/uploads/lido/optimized/2X/a/a95f11dde64d586789ee0ef8b1c5e2968c97519e_2_1033x330.jpeg 1.5x, https://europe1.discourse-cdn.com/business20/uploads/lido/original/2X/a/a95f11dde64d586789ee0ef8b1c5e2968c97519e.jpeg 2x\" data-dominant-color=\"2C2C2C\"></a></div><p></p>\n<h3><a name=\"seedorgseedgovlido-4\" class=\"anchor\" href=\"https://research.lido.fi#seedorgseedgovlido-4\"></a><strong>SEEDOrg&gt;SEEDGov&gt;Lido</strong></h3>\n<p>Participation in forum discussion threads and daily activities represent the opinions of SEEDGov and collaborators in their efforts to stay up to date with their roles. Our delegation will do its utmost to represent and embody our values to enhance Lido’s governance:</p>\n<ul>\n<li><strong>Decentralization:</strong> As <a href=\"https://lido.fi/scorecard\" rel=\"noopener nofollow ugc\">Lido DAO’s purpose</a> is to “keep Ethereum decentralized, accessible to all, and resistant to censorship”, all of our initiatives and proposals will align with these same principles. Along with this position, and as the ecosystem continues to mature and be driven by its community, we will collaborate in the creation, iteration, and improvement of governance processes to ensure broader participation and that the system remains secure.</li>\n<li><strong>Community-Led Growth &amp; Sustainability:</strong> We will promote and support all initiatives that enable the growth, adoption, scalability, and innovation of Lido’s ecosystem. Our focus will be placed on ensuring that all growth initiatives are reliable, secure, and sustainable over time. We are willing to undertake “protocol activism” regarding Lido’s significance in the web3 ecosystem and our alignment with its guiding principles. We intend to focus and try our best efforts on onboarding and educating stakeholders, as well as advocating for Lido within the broader blockchain and DeFi communities.</li>\n<li><strong>Security:</strong> We will always make sure that no DAO decisions will jeopardize the security of the protocol and thus harm users.</li>\n</ul>\n<h1><a name=\"our-case-5\" class=\"anchor\" href=\"https://research.lido.fi#our-case-5\"></a><strong>Our case</strong></h1>\n<p>Lido’s innovative infrastructure has revolutionized staking by lowering barriers and boosting the entire crypto ecosystem. Its user-friendly design and elimination of asset locking have propelled Lido to hold ~30% of the <a href=\"https://dune.com/hildobby/eth2-staking\" rel=\"noopener nofollow ugc\">ETH staking market</a>. This positions Lido’s future developments and challenges as potential tipping points for the entire ETH landscape. Being part of this space will enable us to be informed and continue understanding, building, and participating in the following verticals (among others):</p>\n<ol>\n<li><strong>Governance</strong>: The proposed Dual Governance framework -dynamic timelock and rage quit mechanisms- offers a promising balance between wstETH stakers and other stakeholders, ensuring an effective system of checks and balances and strong incentives alignment, representing LDO holders and protocol users’ interests. However, in search of achieving governance minimization, the social layer will remain a critical instance of the collective decision-making and consensus-building process, where a deep understanding of Lido will play a crucial role. Addressing and arbitrating potential disputes and misalignments between the different stakeholders is something that SEEDGov can help.</li>\n<li><strong>Alliances:</strong> We consider that the recently approved Lido Alliance framework comes as a solution in line with the current trends in the web3 ecosystem, effectively balancing efficiency and scalability. Allowing the community to decide on these partnerships ensures both transparency and tangible impact in the decision-making process. At this point, we can’t envision another solution that wouldn’t risk fracturing our ecosystem. SEEDGov consistently conducts research and maintains a global, comprehensive understanding of the DeFi ecosystem, enabling us to evaluate and assess potential partnerships for Lido.</li>\n<li><strong>L2 Expansion</strong>: From SEED we’re highly committed to advancing Lido’s mission of making staking simple, secure, and accessible to everyone. We consider that continuing to integrate wstETH native minting on diverse L2 ecosystems, including various rollups, can drive adoption and liquidity, enhancing an interconnected DeFi ecosystem. More presence on L2 protocols will enhance the overall UX, encouraging more users to stake their ETH and participate in Lido’s ecosystem.</li>\n</ol>\n<h2><a name=\"disclosure-6\" class=\"anchor\" href=\"https://research.lido.fi#disclosure-6\"></a><strong>Disclosure</strong></h2>\n<p>SEEDGov is a broad organization that not only encompasses communities in Latam, but also has high participation in some of the most prominent governances in the ecosystem such as <strong>Optimism, Arbitrum, Uniswap, Gnosis, Starknet, Everclear (Connext), and Maker</strong>. As mentioned above we come to Lido Governance to bring value, in case there is any conflict of interest, we will communicate it to the community members.</p>\n            <p><small>1 post - 1 participant</small></p>\n            <p><a href=\"https://research.lido.fi/t/seedgov-delegate-thread/7643\">Read full topic</a></p>","link":"https://research.lido.fi/t/seedgov-delegate-thread/7643","pubDate":"Wed, 05 Jun 2024 15:37:49 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"research.lido.fi-topic-7643"},"source":{"@url":"https://research.lido.fi/t/seedgov-delegate-thread/7643.rss","#text":"SEEDGov Delegate Thread"},"filter":false},{"title":"Tané Governance Communication Thread","dc:creator":"Tane","category":"Department of Decentralisation","description":"<p><img src=\"https://europe1.discourse-cdn.com/business20/uploads/lido/original/2X/c/c24f99b7e88e3edac9cb5a09a5cbf1ee55c54b1c.png\" alt=\"icon_vertical_logo\" data-base62-sha1=\"rIXaGYLFkObn3yLFtCU3huaxrgU\" width=\"480\" height=\"480\"></p>\n<p>Tané is formed with a group of crypto-native product builders, based in Tokyo, Dubai and New York. We are backed by SoftBank, and Japanese tech giants like DeNA, GREE, MIXI, and closely work with the big Japanese enterprises and have great relationship with Japanese crypto communities.</p>\n<p>Our investment arm has invested in and supported various innovating projects that contribute to the decentralized society enabled by the new blockchain technology. Our network operation entity started directly contributing to the ecosystem by being validators for the core infrastructures and protocols that make Web3 move forward and contributors to the DAOs that manage them. We have been active as delegates in dYdX, Arbitrum and Optimism.</p>\n<p>Takeshi, Head of Network Operations, who worked for Twitter as a senior software engineer and for SmartNews, a Japanese unicorn startup that provides a news aggregation mobile app with 30M MAU as a product manager, is the main representative of the account.</p>\n<p>We will update our voting activities and reasonings behind them in this thread. Please reach out to <a href=\"https://x.com/tanelabs\" rel=\"noopener nofollow ugc\">us</a> anytime when you have any opinions/comments/feedback.</p>\n<p>You can also check out our voting activities related to Lido from <a href=\"https://networkoperations.tanelabs.com/databases/protocols/lido\" rel=\"noopener nofollow ugc\">our internal tracker</a>.</p>\n            <p><small>2 posts - 1 participant</small></p>\n            <p><a href=\"https://research.lido.fi/t/tane-governance-communication-thread/7639\">Read full topic</a></p>","link":"https://research.lido.fi/t/tane-governance-communication-thread/7639","pubDate":"Wed, 05 Jun 2024 02:47:11 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"research.lido.fi-topic-7639"},"source":{"@url":"https://research.lido.fi/t/tane-governance-communication-thread/7639.rss","#text":"Tané Governance Communication Thread"},"filter":false},{"title":"Community Staking Podcast #12 : Explore ETH home staking in the Philippines with Bitskwela","dc:creator":"UniteTheClans","category":"Community Staking: Contributor Series","description":"<p><a href=\"https://www.youtube.com/watch?v=DWgk4Ir1-dM\">Community Staking Podcast #12 : Explore ETH home staking in the Philippines with Bitskwela</a></p>\n\n<p>This episode of the Lido Community Staking Podcast features one of the grantees of the Community Staking Fleet Pilot --Bitskwela, a Philippines-based education technology platform that makes Web3 education accessible to all Filipinos.</p>\n<p>The Lido Community Lifeguards are excited to uncover the stories of grassroots Web3 communities that are keen to help expand the talent pool of Ethereum home stakers globally via the Lido Community Staking Module.</p>\n<p>If you’d like your story to be heard, reach out to us below!</p>\n<ul>\n<li>Sam | Stakesaurus: <a href=\"https://t.me/samuelclk\" class=\"inline-onebox\">Telegram: Contact @samuelclk</a></li>\n<li>Enti: <a href=\"https://t.me/entigd\" class=\"inline-onebox\">Telegram: Contact @entigd</a></li>\n</ul>\n<p>Get in touch with Bitskwela<br>\nTwitter: <a href=\"https://x.com/bitskwela\" class=\"inline-onebox\">x.com</a><br>\nFacebook: /bitskwela<br>\nTiktok: /bitskwela</p>\n            <p><small>1 post - 1 participant</small></p>\n            <p><a href=\"https://research.lido.fi/t/community-staking-podcast-12-explore-eth-home-staking-in-the-philippines-with-bitskwela/7635\">Read full topic</a></p>","link":"https://research.lido.fi/t/community-staking-podcast-12-explore-eth-home-staking-in-the-philippines-with-bitskwela/7635","pubDate":"Tue, 04 Jun 2024 13:47:58 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"research.lido.fi-topic-7635"},"source":{"@url":"https://research.lido.fi/t/community-staking-podcast-12-explore-eth-home-staking-in-the-philippines-with-bitskwela/7635.rss","#text":"Community Staking Podcast #12 : Explore ETH home staking in the Philippines with Bitskwela"},"filter":false},{"title":"Notice of Motion for Entry of Default Against Lido DAO, or in the Alternative, for Alternative Service On Lido DAO","dc:creator":"fairmarkpartners","category":"General","description":"<p>To Whom It May Concern-</p>\n<p>Plaintiff Andrew Samuels, through counsel, hereby gives notice that a hearing on his Ex Parte Motion for Entry of Default Against Lido DAO, or in the Alternative, for Alternative Service On Lido DAO (“Motion”) will take place on Thursday, June 27, 2024, at 10:00 a.m. at the United States District Court for the Northern District of California, San Francisco Courthouse, 450 Golden Gate Avenue, San Francisco, CA 94102, Courtroom 4. The Motion requests that the Court direct the Clerk to enter a default against Defendant Lido DAO, which was properly served on December 22, 2023 but has not appeared or answered. In the alternative, the Motion requests that the Court order that Plaintiff may serve the summons and complaint on Lido DAO via the alternative methods detailed below; and, because Plaintiff provided Lido DAO the summons and complaint via those methods no later than February 6, 2024, order that Plaintiff effectively served Lido DAO on that date.</p>\n<p>A copy of the motion is available for download at: tinyurl[dot]com/jrjfd4bp - [Note: the forum is not permitting me to post a full url; please replace the [dot] with a . and paste the address into your browser]</p>\n<p>The case is Samuels v. Lido DAO, et al., docketed as No. 23-cv-6492 in the U.S. District Court for the Northern District of California.</p>\n<p>Thank you.</p>\n            <p><small>1 post - 1 participant</small></p>\n            <p><a href=\"https://research.lido.fi/t/notice-of-motion-for-entry-of-default-against-lido-dao-or-in-the-alternative-for-alternative-service-on-lido-dao/7608\">Read full topic</a></p>","link":"https://research.lido.fi/t/notice-of-motion-for-entry-of-default-against-lido-dao-or-in-the-alternative-for-alternative-service-on-lido-dao/7608","pubDate":"Thu, 30 May 2024 20:23:41 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"research.lido.fi-topic-7608"},"source":{"@url":"https://research.lido.fi/t/notice-of-motion-for-entry-of-default-against-lido-dao-or-in-the-alternative-for-alternative-service-on-lido-dao/7608.rss","#text":"Notice of Motion for Entry of Default Against Lido DAO, or in the Alternative, for Alternative Service On Lido DAO"},"filter":false},{"title":"XGA: eXtensible Gas Auctions for enabling Preconfirmations without Restaking or ePBS","dc:creator":"sambacha","category":"Proposals","description":"<h1><a name=\"xga-enabling-preconfirmations-without-restaking-or-epbs-1\" class=\"anchor\" href=\"https://research.lido.fi#xga-enabling-preconfirmations-without-restaking-or-epbs-1\"></a>XGA: Enabling Preconfirmations without Restaking or ePBS</h1>\n<p>XGA or eXtensible Gas Auctions is a platform developed jointly by Manifold Finance and 20<span class=\"chcklst-box fa fa-square-o fa-fw\"></span><sup class=\"footnote-ref\"><a href=\"https://research.lido.fi#footnote-16018-1\" id=\"footnote-ref-16018-1\">[1]</a></sup><br>\nManifold Finance has operated the only original non-censoring Relay since the Merge and 20sq has done mechanism design and review using their open source “Open Games”<sup class=\"footnote-ref\"><a href=\"https://research.lido.fi#footnote-16018-2\" id=\"footnote-ref-16018-2\">[2]</a></sup> engine for projects like Flashbots regarding PBS (see <a href=\"https://github.com/20squares/pbs-auctions/tree/master/pbs-og\" rel=\"noopener nofollow ugc\">https://github.com/20squares/pbs-auctions/tree/master/pbs-og</a>) and more. They have additionally written extensively on the topics of Blockspace (see <a href=\"https://blog.20squares.xyz/correctly-pricing-txs-parallel/\" rel=\"noopener nofollow ugc\">https://blog.20squares.xyz/correctly-pricing-txs-parallel/</a>) and MEV (see <a href=\"https://blog.20squares.xyz/mev-cui-bono/\" rel=\"noopener nofollow ugc\">https://blog.20squares.xyz/mev-cui-bono/</a>).</p>\n<blockquote>\n<p>The documentation for XGA is live at <a href=\"https://docs.xga.com\" rel=\"noopener nofollow ugc\">docs.xga.com</a> &amp; source  via <a href=\"https://github.com/manifoldfinance\" rel=\"noopener nofollow ugc\">GitHub</a></p>\n</blockquote>\n<h2><a name=\"preconfirmations-using-a-forward-contract-market-2\" class=\"anchor\" href=\"https://research.lido.fi#preconfirmations-using-a-forward-contract-market-2\"></a>Preconfirmations using a Forward Contract Market</h2>\n<p>The XGA platform revolutionizes the way block space is allocated to builders and searchers, making it more dynamic and accessible. The auction is implemented on a L2 Rollup based off the OP Stack with minimal changes. The Auction is currently deployed and live on main net<sup class=\"footnote-ref\"><a href=\"https://research.lido.fi#footnote-16018-3\" id=\"footnote-ref-16018-3\">[3]</a></sup> ethereum.</p>\n<blockquote>\n<p>Validators simply need to connect to our new relay implementation, and run an updated Vouch or MEV Boost client. That is all the onboarding process really involves. There is no restaking, no risk to capital for the validators. This proposal would necessitate the adding of the new relay to the Relay must include the list for Lido validators. The onboarding process and current status is discussed more in the <span class=\"hashtag-raw\">#roadmap</span> section.</p>\n</blockquote>\n<h3><a name=\"call-market-mechanics-3\" class=\"anchor\" href=\"https://research.lido.fi#call-market-mechanics-3\"></a>Call Market mechanics</h3>\n<p>XGA facilitates the allocation of blockspace by dividing each block into two parts instead of selling it as a single monolithic entity. One part is designated for high-priority, time-sensitive transactions (⍺-blockspace), while the other is reserved for less urgent transactions (β-blockspace). This segmentation allows users to select the most cost-effective and suitable space for their needs, enhancing transaction efficiency and user value.</p>\n<h4><a name=\"mev-boost-compatibility-4\" class=\"anchor\" href=\"https://research.lido.fi#mev-boost-compatibility-4\"></a>MEV Boost compatibility</h4>\n<p>The second change includes the timing of sales. The first part of the block is sold through <em>mev-boost</em> as is common now for most blocks. The second part of the block is sold as a form of preconfirmation. That is, if a block gets minted at time <em>t</em>, the bottom part is sold in a pre-defined period before. This part is sold in a multi-unit way meaning that several bidders can win blockspace for this part.</p>\n<p>Winners of the <em>beta</em> part of block <em>b</em> can then submit their bundles before the block gets actually minted. <em>In effect, winners of the auction get an inclusion guarantee beforehand.</em> Winners simply “burn” their position on the L2 and submit their L1 transaction.</p>\n<p>In version 1.0, the final merging of alpha and beta portions of the block are handled by our specially designed relay.  This relay is live on mainnet at <a href=\"https://mainnet-auction.securerpc.com\" rel=\"noopener nofollow ugc\">https://mainnet-auction.securerpc.com</a>. Version 2.0 eliminates this privileged service requirement.</p>\n<h2><a name=\"validator-participation-without-slashing-or-loss-risk-5\" class=\"anchor\" href=\"https://research.lido.fi#validator-participation-without-slashing-or-loss-risk-5\"></a>Validator Participation without Slashing or Loss Risk</h2>\n<p>On the validator side, to participate, a validator must be permissioned to register with this service (the relay). Practically, the validator places the relay as a <em>privileged service</em>. This means that it will ignore bids from other relays during a defined time window, and if it fails to receive a valid response from our relay, it will then consider other bids from other relays. If the validator does not get a valid proposal from our relay, it then will pick the highest submitted block it has got from all other relays. Therefore, there is very little remunerative risk from the validator perspective. Any additional risk is covered by our “Captive Insurance” program, in which we cover any costs that are incurred due to assurance violations.</p>\n<blockquote>\n<p>This logic is to ensure against potential service disruptions causing losses for validators. It also provides an enforcement mechanism for the forward contracts to begin with without resorting to slashing. This is why validators must also be approved to register with the relay to participate for version 1.0.</p>\n</blockquote>\n<h2><a name=\"captive-risk-retention-protects-validator-revenue-and-capital-6\" class=\"anchor\" href=\"https://research.lido.fi#captive-risk-retention-protects-validator-revenue-and-capital-6\"></a>Captive Risk Retention protects Validator Revenue and Capital</h2>\n<p>Captive Risk Retention (or “Captive Insurance”) is our risk management protocol, which the primary purpose is to insure the risk related to the relay and auction. It provides a direct relationship between the insured and insurer, and is incentive aligned. The aim is to protect validator stake, earnings and market participants against service outages or other exogenous disruptions , ensuring continuity of potential profits and explicit protections for participating parties.</p>\n<blockquote>\n<p>2.5% gross is taken from the ß-auction into the backstop fund. This amount can be adjusted. Should claims exceed the backstop fund, a pro rata charge is applied to the protocol vault of staked assets and liquidated into ETH to cover the shortfall.</p>\n</blockquote>\n<h3><a name=\"coverage-scope-7\" class=\"anchor\" href=\"https://research.lido.fi#coverage-scope-7\"></a><strong>Coverage Scope</strong></h3>\n<h4><a name=\"service-downtime-8\" class=\"anchor\" href=\"https://research.lido.fi#service-downtime-8\"></a><strong>Service Downtime</strong></h4>\n<p>Provides compensation for any periods when the relay service is either inoperable or inaccessible.</p>\n<h4><a name=\"incorrect-or-malicious-proposals-9\" class=\"anchor\" href=\"https://research.lido.fi#incorrect-or-malicious-proposals-9\"></a><strong>Incorrect or Malicious Proposals</strong></h4>\n<p>Offers protection against losses arising from incorrect or malicious block proposals made by the relay.</p>\n<h4><a name=\"performance-degradation-10\" class=\"anchor\" href=\"https://research.lido.fi#performance-degradation-10\"></a><strong>Performance Degradation</strong></h4>\n<p>Ensures coverage in cases where the relay’s performance deteriorates significantly, affecting validator operations.</p>\n<p>The insurance protocol seeks to provide coverage against a validator not having access to both MEV Boost Auction and the XGA Auction. The MEV Boost auction is protected by failover capacity of 3rd party relays (as described earlier). So long as this mechanism is correctly working, this greatly limits the liability in terms of potential losses that  XGA could end up being on the hook for.</p>\n<h2><a name=\"additional-mev-improvements-and-integrations-11\" class=\"anchor\" href=\"https://research.lido.fi#additional-mev-improvements-and-integrations-11\"></a>Additional MEV Improvements and Integrations</h2>\n<h3><a name=\"buildersearcher-separation-12\" class=\"anchor\" href=\"https://research.lido.fi#buildersearcher-separation-12\"></a>Builder/Searcher Separation</h3>\n<p>Searchers no longer need to vertically integrate with builders to enhance their inclusion rate. This is an important development in the market structure as it will lead to more truthful bidding (i.e. higher bidding). Searchers can now focus on their strategies without having to develop relationships with existing builder incumbents. Thus the barrier to entry is reduced, increasing competition overall and leading to higher validator MEV reward share.</p>\n<h3><a name=\"contract-bidding-strategies-13\" class=\"anchor\" href=\"https://research.lido.fi#contract-bidding-strategies-13\"></a>Contract Bidding Strategies</h3>\n<p>By utilizing smart contracts for bidding and introducing a novel tie-breaking rule that emphasizes competitive pressure over simple high bids, the platform encourages fairer pricing and maximizes the value obtained from each auction. This has the added benefit of providing a way for smaller participants to avoid the latency game of request-response based bidding (i.e. API based).</p>\n<h3><a name=\"blockscout-support-for-preconfirmations-14\" class=\"anchor\" href=\"https://research.lido.fi#blockscout-support-for-preconfirmations-14\"></a>Blockscout support for Preconfirmations</h3>\n<p>We are working with the Blockscout team to provide first class support for preconfirmations visualization and tracking for users out of the box. We are currently using Blockscout for the L2 rollup explorer.</p>\n<h2><a name=\"eligible-node-operators-15\" class=\"anchor\" href=\"https://research.lido.fi#eligible-node-operators-15\"></a>Eligible Node Operators</h2>\n<p>The following Node Operators are eligible to participant in the first cohort. They are listed below in no particular order. Eligibility is determined using <a href=\"https://rated.network\" rel=\"noopener nofollow ugc\">rated.network</a>’s information regarding CL client usage. Due to the way that Prysm and Nimbus clients have implemented the Builder API v3 they would require changes to the CL client which we prefer not to do.</p>\n<p>As a Node Operator, you only have to run a slightly modified MEV Boost client or a modified Vouch client. This modification is to ensure that the failover capability is handled by the node operator, and not a centralized load balancer.</p>\n<div class=\"md-table\">\n<table>\n<thead>\n<tr>\n<th>Node Operator</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>CryptoManufaktur</td>\n</tr>\n<tr>\n<td>Allnodes</td>\n</tr>\n<tr>\n<td>Kukis Global</td>\n</tr>\n<tr>\n<td>Attestant</td>\n</tr>\n<tr>\n<td>Chainsafe</td>\n</tr>\n<tr>\n<td>Klin</td>\n</tr>\n<tr>\n<td>ChainLayer</td>\n</tr>\n<tr>\n<td>Stakely</td>\n</tr>\n<tr>\n<td>Chorus One</td>\n</tr>\n<tr>\n<td>Figment</td>\n</tr>\n<tr>\n<td>Sigma Prime</td>\n</tr>\n<tr>\n<td>A41</td>\n</tr>\n<tr>\n<td>Stakin</td>\n</tr>\n<tr>\n<td>StakeFish</td>\n</tr>\n<tr>\n<td>Staking Facilities</td>\n</tr>\n</tbody>\n</table>\n</div><h2><a name=\"legal-risks-16\" class=\"anchor\" href=\"https://research.lido.fi#legal-risks-16\"></a>Legal Risks</h2>\n<p>XGA has retained the council of Michael Frisch<sup class=\"footnote-ref\"><a href=\"https://research.lido.fi#footnote-16018-4\" id=\"footnote-ref-16018-4\">[4]</a></sup>, Mike’s experience with cryptocurrency began at the Commodity Futures Trading Commission (CFTC), where he brought one of the CFTC’s first enforcement actions involving cryptocurrency — CFTC v. Bitfinex — and was part of the team responsible for the CFTC’s action against Tether in 2021. While at the CFTC, Mike was part of the litigation team in CFTC v. Monex, a landmark case concerning the applicability of Section 2(c)(2)(D) of the CEA, and contributed to the CFTC’s Final Interpretive Guidance on Actual Delivery for Digital Assets.</p>\n<h2><a name=\"roadmap-17\" class=\"anchor\" href=\"https://research.lido.fi#roadmap-17\"></a>Roadmap</h2>\n<p>XGA is live on mainnet Ethereum, today. We have already signed Frax as our initial launch partner for main net and they have been testing with us for the last 6 weeks on Holesky. We expect by late next week to begin adding their validator set to the relay.</p>\n<p></p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://europe1.discourse-cdn.com/business20/uploads/lido/original/2X/7/7fff8f049b3ecbff67943affbfe2c08c3e2c917a.png\" data-download-href=\"/uploads/short-url/igkaA0WJCFcct7mWiUIgrSlettw.png?dl=1\" title=\"XGA LST Chart May 25_1\" rel=\"noopener nofollow ugc\"><img src=\"https://europe1.discourse-cdn.com/business20/uploads/lido/optimized/2X/7/7fff8f049b3ecbff67943affbfe2c08c3e2c917a_2_342x500.png\" alt=\"XGA LST Chart May 25_1\" data-base62-sha1=\"igkaA0WJCFcct7mWiUIgrSlettw\" width=\"342\" height=\"500\" srcset=\"https://europe1.discourse-cdn.com/business20/uploads/lido/optimized/2X/7/7fff8f049b3ecbff67943affbfe2c08c3e2c917a_2_342x500.png, https://europe1.discourse-cdn.com/business20/uploads/lido/optimized/2X/7/7fff8f049b3ecbff67943affbfe2c08c3e2c917a_2_513x750.png 1.5x, https://europe1.discourse-cdn.com/business20/uploads/lido/optimized/2X/7/7fff8f049b3ecbff67943affbfe2c08c3e2c917a_2_684x1000.png 2x\" data-dominant-color=\"F8F8F8\"></a></div><p></p>\n<h2><a name=\"contact-18\" class=\"anchor\" href=\"https://research.lido.fi#contact-18\"></a>Contact</h2>\n<p>We maintain a community telegram channel that is active and participatory, join <a href=\"https://t.me/manifoldfinance\" rel=\"noopener nofollow ugc\">t.me/manifoldfinance</a> or our <a href=\"https://forums.manifoldfinance.com\" rel=\"noopener nofollow ugc\">forums.manifoldfinance.com</a></p>\n<hr>\n<h3><a name=\"disclaimer-19\" class=\"anchor\" href=\"https://research.lido.fi#disclaimer-19\"></a>Disclaimer</h3>\n<pre>The content and information presented on this post (here after referred to as \"Content\") is for informational and educational purposes only. The Content is explicitly not intended to be suitable for any specific purpose, including but not limited to commercial use, and it is explicitly not intended to meet any merchantability requirements. Furthermore, no warranty or representation, whether express or implied, is made as to the Content's suitability for any specific purpose. This Content does not constitute professional financial advice, investment advice, trading advice, and should not be relied upon for making personal, financial, investment, or trading decisions. The Content is provided strictly \"as is\" and \"as available\", without any warranties or representations, either express or implied. This includes, but is not limited to, warranties of accuracy, completeness, reliability, or timeliness. The post's authors and administrators, and any entity associated with them, do not make any representation or warranty regarding the Content and do not accept any responsibility for any loss, damage, liability, or expense suffered by you, the User, or any other person or entity as a result of reliance upon the Content.  The Content is general in nature and does not consider your specific circumstances, financial or otherwise. Before you make any decisions or take any actions that might affect your personal finances or investments, you should consult a qualified professional financial advisor or broker. This post is hosted on a website that is accessible globally, but this does not imply that all Content provided or offered through this website is appropriate or available for use in all jurisdictions. If you access this website (i.e. this post), you do so at your own risk, and you are responsible for compliance with local laws and regulations.  Please note, the laws and regulations regarding financial advice differ between countries, particularly between the United States of America, the United Kingdom and the European Union. Users should not construe any of the Content as legal advice and should consult a legal professional in their respective country to ensure adherence to local laws and regulations.  By reading this proposal, you accept this disclaimer in full. If you disagree with any part of this disclaimer, you should not continue to read this proposal.\n</pre>\n<h3><a name=\"footnotes-20\" class=\"anchor\" href=\"https://research.lido.fi#footnotes-20\"></a>Footnotes</h3>\n<hr class=\"footnotes-sep\">\n\n<ol class=\"footnotes-list\">\n<li id=\"footnote-16018-1\" class=\"footnote-item\"><p>20squares or 20<span class=\"chcklst-box fa fa-square-o fa-fw\"></span> <a href=\"https://research.lido.fi#footnote-ref-16018-1\" class=\"footnote-backref\">↩︎</a></p>\n</li>\n<li id=\"footnote-16018-2\" class=\"footnote-item\"><p><a href=\"https://github.com/CyberCat-Institute/open-game-engine\" class=\"inline-onebox\" rel=\"noopener nofollow ugc\">GitHub - CyberCat-Institute/open-game-engine: Haskell implementation of open games</a> <a href=\"https://research.lido.fi#footnote-ref-16018-2\" class=\"footnote-backref\">↩︎</a></p>\n</li>\n<li id=\"footnote-16018-3\" class=\"footnote-item\"><p>see  <a href=\"https://mainnet-auction.securerpc.com\" rel=\"noopener nofollow ugc\">https://mainnet-auction.securerpc.com</a> <a href=\"https://research.lido.fi#footnote-ref-16018-3\" class=\"footnote-backref\">↩︎</a></p>\n</li>\n<li id=\"footnote-16018-4\" class=\"footnote-item\"><p>see <a href=\"https://crokefairchild.com/team/michael-frisch\" rel=\"noopener nofollow ugc\">https://crokefairchild.com/team/michael-frisch</a> <a href=\"https://research.lido.fi#footnote-ref-16018-4\" class=\"footnote-backref\">↩︎</a></p>\n</li>\n</ol>\n            <p><small>3 posts - 1 participant</small></p>\n            <p><a href=\"https://research.lido.fi/t/xga-extensible-gas-auctions-for-enabling-preconfirmations-without-restaking-or-epbs/7584\">Read full topic</a></p>","link":"https://research.lido.fi/t/xga-extensible-gas-auctions-for-enabling-preconfirmations-without-restaking-or-epbs/7584","pubDate":"Tue, 28 May 2024 15:57:36 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"research.lido.fi-topic-7584"},"source":{"@url":"https://research.lido.fi/t/xga-extensible-gas-auctions-for-enabling-preconfirmations-without-restaking-or-epbs/7584.rss","#text":"XGA: eXtensible Gas Auctions for enabling Preconfirmations without Restaking or ePBS"},"filter":false},{"title":"Alliance Review and Security Checklist","dc:creator":"steakhouse","category":"Alliance","description":"<p>Now that the Alliance has been <a href=\"https://research.lido.fi/t/lido-alliance-an-ethereum-aligned-ecosystem/\">formally approved</a>, we wanted to share some thoughts on the review and endorsement process.</p>\n<p>One of the most important aspects of endorsement is about adhering to an obsessive security culture. Endorsement carries some risk for Lido, particularly with newer, untested protocols. However, the premise of the Alliance is precisely to be flexible enough to help emerging projects reach a new stage of growth. So what the endorsement process should focus on is whether the security culture of a project is sufficiently strong and whether the project has the right processes in place.</p>\n<p>As part of the review process, we wanted to share some illustrative questions that we would look to ask projects seeking Lido Alliance endorsement. These questions aim to provide a fuller picture of the security processes of a prospective member.</p>\n<ul>\n<li><strong>What are the processes for putting code into production?</strong>\n<ul>\n<li>What is the release flow from the security perspective?</li>\n<li>How does the team decide the code is ready for mainnet?</li>\n<li>Does the protocol have public audits?\n<ul>\n<li>Links:</li>\n<li>What parties conducted the audits?</li>\n<li>What’s the issue summary (total issues / total fixed / crits and highs / crits and highs fixed)</li>\n</ul>\n</li>\n<li>How is the deployment verified against the audit?</li>\n</ul>\n</li>\n<li><strong>What are the processes for managing security through TVL growth?</strong>\n<ul>\n<li>Is there a bug bounty? if yes — which and where</li>\n<li>Are there limits / thresholds on the project / TVL? Who controls those?</li>\n<li>Are there any user funds on a multisig?</li>\n<li>Is the code upgradable?\n<ul>\n<li>How and who controls upgradability?</li>\n</ul>\n</li>\n</ul>\n</li>\n<li><strong>What is the likelihood that the project will endure?</strong>\n<ul>\n<li>Is the project incorporated? How the legal structure looks like?\n<ul>\n<li>Neither of these is a blocker, it just gives a fuller picture</li>\n</ul>\n</li>\n<li>What’s the funding situation?\n<ul>\n<li>Similarly, also not a blocker</li>\n</ul>\n</li>\n<li>What is the team size?</li>\n<li>Is the code open source? What’s the license?</li>\n</ul>\n</li>\n</ul>\n<p>As we work through the summary and recommendation for the first two proposals, the process and questions may shift or change to suit particularities of a given project or to strengthen the review process itself.</p>\n            <p><small>7 posts - 5 participants</small></p>\n            <p><a href=\"https://research.lido.fi/t/alliance-review-and-security-checklist/7578\">Read full topic</a></p>","link":"https://research.lido.fi/t/alliance-review-and-security-checklist/7578","pubDate":"Mon, 27 May 2024 11:32:57 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"research.lido.fi-topic-7578"},"source":{"@url":"https://research.lido.fi/t/alliance-review-and-security-checklist/7578.rss","#text":"Alliance Review and Security Checklist"},"filter":false},{"title":"Mellow Lido Alliance proposal","dc:creator":"s0xn1ck","category":"Alliance","description":"<h1><a name=\"tldr-1\" class=\"anchor\" href=\"https://research.lido.fi#tldr-1\"></a>TL;DR</h1>\n<ul>\n<li>Mellow is a novel restaking primitive that allows for permissionless LRT creation, based on their own risk profiles and curation models\n<ul>\n<li>This proposal requests endorsement following the Lido Alliance framework and is for consideration by Lido DAO token holders</li>\n<li>This proposal was drafted with support from the interim Lido Alliance Workgroup</li>\n</ul>\n</li>\n<li>As permissionless LRT middleware, <a href=\"https://research.lido.fi/t/mellow-lido-alliance-proposal/7557#curators-assemble-8\">Mellow will help curators</a> launch their own LRTs backed by stETH\n<ul>\n<li>Lido will integrate descriptions and links to deposits in Mellow UI in stETH into the Lido landing webpage</li>\n<li>Mellow will introduce a loyalty program for new stETH LRTs to maintain sticky liquidity</li>\n</ul>\n</li>\n<li>The interim Lido Alliance Workgroup will review the proposal.</li>\n<li>Following the recommendation of the team or committee, the approval of Mellow as a Lido Alliance partner will be voted on by Lido DAO token holders through Snapshot</li>\n</ul>\n<h1><a name=\"background-2\" class=\"anchor\" href=\"https://research.lido.fi#background-2\"></a>Background</h1>\n<p>Current LRTs force users into a one-size-fits-all risk profile for opting into different AVSes. This approach fails to address the diverse needs of users and tends to overexpose them to slashing risk. <a href=\"https://mellow.finance/\">Mellow</a> solves this by abstracting risk management and allowing for unlimited risk profiles, enabling anyone to curate different AVS compositions and risks.</p>\n<ul>\n<li>Restaking is evolving\n<ul>\n<li>Restaking allows Ethereum validators to repurpose their consensus capacity by opting in to validate additional third-party services. By doing that, in addition to staking rewards, restakers receive rewards and face slashing risks from these services, but these features are not yet implemented by major restaking protocols</li>\n<li>So far, restaking has amassed a significant chunk of ETH supply, some ~$16B or 5.5M ETH, which are held by few major restaking protocols through both native staking and LRTs</li>\n<li>More than half of this ETH is staked by a dozen of liquid restaking providers, which are riskier than native staking, but allow users to reuse their positions in DeFi</li>\n</ul>\n</li>\n<li>Issues of restaking\n<ul>\n<li>Restaking modules, rewards distribution and slashing mechanisms for major protocols are still under development</li>\n<li>Alignment of governance token holders and ETH restakers is vital for a successful protocol, and on issues of revenue sharing or risk bearing it can become a tug of war</li>\n<li>Adding new layers of abstraction over tokenomics can be useful to align stimulus by contouring out some slashing and fork risks, but it makes the system complex and egalitarian</li>\n</ul>\n</li>\n<li>LRTs landscape and issues, risks\n<ul>\n<li>LRTs represent a significant advancement in DeFi by enabling users to earn restaked ETH without sacrificing liquidity</li>\n<li>LRTs market structure is similar to LSTs, with the difference that more differentiation will be possible so more players are expected to compete for a substantial share of the market</li>\n<li>Top 4 LRTs capture more than 90% of restaked ETH, but overall, there are about 20 LRT providers with different implementations wrt validation infrastructure and native/liquid staking</li>\n<li>Besides smart contract and depeg risk, restaking introduces novel slashing risks as users commit their ETH to validate both the Ethereum blockchain and AVSs–each LRT protocol determines which AVSs to validate using their pooled ETH, effectively managing the AVS risk for its users</li>\n<li>Mellow offers an improved level of granularity of exposure to risks for users by enabling the creation of permissionless LRTs</li>\n</ul>\n</li>\n<li>How Mellow fixes LRTs\n<ul>\n<li>Current LRTs force users into a single risk profile for opting into different AVSes</li>\n<li>This approach fails to address users’ diverse needs and overexposes them to slashing risk</li>\n<li>Mellow solves this by decentralizing LRT creation and allowing for unlimited risk profiles</li>\n<li>LRT curators can create their own LRTs that fit their business’s risk/reward profile</li>\n</ul>\n</li>\n<li>Composability and integrations\n<ul>\n<li>We propose launching Mellow’s novel LRT solution as part of the Lido Alliance, prioritizing stETH and offering the opportunity to restaking users to select the most secure collateral available for restaking</li>\n<li>We expect Lido DAO to integrate descriptions and links to Mellow deposits in stETH into the Lido landing page.</li>\n<li>In return, Lido DAO can expect Mellow to prioritize stETH as a collateral asset through loyalty programs or specific points multipliers</li>\n</ul>\n</li>\n<li>Operators and AVSes\n<ul>\n<li>Restaking tech is not mature yet. It is only recently that solo restakers can choose operators to delegate their tokens, and payments from AVS back to restakers are not yet enabled by major protocols</li>\n<li>From the perspective of LRTs, only a few of them have launched governance tokens, but their teams have already unilaterally decided on operators and AVS’ that users are exposed to</li>\n<li>This illustrates the issues around trying to match LRT holders’ heterogeneous risk profiles with a Procrustean bed of homogeneous design in current LRTs</li>\n</ul>\n</li>\n<li>LRT curation\n<ul>\n<li>At Mellow, we believe the future of restaking is decentralized, which means implementing permissionless LRTs</li>\n<li>Mellow’s LRT curation process includes analytical coverage of LRTs issued using Mellow tech, collaboration with existing issuers on DeFi integrations, and aiding in onboarding new LRTs</li>\n</ul>\n</li>\n</ul>\n<h1><a name=\"protocol-overview-3\" class=\"anchor\" href=\"https://research.lido.fi#protocol-overview-3\"></a>Protocol overview</h1>\n<p>Mellow Protocol is an innovative liquid restaking protocol designed to operate within the dynamic environment of the AVS ecosystem. Mellow Protocol offers a series of vault smart contracts tailored to different risk profiles, managed by curators. These vaults rely on the inherent flexibility, composability and security of both Ethereum and restaking providers to mitigate AVS risks effectively.</p>\n<p>The architecture of Mellow Protocol is engineered to adapt to the varying needs of its users while maintaining a high standard of security and transparency. By allowing permissionless LRT curation, Mellow enables depositors more flexibility regarding their desired level of exposure to risk, while still benefiting from the liquidity of staked assets. This is achieved by dynamically adjusting strategies within each vault based on real-time risk assessments and market conditions.</p>\n<p>Mellow’s smart-contract framework is built to be extensible, allowing for the seamless introduction of new features and vault types with minimal changes to the existing codebase. This ensures a low attack surface while facilitating the development of additional products and services.</p>\n<p>To further enhance its robustness and functionality, Mellow Protocol integrates with a variety of DeFi primitives and infrastructures. This integration provides best user experience, enabling seamless interaction with other financial tools and services within the ecosystem. Future iterations of Mellow Protocol are planned to include advanced features such as dynamic rebalancing of vault allocations to optimize risk-adjusted returns and minimize potential losses due to market volatility.</p>\n<ul>\n<li>Overview of Restaking\n<ul>\n<li>Through restaking protocols, stakers can choose to accept additional slashing conditions on their staked ETH for rewards from protocols whose state is secured by stakers’ assets.</li>\n<li>Typical design enables the validation of various modules, including consensus protocols for L2s and appChains, data availability layers, virtual machines &amp; application layers, creating new revenue opportunities for restakers.</li>\n<li>Restaking protocols share the abundant security of Ethereum consensus by spilling it over to these modules, enhancing the reliability of their consensus and adding extra revenue source to restakers.</li>\n</ul>\n</li>\n<li>Launching LRTs will be permissionless for curators/users\n<ul>\n<li>Although LRTs permit delegation to multiple AVS operators, permissioned LRT holders and LRT node operators have little to no choice in how these delegation sets are formed or how risks are managed.</li>\n<li>Holders can only make adjustments by changing the amount of LRT to which they are exposed.</li>\n<li>Allowing LRT curators to issue new LRTs with refined risk/reward ratios in a permissionless manner makes the possibility of malfunctions causing ripple effects and liquidation cascades across the entire ecosystem remote and unlikely.</li>\n</ul>\n</li>\n<li>Fees mechanism for curators\n<ul>\n<li>LRT curators are incentivized to set a competitive fee on restaking revenue. Mellow plans to aid LRT curators to launch permissionless LRTs with deployment, maintenance and DeFi integrations.</li>\n</ul>\n</li>\n</ul>\n<p></p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://europe1.discourse-cdn.com/business20/uploads/lido/original/2X/1/1d893bb532fa21c174826a7400ad8e72f4c2910e.png\" data-download-href=\"/uploads/short-url/4dhRMDaEMD43rUl9WYIT7SKF2J8.png?dl=1\" title=\"SchemeLRT\"><img src=\"https://europe1.discourse-cdn.com/business20/uploads/lido/optimized/2X/1/1d893bb532fa21c174826a7400ad8e72f4c2910e_2_518x500.png\" alt=\"SchemeLRT\" data-base62-sha1=\"4dhRMDaEMD43rUl9WYIT7SKF2J8\" width=\"518\" height=\"500\" srcset=\"https://europe1.discourse-cdn.com/business20/uploads/lido/optimized/2X/1/1d893bb532fa21c174826a7400ad8e72f4c2910e_2_518x500.png, https://europe1.discourse-cdn.com/business20/uploads/lido/optimized/2X/1/1d893bb532fa21c174826a7400ad8e72f4c2910e_2_777x750.png 1.5x, https://europe1.discourse-cdn.com/business20/uploads/lido/optimized/2X/1/1d893bb532fa21c174826a7400ad8e72f4c2910e_2_1036x1000.png 2x\" data-dominant-color=\"FBFBFB\"></a></div><p></p>\n<h1><a name=\"what-is-mellows-security-culture-4\" class=\"anchor\" href=\"https://research.lido.fi#what-is-mellows-security-culture-4\"></a>What is Mellow’s Security Culture?</h1>\n<p>As a fully on-chain protocol, we give security a central role in both the development and maintenance of our on-chain products.</p>\n<p>In the architectural design phase, we decompose the system into the smallest programmable modules or primitives possible. This allows for thorough testing of each module’s logic. We achieve 100% test coverage for each component and perform internal audits, ensuring high code quality and robust security for each component.</p>\n<p>Upon completion, we assess potential edge effects that may arise when integrating various components, including external modules. Previously, when implementing ALM (automated liquidity management) strategies in Mellow, we developed integrations with other DeFi protocols, requiring a deep understanding of not only our own architecture but also that of integrated protocols like Aave and Uniswap. We’ve never had a single security incident.</p>\n<p>We collaborate with renowned security experts and audit firms, including Chainsecurity, Statemind, and Spearbit, and we only release code to production after it has passed external audits.</p>\n<p>Maintaining security for our on-chain products is equally critical. We use real-time monitoring systems, Grafana dashboards and alerting systems to ensure operational integrity, provide tools for problem diagnosis, and also make it a prerequisite to have a public bug bounty program.</p>\n<p>Our Incident Response and Recovery Policy outlines the procedures for detecting, reporting, and responding to security incidents. It also details recovery steps, such as reverting to secure contract versions and notifying affected parties.</p>\n<p>It’s worth mentioning that our products have been operational for over 1.5 years without a single security incident.</p>\n<h1><a name=\"how-will-mellow-help-the-lido-alliance-achieve-its-mission-5\" class=\"anchor\" href=\"https://research.lido.fi#how-will-mellow-help-the-lido-alliance-achieve-its-mission-5\"></a>How will Mellow help the Lido Alliance achieve its mission</h1>\n<p>New integration with Mellow will benefit the whole Lido ecosystem and stakers, making stETH a one-stop vehicle for delegation to operators and different AVSes. stETH liquidity may be increased in addition to becoming prime LST vehicle available for onboarding to Mellow LRT.</p>\n<ul>\n<li>Ethereum-alignment and commitment to decentralize validation\n<ul>\n<li>By participating in the wide restaking ecosystem, Mellow would help to spread the geographical and technical decentralization efforts Lido does outside Ethereum validation.</li>\n<li>As ETH has moved from Lido to EigenLayer, the weighted average node operator set has <a href=\"https://x.com/enshriningplebs/status/1792304095950242075\">become significantly more concentrated</a>, presenting a risk to decentralized validation</li>\n<li>By encouraging users to use stETH in Mellow, we hope to increase the level of validator decentralization in restaking, positively influencing Ethereum integrity.</li>\n</ul>\n</li>\n<li>Use-cases for stETH adoption and integration\n<ul>\n<li>stETH users will find new opportunities to deposit their assets in a restaking marketplace that is more transparent and offers more granularity with regards to risk exposure</li>\n<li>stETH holders may benefit from exclusive opportunities for earning Mellow points</li>\n</ul>\n</li>\n<li>Opportunities for node operators\n<ul>\n<li>Lido node operators could launch their own composable LRT and take control of the risk management process by selecting AVS’ suitable for their needs rather than face their imposition by LRTs or restaking protocols</li>\n<li>They could also collaborate with curators to reach the same outcome and create bespoke LRTs for their customers, based on stETH</li>\n</ul>\n</li>\n</ul>\n<h1><a name=\"what-does-mellow-expect-from-lido-alliance-6\" class=\"anchor\" href=\"https://research.lido.fi#what-does-mellow-expect-from-lido-alliance-6\"></a>What does Mellow expect from Lido Alliance</h1>\n<ul>\n<li>Endorsement\n<ul>\n<li>Lido DAO’s acceptance of Mellow as a member of the Lido Alliance</li>\n</ul>\n</li>\n<li>Integrations\n<ul>\n<li>Mellow expects Lido to integrate descriptions and links to deposits in Mellow UI in stETH into the Lido landing page. After getting positive traction and if Lido Alliance sees it possible and bringing value, integration of deposits directly into any Lido UI.</li>\n</ul>\n</li>\n<li>Ecosystem\n<ul>\n<li>Shared stance of Mellow and Lido Alliance on decentralization and security is a prerequisite to having a shared ecosystem centered around stETH with Mellow LRTs as satellites.</li>\n</ul>\n</li>\n<li>Liquidity bootstrapping\n<ul>\n<li>Mellow seeks access to a partnership network to enhance its own business development efforts for liquidity provision within the system.</li>\n</ul>\n</li>\n<li>Network\n<ul>\n<li>Lido DAO contributors and Mellow members will apply security best practices, refer talented individuals to each other, and collaborate in various ways to build a decentralized future for the Ethereum ecosystem.</li>\n</ul>\n</li>\n<li>Consultation\n<ul>\n<li>Mellow anticipates benefiting from the Lido team’s extensive expertise in different aspects of the ecosystem and technology. This includes access to conversations with contributor groups for knowledge sharing, conducted in a limited and non-disruptive manner.</li>\n</ul>\n</li>\n</ul>\n<h1><a name=\"how-much-alignment-collateral-will-be-locked-in-the-alliance-legal-vehicle-7\" class=\"anchor\" href=\"https://research.lido.fi#how-much-alignment-collateral-will-be-locked-in-the-alliance-legal-vehicle-7\"></a>How much alignment collateral will be locked in the Alliance legal vehicle?</h1>\n<p>100,000,000 MLW tokens (10% of the total supply) will be locked in a Lido Alliance legal entity (e.g. Foundation) after TGE. <s>These tokens will be held in perpetuity</s> These tokens will be subject to the same vesting and cliff terms as the team tokens: a 12-month cliff following the TGE, and a 30-month vesting period beginning after the cliff <em>(amending the edit following the received feedback)</em>.</p>\n<h1><a name=\"curators-assemble-8\" class=\"anchor\" href=\"https://research.lido.fi#curators-assemble-8\"></a>Curators, assemble!</h1>\n<p>Node operators and other actors of staking landscape now have the opportunity to launch their own composable LRTs and take control of the risk management process by selecting appropriate services (AVS) that align with their vision and tech edge, rather than accepting imposed options by existing LRTs. By collaborating with Mellow, curators can create bespoke LRTs for the Ethereum ecosystem. If you want to onboard as LRT curator, kindly leave a comment below this proposal.</p>\n            <p><small>31 posts - 19 participants</small></p>\n            <p><a href=\"https://research.lido.fi/t/mellow-lido-alliance-proposal/7557\">Read full topic</a></p>","link":"https://research.lido.fi/t/mellow-lido-alliance-proposal/7557","pubDate":"Fri, 24 May 2024 14:35:21 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"research.lido.fi-topic-7557"},"source":{"@url":"https://research.lido.fi/t/mellow-lido-alliance-proposal/7557.rss","#text":"Mellow Lido Alliance proposal"},"filter":false},{"title":"Proposal: Onboard Drop to the Lido Alliance","dc:creator":"d_argunov","category":"Alliance","description":"<p></p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://europe1.discourse-cdn.com/business20/uploads/lido/original/2X/a/af25c6f2440bc9807e7d6eadc74a1955e7b746cb.jpeg\" data-download-href=\"/uploads/short-url/oZquEIVj4xh28j5pMTdtU05LqoX.jpeg?dl=1\" title=\"\"><img src=\"https://europe1.discourse-cdn.com/business20/uploads/lido/optimized/2X/a/af25c6f2440bc9807e7d6eadc74a1955e7b746cb_2_690x387.jpeg\" alt=\"\" data-base62-sha1=\"oZquEIVj4xh28j5pMTdtU05LqoX\" width=\"690\" height=\"387\" role=\"presentation\" srcset=\"https://europe1.discourse-cdn.com/business20/uploads/lido/optimized/2X/a/af25c6f2440bc9807e7d6eadc74a1955e7b746cb_2_690x387.jpeg, https://europe1.discourse-cdn.com/business20/uploads/lido/original/2X/a/af25c6f2440bc9807e7d6eadc74a1955e7b746cb.jpeg 1.5x, https://europe1.discourse-cdn.com/business20/uploads/lido/original/2X/a/af25c6f2440bc9807e7d6eadc74a1955e7b746cb.jpeg 2x\" data-dominant-color=\"746A7A\"></a></div><p></p>\n<h1><a name=\"proposal-1\" class=\"anchor\" href=\"https://research.lido.fi#proposal-1\"></a>Proposal</h1>\n<ul>\n<li>This document outlines the rationale for onboarding Drop, a cross-chain liquid staking protocol for the Interchain, to the Lido Alliance.</li>\n<li>It follows the Lido Alliance framework and is for consideration by Lido DAO token holders</li>\n<li>The interim Lido Alliance Workgroup will review the proposal.</li>\n<li>Following the recommendation of the team or committee, the approval of Drop as a Lido Alliance partner will be voted on by Lido DAO token holders through Snapshot</li>\n</ul>\n<h1><a name=\"summary-2\" class=\"anchor\" href=\"https://research.lido.fi#summary-2\"></a>Summary</h1>\n<ul>\n<li>How will Drop help the Lido Alliance achieve its mission\n<ul>\n<li>Sponsoring the decentralization of Ethereum ecosystem dependencies such as bridges and data-availability layers, sponsoring innovation/experimentation that benefits Lido and Ethereum</li>\n<li>Supporting distribution and use cases for wstETH in the Interchain, restaking opportunities, native ETH staking with Lido through Drop</li>\n<li>Opportunity to apply to Drop’s validator onboarding</li>\n</ul>\n</li>\n<li>What is Drop’s Security Culture?\n<ul>\n<li>Open-source, open-license software development, encapsulating complexity, rigorous unit and e2e testing, auditing, formal verification, real-time 24/7 monitoring and alerting.</li>\n</ul>\n</li>\n<li>What does Drop expect from the Lido Alliance\n<ul>\n<li>Endorsement, integration and communication support, liquidity bootstrapping, network, strategic advisory</li>\n</ul>\n</li>\n<li>How much alignment collateral will be locked in the Foundation\n<ul>\n<li>10% of Drop’s token supply</li>\n</ul>\n</li>\n</ul>\n<h1><a name=\"background-3\" class=\"anchor\" href=\"https://research.lido.fi#background-3\"></a>Background</h1>\n<p>The Interchain is a rapidly growing network of blockchains connected via a common, secure interoperability standard called the Inter Blockchain Communication protocol (IBC). In recent years, the Interchain has experienced tremendous growth in user experience, developer functionality, and market cap.</p>\n<p>Throughout this time, the Interchain has maintained a close connection with Ethereum through both its cultural values (decentralization and credible neutrality) and its technology stack. Notably, the Interchain stack has inspired the Ethereum development community to work on single-slot finality, protocol-enforced proposer commitments, application-specific rollups, Ethereum IBC, liquid staking modules, and more.</p>\n<p>To address the challenges of building Interchain DeFi applications, a team spun out of P2P to form Hadron Labs and helped launch Neutron, a secure, feature-rich smart contract platform capable of hosting <a href=\"https://blog.neutron.org/neutron-the-integrated-application-network-2944b2e2cade\">Integrated Applications</a> like Drop.</p>\n<p>Taking Neutron to market, Hadron Labs, in collaboration with Lido contributors, spearheaded the introduction of wstETH into the Interchain while prioritizing security and safeguarding the DAO against vendor lock-in. As part of this initiative, Hadron Labs and Axelar collaborated to deploy the<a href=\"https://research.lido.fi/t/lido-on-cosmos-initial-deployment/5338/2\"> initial bridge solution</a> and incentivize the adoption of the canonical wstETH standard.</p>\n<p><a href=\"http://drop.money\">Drop</a> is the spiritual successor of the Lido for the Interchain vision. Its software was initially developed by Hadron Labs engineers, and an independent Drop Foundation was incorporated to support the protocol’s long-term growth and development.</p>\n<h1><a name=\"protocol-overview-4\" class=\"anchor\" href=\"https://research.lido.fi#protocol-overview-4\"></a>Protocol Overview</h1>\n<p>Drop is a cross-chain liquid staking protocol implemented as an <a href=\"https://blog.neutron.org/neutron-the-integrated-application-network-2944b2e2cade\">Integrated Application</a> on the <a href=\"https://www.neutron.org/\">Neutron</a> network. Its <a href=\"https://cosmwasm.com/\">CosmWasm</a> smart-contract architecture leverages the <a href=\"https://ibc.cosmos.network/main\">Inter-Blockchain Communication</a> (IBC) protocol and Neutron’s <a href=\"https://docs.neutron.org/neutron/modules/interchain-txs/overview\">Interchain Transaction</a> (ICTX) and <a href=\"https://docs.neutron.org/neutron/modules/interchain-queries/overview\">Interchain Queries</a> (ICQ) capabilities to read the state of other blockchains and adjust delegations made by the protocol’s remotely controlled accounts.</p>\n<p>This architecture enables Drop to provide trust-minimized liquid staking services and scale with minimal additional overhead and risk: provided they are compatible with the IBC protocol, new networks and assets can be onboarded to the solution in a single transaction. The smart-contract components can be reused to provide new products and services (such as alternative LST models - rebasing, auto-compounding, bLuna-esque, etc.) with minimal or no additional code or attack surface.</p>\n<p>Since on-chain performance metrics such as uptime and governance participation can be retrieved in a trust-minimized manner through ICQs, Drop’s validator set management baseline can be automated:</p>\n<p>This frees up resources that can be invested in the active curation of excellent validator sets for the supported network. To further the decentralization of stake and infrastructure, the Drop DAO may incorporate off-chain considerations such as geography, infrastructure, and signing setups into its curation policy.</p>\n<p>Future iterations of Drop Protocol will likely implement Scaling Delegations, distributing stake across validators dynamically to maximize stake/infrastructure distribution, and to minimize slashing risks if an operator’s performance degrades.</p>\n<p>As an Integrated Application, Drop is synchronously composable with an array of DeFi primitives, including Duality (Neutron’s in-protocol orderbook), Astroport (Curve v2 style AMM), Mars (credit protocol enabling lending/borrowing, margin trading, and perps), Levana (perps), Apollo (vault strategies), Fission (yield splitting), Amulet (self-repaying loans), and more. This ecosystem forms a strong, coordinated set of use cases for Drop’s LSTs and their initial distribution, and provides a streamlined, synchronous UX for more advanced use cases such as delta-neutral or leveraged staking/farming.</p>\n<p>Drop is being integrated into key infrastructure and distribution channels such as the Skip API (the most widely used cross-chain router in the Interchain), Nexus (the leading bridge for TIA to Celestia rollups), and more to facilitate 1-click access to Drop’s LSTs from any network or application in the Interchain.</p>\n<h1><a name=\"how-will-drop-help-the-lido-alliance-achieve-its-mission-5\" class=\"anchor\" href=\"https://research.lido.fi#how-will-drop-help-the-lido-alliance-achieve-its-mission-5\"></a>How will Drop help the Lido Alliance achieve its mission?</h1>\n<h2><a name=\"ethereum-alignment-decentralized-validation-6\" class=\"anchor\" href=\"https://research.lido.fi#ethereum-alignment-decentralized-validation-6\"></a>Ethereum alignment / decentralized validation</h2>\n<p>Firstly, through its validator set management, Drop could contribute to the decentralization of data-availability layers (e.g. Celestia) and bridges (e.g. Axelar) that Ethereum rollups and wstETH rely on.</p>\n<p>As a more nimble DAO, Drop is likely to be the first to implement technologies that could prove valuable to Lido on Ethereum, such as scaling delegations, generating strategic insight and data on their effectiveness and trade-offs, and helping design and prioritize improvements to the core protocol.</p>\n<p>More broadly, Drop will contribute to the success of the Interchain, which has consistently generated research, innovation, and technologies that benefit Ethereum and its ecosystem, such as single-slot finality, protocol-enforced proposer commitments, application-specific rollups, Ethereum IBC, etc.</p>\n<h2><a name=\"use-cases-for-steth-adoption-7\" class=\"anchor\" href=\"https://research.lido.fi#use-cases-for-steth-adoption-7\"></a>Use cases for stETH adoption</h2>\n<p>Drop already allocates significant resources to helping design and build distribution and use cases for LSTs in the Interchain. Onboarding Drop to the Lido Alliance would empower Drop to actively drive the distribution and integration of wstETH alongside dAssets, and reduce the operational overhead and focus cost on Lido DAO contributors.</p>\n<p>Drop will contribute to the security, resilience, and user experience of the bridges upon which wstETH and dAssets depend. Thanks to its strategic proximity with the Cosmos Hub’s security aggregation, Mesh Security, and other key projects, it is also well positioned to sponsor the adoption of wstETH as restaking collateral in the Interchain.</p>\n<p>As a member of the Lido Alliance, Drop would be an ideal partner to explore restaking opportunities for wstETH. Drop’s architecture minimizes systemic risk to Lido on Ethereum, and incentive alignment between Lido and Drop would prevent the incentive to vampire attack that other providers may be tempted with.</p>\n<p>Eventually, the Lido DAO could use Drop’s protocol architecture as a local outpost for Lido on Ethereum, enabling ETH to be staked with Lido on Ethereum remotely and conveniently.</p>\n<h2><a name=\"opportunities-for-node-operators-8\" class=\"anchor\" href=\"https://research.lido.fi#opportunities-for-node-operators-8\"></a>Opportunities for node operators</h2>\n<p>While inclusion in Lido on Ethereum’s set does not guarantee node operators will be onboarded to Drop’s validator sets, excellent operators that are active in both ecosystems may apply and be onboarded to Drop’s validator sets in the Interchain, driving adoption and strengthening alignment between Lido and its ecosystem.</p>\n<h1><a name=\"what-is-drops-security-culture-9\" class=\"anchor\" href=\"https://research.lido.fi#what-is-drops-security-culture-9\"></a>What is Drop’s Security Culture?</h1>\n<p>Drop’s <a href=\"https://github.com/hadronlabs-org/drop-contracts\">codebase</a> is open-source and open-licensed. As a cross-chain protocol, Drop’s architecture minimizes the complexity of asynchronous interactions by following the principle of encapsulated complexity:</p>\n<p>Most protocol functions are broken down into minimal components, which can interface with one another according to strictly defined interfaces. This makes the protocol and its components formally verifiable and helps create a library of secure, battle-tested contracts. This prevents the creation of large, complex, monolithic contracts, which are harder to audit and reason about, and minimizes the risk of human error. It also enables basic components to be securely reused in different combinations to provide new products while minimizing code changes.</p>\n<p>Drop’s codebase has, and will continue to be, thoroughly tested throughout its development cycle. Drop employs both unit tests and comprehensive E2E tests using <a href=\"https://github.com/neutron-org/cosmopark\">cosmopark</a>. The framework’s purpose is to set up the most realistic testing environment possible by spinning up multiple networks, each with its own nodes and the same software versions as their mainnet counterparts, along with IBC channels and relayers, before conducting a battery of tests on the protocol.</p>\n<p>Drop recently completed its first audit with <a href=\"https://www.oaksecurity.io/\">Oak Security</a>, a leading CosmWasm auditing firm. The final audit report will be attached to this proposal upon release from Oak Security. A second audit is being scheduled with <a href=\"https://osec.io/\">OtterSec</a> ahead of launch.</p>\n<p>Starting on the 27th of May, Drop will also undergo formal verification by <a href=\"https://informal.systems/\">Informal Systems</a> using <a href=\"https://github.com/informalsystems/quint\">Quint</a>. This process aims to increase confidence in Drop’s design by ensuring that the system’s behavior—defined within a formal model—satisfies specific properties, which are also delineated in the formal model.</p>\n<p>An early version of Drop is currently deployed on <a href=\"https://docs.neutron.org/deployment/testnet\">pion-1</a>, Neutron’s persistent testnet. The protocol’s instance is being updated to match changes made as part of the Oak Security audit. Once Drop is deployed on mainnet, any further code or protocol parameters changes will be required to undergo comprehensive tests using <a href=\"https://github.com/hadronlabs-org/rehearsal\">Rehearsal</a>, a mainnet forking and testing tool that ensures tests are conducted within the context of the network’s existing state. Drop’s development team has an established set of practices for any on-chain operations through the process of creating detailed launch policies with the set of actions to be performed, check-lists, and emergency scenarios.</p>\n<p>Drop contributors are also setting up comprehensive monitoring and alerting for balance states, code versions, processing of the protocol’s buffers, validator performance, IBC channel statuses, and more. Lastly, granular kill switches have been implemented into the protocol, and an emergency playbook is being developed for the DAO. These kill switches enable the pausing of specific protocol functions to properly respond to any incident without unnecessarily hindering the user experience or third-party integrations.</p>\n<p>A bug bounty program with Immunefi will be set up shortly after mainnet deployment.</p>\n<p>As an Integrated Application on Neutron, Drop inherits the full economic security of more than $2bn ATOM restaked on the Cosmos Hub through <a href=\"https://cosmos.github.io/interchain-security/\">Replicated Security</a>.</p>\n<h1><a name=\"what-does-drop-expect-from-the-lido-alliance-10\" class=\"anchor\" href=\"https://research.lido.fi#what-does-drop-expect-from-the-lido-alliance-10\"></a>What does Drop expect from the Lido Alliance</h1>\n<ul>\n<li>Endorsement - the DAO endorses Drop, and Drop becomes the first member of the Lido Alliance</li>\n<li>Integration and communication support - to the extent possible and where appropriate, integrate Drop with community distribution channels, such as websites, etc, and support large Drop announcements</li>\n<li>Liquidity bootstrapping - coordinate activities and research with LOL to support Drop/wstETH liquidity on Interchain</li>\n<li>Network - Lido DAO contributors support the adoption of Drop through their network of partners</li>\n<li>Consultation - Drop anticipates benefiting from the Lido contributor groups’ extensive expertise in different aspects of the ecosystem and technology</li>\n</ul>\n<p>All other core responsibilities will be handled by the Drop team.</p>\n<h1><a name=\"how-much-alignment-collateral-will-be-locked-in-the-alliance-legal-vehicle-11\" class=\"anchor\" href=\"https://research.lido.fi#how-much-alignment-collateral-will-be-locked-in-the-alliance-legal-vehicle-11\"></a>How much alignment collateral will be locked in the Alliance legal vehicle?</h1>\n<p>100,000,000 DROP tokens (10% of the total supply) will be sent to a Lido Alliance legal entity after TGE, with a 12 months lock followed by 24 months linear vesting with no cliff.</p>\n<br>\n<p>May 2024</p>\n<p>Author: <a class=\"mention\" href=\"https://research.lido.fi/u/d_argunov\">@d_argunov</a>, with thanks to <a class=\"mention\" href=\"https://research.lido.fi/u/kai\">@kai</a>, <a class=\"mention\" href=\"https://research.lido.fi/u/adcv\">@adcv</a> and <a class=\"mention\" href=\"https://research.lido.fi/u/spaydh\">@spaydh</a> for their thoughts and comments</p>\n<p>Edit:</p>\n<p>Modified the collateral lock requirement based on the community feedback</p>\n            <p><small>9 posts - 6 participants</small></p>\n            <p><a href=\"https://research.lido.fi/t/proposal-onboard-drop-to-the-lido-alliance/7556\">Read full topic</a></p>","link":"https://research.lido.fi/t/proposal-onboard-drop-to-the-lido-alliance/7556","pubDate":"Fri, 24 May 2024 14:17:50 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"research.lido.fi-topic-7556"},"source":{"@url":"https://research.lido.fi/t/proposal-onboard-drop-to-the-lido-alliance/7556.rss","#text":"Proposal: Onboard Drop to the Lido Alliance"},"filter":false},{"title":"Lido Alliance: Category","dc:creator":"kethfinex","category":"Alliance","description":"<p>A forum category for all Lido Alliance project proposals.</p>\n<p>For more info on Lido Alliance, check <a href=\"https://research.lido.fi/t/lido-alliance-an-ethereum-aligned-ecosystem/7475\" class=\"inline-onebox\">Lido Alliance: An Ethereum-Aligned Ecosystem</a>.</p>\n            <p><small>1 post - 1 participant</small></p>\n            <p><a href=\"https://research.lido.fi/t/lido-alliance-category/7555\">Read full topic</a></p>","link":"https://research.lido.fi/t/lido-alliance-category/7555","pubDate":"Fri, 24 May 2024 14:03:43 +0000","discourse:topicPinned":"Yes","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"research.lido.fi-topic-7555"},"source":{"@url":"https://research.lido.fi/t/lido-alliance-category/7555.rss","#text":"Lido Alliance: Category"},"filter":false},{"title":"Proposal: Expanding the Simple DVT Module","dc:creator":"KimonSh","category":"Proposals","description":"<h2><a name=\"proposal-summary-1\" class=\"anchor\" href=\"https://research.lido.fi#proposal-summary-1\"></a>Proposal Summary</h2>\n<p>This proposal seeks DAO approval for the expansion of the Simple DVT Module across two major components:</p>\n<ol>\n<li>\n<p>Allowing for the creation of larger clusters in terms of the number of operated validators (known as Super Simple DVT Clusters), that are composed of Advanced Node Operators from the Simple DVT Module with members of the Curated Node Operator set, and</p>\n</li>\n<li>\n<p>Increasing the maximum target share of the module to 4% from the current 0.5%.</p>\n</li>\n</ol>\n<p>Of note, while outside of the direct scope of this proposal, research is underway in regards to a strategy that could be used to provide possible additional rewards to users and the protocol by leveraging the addition of DVT based validators. This ties into the recently approved <a href=\"https://snapshot.org/#/lido-snapshot.eth/proposal/0x300523518b08f20c585751c0a720ef3ec53698d4e5062154d285b15cb062f96c\">ReGOOSE goals</a>, solidifying stETH as the most secure and decentralized LST, while supporting its position as the most useful LST in the DeFi and LRT ecosystem. A follow up discussion on this topic is expected in the coming weeks.</p>\n<h2><a name=\"why-the-sdvtm-should-be-expanded-2\" class=\"anchor\" href=\"https://research.lido.fi#why-the-sdvtm-should-be-expanded-2\"></a>Why the SDVTM Should be Expanded</h2>\n<p>In addition to facilitating the inclusion of the first solo and community stakers using the Lido protocol, Distributed Validator Technology (DVT) is expected to further improve the resilience, security, and infrastructure distribution of Lido related validators.</p>\n<p>The Simple DVT Module (SDVTM) has been live within the Lido protocol for 3 months, and within this time significant progress has begun in terms of decentralizing the Lido Node Operator set.</p>\n<p>With Obol Cohort 1 active on mainnet, 72 net-new Node Operators have been onboarded to the protocol, with an additional 67 expected to be onboarded with Cohort 2 in the coming weeks.</p>\n<p>Clusters powered by SSV Network’s DVT implementation are expected to go live in the Simple DVT Module within the next month, and between Cohort 1 &amp; 2 an additional 74 net-new Node Operators will be added to the protocol as well.</p>\n<p>With the next Obol &amp; SSV Network testnets occurring during Q2, at least 250 net-new Node Operators are expected to be added to the protocol during 2024, an increase of 676% over the existing 37 members of the Curated Node Operator set.</p>\n<p>The successful rollout of the Simple DVT Module has shown demonstrable progress towards the 2nd GOOSE goal of Attracting the Best Validator Set, which the <a href=\"https://snapshot.org/#/lido-snapshot.eth/proposal/0x0fa423280ce2bcc2596901d81322716ad440c7581658030a7d21784c2661d81c\">Lido DAO voted for in November 2023</a>.</p>\n<p>While meaningful progress has been made to date in the Lido protocol’s adoption of DVT, both Obol and SSV have also seen significant developments in their adoption through the staking community overall.</p>\n<p>When the <a href=\"https://research.lido.fi/t/staking-router-module-proposal-simple-dvt/5625\">first Simple DVT Proposal went</a> live, both providers were in the initial stages of rolling out on mainnet. Now, SSV Network has <a href=\"https://explorer.ssv.network/\">nearly 21,000 mainnet validators</a> with a total value staked of over $2.4B. Obol has also expanded their mainnet reach, notably with an <a href=\"https://blog.obol.tech/decentralising-restaking-our-journey-with-etherfi/\">announcement with EtherFi</a> to launch 1,000 mainnet validators, and their recently announced <a href=\"https://blog.obol.tech/1-percent-for-decentralisation/\">1% for Decentralization Initiative</a> that is expected to drive further accessibility of their technology for Node Operators throughout the ecosystem over the coming months.</p>\n<p>While the Simple DVT Module has demonstrated the exciting potential of DVT, more can be done to supercharge the adoption of DVT via validators using the Lido protocol.</p>\n<p>Three constraints have been identified in the existing structure of the module that can be solved via this proposal:</p>\n<ol>\n<li>Due to the low number of validators per cluster at the current target share of 0.5%, Node Operators are unlikely to be profitable if the number of clusters are expanded,</li>\n<li>Due to the conservative timeline in scaling the number of validators these clusters run, a limited number of DVT based validators can be brought onto the protocol in the near-term, and</li>\n<li>Due to the unbonded nature of the participants in the current Simple DVT clusters, the maximum number of validators per cluster should be limited given the constituent make-up of these clusters.</li>\n</ol>\n<p>Separately, research is currently being undertaken to understand how the adoption of Distributed Validator Technology may be used to drive additional value to stakers and the Lido protocol, specifically targeted towards the Simple DVT Module. In this event, additional capacity to onboard validators would likely be required, which can be covered by the combination of these two parts of the proposal.</p>\n<h2><a name=\"component-1-scaling-72-simple-dvt-clusters-3\" class=\"anchor\" href=\"https://research.lido.fi#component-1-scaling-72-simple-dvt-clusters-3\"></a>Component 1: Scaling 72 Simple DVT Clusters</h2>\n<p>Currently, the Simple DVT Module has a target share of 0.5% of Lido stake. As of 21/5/24, this equates to approximately 1,420 validators to be split evenly across Obol and SSV Network clusters. With two LNOSG evaluation rounds and DAO discussion periods complete, 24 Obol clusters and 21 SSV clusters have been proposed for mainnet onboarding so far.</p>\n<p>Given the success of the Simple DVT testnets to date (<a href=\"https://blog.lido.fi/simpledvt-ssv-testnet-results/\">SSV</a>, <a href=\"https://blog.lido.fi/simpledvt-obol-testnet-results/\">Obol</a>) and the initial roll-out on mainnet (targeting at least 250 net-new Node Operators), it is expected that 36 clusters for each DVT provider could be onboarded to the protocol. However, due to the economic differences between running validators in a DV format from single operator run nodes, the current target share presents an issue.</p>\n<p>With current market dynamics, the average rewards for a Node Operator participating in Simple DVT is equivalent to approximately $30 per validator per year. Assuming an equal split of 24 Obol and SSV clusters, the module currently has capacity for each cluster to run approximately 29 validators. For some, this is not enough in terms of rewards to cover operational costs across hardware and time contributed.</p>\n<p>As a result, the proposed solution is to increase the target share of the module. With 2% of the updated target share allocated to the normal Simple DVT clusters, this would represent 5,690 validators to be split between these Obol and SSV clusters. Assuming 72 clusters in this format (36 for each provider), as of 21/5/24 this would represent approximately 80 validators per cluster.</p>\n<p>This would greatly improve the economics for participating operators (especially solo and community stakers) and at least cover the fixed costs for the majority of professional node operators. Meanwhile, the total number of validators that any one cluster would be running would still remain limited, taking into account the unbonded nature of these clusters and greater diversity of participant types.</p>\n<p>From the perspective of the DAO, the rewards structure would not change for these clusters from the existing reward share voted on in the Simple DVT Module proposal.</p>\n<p>As a reminder, the total reward share for the Simple DVT Module is 10%, with the Lido DAO receiving 2% of rewards. In the case of Obol clusters, Node Operators receive 7% (1% each), and Obol receives 1% of rewards. For SSV clusters, Node Operators receive 8% (1.14% each), however operators are responsible for paying the SSV Network Fees and to deposit initial collateral denominated in the SSV token as <a href=\"https://docs.ssv.network/learn/protocol-overview/tokenomics/fees\">outlined in the SSV Network technical documentation</a>.*</p>\n<p>It should be noted that Obol’s reward share supports their recently announced <a href=\"https://blog.obol.tech/1-percent-for-decentralisation/\">1% for Decentralization</a> initiative, a retroactive funding pool that rewards projects and innovations that promote Ethereum’s decentralization.</p>\n<p><strong>Simple DVT Cluster Rewards Share</strong></p>\n<div class=\"md-table\">\n<table>\n<thead>\n<tr>\n<th>Obol Clusters</th>\n<th></th>\n<th>SSV Clusters</th>\n<th></th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>Total stETH Reward Share</td>\n<td>10%</td>\n<td>Total stETH Reward Share</td>\n<td>10%</td>\n</tr>\n<tr>\n<td>Direct Treasury share</td>\n<td>2%</td>\n<td>Direct Treasury share</td>\n<td>2%</td>\n</tr>\n<tr>\n<td>Obol share</td>\n<td>1%</td>\n<td>SSV share*</td>\n<td>0%</td>\n</tr>\n<tr>\n<td>Node Operators share</td>\n<td>7%</td>\n<td>Node Operators share*</td>\n<td>8%</td>\n</tr>\n</tbody>\n</table>\n</div><h2><a name=\"component-2-adding-10-super-simple-dvt-clusters-4\" class=\"anchor\" href=\"https://research.lido.fi#component-2-adding-10-super-simple-dvt-clusters-4\"></a>Component 2: Adding 10 Super Simple DVT Clusters</h2>\n<p>While Point 1 of the proposal would expand the available capacity of DVT validators within the protocol, it is still constrained by higher operational load in terms of cluster onboarding as well as a more limited number of validators each cluster should support.</p>\n<p>To solve this, the proposal suggests the addition of 10 Super Simple DVT Clusters, 5 from Obol, and 5 from SSV Network, in addition to the normal Simple DVT clusters discussed above.</p>\n<p>These clusters would consist of members of the Curated Operator set along with Advanced Node Operators (ANOs), a classification that was discussed in the <a href=\"https://research.lido.fi/t/staking-router-module-proposal-simple-dvt/5625\">original Simple DVT Module proposal</a>. ANOs are participants that have demonstrated consistently strong performance from both a qualitative and quantitative standpoint during Simple DVT testnets and/or mainnet. As noted in the original proposal, any cluster running 100+ validators should contain at least 50% of the members with the ANO classification.</p>\n<p>The Lido Node Operator Subgovernance Group would meet to review performance of these operators using mainnet and/or testnet data, and propose the five clusters for each DV provider to the DAO, which would be followed with a week discussion period to consider the proposal, in-line with the existing flow of Simple DVT onboarding.</p>\n<p>In general, the initial ANOs would likely consist of mostly professional node operators, however solo and community stakers are also eligible for this classification.</p>\n<p>Once selected and reviewed by the DAO, these “Super Clusters” would be eligible to run up to 500 validators using the protocol. Key limits would initially start at 50 validators (compared to the initial ~1 week monitoring period in the Curated Node Operator set of 100 validators), and after a two week period a performance report would be shared with the DAO for review.</p>\n<p>If performance looks comparable to the overall operator set, a representative of the Simple DVT Module Committee would simultaneously begin a week-long discussion period to consider raising key limits for these clusters.</p>\n<p>In this format, 5,000 validators would be available for utilizing both Obol and SSV based DVT on mainnet (2,500 each) in an expedited format, while not compromising on the quality of Node Operators involved given that they would consist of members of the Curated Set and experienced Advanced Node Operators.</p>\n<p>From the economics perspective, given the larger number of validators these Super Clusters would operate, a change would be made to the rewards structure. From the module point of view, the existing rewards structure would remain in place. However, as Lido Simple DVT rewards are distributed in both Obol and SSV clusters via a set of splitter smart contracts, the DAO portion of rewards could be increased through the splitter mechanism.</p>\n<p>The proposed reward structure would consist of the following format: the direct DAO treasury reward share would remain at 2%, however an additional 2% would be added to the DAO treasury following reward distribution via the splitter contract. In Obol clusters, participants would receive 5% of rewards, and Obol would continue to receive 1%. In SSV clusters, participants would receive 6%, however they would still be responsible for paying the SSV Network Fees and to deposit initial collateral denominated in the SSV token as <a href=\"https://docs.ssv.network/learn/protocol-overview/tokenomics/fees\">outlined in the SSV Network technical documentation</a>.</p>\n<p>Claiming from the splitter is permissionless, meaning any address could trigger the claim flow to the DAO treasury at any point following the stETH rebase. The splitter contracts would be deployed by contributors from Obol and SSV, with verification from Lido contributors to ensure addresses are properly configured. For more information about Simple DVT Reward distribution and the Obol wrapper and 0xsplits set of smart contracts, see the <a href=\"https://research.lido.fi/t/staking-router-module-proposal-simple-dvt/5625/23#simple-dvt-reward-distribution-5\">Simple DVT Reward Distribution section of this post</a>.*</p>\n<p><strong>Super Simple DVT Cluster Rewards Share</strong></p>\n<div class=\"md-table\">\n<table>\n<thead>\n<tr>\n<th>Obol Clusters</th>\n<th></th>\n<th>SSV</th>\n<th></th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>Total stETH Reward Share</td>\n<td>10%</td>\n<td>Total stETH Reward Share</td>\n<td>10%</td>\n</tr>\n<tr>\n<td>Direct Treasury share</td>\n<td>2%</td>\n<td>Direct Treasury share</td>\n<td>2%</td>\n</tr>\n<tr>\n<td>Treasury share from splitter</td>\n<td>2%</td>\n<td>Treasury share from splitter</td>\n<td>2%</td>\n</tr>\n<tr>\n<td>Obol share</td>\n<td>1%</td>\n<td>SSV share*</td>\n<td>0%</td>\n</tr>\n<tr>\n<td>Node Operators share</td>\n<td>5%</td>\n<td>Node Operators share*</td>\n<td>6%</td>\n</tr>\n</tbody>\n</table>\n</div><h2><a name=\"onboarding-validator-scaling-5\" class=\"anchor\" href=\"https://research.lido.fi#onboarding-validator-scaling-5\"></a>Onboarding &amp; Validator Scaling</h2>\n<p>Onboarding and evaluations for participants covered in Component 1, the scaling of the existing cluster format would be unchanged from the current process described in the Simple DVT Module proposal. The LNOSG assesses testnet participants, meets to discuss their performance, and proposes clusters to the DAO with a week discussion period before being finalized.</p>\n<p>The Simple DVT Module Committee (SDVTMC) is then responsible for preparing the Easy Track motions to add Node Operators to the Simple DVT Node Operator registry and raising key limits for the clusters. After the initial 5 validators are active for a month, a performance report is presented to the DAO with the potential for a proposal to the DAO from the committee to raise the key limits further. This process is followed for at least the first 3 months of operation, and for any subsequent increases in validator key limits. All actions by the SDVTMC occur via Easy Track, and are vetoable over a 72 hour period by LDO holders.</p>\n<p>For the Super Simple DVT Clusters discussed in Component 2, the process would be very similar. Participants would already have been proposed by the LNOSG and accepted by the DAO to participate in the normal Simple DVT clusters. However, the LNOSG would meet to evaluate Node Operators, and propose participants that fall into the Advanced Node Operator category. This proposal would be shared to the DAO, with a week discussion period to consider the participants and the proposed clusters.</p>\n<p>If accepted, the SDVTMC would then also prepare transactions to add Node Operators to the SDVT Node Operator registry and raise key limits for the clusters via Easy Track motions. Super Clusters would start with an initial key limit of 50 validators, and after two weeks of running those validators a performance report would be shared with the DAO. If performance is comparable to the overall validator set, a proposal would be made to raise the key limits to 200. The process would repeat again, and a proposal could be made to raise these cluster’s key limits to a maximum of 500 validators each.</p>\n<h2><a name=\"risk-factors-6\" class=\"anchor\" href=\"https://research.lido.fi#risk-factors-6\"></a>Risk Factors</h2>\n<p>While the two factors discussed below also exist for Node Operators in the Curated Set, it is important to highlight these risks as this proposal would expand the DVT deployment within the Lido Node Operator set to a scaled approach.</p>\n<p>During the <a href=\"https://snapshot.org/#/lido-snapshot.eth/proposal/0xf3ac657484444f0b54eba2c251135c47f875e3d1821496247d11bdd7fab0f291\">Snapshot vote for the Simple DVT Module</a>, the DAO chose to utilize the existing <a href=\"https://etherscan.io/address/0x8B3f33234ABD88493c0Cd28De33D583B70beDe35\">cover fund vault contract</a> to cover risks from the Simple DVT Module. With 6,356 stETH currently in the contract, the vault would not be sufficient to cover the entire module in the event of a mass slashing or downtime event. In addition, it is possible that a mass slashing of either Obol or SSV Network validators in the module could trigger <a href=\"https://docs.lido.fi/guides/oracle-spec/accounting-oracle#bunker-mode\">bunker mode</a>, impacting validator exits.</p>\n<p>As noted earlier in the proposal, both Obol and SSV have made significant progress in terms of their mainnet adoption since the Simple DVT Proposal went live in October 2023, with more validators active between both DVT providers on mainnet than the entire capacity of the Simple DVT Module at its current 0.5% target share.</p>\n<h2><a name=\"closing-thoughts-7\" class=\"anchor\" href=\"https://research.lido.fi#closing-thoughts-7\"></a>Closing Thoughts</h2>\n<p>The Lido DAO and protocol has been a leader in pushing for the adoption of Distributed Validator Technology since the early stages of the technology, with <a href=\"https://research.lido.fi/t/lego-strategic-commitment-to-research-of-ssvs-blox-staking-obol/817\">grants to both Obol and SSV (then Blox)</a> in July 2021.</p>\n<p>When announced, the Simple DVT Module was a meaningful first step in adopting DVT on mainnet and using the benefits it provides to expand the Node Operator set to a larger number of participants. However, with the progress made to date from both the Obol and SSV teams, as well as the successful results of Simple DVT to-date, an expansion of the DAO’s strategy towards DVT seems desirable not only from an operator decentralization perspective, but also to support the protocol’s commitment to its core mission and values, as reiterated <a href=\"https://research.lido.fi/t/regoose-updated-goals-for-lido-in-the-light-of-mvi-and-restaking/7462\">in ReGoose</a>.</p>\n<p>By increasing the target share to 4%, the number of Node Operators that can be added to the protocol will be expanded by continuing to scale the clusters as planned. This will be done in a way to make it worthwhile for participants to contribute to running validators, while simultaneously increasing the distribution of infrastructure and client types utilized and taking advantage of the improved resilience and security that DVT based validators offer.</p>\n<p>At the same time, by introducing the 10 Super Simple DVT clusters, the protocol can more quickly open up capacity for DV based validators operated by Curated Node Operators and Advanced Node Operators, and expand the share of stake operated by more high-quality participants in a way that provides reasonable economic benefits to both participants, DVT providers, and the DAO.</p>\n<p>Research is underway in regards to a strategy that could also utilize this expansion of the Simple DVT Module to provide possible additional rewards to users and the protocol with the focus on expanding DV adoption at scale. This strategy would continue to support the decentralization and security of stETH, while also solidifying its place as the most useful LST in DeFi and for LRTs. A follow up discussion related to this topic is expected in the near future, however this proposal stands on its own.</p>\n<p>If there are no objections or requests for significant changes to the proposal, it is suggested that a Snapshot vote follow this proposal in one week’s time seeking approval for raising the target share to 4% and the adoption of Super Simple DVT Clusters. By voting for this proposal, the Lido Node Operator set can continue on its path to become more decentralized, resilient, and secure, a meaningful step towards achieving the GOOSE goal of Attracting the Best Validator Set. If the Snapshot vote passes, an on-chain Aragon vote will follow to raise the target share of the module to 4%.</p>\n            <p><small>13 posts - 9 participants</small></p>\n            <p><a href=\"https://research.lido.fi/t/proposal-expanding-the-simple-dvt-module/7549\">Read full topic</a></p>","link":"https://research.lido.fi/t/proposal-expanding-the-simple-dvt-module/7549","pubDate":"Thu, 23 May 2024 18:52:02 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"research.lido.fi-topic-7549"},"source":{"@url":"https://research.lido.fi/t/proposal-expanding-the-simple-dvt-module/7549.rss","#text":"Proposal: Expanding the Simple DVT Module"},"filter":false},{"title":"LIP-23: Negative rebase sanity check with second opinion","dc:creator":"Greg_S","category":"The LIP - Lido Improvement Proposal - Process","description":"<h2><a name=\"tldr-1\" class=\"anchor\" href=\"https://research.lido.fi#tldr-1\"></a>TL;DR</h2>\n<p>Lido stETH stream contributors propose to improve the safety check for the accounting report in the case of a negative rebase, reducing the possible impact size, but with the requirement for a second opinion for extreme cases.</p>\n<p>It is proposed to change the current AccountingOracle sanity check, which currently does not allow reporting more than a 5% of Consensus layer validator balance and withdrawal vault balance decrease daily, to a sanity check, which will not allow more than ~3.4% per an 18-day window (1.101 ETH decrease per validator concerning the window).</p>\n<h2><a name=\"motivation-2\" class=\"anchor\" href=\"https://research.lido.fi#motivation-2\"></a>Motivation</h2>\n<p>The AccountingOracle contract aggregates all Lido validators’ Beacon Chain balances (<code>clBalance</code> in the report) to the protocol, critical for the daily rebase of the stETH token. It uses a committee of nine Oracle daemons, with a consensus required from at least five, to ensure data integrity.</p>\n<p>The protocol could be harmed if this committee is compromised, malfunctions, or colludes. This risk is acknowledged and constrained by a sanity check that restricts the possible discrepancy in balance that Oracle can report. The current approach to sanity checking allows the Oracle committee to bring up to a 5% reduction of TVL in each report. Given that the governance reaction time is 3-4 days, the malicious or compromised Oracles could reduce the TVL by 15-20%, invoking mass liquidations on lending markets and dropping the price of stETH.</p>\n<p>However, a real negative rebase has very distinct features that can be taken into account to reduce the impact and attack surface while allowing frictionless operation of the protocol even during a mass slashing event.</p>\n<h2><a name=\"proposed-execution-plan-3\" class=\"anchor\" href=\"https://research.lido.fi#proposed-execution-plan-3\"></a>Proposed execution plan</h2>\n<ol>\n<li>The contract has been developed, reviewed internally, and covered with the test suite (<a href=\"https://github.com/lidofinance/core/pull/67\">PR</a>).</li>\n<li>The contract implementing the LIP is undergoing the audit by ChainSecurity, the final report will be published once finalized.</li>\n<li>There will be a snapshot vote to gauge the sentiment of DAO.</li>\n<li>The contract will be deployed on testnet and connected with the second opinion oracle as soon as it becomes available.</li>\n<li>Mainnet voting will be covering limit change without a second opinion provider.</li>\n<li>Connecting a second opinion provider to Mainnet is a question of separate discussion and voting.</li>\n</ol>\n<h2><a name=\"summary-4\" class=\"anchor\" href=\"https://research.lido.fi#summary-4\"></a>Summary</h2>\n<p>Initially, it is suggested that there should be no secondary opinion source but rather an interface to integrate a preferred provider later on. Once available, the ideal secondary opinion source would be a ZKP-based Oracle, similar to those discussed on the forum (more details on this in references). Alternatively, options might be considered such as a third-party Oracle committee or even a multisig-controlled manual quasi-Oracle.</p>\n<p>To enhance the safety of the existing design, a new strategy is suggested: instead of allowing a 5% consensus layer validator balance daily decrease, a 1.101 ETH decrease per active validator over an 18-day period is proposed (or ~3.4% consensus layer validator balance cumulative decrease over the period). This value, drawn from Ethereum specifications, addresses two out of four cases of ‘Natural CLBalance decrease’—attestation penalties and the initial slashing penalty. For addressing the inactivity leak and correlated slashing penalty, which could potentially result in a loss of up to 96.88% of all Lido CLBalance in extreme cases, it is proposed to rely on a DAO vote until a trustless second opinion source is established.</p>\n<h2><a name=\"references-5\" class=\"anchor\" href=\"https://research.lido.fi#references-5\"></a>References</h2>\n<p><a href=\"https://github.com/lidofinance/lido-improvement-proposals/blob/develop/LIPS/lip-23.md\">LIP-23: Negative rebase sanity check with second opinion specification</a><br>\n<a href=\"https://docs.google.com/document/d/1e3R2lAl4xXm0vwqNFB02tvv57jjza9gK9zLkM7Jt1Ow/edit\">New values calculation</a><br>\n<a href=\"https://research.lido.fi/t/proposal-oracle-v2-reporting-sanity-check-parameter-values/511\">Oracle V2 reporting sanity check parameter values</a><br>\n<a href=\"https://research.lido.fi/t/expansion-of-lidos-ethereum-oracle-set/2836\">Oracle committee 5/9</a><br>\n<a href=\"https://github.com/lidofinance/core/pull/67/\">Github repo</a><br>\n<a href=\"https://research.lido.fi/t/zkllvm-trustless-zk-proof-tvl-oracle/5028\">[ZKLLVM] Trustless ZK-proof TVL oracle</a><br>\n<a href=\"https://research.lido.fi/t/dendreth-a-trustless-oracle-for-liquid-staking-protocols/5136\">DendrETH: A trustless oracle for liquid staking protocols</a><br>\n<a href=\"https://research.lido.fi/t/zk-lido-oracle-powered-by-succinct/5747\">ZK Lido Oracle powered by Succinct</a></p>\n            <p><small>4 posts - 3 participants</small></p>\n            <p><a href=\"https://research.lido.fi/t/lip-23-negative-rebase-sanity-check-with-second-opinion/7543\">Read full topic</a></p>","link":"https://research.lido.fi/t/lip-23-negative-rebase-sanity-check-with-second-opinion/7543","pubDate":"Wed, 22 May 2024 12:40:28 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"research.lido.fi-topic-7543"},"source":{"@url":"https://research.lido.fi/t/lip-23-negative-rebase-sanity-check-with-second-opinion/7543.rss","#text":"LIP-23: Negative rebase sanity check with second opinion"},"filter":false},{"title":"Lido on Ethereum Node Operator (Numic) Security Incident Disclosure - May 21, 2024","dc:creator":"Izzy","category":"Node Operators","description":"<p>On May 14th, Lido DAO contributors were made aware of a security breach that affected an active Node Operator using the Lido on Ethereum protocol (Numic). The security breach had occurred a few days prior and affected a developer machine that had access to an encrypted key material backup for mainnet validators. It is unclear if the encrypted key material was accessed, copied, or otherwise manipulated, nor if the decryption material for that data was found, or if the encryption was otherwise broken.</p>\n<p>In response to the identification that the encrypted backups may have been accessed, and for safety reasons, the Node Operator decided to:</p>\n<ol>\n<li>set their depositable keys relating to the Lido Protocol to zero to avoid receiving any further deposits, and</li>\n<li>perform voluntary exits of all possibly affected keys in a staggered manner of the following days.</li>\n</ol>\n<p>As of a few hours ago, all of the operator’s validators have been exited (and fully withdrawn). Validator operations were not affected as a result of the incident, and no user funds have been affected.</p>\n<p>Some Lido DAO contributors have been involved in helping support the Node Operator in investigating the incident to understand its full scope and potential impact.</p>\n<p>The disclosure was not made public immediately as to not call unneeded attention to the breach until the validators had been fully exited.<br>\nWhile the Node Operator is performing a more extensive review of their security &amp; backup processes, the DAO may deliberate as to whether the operator should continue in the active set or not.</p>\n            <p><small>7 posts - 4 participants</small></p>\n            <p><a href=\"https://research.lido.fi/t/lido-on-ethereum-node-operator-numic-security-incident-disclosure-may-21-2024/7536\">Read full topic</a></p>","link":"https://research.lido.fi/t/lido-on-ethereum-node-operator-numic-security-incident-disclosure-may-21-2024/7536","pubDate":"Tue, 21 May 2024 10:54:00 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"research.lido.fi-topic-7536"},"source":{"@url":"https://research.lido.fi/t/lido-on-ethereum-node-operator-numic-security-incident-disclosure-may-21-2024/7536.rss","#text":"Lido on Ethereum Node Operator (Numic) Security Incident Disclosure - May 21, 2024"},"filter":false},{"title":"Crisis situation answers you can trust","dc:creator":"Tina_Bate","category":"Start Here","description":"<p>I’d like to say this I think there would be a lot more participation if things where so hidden if folks like me knew where there funds where and new how to withdrawal in emergency <img src=\"https://emoji.discourse-cdn.com/apple/rotating_light.png?v=12\" title=\":rotating_light:\" class=\"emoji\" alt=\":rotating_light:\" loading=\"lazy\" width=\"20\" height=\"20\"> cases such as mine it’s hard to here the needs of others when stakeholders / contributors are left in the dark. I notice in crypto there is always deposit instructions but I never see instruction on how to withdrawal in times of need. Not on dapps anywhere u have to dig  and no direction when ask for help discord and telegram are wonderful concepts but I’m so afraid of hackers terrified it has me paranoid beyond belief we need a place to feel safe and ask for guidance not just what’s yr wallet address then I’ll try and help. Not once not one time have I been able to go to discord and find a solution but at least there they give a lot of love and tell u it’s gonna be okay. Discord is beautiful for that but we need solutions to funds that have been flung from here there and everywhere at least I do desperately</p>\n            <p><small>2 posts - 2 participants</small></p>\n            <p><a href=\"https://research.lido.fi/t/crisis-situation-answers-you-can-trust/7531\">Read full topic</a></p>","link":"https://research.lido.fi/t/crisis-situation-answers-you-can-trust/7531","pubDate":"Tue, 21 May 2024 01:08:26 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"research.lido.fi-topic-7531"},"source":{"@url":"https://research.lido.fi/t/crisis-situation-answers-you-can-trust/7531.rss","#text":"Crisis situation answers you can trust"},"filter":false},{"title":"[EGG] Establishing the Community Lifeguards Initiative (CLI) Sub-Committee","dc:creator":"enti","category":"Proposals","description":"<h1><a name=\"tldr-1\" class=\"anchor\" href=\"https://research.lido.fi#tldr-1\"></a>TLDR</h1>\n<ul>\n<li>Consolidate and fund the Community Lifeguards Initiative (CLI) as a sub-committee of LEGO.</li>\n<li>Foster community development by creating helpful content and resources, representing community stakers internally and at community activities, and identifying monetary and non-monetary collaboration opportunities. Now with a dedicated community grants fund.</li>\n<li>197K USD requested every quarter, paid in stablecoins (DAI / USDT / USDC).</li>\n<li>Recurring funding by LEGO, with a retroactive payment for April and May.</li>\n</ul>\n<h1><a name=\"basic-data-2\" class=\"anchor\" href=\"https://research.lido.fi#basic-data-2\"></a>Basic Data</h1>\n<div class=\"md-table\">\n<table>\n<thead>\n<tr>\n<th>Field</th>\n<th>Description</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>Proposal Name</td>\n<td>Establishing the Community Lifeguards Initiative (CLI) Committee</td>\n</tr>\n<tr>\n<td>Which of the following GOOSE goals is your proposal advancing?</td>\n<td>2: Lido attracts the best validator set in the market.</td>\n</tr>\n<tr>\n<td>Organization description</td>\n<td><a class=\"mention\" href=\"https://research.lido.fi/u/enti\">@enti</a> and <a class=\"mention\" href=\"https://research.lido.fi/u/stakesaurus\">@Stakesaurus</a>. Community-oriented, seasoned Ethereum solo operators and current Community Lifeguards.</td>\n</tr>\n<tr>\n<td>Proposed scope of work</td>\n<td>Represent community operators among Lido contributors, engage and create valuable resources for them, identify collaboration and grant opportunities with community staking-oriented projects, and represent Lido in community activities.</td>\n</tr>\n<tr>\n<td>Objectives</td>\n<td>Significantly increase and diversify the operators participating in the Lido on Ethereum protocol while fostering a vibrant and inclusive community.</td>\n</tr>\n<tr>\n<td>Quarterly Budget Request</td>\n<td>197K USD</td>\n</tr>\n</tbody>\n</table>\n</div><h1><a name=\"review-of-the-cli-pilot-3\" class=\"anchor\" href=\"https://research.lido.fi#review-of-the-cli-pilot-3\"></a>Review of the CLI Pilot</h1>\n<p>The <a href=\"https://research.lido.fi/t/lido-community-lifeguards-initiative/4678\">Community Lifeguards Initiative (CLI) Pilot</a> ran for roughly three quarters, with Eridian as the sole appointee for the first two quarters and Sam and Enti joining in the last quarter.</p>\n<p>Below is a table detailing our contributions to Lido Community Stakers set against the <a href=\"https://research.lido.fi/t/lido-community-lifeguards-initiative/4678#metrics-9\">original evaluation factors in the CLI Pilot</a>:</p>\n<div class=\"md-table\">\n<table>\n<thead>\n<tr>\n<th>Evaluation Factor</th>\n<th>Value Created</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>Determine the realizable potential and report on the results.</td>\n<td>Design, propose, &amp; launch the <a href=\"https://research.lido.fi/t/community-staking-fleet-pilot/6606/\" class=\"inline-onebox\">Community Staking Fleet Pilot</a> as a community engagement flywheel to create net new home/solo stakers continuously. // Overseeing the execution of community grants, including <a href=\"https://research.lido.fi/t/dvstakers-grant-proposal/5346\" class=\"inline-onebox\">DVStakers - Grant Proposal</a> and <a href=\"https://research.lido.fi/t/seednode-lido/6641\" class=\"inline-onebox\">SEEDNode - Lido</a>.</td>\n</tr>\n<tr>\n<td>Defining metrics to measure the success of this initiative.</td>\n<td>A weekly discussion with the Lido Community Staking team has led to more refined metrics for measuring success (see the final section below).</td>\n</tr>\n<tr>\n<td>Engagement in Lido community channels</td>\n<td>Technical support in Simple DVT trials, assisting community operators in their journey and testing SDVT integrations.</td>\n</tr>\n<tr>\n<td>Educational content created and shared</td>\n<td>11 Podcasts, 4 written Q&amp;As, 3 blog posts, and 3 X Spaces on the <a href=\"https://research.lido.fi/c/community-staking-contributor-series/18\" class=\"inline-onebox\">Community Staking: Contributor Series - Lido Governance</a>.</td>\n</tr>\n<tr>\n<td>Attendance and participation in community events</td>\n<td><a href=\"https://youtube.com/playlist?list=PLhvXP1-8VKZRihhdZMbPvK4rHOUBMe49i&amp;si=tdW4h_pmIg8bXgbb\" rel=\"noopener nofollow ugc\">2 virtual DVT workshops</a> and 3 in-person presentations at events all around the world (LidoConnect '23, ETH Vietnam '24 &amp; ETHLatam '24).</td>\n</tr>\n<tr>\n<td>Surveying community node operator satisfaction levels</td>\n<td>Too early to conduct during the first 3 quarters as the focus was on creating a rich repository of community staking content for a majority of the initiative duration // To begin when CSM Testnet becomes available</td>\n</tr>\n</tbody>\n</table>\n</div><p>See more in the previous quarterly reports: <a href=\"https://research.lido.fi/t/lido-community-lifeguards-initiative/4678/23\">Report 1</a>, <a href=\"https://research.lido.fi/t/lido-community-lifeguards-initiative/4678/32\">Report 2</a>, and <a href=\"https://research.lido.fi/t/lido-community-lifeguards-initiative/4678/40\">Report 3</a>.</p>\n<p>This has helped attract community stakers and significantly raise awareness about Community Staking initiatives in Lido like SDVT or the upcoming CSM, which are now top-of-the-mind for a lot of the community leaders in Ethereum-aligned communities around the world thanks to the strong community orientation and relations of the CLGs.</p>\n<p>With all the learnings from the pilot and the strong tailwinds brought by our recent work, we believe that the time is ripe to ramp up the Community Lifeguards Initiative.</p>\n<h1><a name=\"establishing-the-community-lifeguards-initiative-cli-sub-committee-4\" class=\"anchor\" href=\"https://research.lido.fi#establishing-the-community-lifeguards-initiative-cli-sub-committee-4\"></a>Establishing the Community Lifeguards Initiative (CLI) Sub-Committee</h1>\n<p>We’re putting this proposal forward to the DAO to formalize and expand the Community Lifeguards Initiative as a LEGO sub-committee of community-oriented, seasoned Ethereum solo operators committed to developing the community of stakers in Lido on Ethereum.</p>\n<p>This is in alignment with Goal 2 of the approved GOOSE — <em><strong>Lido attracts the best validator set in the market.</strong></em></p>\n<h2><a name=\"objectives-5\" class=\"anchor\" href=\"https://research.lido.fi#objectives-5\"></a>Objectives</h2>\n<p>The <a href=\"https://research.lido.fi/t/lido-on-ethereum-community-validation-manifesto/3331\">Community Validation Manifesto</a> is the committee’s <em>raison d’être</em>. As such, our fundamental objective is to uphold its principles and bring the Lido DAO and protocol closer to their goals through identifying, engaging with, and rewarding community contributions to staking in Ethereum and Lido.</p>\n<p>We do this through 3 main pillars:</p>\n<ul>\n<li><strong>Adding value to the community</strong> by creating relevant programs, content, and resources, collecting feedback, and participating in community events.</li>\n<li><strong>Represent community operators among Lido contributors</strong> in internal discussions and collaborate with them on community campaigns and product decisions.</li>\n<li><strong>Identifying opportunities for collaboration</strong> with staking communities and projects, whether through CLI Community Grants, LEGO, or non-monetary forms of support.</li>\n</ul>\n<p>The CLI’s main objective slightly differs from LEGO in that Community Lifeguards are a community task force devoted to its development, and whose mission is to be as close and integrated to the Lido and Ethereum community as possible. On the other hand, LEGO has a broader mission to support Ethereum and liquid staking in general, mainly through grant-giving.</p>\n<h2><a name=\"structure-of-the-committee-6\" class=\"anchor\" href=\"https://research.lido.fi#structure-of-the-committee-6\"></a>Structure of the committee</h2>\n<ul>\n<li>Three full-time equivalent (FTE) Community Lifeguards, elected through open applications in this forum thread and accepted by a vote of committee members + Lido Community Staking contributors. Applications will remain open, provided slots are available.</li>\n<li>One of the Community Lifeguards serves as the coordinator, responsible for organizing the initiative and ensuring that the committee’s goals are met. The appointed coordinator must commit to spending at least 30 hours per week on the initiative.</li>\n<li>To align on the direction and keep the CLI accountable, input from Lido Community Staking contributors will be used in the committee’s decision-making process. The committee’s primary purpose is to assess CLI’s performance at the end of every quarter, which helps with goal-setting and affects their compensation.</li>\n<li>Quarterly reports include the period’s progress and expectations for the following quarter.</li>\n<li>Community Lifeguards should have a deep understanding of Ethereum staking, excellent communication and interpersonal skills, experience with educational content, and familiarity with <a href=\"https://research.lido.fi/t/lido-dao-vibe-alignment-purpose-mission-vision/4380\">Lido DAO’s vision</a>, objectives, and technology stack.</li>\n</ul>\n<h3><a name=\"current-members-7\" class=\"anchor\" href=\"https://research.lido.fi#current-members-7\"></a>Current members</h3>\n<ul>\n<li><a class=\"mention\" href=\"https://research.lido.fi/u/enti\">@enti</a> as the CLI coordinator.</li>\n<li><a class=\"mention\" href=\"https://research.lido.fi/u/stakesaurus\">@stakesaurus</a> as one of the Community Lifeguards in a FTE capacity.</li>\n<li><a class=\"mention\" href=\"https://research.lido.fi/u/izzy\">@Izzy</a>, <a class=\"mention\" href=\"https://research.lido.fi/u/alex\">@Alex</a>, <a class=\"mention\" href=\"https://research.lido.fi/u/dgusakov\">@dgusakov</a> and <a class=\"mention\" href=\"https://research.lido.fi/u/aleksandra_g\">@Aleksandra_G</a> as Lido Community Staking contributors.</li>\n</ul>\n<h2><a name=\"cli-community-grants-8\" class=\"anchor\" href=\"https://research.lido.fi#cli-community-grants-8\"></a>CLI Community Grants</h2>\n<p>To better support the growing community, we’re proposing the establishment of a Community Grants fund managed by the CLI. This will give us increased agency to direct resources toward opportunities aligned with this committee’s goals.</p>\n<p>The community grants fund will be disbursed in the following ways:</p>\n<ul>\n<li>Programs, such as RFPs or one-offs proposed by the CLI or in collaboration with LEGO, like the Community Staking Fleet or a more structured round-based grant process.</li>\n<li>Grants towards exemplary participation, value add, or small-scale community development projects in the scope of the initiative.</li>\n</ul>\n<h2><a name=\"budget-9\" class=\"anchor\" href=\"https://research.lido.fi#budget-9\"></a>Budget</h2>\n<p>We are asking for a quarterly allocation of 197K USD, broken up as follows:</p>\n<div class=\"md-table\">\n<table>\n<thead>\n<tr>\n<th>Amount</th>\n<th>Use of funds</th>\n<th>Approver</th>\n<th>Unspent budget</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>117K USD per quarter</td>\n<td>Compensation for Community Lifeguards, based on time and quality of contribution (i.e. max of 39K USD/FTE per quarter, where max would indicate exemplary performance)</td>\n<td>Community Lifeguard Coordinator + Lido Community Staking Contributors (Note the amounts constitute a maximum).</td>\n<td>Net every quarter.</td>\n</tr>\n<tr>\n<td>60K USD per quarter</td>\n<td>For use as the CLI Community Grants fund as described above with up to 10K USD per grant (Larger grants can be approved as per normal LEGO approval requirements).</td>\n<td>CLGs + Lido CS Contributors. The process is described in the section above.</td>\n<td>Rolled out for 2 quarters. Then it’s zeroed out and starts again.</td>\n</tr>\n<tr>\n<td>20K USD per quarter</td>\n<td>Fund for operational expenses for the Community Lifeguards, including travel accommodations or merch.</td>\n<td>Community Lifeguard Coordinator + Lido Community Staking Contributors.</td>\n<td>Net every quarter.</td>\n</tr>\n</tbody>\n</table>\n</div><h2><a name=\"scope-and-responsibilities-10\" class=\"anchor\" href=\"https://research.lido.fi#scope-and-responsibilities-10\"></a>Scope and responsibilities</h2>\n<ul>\n<li>Design, propose, and execute community programs like the Community Staking Fleet to facilitate and empower the community.</li>\n<li>Identifying opportunities for CLI and LEGO grants (e.g., community staker meetups or tooling) and facilitating the grants process for such initiatives, from proposal to execution and grant completion.</li>\n<li>Identifying opportunities for collaboration with other Ethereum staking projects and fostering new initiatives within the community.</li>\n<li>Represent community operators among Lido contributors and collaborate with them on everything from marketing to product feedback and technical support during testnet trials—e.g., SimpleDVT, CSM.</li>\n<li>Participating in community events, webinars, and AMAs as Lido ecosystem and staker community members.</li>\n<li>Create relevant content and resources for community stakers.</li>\n</ul>\n<h2><a name=\"measures-of-success-11\" class=\"anchor\" href=\"https://research.lido.fi#measures-of-success-11\"></a>Measures of Success</h2>\n<p>The success of this proposal can be gauged using the following metrics along with their relevant Net Promoter Score (NPS):</p>\n<div class=\"md-table\">\n<table>\n<thead>\n<tr>\n<th>Metric</th>\n<th>Base Target</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>Number of communities onboarded.</td>\n<td>3 communities onboarded with at least 1 community staking activity executed or planned each. // NPS ≥ 50%</td>\n</tr>\n<tr>\n<td>Number of new discord joiners with the community staker role. Measured as a growth % in each quarterly report.</td>\n<td>30% QoQ growth up to 1000 members; 10% QoQ growth thereafter. // NPS ≥ 50%</td>\n</tr>\n<tr>\n<td>Number of new home/solo stakers participating in the CSM or Simple DVT — measured through growth during quarterly reporting.</td>\n<td>150 home/solo stakers onboarded onto CSM within first 6 months of launch. // NPS ≥ 50%</td>\n</tr>\n<tr>\n<td>Number of new individual node operators created by the CLI, including those who do not end up participating in the CSM.</td>\n<td>300 new node operators created in total. // NPS ≥ 50%</td>\n</tr>\n</tbody>\n</table>\n</div><p>To be able to accommodate changes and the needs of the community, we will keep the community updated on our goals and metrics in every quarterly report.</p>\n<h2><a name=\"vote-and-operations-12\" class=\"anchor\" href=\"https://research.lido.fi#vote-and-operations-12\"></a>Vote and operations</h2>\n<p>LEGO will serve as a manager for CLI funding. If this proposal is approved, the CLI will get recurring funding from LEGO with a retroactive payment for April and May.</p>\n<p>Funds will then be sent to the CLI multisig <code>0x6faCCcE132d5C397068807Ca73883d3df198dFF4</code> at the beginning of every quarter, provided the committee fulfills its responsibilities.</p>\n<p>Should any significant changes to the structure and budget for the CLI be needed, a new proposal will be put forward to the DAO at least one month in advance. This contemplates budget extensions and the dismantling of the committee.</p>\n<p>This is a 3/5 multisig with the following signers</p>\n<p><a class=\"mention\" href=\"https://research.lido.fi/u/alex_l\">@Alex_L</a>: <code>0x3786C091Ed68d5B58EFAE5193e54c043Bde3b8f6</code></p>\n<p><a class=\"mention\" href=\"https://research.lido.fi/u/izzy\">@Izzy</a>: <code>0x783EA934d543CD1ccfd920639A7539a0BD3895e2</code></p>\n<p><a class=\"mention\" href=\"https://research.lido.fi/u/dgusakov\">@dgusakov</a>: <code>0x992Ce4eEc8288274f60880c7770DdA265fCCe610</code></p>\n<p><a class=\"mention\" href=\"https://research.lido.fi/u/aleksandra_g\">@Aleksandra_G</a>: <code>0x9795d01Aa9F4F80E95828049921B179fBA2Fe6b5</code></p>\n<p><a class=\"mention\" href=\"https://research.lido.fi/u/enti\">@enti</a>: <code>0xfcfbafa0d5f5512C65DbB4C073fE4Ee6Dc3c4779</code></p>\n            <p><small>7 posts - 5 participants</small></p>\n            <p><a href=\"https://research.lido.fi/t/egg-establishing-the-community-lifeguards-initiative-cli-sub-committee/7527\">Read full topic</a></p>","link":"https://research.lido.fi/t/egg-establishing-the-community-lifeguards-initiative-cli-sub-committee/7527","pubDate":"Mon, 20 May 2024 10:52:29 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"research.lido.fi-topic-7527"},"source":{"@url":"https://research.lido.fi/t/egg-establishing-the-community-lifeguards-initiative-cli-sub-committee/7527.rss","#text":"[EGG] Establishing the Community Lifeguards Initiative (CLI) Sub-Committee"},"filter":false},{"title":"RockLogic Monthly Notes - 05/2024","dc:creator":"Vithya","category":"Node Operators","description":"<p>Dear Lido Community,</p>\n<p>Welcome to our monthly news, where we provide you with updates on our efforts to establish a secure Ethereum environment. Here’s a summary of notable developments since our last update.</p>\n<h1><a name=\"lido-general-1\" class=\"anchor\" href=\"https://research.lido.fi#lido-general-1\"></a>Lido General</h1>\n<p><em><strong>Performance optimization: Fullnode &lt;&gt; VC Connection Changes</strong></em></p>\n<p>In efforts to optimize performance following client updates, modifications were made to the Fullnode &lt;&gt; VC connections. These changes resulted in a few unforeseen performance issues that were either resolved or are still under investigation.</p>\n<p>Advancements &amp; Result:</p>\n<ul>\n<li>Following the connection changes, we observed a few performance issues particularly impacting Lighthouse.</li>\n</ul>\n<p>Next Steps:</p>\n<ul>\n<li>Due to performance concerns, a decision was made to revert to a simpler setup.</li>\n<li>Investigate remaining issues related to the changes.</li>\n</ul>\n<p><em><strong>Maintenance Updates</strong></em></p>\n<p>Completed scheduled updates for all Fullnodes and Validator Clients. We are continuing to monitor node performance.</p>\n<p>Advancements &amp; Results:</p>\n<ul>\n<li>All Fullnode and Validator Client software has been updated to the latest secure versions.</li>\n</ul>\n<p>Next Steps:</p>\n<ul>\n<li>System performance is being monitored following the updates.</li>\n</ul>\n<p><em><strong>Missed Attestation Incident Updates</strong></em></p>\n<p>An unexpected server outage caused missed attestations by validators. The issue has been resolved and validators are back online.</p>\n<p>Advancements &amp; Results:</p>\n<ul>\n<li>Identified root cause of the outage as a Virtualization cluster issue on specific nodes.</li>\n<li>Resolved the immediate problem and restored validator functionality.</li>\n</ul>\n<p>Next Steps:</p>\n<ul>\n<li>Our team is actively investigating the corosync bond failure to identify the root cause and implement preventative measures to avoid similar outages in the future.</li>\n<li>We are already engaged with virtualization support to confirm the identified root cause and discuss additional preventative measures to ensure validator stability.</li>\n</ul>\n<h1><a name=\"lido-x-obol-2\" class=\"anchor\" href=\"https://research.lido.fi#lido-x-obol-2\"></a>Lido x Obol</h1>\n<p><em><strong>Testnet Stereum Support</strong></em></p>\n<p>We are diligently providing comprehensive technical support for participants utilizing Stereum throughout the testnet.</p>\n<p>Advancements &amp; Results:</p>\n<ul>\n<li>Established and maintain a dedicated tech support channel for participants encountering issues with Stereum.</li>\n<li>Our support team continuously monitors participant feedback and refines the knowledge base to address emerging questions and challenges.</li>\n</ul>\n<p><em><strong>Mainnet &amp; Testnet</strong></em><br>\nActively participating in mainnet and testnet testing.</p>\n<p>Next Steps:</p>\n<ul>\n<li>Adhering to the established guidelines and following cluster coordinator instructions.</li>\n<li>Continuously monitoring node performance and network health.</li>\n</ul>\n<p>Best Regards,<br>\nRockLogic Team</p>\n            <p><small>1 post - 1 participant</small></p>\n            <p><a href=\"https://research.lido.fi/t/rocklogic-monthly-notes-05-2024/7495\">Read full topic</a></p>","link":"https://research.lido.fi/t/rocklogic-monthly-notes-05-2024/7495","pubDate":"Wed, 15 May 2024 17:20:41 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"research.lido.fi-topic-7495"},"source":{"@url":"https://research.lido.fi/t/rocklogic-monthly-notes-05-2024/7495.rss","#text":"RockLogic Monthly Notes - 05/2024"},"filter":false},{"title":"Lido Alliance: An Ethereum-Aligned Ecosystem","dc:creator":"steakhouse","category":"Proposals","description":"<p></p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://europe1.discourse-cdn.com/business20/uploads/lido/original/2X/7/7c65aff4fa155c8933f49d59485da29000bb3f83.jpeg\" data-download-href=\"/uploads/short-url/hKt4mLEzv2Bb98Fc5M0rdRBP5LR.jpeg?dl=1\" title=\"image\"><img src=\"https://europe1.discourse-cdn.com/business20/uploads/lido/optimized/2X/7/7c65aff4fa155c8933f49d59485da29000bb3f83_2_517x293.jpeg\" alt=\"image\" data-base62-sha1=\"hKt4mLEzv2Bb98Fc5M0rdRBP5LR\" width=\"517\" height=\"293\" srcset=\"https://europe1.discourse-cdn.com/business20/uploads/lido/optimized/2X/7/7c65aff4fa155c8933f49d59485da29000bb3f83_2_517x293.jpeg, https://europe1.discourse-cdn.com/business20/uploads/lido/optimized/2X/7/7c65aff4fa155c8933f49d59485da29000bb3f83_2_775x439.jpeg 1.5x, https://europe1.discourse-cdn.com/business20/uploads/lido/optimized/2X/7/7c65aff4fa155c8933f49d59485da29000bb3f83_2_1034x586.jpeg 2x\" data-dominant-color=\"B5E2EE\"></a></div><p></p>\n<blockquote>\n<p>“Like romances, alliances are built on hopes and dreams—what might happen if certain opportunities are pursued.”–Rosabeth Moss Kanter (HBR, 1994)</p>\n</blockquote>\n<h1><a name=\"outline-1\" class=\"anchor\" href=\"https://research.lido.fi#outline-1\"></a>Outline</h1>\n<p><a href=\"https://research.lido.fi/t/lido-alliance-an-ethereum-aligned-ecosystem/7475#wishlist-grow-a-permissionless-decentralized-restaking-ecosystem-2\">Wishlist: Grow a permissionless, decentralized restaking ecosystem</a><br>\n<a href=\"https://research.lido.fi/t/lido-alliance-an-ethereum-aligned-ecosystem/7475#growing-an-ethereum-aligned-ecosystem-around-steth-helps-decentralize-the-network-3\">Growing an Ethereum-aligned ecosystem around stETH helps decentralize the network</a><br>\n<a href=\"https://research.lido.fi/t/lido-alliance-an-ethereum-aligned-ecosystem/7475#how-should-lido-dao-help-support-the-growth-of-the-ecosystem-around-it-4\">How should Lido DAO help support the growth of the ecosystem around it?</a><br>\n<a href=\"https://research.lido.fi/t/lido-alliance-an-ethereum-aligned-ecosystem/7475#navigating-the-lido-alliance-5\">Navigating the Lido Alliance</a><br>\n<a href=\"https://research.lido.fi/t/lido-alliance-an-ethereum-aligned-ecosystem/7475#lido-alliance-principles-6\">Lido Alliance Principles</a><br>\n<a href=\"https://research.lido.fi/t/lido-alliance-an-ethereum-aligned-ecosystem/7475#conflict-resolution-7\">Conflict resolution</a><br>\n<a href=\"https://research.lido.fi/t/lido-alliance-an-ethereum-aligned-ecosystem/7475#onboarding-process-8\">Onboarding process</a><br>\n<a href=\"https://research.lido.fi/t/lido-alliance-an-ethereum-aligned-ecosystem/7475#proposal-actions-9\">Proposal actions</a><br>\n<a href=\"https://research.lido.fi/t/lido-alliance-an-ethereum-aligned-ecosystem/7475#illustrative-template-for-lido-alliance-workgroup-review-11\">Template for Lido Alliance Workgroup Review</a></p>\n<h1><a name=\"wishlist-grow-a-permissionless-decentralized-restaking-ecosystem-2\" class=\"anchor\" href=\"https://research.lido.fi#wishlist-grow-a-permissionless-decentralized-restaking-ecosystem-2\"></a>Wishlist: Grow a permissionless, decentralized restaking ecosystem</h1>\n<p>Hasu recently outlined some updated <a href=\"https://research.lido.fi/t/regoose-updated-goals-for-lido-in-the-light-of-mvi-and-restaking/7462#h-4-lido-and-restaking-7\">strategic priorities</a> in light of, among other things, the rapid emergence of the restaking market. To answer part of his call, we propose the below framework as a way of supporting the emergence of an ecosystem around stETH, while keeping the protocol the same.</p>\n<p>While our Alliance framework proposal is theoretically open to any new protocol, we wrote it with restaking in mind, and have three points to our ‘wishlist’, as an open call to the community:</p>\n<ol>\n<li>Permissionless LRTs, i.e. services that curate AVS’ but allow users to delegate ETH in a trustless and multisig-less way (similar to yearn strategies or MetaMorpho vaults)</li>\n<li>Pre-confirmation services and other AVS protocols that are Ethereum-aligned and can help make the network stronger.</li>\n</ol>\n<p>Any of the above are invited to contact the Alliance Workgroup (details to come, should the proposal pass) to explore the Alliance and begin the governance process for endorsement. Of course, the framework is generalist and other protocols that share the same aim are equally invited to participate.</p>\n<p><em>nb.: As part of our ‘not-wished-for’ list are protocols, fund managers or entities that seek Alliance endorsement with the aim to ‘manage’ the Lido DAO treasury, or surplus. Ultimately, DAO token holders are free to vote as they see fit for such proposals, should they emerge from the below process. It is worth reiterating that DAO token holders have already approved minimalistic <a href=\"https://research.lido.fi/t/proposal-to-approve-lido-dao-treasury-management-principles-and-authorize-the-formation-of-a-treasury-management-committee\">Treasury Management Principles</a> to this effect, with the express purpose to remove or automate decision-making from the DAO treasury.</em></p>\n<h1><a name=\"growing-an-ethereum-aligned-ecosystem-around-steth-helps-decentralize-the-network-3\" class=\"anchor\" href=\"https://research.lido.fi#growing-an-ethereum-aligned-ecosystem-around-steth-helps-decentralize-the-network-3\"></a>Growing an Ethereum-aligned ecosystem around stETH helps decentralize the network</h1>\n<p>We think of Lido stETH as a triangle connecting node operators, stETH holders and LDO token holders through Lido stETH software. This software runs autonomously and is designed to align cryptoeconomic incentives to further the purpose of decentralizing Ethereum validation. stETH is a mission-driven software tool with a proven track-record of decentralizing the network of Ethereum validators through 1) permissionless software and 2) market forces (cf. HHI graph below, source: <a href=\"https://arxiv.org/pdf/2306.10777v1.pdf\">Grandjean, Heimbach, Wattenhofer</a>).</p>\n<p>Growing the ecosystem around the above mentioned three participants is a powerful way of accelerating Ethereum decentralization. The more attractive it is to <a href=\"https://dune.com/lido/steth-collateral-compare-to-others\">use</a> stETH as collateral, the more the ecosystem grows. This makes it more appealing to participate as a node operator. In turn, and in particular with the possibility for solo-stakers to join through DVT or Community Staking, this increases the decentralization of Ethereum validation.</p>\n<p></p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://europe1.discourse-cdn.com/business20/uploads/lido/original/2X/0/0bddd1b1185c7a1779078bead0ceb5b75e8f9194.png\" data-download-href=\"/uploads/short-url/1GYuQ5R0guCSriwyLooPjvsfcvW.png?dl=1\" title=\"Y3uQhrFpJbAFijf-imOJzYdKX7dyI7DQ0JoTRXvz6kHZpv4DrOhXbk4h8LRXUYU-WSUTkiYYjrlbzb_bItC5v_pIIb-EeILT4peisSNjSnYZQqWI4WWs3zL8dnvBqN-q-0Fk3aPRxZ9KTk19dExbSII\"><img src=\"https://europe1.discourse-cdn.com/business20/uploads/lido/optimized/2X/0/0bddd1b1185c7a1779078bead0ceb5b75e8f9194_2_690x210.png\" alt=\"Y3uQhrFpJbAFijf-imOJzYdKX7dyI7DQ0JoTRXvz6kHZpv4DrOhXbk4h8LRXUYU-WSUTkiYYjrlbzb_bItC5v_pIIb-EeILT4peisSNjSnYZQqWI4WWs3zL8dnvBqN-q-0Fk3aPRxZ9KTk19dExbSII\" data-base62-sha1=\"1GYuQ5R0guCSriwyLooPjvsfcvW\" width=\"690\" height=\"210\" srcset=\"https://europe1.discourse-cdn.com/business20/uploads/lido/optimized/2X/0/0bddd1b1185c7a1779078bead0ceb5b75e8f9194_2_690x210.png, https://europe1.discourse-cdn.com/business20/uploads/lido/optimized/2X/0/0bddd1b1185c7a1779078bead0ceb5b75e8f9194_2_1035x315.png 1.5x, https://europe1.discourse-cdn.com/business20/uploads/lido/original/2X/0/0bddd1b1185c7a1779078bead0ceb5b75e8f9194.png 2x\" data-dominant-color=\"F6F5F5\"></a></div><p></p>\n<h1><a name=\"how-should-lido-dao-help-support-the-growth-of-the-ecosystem-around-it-4\" class=\"anchor\" href=\"https://research.lido.fi#how-should-lido-dao-help-support-the-growth-of-the-ecosystem-around-it-4\"></a>How should Lido DAO help support the growth of the ecosystem around it?</h1>\n<p>Lido DAO has experimented with supporting new protocols in the past through Lido on X. However, the execution led to unstructured frameworks for incentivizing growth and partnerships with protocols where the alignment with Ethereum was unclear. As a consequence, DAO token holders have voted to pull back on virtually all of the Lido on X programs to focus on Ethereum.</p>\n<p><a href=\"https://lido.fi/lego\">LEGO</a>, on the other hand, is an example of a tool that has worked extremely well at supporting the ecosystem growing around this triangle. <a href=\"https://research.lido.fi/t/proposal-to-fund-the-protocol-guild-pilot-via-a-lido-grant/2016\">In April 2022</a>, Lido DAO token holders approved a 2m LDO grant to the Ethereum Protocol Guild to support the development of the Ethereum network. Many other grants have been deployed to support Lido protocol security, security audits for <a href=\"https://research.lido.fi/t/grant-request-for-let-s-get-hai-codebase-audit/\">novel protocols</a> looking to integrate wstETH into their own ecosystems <a href=\"https://research.lido.fi/t/lego-q1-2024-report/7364\">and more</a>. LEGO has, and should continue to have, a role in curating targeted ecosystem grants.</p>\n<p>We would like to propose a new, systematic framework for the DAO to signal its support of Ethereum-aligned and security-obsessed protocols and teams. The intent is not to disburse grants, as with LEGO, but to provide an umbrella framework for endorsement and partnership instead. It is designed to remain decentralized and guided by LDO token holders.</p>\n<h1><a name=\"navigating-the-lido-alliance-5\" class=\"anchor\" href=\"https://research.lido.fi#navigating-the-lido-alliance-5\"></a>Navigating the Lido Alliance</h1>\n<p></p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://europe1.discourse-cdn.com/business20/uploads/lido/original/2X/c/c24ecf3d2dd2e3a10c4d8b5f727cc0e4b53732df.jpeg\" data-download-href=\"/uploads/short-url/rIVtD35kdKA6YG8lgVhFE1ib9Dx.jpeg?dl=1\" title=\"image\"><img src=\"https://europe1.discourse-cdn.com/business20/uploads/lido/optimized/2X/c/c24ecf3d2dd2e3a10c4d8b5f727cc0e4b53732df_2_690x251.jpeg\" alt=\"image\" data-base62-sha1=\"rIVtD35kdKA6YG8lgVhFE1ib9Dx\" width=\"690\" height=\"251\" srcset=\"https://europe1.discourse-cdn.com/business20/uploads/lido/optimized/2X/c/c24ecf3d2dd2e3a10c4d8b5f727cc0e4b53732df_2_690x251.jpeg, https://europe1.discourse-cdn.com/business20/uploads/lido/optimized/2X/c/c24ecf3d2dd2e3a10c4d8b5f727cc0e4b53732df_2_1035x376.jpeg 1.5x, https://europe1.discourse-cdn.com/business20/uploads/lido/optimized/2X/c/c24ecf3d2dd2e3a10c4d8b5f727cc0e4b53732df_2_1380x502.jpeg 2x\" data-dominant-color=\"BA8BAD\"></a></div><p></p>\n<p>Lido Alliance is a framework for Lido DAO to offer support and endorsement for protocols with the same obsessive focus on security and a no-holds barred commitment to decentralizing Ethereum validation. It is a governance process for Lido DAO to identify and recognize projects that share the same values and mission, and have a way to positively contribute to the stETH ecosystem.</p>\n<p>The proposal asks for creation of a dedicated Alliance workgroup of Lido Contributors. The group’s purpose is to assess potential new Alliance members, facilitate &amp; guide them in the DAO’s governance process, as well as help with navigating the potential alignment &amp; product development possibilities. For any Alliance application, the workgroup would be expected to weigh in with assessment results as a note for tokenholders and the wider community. The other two workgroup objectives are</p>\n<ol>\n<li>Be the first point of contact for Alliance members on an ongoing basis</li>\n<li>Signal the community and propose offboarding Alliance members in case of misbehavior in regards to stETH or Ethereum alignment</li>\n</ol>\n<p>LDO token holders will always be consulted and have a say in the matter by way of a vote whenever there is a major event impacting the operation of the Alliance like any decision to onboard, offboard, or make any changes to the partnership. Such votes would ensure the Alliance Workgroup stays on track in terms of mission and vision alignment and make sure the Allied Partners’ values align closely with the values and ethos of Lido DAO.</p>\n<p>While being an ongoing effort, one can expect the Alliance workgroup to facilitate onboarding batches aligned with regular voting cadence. The actual timing is left to the workgroup’s discretion. Token holders can expect evaluation and recommendation based on prospective Partner’s values alignment, focus and commitment to security and unique and promising ways the partnership can benefit the stETH ecosystem.</p>\n<p>Closer affiliation with Lido DAO and the participants in the stETH Triangle can help spread awareness both for stETH and for Allied Partners and their unique technological solutions, which in turn furthers the decentralization of Ethereum.</p>\n<p>As part of a proposal and where relevant, Partners have the option to offer a token airdrop to the Alliance. Those tokens would be committed to the Alliance in perpetuity. Any action towards airdropped tokens would have to be vetted by both Alliance Workgroup and the Lido DAO.</p>\n<h1><a name=\"lido-alliance-principles-6\" class=\"anchor\" href=\"https://research.lido.fi#lido-alliance-principles-6\"></a>Lido Alliance Principles</h1>\n<ul>\n<li>Partners should:\n<ul>\n<li><strong>Share philosophy alignment:</strong> Align with Lido DAO’s vibes, centered around the purpose of preserving Ethereum’s decentralization, accessibility and resistance to censorship.</li>\n<li><strong>Focus on integrations:</strong> Tailor product integrations for the Lido protocol to enhance the project’s value proposition, expand market reach and foster synergistic growth opportunities.</li>\n<li><strong>Have an Obsessive Security Culture:</strong> Uncompromising, relentless approach to security for users</li>\n</ul>\n</li>\n<li>Partners should not:\n<ul>\n<li><strong>Misrepresent the Alliance:</strong> Partners must avoid misleading references to participation in the Lido Alliance</li>\n<li><strong>Front run the DAO:</strong> The prospect of a partnership or collaboration should not be used for business development or marketing</li>\n<li><strong>Take security shortcuts:</strong> No</li>\n<li><strong>Stealth Allocate:</strong> Attempt to use the Alliance endorsement process to ‘allocate’ part of Lido DAO’s treasury in contravention of the <a href=\"https://research.lido.fi/t/proposal-to-approve-lido-dao-treasury-management-principles-and-authorize-the-formation-of-a-treasury-management-committee\">Treasury Management Principles</a> or its rules</li>\n</ul>\n</li>\n<li>Partner protocols should be, where relevant:\n<ul>\n<li><strong>Ethereum-aligned</strong></li>\n<li><strong>Thoroughly vetted from a security perspective</strong></li>\n<li><strong>Open-source, with open-license smart contracts</strong></li>\n</ul>\n</li>\n</ul>\n<h2><a name=\"conflict-resolution-7\" class=\"anchor\" href=\"https://research.lido.fi#conflict-resolution-7\"></a>Conflict resolution</h2>\n<p>In case of disagreement in relation to a specific partner, LDO token holders would always be able to vote for discontinuation of the partnership with a specific Partner. In this case, the partnership would be considered dissolved and Lido DAO’s endorsement would be immediately revoked.</p>\n<p>If Partners are dissatisfied with the level of support dedicated to them on behalf of the Alliance Workgroup, they may, through their own governance processes, vote to dissolve the partnership and disavow Lido DAO endorsement.</p>\n<h2><a name=\"onboarding-process-8\" class=\"anchor\" href=\"https://research.lido.fi#onboarding-process-8\"></a>Onboarding process</h2>\n<ol>\n<li>The prospective group reaches out to the Alliance workgroup</li>\n<li>Alliance Workgroup looks to determine what the “Alliancing grounds” are:\n<ul>\n<li>if the values of the prospective team match with Lido DAO’s</li>\n<li>if the product aligns &amp; contributes towards the growth of the stETH ecosystem</li>\n<li>if the team has held a high bar of security practice and diligence</li>\n</ul>\n</li>\n<li>Alliance workgroup and the prospective group fleshes out what the partnership particulars could look like before sharing with the DAO</li>\n<li>With the Alliance Workgroup’s facilitation, the external group prepares the proposal for the DAO to onboard the project into Alliance</li>\n<li>Alliance Workgroup shares their perspective and feedback on the proposal, providing the details &amp; context to the Lido DAO community</li>\n<li>The DAO decides by vote whether to onboard the prospective team to Alliance</li>\n<li>Endorsement is regularly reviewed by the Alliance Workgroup and material changes to the recommendations could be issued in turn</li>\n</ol>\n<h2><a name=\"proposal-actions-9\" class=\"anchor\" href=\"https://research.lido.fi#proposal-actions-9\"></a>Proposal actions</h2>\n<p>This proposal requests:</p>\n<ul>\n<li>Recognition of Lido Alliance as a group of Lido-aligned projects</li>\n<li>Authorization from Lido DAO for Contributors to enact this proposal</li>\n<li>Approval of the initial wishlist</li>\n</ul>\n<p>This proposal also authorizes the creation of a temporary Alliance Development Committee composed of current Lido contributors, that will lead reviews for candidate protocols until the Alliance Workgroup has been appointed.</p>\n<p>The proposal is aimed to be self-executing so that if the DAO approves it with a vote, it would not be necessary to run a subsequent vote once any real-world legal entities are in existence and ready to operate, whereas the temporary Alliance Development Committee will socialize the particulars through the research forum.</p>\n<p>The proposal pursues idealistic non-profit goals about alignment on vision and mission and any admission of a Partner into the Alliance should not be seen as any form or shape of financial advice, nor shall it affect in any way any monetary perception about any involved tokens.</p>\n<h1><a name=\"disclaimers-10\" class=\"anchor\" href=\"https://research.lido.fi#disclaimers-10\"></a>Disclaimers</h1>\n<p><em>Steakhouse has served Lido DAO as the finance workgroup since September 2022.</em></p>\n<hr>\n<h1><a name=\"illustrative-template-for-lido-alliance-workgroup-review-11\" class=\"anchor\" href=\"https://research.lido.fi#illustrative-template-for-lido-alliance-workgroup-review-11\"></a>Illustrative template for Lido Alliance Workgroup Review</h1>\n<h2><a name=\"key-terms-12\" class=\"anchor\" href=\"https://research.lido.fi#key-terms-12\"></a>Key Terms</h2>\n<div class=\"md-table\">\n<table>\n<thead>\n<tr>\n<th></th>\n<th></th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>Ethereum-alignment and commitment to decentralize validation</td>\n<td></td>\n</tr>\n<tr>\n<td>Use-cases for stETH adoption and integration</td>\n<td></td>\n</tr>\n<tr>\n<td>Opportunities for node operators</td>\n<td></td>\n</tr>\n</tbody>\n</table>\n</div><h2><a name=\"executive-summary-13\" class=\"anchor\" href=\"https://research.lido.fi#executive-summary-13\"></a>Executive Summary</h2>\n<div class=\"md-table\">\n<table>\n<thead>\n<tr>\n<th>Dimension</th>\n<th>Conclusion</th>\n<th>Comment</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>Security Evaluation</td>\n<td></td>\n<td></td>\n</tr>\n<tr>\n<td>Ethereum Decentralization</td>\n<td></td>\n<td></td>\n</tr>\n<tr>\n<td>stETH Adoption</td>\n<td></td>\n<td></td>\n</tr>\n<tr>\n<td>Benefits to Node Operators</td>\n<td></td>\n<td></td>\n</tr>\n<tr>\n<td>Integration Complexity</td>\n<td></td>\n<td></td>\n</tr>\n</tbody>\n</table>\n</div><h2><a name=\"recommendation-accept-reject-14\" class=\"anchor\" href=\"https://research.lido.fi#recommendation-accept-reject-14\"></a>Recommendation: Accept / Reject</h2>\n<p>Edit:</p>\n<p>Modified wishlist as per below</p>\n            <p><small>22 posts - 14 participants</small></p>\n            <p><a href=\"https://research.lido.fi/t/lido-alliance-an-ethereum-aligned-ecosystem/7475\">Read full topic</a></p>","link":"https://research.lido.fi/t/lido-alliance-an-ethereum-aligned-ecosystem/7475","pubDate":"Mon, 13 May 2024 15:05:52 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"research.lido.fi-topic-7475"},"source":{"@url":"https://research.lido.fi/t/lido-alliance-an-ethereum-aligned-ecosystem/7475.rss","#text":"Lido Alliance: An Ethereum-Aligned Ecosystem"},"filter":false},{"title":"ReGOOSE: Updated goals for Lido in the light of MVI and restaking","dc:creator":"Hasu","category":"Proposals","description":"<h1><a name=\"table-of-contents-1\" class=\"anchor\" href=\"https://research.lido.fi#table-of-contents-1\"></a>Table of contents</h1>\n<ol>\n<li><a href=\"https://research.lido.fi/t/regoose-updated-goals-for-lido-in-the-light-of-mvi-and-restaking/7462#h-1-intro-2\">Intro</a></li>\n<li><a href=\"https://research.lido.fi/t/regoose-updated-goals-for-lido-in-the-light-of-mvi-and-restaking/7462#h-2-what-has-changed-since-first-goose-3\">What has changed since first GOOSE?</a></li>\n<li><a href=\"https://research.lido.fi/t/regoose-updated-goals-for-lido-in-the-light-of-mvi-and-restaking/7462#h-3-lido-and-changes-to-issuance-4\">Lido and changes to issuance</a><br>\n3.1 <a href=\"https://research.lido.fi/t/regoose-updated-goals-for-lido-in-the-light-of-mvi-and-restaking/7462#h-31-stay-focused-on-security-and-decentralization-5\">Stay focused on security and decentralization</a><br>\n3.2 <a href=\"https://research.lido.fi/t/regoose-updated-goals-for-lido-in-the-light-of-mvi-and-restaking/7462#h-32-participate-in-ethereum-staking-roadmap-research-6\">Participate in Ethereum staking roadmap research</a></li>\n<li><a href=\"https://research.lido.fi/t/regoose-updated-goals-for-lido-in-the-light-of-mvi-and-restaking/7462#h-4-lido-and-restaking-7\">Lido and restaking</a><br>\n4.1 <a href=\"https://research.lido.fi/t/regoose-updated-goals-for-lido-in-the-light-of-mvi-and-restaking/7462#h-41-reaffirm-that-steth-should-stay-an-lst-not-become-an-lrt-8\">Reaffirm that stETH should stay an LST, not become an LRT.</a><br>\n4.2 <a href=\"https://research.lido.fi/t/regoose-updated-goals-for-lido-in-the-light-of-mvi-and-restaking/7462#h-42-support-ethereum-aligned-validator-services-starting-with-preconfirmations-without-exposing-stakers-to-additional-risk-9\">Support Ethereum-aligned validator services, starting with preconfirmations, without exposing stakers to additional risk.</a><br>\n4.3 <a href=\"https://research.lido.fi/t/regoose-updated-goals-for-lido-in-the-light-of-mvi-and-restaking/7462#h-43-make-steth-the-1-collateral-in-the-restaking-market-allowing-stakers-to-opt-into-additional-points-on-the-risk-and-reward-spectrum-10\">Make stETH the #1 collateral in the restaking market, allowing stakers to opt into additional points on the risk and reward spectrum.</a></li>\n<li><a href=\"https://research.lido.fi/t/regoose-updated-goals-for-lido-in-the-light-of-mvi-and-restaking/7462#h-5-summary-11\">Summary</a></li>\n</ol>\n<h1><a name=\"h-1-intro-2\" class=\"anchor\" href=\"https://research.lido.fi#h-1-intro-2\"></a>1. Intro</h1>\n<p>In October 2023, the Lido DAO first established the GOOSE (strategic intent) + <a href=\"https://research.lido.fi/t/ecosystem-grants-grequest-egg-a-budget-request-framework-in-the-service-of-goose/\">EGG</a> (budget) processes as a way to express what they want DAO contributors to work on. By design, the GOOSE is focused on intent (what and why), while execution (the how) is for contributors + future discussions to determine.</p>\n<p>At the time, I analyzed that the staking market is dominated by network effects, leading to a winner-take-most dynamic. To reach Lido DAO’s expressed purpose of <a href=\"https://research.lido.fi/t/lido-dao-vibe-alignment-purpose-mission-vision/4380\">keeping Ethereum decentralized, accessible to all, and resistant to censorship</a>, and honor its responsibility as a market leader, Lido protocol should be as decentralized and Ethereum-aligned as possible. The resulting “laser focus on security” led to <a href=\"https://research.lido.fi/t/hasus-goose-submission-proposed-goals-for-lido-dao-to-consider/\">three major priorities</a>:</p>\n<ul>\n<li>decentralize the NO set,</li>\n<li>decentralize the governance, and</li>\n<li>make stETH the most used token in the Ethereum ecosystem.</li>\n</ul>\n<p>In this post, we cover what has changed between the ratification of these goals and today. I discuss both internal achievements and external developments, above all the Ethereum issuance debate, and the rise of restaking. Naturally, the magnitude of these developments raises questions about the DAO’s strategy and whether it is still the best course of action or whether it should be revisited. In this post, the first “reGOOSE”, I want to suggest <strong>how Lido should react to the changing tides, what should change, and what should stay the same.</strong></p>\n<p>In summary, I propose that Lido DAO:</p>\n<p><strong>1. Stay focused on security and decentralization</strong><br>\n<strong>2. Participate in Ethereum staking roadmap research</strong><br>\n<strong>3. Reaffirm that stETH should stay an LST, not become an LRT.</strong><br>\n<strong>4. Support Ethereum-aligned validator services, starting with preconfirmations, without exposing stakers to additional risk.</strong><br>\n<strong>5. Make stETH the <span class=\"hashtag-raw\">#1</span> collateral in the restaking market, allowing stakers to opt into additional points on the risk and reward spectrum.</strong></p>\n<h1><a name=\"h-2-what-has-changed-since-first-goose-3\" class=\"anchor\" href=\"https://research.lido.fi#h-2-what-has-changed-since-first-goose-3\"></a>2. What has changed since first GOOSE?</h1>\n<p>In the months since the first GOOSE submission was ratified, significant progress has been made across all of the identified priorities:</p>\n<p><strong>Decentralized Governance:</strong></p>\n<ul>\n<li>The important <a href=\"https://research.lido.fi/t/dual-governance-design-and-implementation-proposal/\">dual governance</a> design has been completed and ratified by LDO holders. Implementation is in progress with external audits starting in the summer.</li>\n</ul>\n<p><strong>Decentralized NO Set:</strong></p>\n<ul>\n<li>\n<p>The first staking router modules for Simple DVT added <a href=\"https://x.com/LidoFinance/status/1780317961854636384\">&gt;70 new node operators</a>, including solo-stakers, for the first time pushing the number of operators using the Lido protocol over the 100 mark (goal is 5000 by 2027)</p>\n</li>\n<li>\n<p>Client diversity has continued to improve, with usage of the current majority Execution Layer client (geth) across Lido validators going from &gt;80% in 2022 to 45% today</p>\n</li>\n</ul>\n<p><strong>stETH Adoption:</strong></p>\n<ul>\n<li>Important milestones in institutional adoption have been hit, including adoption from qualified custodians, regulated entities, centralized exchanges and other participants who recognize the benefits of stETH in security, liquidity and utility as part of a modular stack for institutional products</li>\n<li><a href=\"https://research.lido.fi/t/network-expansion-workgroup-initiative-governance-decision-forwarding-to-non-l2-networks-lip-24/7446\">Security-first</a> deployments of stETH are <a href=\"https://lido.fi/lido-on-l2\">now available</a> on all of the leading Ethereum L2s</li>\n</ul>\n<p>At the same time, stETH market share has declined from 32% to 29%, with additional stake sitting in vampire attacks and queued to unstake in the future. The decline in market share has been fueled by the rise of restaking and Liquid Restaking Tokens (LRTs) that attracted stake through billions of dollars in speculation-driven, unsustainable subsidies.</p>\n<p>At the same time, Ethereum Foundation researchers have started a debate to dramatically reduce staking incentives, which threatens the economic feasibility of decentralized staking pools.</p>\n<p>These two developments, the so-called issuance debate and the rise of restaking, are important enough to warrant a bit of unpacking, followed by my proposal on how Lido DAO should react to them.</p>\n<h1><a name=\"h-3-lido-and-changes-to-issuance-4\" class=\"anchor\" href=\"https://research.lido.fi#h-3-lido-and-changes-to-issuance-4\"></a>3. Lido and changes to issuance</h1>\n<p>The Ethereum issuance (colloquially dubbed “minimal viable issuance”, or MVI) actually conflates several independent debates:</p>\n<ul>\n<li>\n<p>Whether Ethereum should take explicit steps to limit the growth of the validator set, and thereby, of % ETH staked.</p>\n</li>\n<li>\n<p>Whether Ethereum is spending too much on security, and getting incrementally less in return.</p>\n</li>\n</ul>\n<p>Some proponents of changing issuance argue that not capping will eventually lead to a large % of ETH staked, with one or two LSTs “crowding out” ETH as the base token and introducing long-tail risks for security and governance.</p>\n<p>Meanwhile, proponents of the status quo argue that effectively capping ETH staked at a relatively low rate could lead to full market capture by centralized providers with cost/scale advantages (e.g. Coinbase, ETFs), crowding out decentralized pools and solo stakers.</p>\n<p>I suggest Lido DAO address the issuance debate in two ways:</p>\n<h2><a name=\"h-31-stay-focused-on-security-and-decentralization-5\" class=\"anchor\" href=\"https://research.lido.fi#h-31-stay-focused-on-security-and-decentralization-5\"></a>3.1 Stay focused on security and decentralization</h2>\n<p>In my view, maximizing the strengths of the validator set and minimizing the risks from LSTs on long-tail security are both important goals, and both sides only want the best for Ethereum. In practice, I see the risk from LSTs as the more manageable problem through continued research and investment in decentralization.</p>\n<p>If, on the other hand, the marginal staking rate was lowered to zero today, the effect on said decentralization roadmaps would be severe. Investments into decentralization would have to be cut, hurting not only Lido but also supplier technology like DVT and community staking software, ultimately leading to a more centralized and fragile staking layer.</p>\n<p>Today, we are not in that place yet. The grass-roots community has been largely opposed to changing issuance without further extensive research, so the chance of immediate changes (i.e. in the next 12 months) should be low.</p>\n<p>I believe that stETH meaningfully contributes to Ethereum decentralization and want the DAO to continue improving the stETH validator set and decreasing smart contract and governance risks, all the while researching possible alternatives to the MVI endgame.</p>\n<h2><a name=\"h-32-participate-in-ethereum-staking-roadmap-research-6\" class=\"anchor\" href=\"https://research.lido.fi#h-32-participate-in-ethereum-staking-roadmap-research-6\"></a>3.2 Participate in Ethereum staking roadmap research</h2>\n<p>In spite of the criticism the MVI proposals have received, the risks that motivate the issuance debate are important to explore further. The arguments in favor of having a low stake rate are not without merit, but the benefits of having a high stake rate (e.g. maximum alignment between holders and stakers) are underexplored as well, and no decision should be made without deeply understanding their tradeoffs.</p>\n<p>We have already seen <a href=\"http://cyber.fund\">cyber.fund</a> start a generous research grant to explore the future of MVI, with some prominent independent researchers in the space <a href=\"https://cyber.fund/content/mvi-grants\">heeding the call</a>. However, the Lido DAO can do more as well, having contributors who foresaw many future dynamics in staking and have developed strong opinions based on years of on-the-ground experience with staking and network economics.</p>\n<p>To that end, I suggest the creation of Lido Research, a new research group tasked with contributing to the future vision of staking in Ethereum, in close collaboration with the Ethereum Foundation, independent incentives and security researchers, and the wider community.</p>\n<h1><a name=\"h-4-lido-and-restaking-7\" class=\"anchor\" href=\"https://research.lido.fi#h-4-lido-and-restaking-7\"></a>4. Lido and restaking</h1>\n<p>Restaking is a new economic primitive enabling the same collateral to be put under slashing conditions imposed by multiple validation services (AVSs in the Eigenlayer terminology), increasing capital efficiency for the cost of increased risks. For example, the same ETH might be used as a slashing collateral for Ethereum validation as well as running a data availability node.</p>\n<p>When I discussed restaking in my <a href=\"https://research.lido.fi/t/hasus-goose-submission-proposed-goals-for-lido-dao-to-consider/5590\">previous GOOSE submission</a>, I saw it as a fundamentally promising technology that would take several years to fully mature. Restaking (in its proper form) adds risk through additional slashing conditions, while rewards from AVSs are expected to remain inconsequential in the beginning.</p>\n<p>What this analysis missed is the hype created by EigenLayer even in the pre-product stage, allowing stakers to farm points in exchange for parking capital. At the time of writing, users have deposited 5m ETH (or $15b) in EigenLayer, most of it before any AVSs are even live. EigenLayer rewards were further augmented by new LRTs launching to tokenize these deposits, and AVS partners to use them, each of which with their own subsidy programs as well.</p>\n<p>These subsidies are not sustainable in the long-term, but today, they have caused a significant number of stakers to choose the superior yield of Eigenlayer + LRTs over the superior security and network effect of stETH.</p>\n<p>I propose the following updated strategy for dealing with restaking:</p>\n<h2><a name=\"h-41-reaffirm-that-steth-should-stay-an-lst-not-become-an-lrt-8\" class=\"anchor\" href=\"https://research.lido.fi#h-41-reaffirm-that-steth-should-stay-an-lst-not-become-an-lrt-8\"></a>4.1 Reaffirm that stETH should stay an LST, not become an LRT.</h2>\n<p>In spite of the current popularity of restaking/LRTs, it would be a mistake to expand stETH into an LRT, for two reasons:</p>\n<p>First, as explained in the original GOOSE, more institutional than retail capital is expected to join Ethereum over the next three years. If the Ethereum staking layer is to stay decentralized, then Lido or another decentralized staking protocol winning that institutional opportunity is essential. In my experience, the more risky and actively-managed nature of LRTs does not align with the risk preferences of these institutions today. Much has been invested into making stETH the most secure and liquid LST; becoming an LRT and adding extra risks would undermine this cornerstone of our strategy.</p>\n<p>Second, while LRTs can offer higher rewards, their nature is closer to ETH-denominated mutual funds or tokenized deposits in an Ethereum lending market. The key attribute of liquid staking was that it’s a commoditized software offering, but with LRTs it’s less likely that large parts of the market share the same risk/reward preference. As a result, LRTs are less likely to attain a significant network effect and deep liquidity, further limiting their adoption. Their actively managed nature may also make them more likely to be qualified as regulated financial services.</p>\n<p>The DAO should stay open to launching additional products on top of stETH, incl. an LRT, if there is sustained market demand for something that feels aligned with the Lido mission. However, stETH should always stay the DAO’s priority, and it should always stay an LST.</p>\n<h2><a name=\"h-42-support-ethereum-aligned-validator-services-starting-with-preconfirmations-without-exposing-stakers-to-additional-risk-9\" class=\"anchor\" href=\"https://research.lido.fi#h-42-support-ethereum-aligned-validator-services-starting-with-preconfirmations-without-exposing-stakers-to-additional-risk-9\"></a>4.2 Support Ethereum-aligned validator services, starting with preconfirmations, <em>without</em> exposing stakers to additional risk.</h2>\n<p>It makes sense to talk about validator services independent of the question of becoming an LRT or not, for two reasons:</p>\n<ul>\n<li>AVSs can be broadly separated into those that require a validator and those that don’t and can work on any type of collateral.</li>\n<li>Not every validator service may require slashing to work, and/or the slashing can be isolated to not impact stETH holders.</li>\n</ul>\n<p>I believe that Lido should stay at the forefront of what “staking” constitutes and actively explore validator services that support Ethereum’s scaling or security roadmap, and has buy-in from researchers and the Ethereum community.</p>\n<p>In 2022, Lido was the first staking protocol to commit to using mev-boost (out-of-protocol PBS) across all of the participating node operators. Its <a href=\"https://research.lido.fi/t/proposal-optimal-mev-policy-for-lido/2489\">thoughtful MEV policy</a> that balanced MEV maximization with choice for node operators and censorship resistance has positively influenced other staking providers across the industry.</p>\n<p>Today, running mev-boost has become a normal and accepted part of every staking operation. It shows that the definition of “what staking is” can expand to include additional services.</p>\n<p>In my view, preconfirmations will be the next widely adopted validator service after mev-boost (though I expect them to be more an evolution than substitution of mev-boost). Preconfirmations allow validators to commit to including a transaction outside the current full-block auction to sequence “based” rollups or DEX trades faster than the current 12 second block time, promising improvements across user experience, security, and interoperability.</p>\n<p>Lido should become the leader in preconfirmations, and start looking for partners to collaborate with. And it should achieve that without exposing stETH holders to additional base risk, e.g. through the use of a dedicated cover fund for every new service.</p>\n<h2><a name=\"h-43-make-steth-the-1-collateral-in-the-restaking-market-allowing-stakers-to-opt-into-additional-points-on-the-risk-and-reward-spectrum-10\" class=\"anchor\" href=\"https://research.lido.fi#h-43-make-steth-the-1-collateral-in-the-restaking-market-allowing-stakers-to-opt-into-additional-points-on-the-risk-and-reward-spectrum-10\"></a>4.3 Make stETH the <span class=\"hashtag-raw\">#1</span> collateral in the restaking market, allowing stakers to opt into additional points on the risk and reward spectrum.</h2>\n<p>Apart from internalizing Ethereum-aligned validator services like preconfirmations, there is a second opportunity in becoming the <span class=\"hashtag-raw\">#1</span> collateral used for AVSs that either don’t require validators or are too risky or not Ethereum-aligned enough to pursue in-protocol.</p>\n<p>This choice is in line with keeping stETH the most secure and Ethereum-aligned LST. Instead of entering the domain of active risk-management, the DAO should instead strive to give stakers the ability to opt into different points on the risk/reward spectrum, by e.g. depositing stETH into a restaking protocol or AVS in exchange for both higher risk and reward.</p>\n<p>This requires establishing a flourishing ecosystem of apps and partners on the stETH platform, and is an effort in ecosystem-building, similar to what Lido DAO once achieved with integrations into Ethereum DeFi and the wider CeFi landscape. It requires deeply understanding the AVS and LRT landscape, forging bonds with key players, and aligning the incentives through key partnerships.</p>\n<p>Since DAOs are chronically bad at negotiating strategic partnerships, I suggest the creation of a new ecosystem-building team or initiative for that purpose inside Lido DAO.</p>\n<h1><a name=\"h-5-summary-11\" class=\"anchor\" href=\"https://research.lido.fi#h-5-summary-11\"></a>5. Summary</h1>\n<p>In summary, I propose five changes to address the question of MVI/issuance and the rise of restaking:</p>\n<p><strong>1. Stay focused on security and decentralization</strong><br>\n<strong>2. Participate in Ethereum staking roadmap research</strong><br>\n<strong>3. Reaffirm that stETH should stay an LST, not become an LRT.</strong><br>\n<strong>4. Support Ethereum-aligned validator services, starting with preconfirmations, without exposing stakers to additional risk.</strong><br>\n<strong>5. Make stETH the <span class=\"hashtag-raw\">#1</span> collateral in the restaking market, allowing stakers to opt into additional points on the risk and reward spectrum.</strong></p>\n<p>While these are more than cosmetic changes, they leave all of the cornerstones of our previous strategy untouched: the DAO’s purpose of keeping Ethereum decentralized, accessible to all, and resistant to censorship, of building the most widely used LST, of heavy investment into governance and NO set decentralization, and a rising focus on institutional capital.</p>\n<p>Since its inception, the Lido DAO has been a deeply mission-driven organization, putting the health of Ethereum over anything else, while achieving a rare synthesis between OG idealism and pragmatic reality. I am happy to bet that continuing on this path, incrementally chipping away at our ambitious roadmap, and playing long-term games with long-term people, will lead to the greatest success in the end.</p>\n<p><em>Disclaimers:</em></p>\n<ul>\n<li><em>I am <a href=\"https://research.lido.fi/t/proposal-for-hasu-to-join-lido-as-strategic-advisor/1940\">Strategic Advisor  to the Lido DAO.</a></em></li>\n<li><em>As outlined in the <a href=\"https://research.lido.fi/t/the-guided-open-objective-setting-exercise-goose-proposal-a-genesis-step-to-jump-start-a-dao-wide-goal-setting-exercise-and-cadence/5355\">GOOSE</a>, this proposal is submitted in its final form, and the rationale offered explains both the high-level and the lower-level goals. I invite the extended community to engage on the proposal and will happily respond to questions at any time.</em></li>\n</ul>\n            <p><small>28 posts - 15 participants</small></p>\n            <p><a href=\"https://research.lido.fi/t/regoose-updated-goals-for-lido-in-the-light-of-mvi-and-restaking/7462\">Read full topic</a></p>","link":"https://research.lido.fi/t/regoose-updated-goals-for-lido-in-the-light-of-mvi-and-restaking/7462","pubDate":"Fri, 10 May 2024 10:22:23 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"research.lido.fi-topic-7462"},"source":{"@url":"https://research.lido.fi/t/regoose-updated-goals-for-lido-in-the-light-of-mvi-and-restaking/7462.rss","#text":"ReGOOSE: Updated goals for Lido in the light of MVI and restaking"},"filter":false},{"title":"Network Expansion Workgroup initiative: governance decision forwarding to non-L2 networks (LIP-24)","dc:creator":"TheDZhon","category":"The LIP - Lido Improvement Proposal - Process","description":"<h3><a name=\"executive-summary-1\" class=\"anchor\" href=\"https://research.lido.fi#executive-summary-1\"></a>Executive Summary</h3>\n<ul>\n<li>\n<p><strong>Objective</strong>: Implement a framework for executing Lido DAO’s on-chain governance voted-in actions forwarded from Ethereum to outer networks to minimize or exclude involvement of multisigs, committees, and intermediates.</p>\n</li>\n<li>\n<p><strong>Context</strong>: For the recognized wstETH deployments on Layer 2 (L2) networks, Lido DAO currently utilizes established processes that employ canonical bridges, ensuring security congruent with the underlying rollups.</p>\n</li>\n<li>\n<p><strong>Proposal</strong>: This discussion aims to explore the adaptation of the governance infrastructure (<a href=\"https://governance.aave.com/t/bgd-a-di-aave-delivery-infrastructure/13951\" rel=\"noopener nofollow ugc\">a.DI</a>) developed by <a href=\"https://bgdlabs.com/\" rel=\"noopener nofollow ugc\">BGD Labs</a> to forward Lido DAO governance decisions (originated from the <a href=\"https://etherscan.io/address/0x3e40D73EB977Dc6a537aF587D48316feE66E9C8c\" rel=\"noopener nofollow ugc\">Lido DAO Agent</a> contract on Ethereum) to external non-L2 networks, such as <a href=\"https://snapshot.org/#/lido-snapshot.eth/proposal/0xc12ae07242326a719cb6b6a5eb19cb77eb4515b4a5ebe58508f965a5b9abb27c\" rel=\"noopener nofollow ugc\">BNB Chain</a>, to mitigate risks of third-party bridge services misoperation by utilizing bridge aggregation for messages.</p>\n</li>\n</ul>\n<h3><a name=\"abstract-2\" class=\"anchor\" href=\"https://research.lido.fi#abstract-2\"></a>Abstract</h3>\n<p>The <a href=\"https://github.com/lidofinance/aave-delivery-infrastructure/blob/main/README.md\" rel=\"noopener nofollow ugc\">a.DI</a> system by BGD Labs serves as a cross-chain communication layer designed to facilitate secure interactions across different blockchain networks with minimal exposure to bridge-related vulnerabilities. This system is instrumental in AAVE’s <a href=\"https://docs.aave.com/governance/master/aave-governance-v3\" rel=\"noopener nofollow ugc\">governance v3</a> as a secure message bus and has undergone multiple security <a href=\"https://github.com/lidofinance/aave-delivery-infrastructure/tree/main/security\" rel=\"noopener nofollow ugc\">audits and formal verification rounds</a>.</p>\n<p>However, a.DI doesn’t contain a built-in execution module out of the box and requires one to be implemented supporting the interface needed. It’s suggested to derive <a href=\"https://github.com/lidofinance/governance-crosschain-bridges/blob/master/contracts/bridges/BridgeExecutorBase.sol\" rel=\"noopener nofollow ugc\"><code>BridgeExecutorBase</code></a> for the governance motion payload format to be compatible with the one <a href=\"https://github.com/lidofinance/governance-crosschain-bridges\" rel=\"noopener nofollow ugc\">used</a> for L2 networks forwarding by the Lido DAO.</p>\n<h3><a name=\"scope-of-pilot-implementation-3\" class=\"anchor\" href=\"https://research.lido.fi#scope-of-pilot-implementation-3\"></a>Scope of pilot implementation</h3>\n<p><strong>Immediate goals</strong></p>\n<ul>\n<li>Extend Lido DAO governance functionalities to pass executable decisions on BNB Chain</li>\n</ul>\n<p><strong>Proposed Adapter Configurations</strong></p>\n<ul>\n<li>Quorum Requirement: 3/4</li>\n<li>Proposed Bridges: CCIP, HyperLane, LayerZero, Wormhole</li>\n</ul>\n<h3><a name=\"status-4\" class=\"anchor\" href=\"https://research.lido.fi#status-4\"></a>Status</h3>\n<p>The <a href=\"https://github.com/lidofinance/lido-improvement-proposals/blob/develop/LIPS/lip-24.md\" rel=\"noopener nofollow ugc\">proposed contractual solution</a> shaped as a LIP, tailored for Lido deployments, is under audit by <a href=\"https://mixbytes.io/\" rel=\"noopener nofollow ugc\">MixBytes()</a>. Lido contributors anticipate sharing the comprehensive audit report on this forum shortly.</p>\n<h3><a name=\"testnet-5\" class=\"anchor\" href=\"https://research.lido.fi#testnet-5\"></a>Testnet</h3>\n<p>Testnet deployments connecting the <a href=\"https://sepolia.etherscan.io/address/0x32A0E5828B62AAb932362a4816ae03b860b65e83\" rel=\"noopener nofollow ugc\">DAO Agent</a> on Ethereum Sepolia and <a href=\"https://testnet.bscscan.com/address/0x69EE990d0AADEfcbbA0F2de94E0F26521ae680ff\" rel=\"noopener nofollow ugc\">CrossChainExecutor</a> on BNB Sepolia Testnet (Anchored to Sepolia) are available <a href=\"https://github.com/lidofinance/aave-delivery-infrastructure/blob/2a883777c02487571adfc08fbf362d57134a493f/deployments/addresses.json\" rel=\"noopener nofollow ugc\">here</a>. The deployments resemble the proposed adapter configurations.</p>\n<h3><a name=\"next-steps-6\" class=\"anchor\" href=\"https://research.lido.fi#next-steps-6\"></a>Next steps</h3>\n<p>Should this proposal be considered favorably, <a href=\"https://research.lido.fi/t/unofficial-guidelines-for-bridging-solutions-network-expansion-workgroup/5790\">Network Expansion Workgroup</a> recommends to include a.DI to the scope of the follow-up <a href=\"https://snapshot.org/#/lido-snapshot.eth/proposal/0xc12ae07242326a719cb6b6a5eb19cb77eb4515b4a5ebe58508f965a5b9abb27c\" rel=\"noopener nofollow ugc\">wstETH bridged to BNB</a> recognition proposal to avoid <a href=\"https://research.lido.fi/t/wormhole-x-axelar-lido-bridge-implementation-for-wsteth-on-bnb-chain/6012/7\">msig-based administration of the token and its bridge endpoints</a> for wstETH on BNB deployments on Mainnet as early as possible.</p>\n<p>Further details will be included in the corresponding snapshot proposal(s).</p>\n<h3><a name=\"feedback-request-7\" class=\"anchor\" href=\"https://research.lido.fi#feedback-request-7\"></a>Feedback Request</h3>\n<p>Community feedback on the feasibility, security concerns, and any potential improvements to this framework to ensure robust and decentralized governance decision forwarding from Ethereum to diverse blockchain environments would be highly appreciated.</p>\n            <p><small>6 posts - 3 participants</small></p>\n            <p><a href=\"https://research.lido.fi/t/network-expansion-workgroup-initiative-governance-decision-forwarding-to-non-l2-networks-lip-24/7446\">Read full topic</a></p>","link":"https://research.lido.fi/t/network-expansion-workgroup-initiative-governance-decision-forwarding-to-non-l2-networks-lip-24/7446","pubDate":"Thu, 09 May 2024 05:52:51 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"research.lido.fi-topic-7446"},"source":{"@url":"https://research.lido.fi/t/network-expansion-workgroup-initiative-governance-decision-forwarding-to-non-l2-networks-lip-24/7446.rss","#text":"Network Expansion Workgroup initiative: governance decision forwarding to non-L2 networks (LIP-24)"},"filter":false},{"title":"Launchnodes: Africa Infrastructure Update","dc:creator":"Rajesh","category":"Node Operators","description":"<p>We wanted to provide an update on Launchnodes’ Africa infrastructure and Lido nodes.</p>\n<p>Following the major incident last year, Launchnodes has rebuilt our infrastructure to be more resilient.</p>\n<p>Changes have included:</p>\n<li>Architecture updated to remove key points of failure / dependencies\n</li><li> Node configuration changes, in conjunction with the client teams\n</li><li> Additional slashing protection added\n</li><li> Testing and adding multiple MEV relays\n<p>These changes have been bedded down and optimized over several months, with multiple test nodes running effectively on Holesky so far this year.</p>\n<p>We have now been running production nodes on mainnet for over 4 weeks on our new infrastructure, and our internal monitoring - and that of Rated.Network - shows performance typically better than operator averages.</p>\n<p>We will continue to monitor and optimize, all being well we intend to request a small batch of new nodes within the next few days.</p>\n<p>Team Launchnodes is hugely grateful for the support, feedback and patience of the community as we’ve moved back to bare metal in Africa. It’s great to be back and continuing to support stakers and the Lido community globally.</p>\n<p>Please reach out for any more details or with any feedback. <img src=\"https://emoji.discourse-cdn.com/apple/pray.png?v=12\" title=\":pray:\" class=\"emoji\" alt=\":pray:\" loading=\"lazy\" width=\"20\" height=\"20\"></p></li>\n            <p><small>1 post - 1 participant</small></p>\n            <p><a href=\"https://research.lido.fi/t/launchnodes-africa-infrastructure-update/7441\">Read full topic</a></p>","link":"https://research.lido.fi/t/launchnodes-africa-infrastructure-update/7441","pubDate":"Wed, 08 May 2024 07:18:32 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"research.lido.fi-topic-7441"},"source":{"@url":"https://research.lido.fi/t/launchnodes-africa-infrastructure-update/7441.rss","#text":"Launchnodes: Africa Infrastructure Update"},"filter":false},{"title":"Where is my reward？","dc:creator":"one166166","category":"General","description":"<p>I pledged ETH five days ago. Haven’t I received any rewards yet?<br>\n</p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://europe1.discourse-cdn.com/business20/uploads/lido/original/2X/e/e0e5bff4bf2fbfbb6b163cc1d9b418da7848b93a.jpeg\" data-download-href=\"/uploads/short-url/w5xbMOktkpHZwhZCNt6NdihtRUK.jpeg?dl=1\" title=\"Lido\" rel=\"noopener nofollow ugc\"><img src=\"https://europe1.discourse-cdn.com/business20/uploads/lido/optimized/2X/e/e0e5bff4bf2fbfbb6b163cc1d9b418da7848b93a_2_690x486.jpeg\" alt=\"Lido\" data-base62-sha1=\"w5xbMOktkpHZwhZCNt6NdihtRUK\" width=\"690\" height=\"486\" srcset=\"https://europe1.discourse-cdn.com/business20/uploads/lido/optimized/2X/e/e0e5bff4bf2fbfbb6b163cc1d9b418da7848b93a_2_690x486.jpeg, https://europe1.discourse-cdn.com/business20/uploads/lido/optimized/2X/e/e0e5bff4bf2fbfbb6b163cc1d9b418da7848b93a_2_1035x729.jpeg 1.5x, https://europe1.discourse-cdn.com/business20/uploads/lido/original/2X/e/e0e5bff4bf2fbfbb6b163cc1d9b418da7848b93a.jpeg 2x\" data-dominant-color=\"D1D2D3\"></a></div><p></p>\n            <p><small>2 posts - 2 participants</small></p>\n            <p><a href=\"https://research.lido.fi/t/where-is-my-reward/7412\">Read full topic</a></p>","link":"https://research.lido.fi/t/where-is-my-reward/7412","pubDate":"Sun, 05 May 2024 06:38:17 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"research.lido.fi-topic-7412"},"source":{"@url":"https://research.lido.fi/t/where-is-my-reward/7412.rss","#text":"Where is my reward？"},"filter":false}]}}}