{"rss":{"@version":"2.0","@xmlns:discourse":"http://www.discourse.org/","@xmlns:atom":"http://www.w3.org/2005/Atom","@xmlns:dc":"http://purl.org/dc/elements/1.1/","channel":{"title":"Optimism Collective - Latest topics","link":"https://gov.optimism.io/latest","description":"Latest topics","lastBuildDate":"Mon, 19 Aug 2024 12:05:46 +0000","atom:link":{"@href":"https://gov.optimism.io/latest.rss","@rel":"self","@type":"application/rss+xml"},"item":[{"title":"Retro Funding 5: Application Form Changes","dc:creator":"system","category":"Retro  Funding 🔴","description":"<p>This post outlines the changes and updates which are being made to <a href=\"https://retrofunding.optimism.io/\">OP Atlas</a> in preparation for <a href=\"https://gov.optimism.io/t/retro-funding-5-op-stack-round-details/8612\">Retro Funding 5</a>.<br>\nThe infrastructure for the application process is created and hosted by Agora, you can find the relevant code <a href=\"https://github.com/voteagora/op-atlas\">here</a>.</p>\n<p><strong>Timeline</strong></p>\n<ol>\n<li>Sign up: Aug 22nd - Sept 5th</li>\n<li>Application Review Process: Sept 6th - Sept 20th</li>\n<li>Voting: September 21st - Oct 4th</li>\n<li>Results &amp; Grant delivery: October 10th</li>\n</ol>\n<h3><a name=\"p-39509-organizations-1\" class=\"anchor\" href=\"https://gov.optimism.io#p-39509-organizations-1\"></a>Organizations</h3>\n<p>In previous Retro Funding rounds, we’ve seen that individual applications are often overloaded with many different types of projects. For example, in <a href=\"https://round3.optimism.io/\">Retro Funding 3</a>…</p>\n<ul>\n<li><a href=\"https://round3.optimism.io/projects/0x09a432ebeb70fe4d205e410b028c0ac46b04aa9e1e96b9fafdeb8dc06dbb22e0\">Test-in-Prod</a> applied with 5 distinct projects, ranging from work on OP Stack client implementations to data analytics work.</li>\n<li><a href=\"https://round3.optimism.io/projects/0xf780b4a39ea9529b9e7af1638c816801ce89cf06e93dd6d66ea383fb3ed263f0\">Department of Decentralization</a> applied both with their work on conferences and hackathons, such as ETHBerlin and Protocol Berg, as well their work on the Goerli Testnetwork.</li>\n</ul>\n<p>This mixture of substantially different projects in a single application adds difficulty to the voting process. It makes comparisons among applications harder and increases the complexity of voting.</p>\n<p><strong>Organizations aim to solve this problem.</strong></p>\n<p>An organization is a new entity within OP Atlas that reflects a company, DAO or team which is working together. Each organization can create one or multiple projects that reflect distinct products, services, or contributions.</p>\n<ol>\n<li><strong>Organization</strong>: Team, DAO, or business working together on one or multiple projects</li>\n<li><strong>Project:</strong> A distinct product, service, or contribution that reflects a significant amount of work</li>\n</ol>\n<blockquote>\n<p><strong>What should not be a project:</strong> Individual activities within a larger project, such as a commit, a contract deployment on a new chain, a single call or presentation.</p>\n</blockquote>\n<p>With Organizations, Test-in-Prod can represent itself as a team, and then create distinct projects with which they want to apply to Retro Funding. Each project will then be judged separately within the relevant retro round.</p>\n<p>While in some cases creating an organization is helpful, projects do not need to be associated to an organization. For example, individuals building things by themselves can simply create a project and submit it for Retro Funding consideration. Groups of people who worked together on a single project, for example as part of a hackathon, may also choose not to create an organization. Creating the right framework for organizations and projects remains a challenge that we’ll continue to iterate on, and we appreciate your feedback.</p>\n<h3><a name=\"p-39509-application-questions-2\" class=\"anchor\" href=\"https://gov.optimism.io#p-39509-application-questions-2\"></a>Application Questions</h3>\n<p>As a continuation of the involvement of badgeholders in the design process of Retro Funding rounds, the Foundation <a href=\"https://www.figma.com/board/qcwy2ix4avwjMtSwBqU9Ef/R5%3A-Application-Jam?node-id=20-402&amp;t=50ys6oRpAiZskgnr-1\">hosted a workshop</a> with the aim of refining the project application form to collect more insightful information for the Retro Funding 5 voting process. The workshop provided valuable insights into the kinds of questions and answers that will help badgeholders better evaluate projects impact across the <a href=\"https://gov.optimism.io/t/retro-funding-5-op-stack-round-details/8612\">three scope categories</a>.</p>\n<p><strong>Workshop Outcomes:</strong></p>\n<ol>\n<li><strong>Refined Questions for Impact Evaluation:</strong> Through group discussions, we identified key questions that should be included in the project application form to help badgeholders assess impact more effectively. For instance, we determined that for Ethereum Core Contributions, it’s crucial to ask questions that clarify how a project supports or is a dependency of the OP Stack. Important feedback has been the desire to have more verifiable information about projects impact, instead of self-reported statements,  user testimonials were  highlighted as anexample of this.</li>\n<li><strong>Targeted Asks:</strong> The workshop also shed light on the nature of the data submitted for the different categories through an exercise of evaluating the answers received in Retro Funding 3. A more focused set of questions, anchored in tangible, specific impact related proof were brought forward to avoid broad, or at times unrelated, information being submitted by projects.</li>\n</ol>\n<p>We collated the most effective questions that emerged from each group discussion per category and sent out a survey to the broader badgeholder set to gather additional feedback and enable broader voting and calibration of these questions. The aim of the workshop &amp; survey is to make the application process better aligned with the needs and expectations of badgeholders, ultimately leading to more accurate rewarding of impact in Retro Funding 5.</p>\n<p>Below are the final application questions which were selected as a result of the workstream:</p>\n<ol>\n<li><strong>Ethereum Core Contributions</strong>: How does your project support, or is a dependency of, the OP Stack? How would it impact the OP Stack if your project ceased to exist?</li>\n<li><strong>OP Stack Research &amp; Development</strong>: How has your project advanced the development of the OP Stack? Who has benefited the most from your work on the OP Stack and how?</li>\n<li><strong>OP Stack Tooling</strong>: How has the infrastructure you built enabled the testing, deployment, and operation of OP chains? Who has used your tooling and how has it benefited them (Please reference relevant data sources which surface the impact of your tooling, such as user surveys, testimonials, attestations etc)?</li>\n</ol>\n<h3><a name=\"p-39509-other-updates-changes-3\" class=\"anchor\" href=\"https://gov.optimism.io#p-39509-other-updates-changes-3\"></a><strong>Other Updates &amp; Changes</strong></h3>\n<ol>\n<li><strong>Project grant and funding reporting</strong>: See <a href=\"https://gov.optimism.io/t/retro-funding-5-grants-funding-within-the-application-process/8742\" class=\"inline-onebox\">Retro Funding 5: Grants &amp; Funding within the application process</a> post for more details.</li>\n<li><strong>Add Links</strong>:  Applicants can now add links to their projects. They can add any link which supports them in showcasing their impact. They may also provide a name and description for each link.</li>\n<li><strong>Improved project creation to application handover</strong>: The final step in creating a project in our system is to publish that project’s metadata onchain. Some projects completed this step, but then failed to also submit an application. Messaging has been added to make it clear that after publishing a project, applicants <strong>must also submit an application</strong> to participate in a retro round.</li>\n<li><strong>Round details and application:</strong> We’ve made the round details (found in the round application) visible to anyone before signing in.</li>\n<li><strong>Markdown support:</strong> In the round application, free form input fields will support markdown.</li>\n</ol>\n            <p><small>1 post - 1 participant</small></p>\n            <p><a href=\"https://gov.optimism.io/t/retro-funding-5-application-form-changes/8743\">Read full topic</a></p>","link":"https://gov.optimism.io/t/retro-funding-5-application-form-changes/8743","pubDate":"Mon, 19 Aug 2024 12:05:46 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"gov.optimism.io-topic-8743"},"source":{"@url":"https://gov.optimism.io/t/retro-funding-5-application-form-changes/8743.rss","#text":"Retro Funding 5: Application Form Changes"},"filter":false},{"title":"Retro Funding 5: Grants & Funding within the application process","dc:creator":"system","category":"Retro  Funding 🔴","description":"<p>This post outlines which sources of grants and funding projects need to report when applying to Retro Funding 5.</p>\n<h3><a name=\"p-39508-challenges-1\" class=\"anchor\" href=\"https://gov.optimism.io#p-39508-challenges-1\"></a>Challenges</h3>\n<p>The <a href=\"https://gov.optimism.io/t/ratification-of-profit-definition-for-round-4/8312\">deliberative process on profit in Retro Funding 4</a> highlighted the many challenges in collecting information about grants and funding received by projects:</p>\n<ol>\n<li><strong>Verifiability</strong>: The amount of grants (other than Optimism grants), funding and revenue a project has received is usually non-public information, making it impossible to verify the accurate reporting by projects. This dynamic creates an incentive for projects to not disclose grants, funding and revenue.</li>\n<li><strong>Attributing Optimism Grants</strong>: Optimism issues a number of different types of grants (Token House missions, Foundation missions, and Partner Fund grants). A grant might be received for a variety of purposes with distinct grant conditions. Participants in the deliberative process have highlighted the complexity when considering these many different grant types, a prime example has been the distinction between Token House Builder grants and Growth grants.</li>\n<li><strong>Attributing Profit to Impact:</strong> A project might receive grants and funding for different services or products benefitting different types of users, companies and ecosystems. To implement impact = profit, Retro Funding needs to attribute what forms of grants and funding relate to the impact that is rewarded in the relevant retro round. This attribution poses a complex challenge, as it requires an understanding of the purpose of different grants and funding that were received.</li>\n<li><strong>Attribution of Funding and Revenue:</strong> The structuring of legal entities can have a significant effect on how revenue, grants and funding are attributed to projects. Some companies may pursue a structure where the development of different products (closed and open source) takes place within separate legal entities, while others combine open and closed source work within a single entity. Projects which combine open and closed source work within a single entity might be worse off, as all their funding and revenue is considered, while projects with separate entities benefit.</li>\n</ol>\n<h2><a name=\"p-39508-retro-funding-5-information-collection-2\" class=\"anchor\" href=\"https://gov.optimism.io#p-39508-retro-funding-5-information-collection-2\"></a>Retro Funding 5: Information Collection</h2>\n<p>For Retro Funding 5, the application process will provide badgeholders with relevant information relating to grants and funding, based on feedback from the <a href=\"https://gov.optimism.io/t/retro-funding-4-deliberative-process-on-the-definition-of-profit/8083\">deliberative process experiment</a> and <a href=\"https://optimism.mirror.xyz/Bbu5M1mTNV2Z637QxOiF7Qt7R9hy6nxghbZiFbtZOBA\">previous retro rounds</a>. In Round 5, the voter exit survey will aim to measure the importance of this information to voters, to understand the value this information provides in the voting process to inform future application processes.</p>\n<p>The following information will be collected from projects</p>\n<ol>\n<li><strong>Pricing:</strong> Projects are required to report if their product/service is free, freemium or pay-to-use. If one of latter two categories is selected, the project is asked to report the pricing model for their product/service. This information is aiming to give voters insights into the business model of a project and its value extraction. The application review process will rely on publicly available information to enforce the accurate reporting of this information. The correct reporting of non-public information can’t be enforced.</li>\n<li><strong>Optimism Grants:</strong> Due to the verifiability of Optimism grants, projects are required to report grants which they received from the Token House, Citizens’ House or Optimism Foundation since January 2023. This includes Token House Missions, Foundation Missions and Retro Funding rewards.</li>\n<li><strong>Investments</strong>: Projects are required to report funding which they received in exchange for equity since January 2020. They reporting is done by selecting between ranges of funding (Less than $1M, $1M-$5M, $5M-$10M, $10M-$25M, $25M-$50M, more than $50M). The application review process will rely on publicly available information to verify the accurate reporting of this information. The correct reporting of non-public information can’t be verified, this poses a significant risk of including funding in the definition of profit.</li>\n</ol>\n<p>The following information will not be collected from projects:</p>\n<ol>\n<li><strong>Other Grants</strong>: Information on non-Optimism grants will not be collected due to its non-verifiable nature combined with the results of <a href=\"https://gov.optimism.io/t/ratification-of-profit-definition-for-round-4/8312#vote-1-6\">the deliberative process on profit</a>, in which 74% of participants voted to not consider “Other Grants” in Retro Funding.</li>\n<li><strong>Revenue → Replaced by Pricing</strong>: Information on non-Optimism grants will not be collected due to its non-verifiable nature combined with the results of <a href=\"https://gov.optimism.io/t/ratification-of-profit-definition-for-round-4/8312#vote-1-6\">the deliberative process on profit</a>, in which 80% of participants voted to not consider “Revenue” in Retro Funding. Instead the application process is collecting information on pricing to provide insights into the value extraction of a project (see above).</li>\n</ol>\n<h3><a name=\"p-39508-risks-and-drawbacks-3\" class=\"anchor\" href=\"https://gov.optimism.io#p-39508-risks-and-drawbacks-3\"></a>Risks and Drawbacks</h3>\n<p>Badgeholders should be aware of the risks and drawbacks introduced by the current state of defining impact = profit. A key goal of Retro Funding is to sustainably reward Optimism core contributors for the impact they provide to the Collective. Key to achieving this goal is creating reliability for projects when it comes to Retro Funding rewards, so that they can contribute to Optimism knowing that they will be rewarded for their impact.<br>\nThe current state of defining profit, <strong>poses a significant challenge to achieving reliability.</strong> It creates high uncertainty for projects, as they are not able to understand how grants and funding may impact their Retro Funding rewards.</p>\n<p>Further, the current design leads to inconsistency on how grants and funding are taken into account within impact evaluation. Each badgeholder may apply a different definition of profit across projects. This results in a system in which the grants and funding of two identical projects may have vastly different effects on their Retro Funding rewards.</p>\n<p>In the spirit of Governance minimisation, <strong>Retro Funding should strive to use a minimal set of rules required to reward impact.</strong> This is a core principal of Optimism Governance because each additional rule adds high costs to the system by requiring more bureaucracy to support its enforcement, increasing the surface area for attack and overall complexity and rigidity of the system.</p>\n<p>We appreciate the many discussions badgeholders have had on the topic of profit over the past four rounds. We’ve used insights and outputs from the deliberative process to make incremental progress towards this definition in Round 5. It will continue to be an iterative and gradual process to define the goals and implementation of profit as it pertains to impact evaluation.</p>\n            <p><small>1 post - 1 participant</small></p>\n            <p><a href=\"https://gov.optimism.io/t/retro-funding-5-grants-funding-within-the-application-process/8742\">Read full topic</a></p>","link":"https://gov.optimism.io/t/retro-funding-5-grants-funding-within-the-application-process/8742","pubDate":"Mon, 19 Aug 2024 11:53:21 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"gov.optimism.io-topic-8742"},"source":{"@url":"https://gov.optimism.io/t/retro-funding-5-grants-funding-within-the-application-process/8742.rss","#text":"Retro Funding 5: Grants & Funding within the application process"},"filter":false},{"title":"Tingchain: The First Optimism Deployment on a Non-Ethereum Chain (TON)","dc:creator":"TingChain","category":"✨ General","description":"<p><strong>Introduction</strong><br>\nThe TON Application Chain (TAC) is an innovative Layer-2 blockchain designed to enhance the functionality, interoperability, and scalability of the TON (The Open Network) ecosystem by enabling seamless integration with Ethereum Virtual Machine (EVM)-compatible protocols. This development significantly expands the scope of the TON ecosystem, allowing it to support a wide range of decentralized applications (DApps) operating within the Ethereum ecosystem and beyond.</p>\n<p>Tingchain, a groundbreaking Layer 2 solution designed for the TON ecosystem, marks the first Optimism deployment on a non-Ethereum chain. Tingchain aims to revolutionize the TON network by providing scalability, enhancing liquidity, and ensuring EVM compatibility, thus extending the reach of the Optimism ecosystem into new and untapped territories.</p>\n<p><strong>Motivation</strong><br>\nThe TON ecosystem has demonstrated rapid growth, with a significant Total Value Locked (TVL) and an increasing user base. However, the lack of EVM compatibility has limited its potential, constraining developers’ and users’ ability to fully leverage existing DeFi resources and dApps. The deployment of Tingchain as an Optimism Layer 2 chain addresses this gap, bringing Ethereum-compatible assets and advanced scaling solutions to the TON network.</p>\n<p><strong>Tingchain Initiative Details</strong><br>\n<strong>Overview</strong><br>\nTingchain is designed as a Layer 2 solution focused on scalability and liquidity, seamlessly integrating with the TON ecosystem while maintaining EVM compatibility. This initiative addresses several key challenges:</p>\n<ul>\n<li>Scaling for TON: Tingchain enhances transaction throughput on TON by leveraging Optimism technology, reducing latency and fees, and making DeFi and dApp operations more efficient.</li>\n<li>Liquidity Bridge: Tingchain acts as a bridge for Ethereum-based assets, including ETH and stablecoins, into the TON ecosystem, significantly boosting available liquidity and enabling a richer DeFi environment.</li>\n<li>Developer Tools: Tingchain provides comprehensive developer tools to build, optimize, and deploy scalable applications on TON, driving widespread adoption through easy integration with existing Ethereum-based applications.</li>\n<li>Expanding the Optimism Ecosystem: By deploying on TON, Tingchain introduces the first Optimism Layer 2 on a non-Ethereum chain, tapping into TON’s vast user base, particularly within the Telegram ecosystem.</li>\n</ul>\n<p><strong>Target Market</strong></p>\n<ul>\n<li>Developers: Game and dApp developers on TON seeking scalable and EVM-compatible solutions will find Tingchain’s offerings particularly appealing.</li>\n<li>Users: Gamers and dApp users within TON will benefit from reduced transaction costs, faster processing times, and a broader range of DeFi services.</li>\n<li>Related Projects: DeFi protocols and other blockchain projects looking for robust interoperability and enhanced liquidity will be drawn to Tingchain’s capabilities.</li>\n</ul>\n<p><strong>Impact</strong><br>\nThe deployment of Tingchain as an Optimism Layer 2 on TON is expected to have a significant impact on both the TON and Optimism ecosystems. It will introduce additional liquidity, enhance user engagement, and provide exposure to a new, actively engaged user base. This initiative is expected to increase TVL, drive user participation, and generate additional revenue streams. Additionally, a portion of Tingchain’s profits will be allocated to the ongoing development and support of Optimism, ensuring the sustainability of this collaboration.</p>\n<p><strong>Rationale</strong><br>\nThe deployment of Tingchain leverages the robust architecture of Optimism’s Layer 2 technology, providing a secure and scalable solution for TON. This strategic move is designed to attract both DeFi and GameFi users from the TON ecosystem, backed by the experience and expertise of the Tingchain development team. This deployment not only enhances the TON network but also extends Optimism’s reach and influence beyond Ethereum.</p>\n<p><strong>Implementation Plan</strong></p>\n<ul>\n<li>September: Begin internal testing and deployment on Testnet.</li>\n<li>October: Launch Tingchain on Mainnet, officially expanding the Optimism ecosystem to TON.</li>\n</ul>\n<p><strong>Conclusion</strong><br>\nTingchain is poised to pioneer the integration of Optimism technology in a non-Ethereum environment, starting with TON. This initiative not only enhances the capabilities of the TON ecosystem but also broadens the horizon for Optimism, creating new opportunities for growth, collaboration, and innovation within the broader blockchain community.</p>\n<p><strong>Follow us at:</strong> <a href=\"http://linktr.ee/tingchain\" rel=\"noopener nofollow ugc\">http://linktr.ee/tingchain</a></p>\n            <p><small>1 post - 1 participant</small></p>\n            <p><a href=\"https://gov.optimism.io/t/tingchain-the-first-optimism-deployment-on-a-non-ethereum-chain-ton/8740\">Read full topic</a></p>","link":"https://gov.optimism.io/t/tingchain-the-first-optimism-deployment-on-a-non-ethereum-chain-ton/8740","pubDate":"Mon, 19 Aug 2024 05:28:02 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"gov.optimism.io-topic-8740"},"source":{"@url":"https://gov.optimism.io/t/tingchain-the-first-optimism-deployment-on-a-non-ethereum-chain-ton/8740.rss","#text":"Tingchain: The First Optimism Deployment on a Non-Ethereum Chain (TON)"},"filter":false},{"title":"Upgrade Proposal #10: Granite Network Upgrade","dc:creator":"inphi","category":"Protocol Upgrade","description":"<h1><a name=\"p-39463-executive-summary-1\" class=\"anchor\" href=\"https://gov.optimism.io#p-39463-executive-summary-1\"></a>Executive Summary</h1>\n<p>Hi I’m Mofi, a protocol engineer at OP Labs. OP Labs is a software development company focused on the Optimism ecosystem and a core developer of the OP Stack. We provide some services to, but do not represent or speak on behalf of, the Optimism Foundation.</p>\n<p>This upgrade is proposed in response to security vulnerabilities identified during a series of third-party security audits by Spearbit, Cantina, and Code4rena. None of the vulnerabilities have been exploited, and user assets are not and were never at risk. However, out of an abundance of caution, the permissioned fallback mechanism has been activated in order to avoid any potential instability while the vulnerabilities are patched. For more information on the permissioned fallback mechanism and the OP Stack’s defense-in-depth approach to Fault Proof security, see the <a href=\"https://docs.optimism.io/stack/protocol/fault-proofs/fp-security\" rel=\"noopener nofollow ugc\">documentation</a>.</p>\n<p>The upgrade includes both a set of smart contract upgrades to fix the vulnerabilities identified in the audit as well as an L2 hardfork to improve the stability and performance of the fault proof system. In addition, we propose extending the capabilities of the Guardian and DeputyGuardian to set the anchor state for the fault proof system in order to prevent referencing invalid anchor states. Aside from implementing these fixes, the primary impact of this upgrade would be to reset user withdrawals at the planned time, similar to the initial Fault Proof upgrade.</p>\n<h1><a name=\"p-39463-motivation-2\" class=\"anchor\" href=\"https://gov.optimism.io#p-39463-motivation-2\"></a>Motivation</h1>\n<p>As described in the original upgrade <a href=\"https://gov.optimism.io/t/final-protocol-upgrade-7-fault-proofs/8161\">proposal</a>, our rollout strategy for Fault Proofs focuses on securing the fundamental security mechanisms first, then building confidence on the correctness of the rest of the system over time. Successfully performing this strategy requires that:</p>\n<ol>\n<li>The fallback mechanisms are activated whenever there is a risk of a security vulnerability.</li>\n<li>Any vulnerabilities that may arise are swiftly patched.</li>\n</ol>\n<p>Therefore, the Foundation (via the Deputy Guardian role) activated the permissioned fallback which restricts output proposals to a trusted proposer and we at OP Labs created this proposal to resolve the vulnerabilities identified by the security audits. Note that the Guardian role is generally authorized to enforce “Safety over Liveness” in the system, meaning that it can pause and unpause withdrawals and as part of the Fault Proofs upgrade was authorized to intervene in the event that a bug would allow an invalid L2 output to be finalized.</p>\n<h1><a name=\"p-39463-specifications-3\" class=\"anchor\" href=\"https://gov.optimism.io#p-39463-specifications-3\"></a>Specifications</h1>\n<p>The specification for the proposed changes can be found in the <a href=\"https://github.com/ethereum-optimism/specs\" rel=\"noopener nofollow ugc\">specs repo</a>. Details of the individual audit issues are enumerated in the Audit Issues section below.</p>\n<h1><a name=\"p-39463-technical-details-4\" class=\"anchor\" href=\"https://gov.optimism.io#p-39463-technical-details-4\"></a>Technical Details</h1>\n<p>In the section below, we will summarize each of the audit issues we are fixing as well as the smart contracts/off-chain components affected by the upgrade. The full reports for each audit can be found here:</p>\n<ul>\n<li><a href=\"https://github.com/ethereum-optimism/optimism/blob/develop/docs/security-reviews/2024_08_report-cb-fault-proofs-non-mips.pdf\" rel=\"noopener nofollow ugc\">Spearbit</a></li>\n<li><a href=\"https://github.com/ethereum-optimism/optimism/blob/develop/docs/security-reviews/2024_08_report-cantinacode-coinbase-fault-proofs-mips.pdf\" rel=\"noopener nofollow ugc\">Cantina</a></li>\n<li><a href=\"https://github.com/code-423n4/2024-07-optimism-findings\" rel=\"noopener nofollow ugc\">Code4rena</a></li>\n</ul>\n<p>Note that this upgrade only contains the most important issues (in our opinion) from each audit. We plan on addressing other, lower-severity issues in future upgrades.</p>\n<h2><a name=\"p-39463-audit-issues-5\" class=\"anchor\" href=\"https://gov.optimism.io#p-39463-audit-issues-5\"></a>Audit Issues</h2>\n<p>The table below lists all the audit issues that are fixed in this upgrade. Issue severities have been updated to match the <a href=\"https://immunefi.com/bug-bounty/optimism/information/\" rel=\"noopener nofollow ugc\">Optimism ImmuneFi bounty</a>. While the auditors did discover some high severity issues, no user assets were ever at risk. All of the audit issues listed below can be detected by our monitoring tooling. Had an exploit been detected, the Deputy Guardian role - which is held by the Optimism Foundation and revocable by the Security Council - would have been expected to blacklist any exploitable dispute games or activate the permissioned fallback.</p>\n<p>Note that we have updated the spec to clarify some assumptions around the Cannon VM and program. Specifically, we trust that the Go compiler will emit proper MIPS32 programs. As a result, the Cantina issues that reference problems related to invalid MIPS32 programs are considered out-of-scope and will not be fixed.</p>\n<p>Unless otherwise noted, vulnerabilities in the dispute game all occur at MAX_GAME_DEPTH and are therefore classified as medium.</p>\n<div class=\"md-table\">\n<table>\n<thead>\n<tr>\n<th style=\"text-align:left\">Issue ID</th>\n<th style=\"text-align:left\">Severity</th>\n<th style=\"text-align:left\">Summary</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td style=\"text-align:left\">Cantina 3.1.1: Allocation overflow could allow for arbitrary code execution</td>\n<td style=\"text-align:left\">High</td>\n<td style=\"text-align:left\">Mmap calls did not perform memory bounds checking, which allowed memory pointers to wrap around to zero and access the entire memory of the fault proof program including the data and text sections of active MIPS programs. This could lead to arbitrary code execution within the VM, effectively breaking the VM’s correctness guarantees. No PoC was given, and it is our belief that such an exploit is infeasible due to memory protections employed by the Go runtime. Nevertheless, given the potential impact of the issue we worked with the auditors to classify this as a high severity issue and deploy a fix.</td>\n</tr>\n<tr>\n<td style=\"text-align:left\">C4 H-01: Invalid DISPUTED_L2_BLOCK_NUMBER is passed to VM</td>\n<td style=\"text-align:left\">High</td>\n<td style=\"text-align:left\">An attacker can counter a valid output claim by providing a trace containing one block after the original claim. For example, if an output root is proposed for block 13, the attacker could counter using a trace that includes valid blocks up to block 14. This issue is classified as high severity since it occurs above MAX_GAME_DEPTH.</td>\n</tr>\n<tr>\n<td style=\"text-align:left\">Spearbit 5.1.1: PreimageOracle.loadPrecompilePreimagePart an outOfGas error in the precompile will overwrite correct preimageParts</td>\n<td style=\"text-align:left\">Medium</td>\n<td style=\"text-align:left\">See section below.</td>\n</tr>\n<tr>\n<td style=\"text-align:left\">C4 H-02: The LPP challenge period can cause malicious and freeloader claims to be uncounterable and can also cause freeloader claims to be abused to entrap honest challengers</td>\n<td style=\"text-align:left\">Medium</td>\n<td style=\"text-align:left\">The clock extension mechanism is designed to give an honest actor time to counter freeloader claims, even though in that case they will inherit the opposing chess clock which may have very limited time remaining. Since the LPP challenge period was longer than the clock extension period, the clock extension granted in that case would not be sufficient to allow the honest actor to complete a call to step. While the overall game still resolves correctly, the challenger would lose bonds posted in attempting to counter the freeloader claim.</td>\n</tr>\n<tr>\n<td style=\"text-align:left\">C4 H-05: An attacker can bypass the challenge period during LPP finalization</td>\n<td style=\"text-align:left\">Medium</td>\n<td style=\"text-align:left\">An attacker can bypass the large preimage challenge period by calling addLeavesLPP with _finalize set to false. Since the challenge period timestamp is never set, attackers can then call squeezeLPP, thereby bypassing the challenge period and inserting invalid data into the preimage oracle.</td>\n</tr>\n<tr>\n<td style=\"text-align:left\">Cantina 3.3.5: Wrong implementation of srav</td>\n<td style=\"text-align:left\">Low</td>\n<td style=\"text-align:left\">The srav instruction does not mask the 5 lower bits of rs, which is nonconformant with the MIPS specification. This could lead to undefined behavior.</td>\n</tr>\n<tr>\n<td style=\"text-align:left\">Cantina 3.4.2: Location of registers array in memory should be verified</td>\n<td style=\"text-align:left\">Low</td>\n<td style=\"text-align:left\">The on-chain MIPS VM does not verify that the registers array is allocated right after the state struct. Validating this would make the code more defensive.</td>\n</tr>\n<tr>\n<td style=\"text-align:left\">Spearbit 5.2.5: Preimage proposals can be initialized multiple times</td>\n<td style=\"text-align:left\">Low</td>\n<td style=\"text-align:left\">initLPP() does not check if a proposal already exists. This could lead to loss of funds if a user provides the same LPP UUID multiple times.</td>\n</tr>\n<tr>\n<td style=\"text-align:left\">Spearbit 5.2.3: Extension period not applied correctly for next root when SPLIT_DEPTH is set to 1 or less</td>\n<td style=\"text-align:left\">Low</td>\n<td style=\"text-align:left\">When SPLIT_DEPTH is set to 1, the extension period for the next root is calculated as zero which results in no extension period being applied. If SPLIT_DEPTH is set to zero, subsequent game moves will result due to an integer underflow.</td>\n</tr>\n<tr>\n<td style=\"text-align:left\">Spearbit 5.1.2: Invalid Ancestor Lookup Leading to Out-of-Bounds Array Access</td>\n<td style=\"text-align:left\">Low</td>\n<td style=\"text-align:left\">An out of bounds array access can occur when MAX_DEPTH = SPLIT_DEPTH + 1. While this is unlikely to happen in practice, we have updated the FDG constructor to require that SPLIT_DEPTH + 1 &gt;= MAX_GAME_DEPTH.</td>\n</tr>\n<tr>\n<td style=\"text-align:left\">Spearbit 5.2.4: Inconsistent _partOffset check and memory boundaries in loadLocalData function</td>\n<td style=\"text-align:left\">Low</td>\n<td style=\"text-align:left\">The _partOffset parameter is handled inconsistently in some places within the loadLocalData function.</td>\n</tr>\n<tr>\n<td style=\"text-align:left\">Spearbit 5.2.6: _clockExtension and _maxClockDuration are not validated correctly in DisputeGame constructor</td>\n<td style=\"text-align:left\">Low</td>\n<td style=\"text-align:left\">If a dispute game is initialized with a clock extension set to more than half of the max duration, move transactions during the execution trace bisection will revert since the difference between 2 * the clock extension and the game’s max duration will underflow.</td>\n</tr>\n</tbody>\n</table>\n</div><h3><a name=\"p-39463-notes-on-spearbit-511-6\" class=\"anchor\" href=\"https://gov.optimism.io#p-39463-notes-on-spearbit-511-6\"></a>Notes on Spearbit 5.1.1</h3>\n<p>By calling loadPrecompilePreimagePart with less gas than necessary, an attacker could produce an outOfGas error in the precompile. If there is enough gas left in the loadPrecompilePart function, a valid preimage could be overwritten with the outOfGas error itself. This would result in an incorrect game outcome.</p>\n<p>The function of the loadPrecompilePreimagePart method is to allow certain expensive precompiles - namely ecrecover, ecpairing, and kzg_point_evaluation - to be accelerated. Accelerated precompiles offload their execution to an L1 oracle. Since precompiles are implemented natively rather than via EVM opcodes, this improves Cannon’s performance and allows challengers to quickly generate traces for blocks filled with these computationally expensive calls. To address the outOfGas issue, we’re adding a minimum gas requirement to the PreimageOracle to ensure there’s enough gas to accelerate precompiles on L1.</p>\n<p>Another related issue with loadPrecompilePreimagePart is that the gas required to accelerate precompiles on L1 may be insufficient given the cost of executing them on L2. This is because the gas provided to the precompile accelerator contract on L1 can never exceed 63/64th of the gas limit on L2. This is a problem for precompiles that have a dynamic gas cost of execution. Of the accelerated precompiles, ecPairing is the only one that contains this vulnerability as its gas cost scales with its input size.</p>\n<p>To fix this problem, we are proposing an L2 hardfork to limit the maximum input size provided to the ecPairing precompile to 112687 bytes. This number is high enough to enable all known use cases of the ecPairing precompile, but low enough to enable the challenger to generate traces for larger blocks in a timely manner. While this is technically a divergence from the EVM, our on-chain data has found no calls to the ecPairing precompile with an input size over 1187 bytes. The provided limit is therefore 2 orders of magnitude larger than any known use case, which we believe is sufficiently safe.</p>\n<h2><a name=\"p-39463-additional-fixes-7\" class=\"anchor\" href=\"https://gov.optimism.io#p-39463-additional-fixes-7\"></a>Additional Fixes</h2>\n<p>In addition to the audit fixes above, we are also proposing the following additional fixes:</p>\n<ol>\n<li>We propose reducing the ChannelTimeout value from 200 blocks to 50. Canon has a limited amount of memory - approximately 1.1GB - and is not currently garbage collected. The longer channel timeout caused Cannon to run out of memory on OP Sepolia, and was close to the limit on mainnet. Reducing the ChannelTimeout significantly increases the amount of memory available to Cannon and reduces the risk of an OOM occurring.</li>\n<li>An ImmuneFi bounty hunter noticed that DelayedWETH’s recover function is not robust against transfers which need more than 2300 gas. We propose modifying DelayedWETH such that the owner can always recover funds regardless of how much gas is required.</li>\n<li>As a result of falling back to the permissioned game, we realized that switching back to the permissionless game could in theory cause the anchor state to reference an old state prior to the switch to the permissioned game. To remedy this, we have updated the Guardian and DeputyGuardian roles to have the permission to set the anchor state.</li>\n</ol>\n<p>All proposed contract changes can be found in the op-contracts/v1.6.0 <a href=\"https://github.com/ethereum-optimism/optimism/tree/op-contracts/v1.6.0-rc.1\" rel=\"noopener nofollow ugc\">release</a>.</p>\n<h2><a name=\"p-39463-impacted-components-8\" class=\"anchor\" href=\"https://gov.optimism.io#p-39463-impacted-components-8\"></a>Impacted Components</h2>\n<p>This upgrade involves both L1 smart contracts as well as the node and execution client software.</p>\n<p>The following contracts are modified as part of this upgrade:</p>\n<ul>\n<li>On-Chain MIPS VM:\n<ul>\n<li>MIPS.sol</li>\n<li>PreimageOracle.sol</li>\n</ul>\n</li>\n<li>Dispute Game\n<ul>\n<li>FaultDisputeGame.sol</li>\n<li>PermissionedDisputeGame.sol</li>\n</ul>\n</li>\n<li>DelayedWETH.sol</li>\n<li>DeputyGuardianModule.sol</li>\n<li>AnchorStateRegistry.sol</li>\n</ul>\n<p>OP Node has been updated to process the reduced ChannelTimeout. OP Geth has been updated to limit the maximum input size to ecPairing.</p>\n<h2><a name=\"p-39463-security-considerations-9\" class=\"anchor\" href=\"https://gov.optimism.io#p-39463-security-considerations-9\"></a>Security Considerations</h2>\n<p>These changes are all in response to vulnerabilities discovered during external security audits. No vulnerabilities were found in the fallback mechanisms, which were themselves <a href=\"https://audits.sherlock.xyz/contests/205/report\" rel=\"noopener nofollow ugc\">audited</a> prior to deploying Fault Proofs in June.</p>\n<p>As per the <a href=\"https://gov.optimism.io/t/op-labs-audit-framework-when-to-get-external-security-review-and-how-to-prepare-for-it/6864\">Audit Framework</a>, the dispute game and MIPS contracts fall into the liveness/reputational risk category which do not require audits. The fallback mechanisms make any bugs simple to recover from and  pose no risk to user funds. Therefore, we have opted not to pursue a fix review for the changes made in this proposal. We propose addressing any additional issues discovered in a similar manner to the way they are being addressed here, specifically:</p>\n<ol>\n<li>Depending on the issues at hand, Labs recommend that the Deputy Guardian trigger the fallback or blacklist specific dispute games.</li>\n<li>Labs or (others in the core developer community) would create a governance proposal to resolve the issues.</li>\n</ol>\n<p>There’s quite a bit of nuance to when the fallbacks should be activated. In light of this audit, we propose adopting the following rubric to decide if/when the fallback should be activated. If an issue is costly to exploit - e.g., it requires playing the game to MAX_GAME_DETH - then we propose disclosing it immediately and using the dispute game blacklist to mitigate any attempts to exploit it. The dispute game blacklist will seize any bonds paid by an attacker, and makes attempting to exploit dispute resolution deeply unprofitable. On the other hand, if issues are not costly to exploit then we propose activating the fallback prior to disclosure. In both cases, fixes for the vulnerabilities would be proposed as a regular protocol upgrade in the nearest voting cycle.</p>\n<p>Consistent with the <a href=\"https://gov.optimism.io/t/op-labs-audit-framework-when-to-get-external-security-review-and-how-to-prepare-for-it/6864\">OP Labs Audit Framework</a>, we have not had the contents of the hardfork audited. However, OP Labs did perform a security review of these changes. Risk analysis of each L2 change is below.</p>\n<ul>\n<li>Limiting the size of ecPairing’s input is considered a <strong>low-risk</strong> change. Implementation bugs would not put user assets at risk. Even though this is technically a divergence from the EVM, our data suggests that there have been no usages of the ecPairing precompile with an input size &gt; 1152 bytes, which is far below the limit we will be imposing.</li>\n<li>Reducing the ChannelTimeout is considered a <strong>low-risk</strong> change. Implementation bugs would not put user assets at risk.</li>\n</ul>\n<h1><a name=\"p-39463-impact-summary-10\" class=\"anchor\" href=\"https://gov.optimism.io#p-39463-impact-summary-10\"></a>Impact Summary</h1>\n<ul>\n<li>OP Labs does not anticipate any downtime due to this upgrade.</li>\n<li>If this proposal is approved, node operators <strong>must</strong> upgrade their node software prior to September 11th in order to avoid a chain split.</li>\n<li>As a result of triggering the fallback, <strong>all pending withdrawals will be invalidated</strong>. Users with pending withdrawals will need to re-prove them against an output proposal submitted by the permissioned proposer. <strong>This means that withdrawals initiated less than one week before the upgrade is executed will only be finalized one week after the upgrade is complete.</strong> For example, a withdrawal initiated 6 days before the upgrade would take a total of 13 days to finalize. <strong>In addition, proposals made within a week of the permissionless game being reactivated will also be invalidated.</strong></li>\n<li>Users will be unable to provide more than 112687 bytes of input to the ecPairing precompile.</li>\n<li>Proposers (other than the trusted proposer operated by OP Labs) will be unable to propose their own outputs until the fallback is deactivated following the L1 upgrades.</li>\n<li>All client-side tooling is unaffected.</li>\n</ul>\n<h1><a name=\"p-39463-action-plan-11\" class=\"anchor\" href=\"https://gov.optimism.io#p-39463-action-plan-11\"></a>Action Plan</h1>\n<p>If this vote passes, the Granite upgrade will be scheduled for execution on September 10th at 16:00:01 UTC. The upgrade will occur automatically for nodes on a release which contains the baked-in activation time. Granite is code complete in the optimism monorepo at commit a81de910dc2fd9b2f67ee946466f2de70d62611a and op-geth at commit 0f5b9dcfd2ac66f6fd8faae526b1549721f5f392. The smart contracts release is op-contracts/v1.6.0-rc.1. The op-node and op-geth releases will be finalized if this proposal passes.</p>\n<p>This upgrade has already been activated on internal devnets and the Sepolia Superchain in coordination with Base and Conduit.</p>\n<p>The overall upgrade plan is as follows:</p>\n<ol>\n<li><strong>Update the Absolute Pre-State:</strong> Prior to the hardfork activation, we will update the absolute pre-state as done in the Fjord upgrade. This ensures that the new op-program can be used with the upgraded protocol, and must be performed prior to hardfork activation. See the Fjord upgrade <a href=\"https://gov.optimism.io/t/upgrade-proposal-9-fjord-network-upgrade/8236\">proposal</a> for more details. This upgrade is transparent to users, and no action is required.</li>\n<li><strong>Activate the Hardfork on L2:</strong> The hardfork will activate on the L2 network at the scheduled time. Node operators must upgrade to the versions described above to avoid a chain split. Once upgraded, no further action is required.</li>\n<li><strong>Update the L1 Smart Contracts:</strong> Finally, we will update the L1 smart contracts to new versions that contain fixes for the audit issues. This upgrade is transparent to users, and no action is required. This update will also deactivate the fallback mechanism, and revert back to permissionless proposing.</li>\n</ol>\n<p>The Security Council and Optimism Foundation must sign the transactions for steps 1 and 3 prior to the hardfork activation. This sequence is crucial to prevent breaking the fault proof system.</p>\n<h2><a name=\"p-39463-emergency-cancellation-12\" class=\"anchor\" href=\"https://gov.optimism.io#p-39463-emergency-cancellation-12\"></a>Emergency Cancellation</h2>\n<p>The releases above will contain a Granite activation at the above-mentioned time. If a critical security issue is found between approval and rollout, the Optimism Foundation and Security Council should coordinate an emergency cancellation. Node operators can quickly react by using the --override.granite flag on both op-node and op-geth.</p>\n<h1><a name=\"p-39463-conclusion-13\" class=\"anchor\" href=\"https://gov.optimism.io#p-39463-conclusion-13\"></a>Conclusion</h1>\n<p>This proposal outlines the Granite network upgrade, which responds to security vulnerabilities identified by third-party auditors. This upgrade brings better security and performance to the fault proof system.</p>\n            <p><small>20 posts - 14 participants</small></p>\n            <p><a href=\"https://gov.optimism.io/t/upgrade-proposal-10-granite-network-upgrade/8733\">Read full topic</a></p>","link":"https://gov.optimism.io/t/upgrade-proposal-10-granite-network-upgrade/8733","pubDate":"Fri, 16 Aug 2024 19:09:51 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"gov.optimism.io-topic-8733"},"source":{"@url":"https://gov.optimism.io/t/upgrade-proposal-10-granite-network-upgrade/8733.rss","#text":"Upgrade Proposal #10: Granite Network Upgrade"},"filter":false},{"title":"Cross Posting - Experimentation with Citizenship","dc:creator":"system","category":"Citizens  👥","description":"<p><em>This is an article in the <a href=\"https://community.optimism.io/citizens-house/experimentation-with-citizenship\">governance docs</a>, cross-posted here for better visibility</em></p>\n<p>The Citizens’ House is half of the Optimism Collective’s bicameral governance system, designed to work alongside the pure token-voting based Token House.</p>\n<p>The purpose of the Citizens’ House is to:</p>\n<ul>\n<li>Reduce the concentration of power in the Collective</li>\n<li>Safeguard against the capture of the Token House</li>\n<li>Allocate resources according to the long-term benefit to the Collective</li>\n</ul>\n<p>Any changes to the Citizens’ House, including changes to Citizen selection, should be evaluated based on their contribution to these objectives.</p>\n<h2><a name=\"p-39451-taking-an-experimental-approach-to-citizen-selection-1\" class=\"anchor\" href=\"https://gov.optimism.io#p-39451-taking-an-experimental-approach-to-citizen-selection-1\"></a>Taking an experimental approach to Citizen selection</h2>\n<p>An experimental approach to Citizen selection ensures that changes are made based on evidence rather than gut feeling. Guesswork and informed opinions play a part in the formation of hypotheses, but diverging opinions are settled through hypothesis-testing. This process ensures that as Citizen selection evolves over time, it is always evolving in the direction of progress towards the objectives. Changes that have an undesirable effect are rolled back, and mistakes are learned from to inform future improvements.</p>\n<p>Disclaimer: <em>The types of experiments run in the name of Citizen selection are unlikely to be double-blind controlled trials. We seek to use the principles and practices of experimentation to the maximum extent feasible, with the aim of growing the amount of high-confidence knowledge about Citizen selection that the Collective has access to.</em></p>\n<h2><a name=\"p-39451-experimentation-on-citizen-selection-in-practice-2\" class=\"anchor\" href=\"https://gov.optimism.io#p-39451-experimentation-on-citizen-selection-in-practice-2\"></a>Experimentation on Citizen selection in practice</h2>\n<p>Effective experimentation with Citizen selection has several prerequisites:</p>\n<ol>\n<li>The ability to measure both input and outcome variables</li>\n<li>Short feedback cycles</li>\n<li>Reversibility</li>\n</ol>\n<h3><a name=\"p-39451-measuring-both-input-and-outcome-variables-3\" class=\"anchor\" href=\"https://gov.optimism.io#p-39451-measuring-both-input-and-outcome-variables-3\"></a>Measuring both input and outcome variables</h3>\n<p>To run effective experiments, the inputs and outcomes of those experiments must be measurable. Inputs (independent variables) are the aspects of Citizen selection that we want to change or influence, and outcomes (dependent variables) are the measurable effects of the experiment, usually tied to the overall objective we want to achieve. A large effort is underway to improve our ability to measure key aspects of Retroactive Public Goods Funding (Retro Funding), Citizens’ House performance and other aspects of the Citizenry.</p>\n<h3><a name=\"p-39451-short-feedback-cycles-4\" class=\"anchor\" href=\"https://gov.optimism.io#p-39451-short-feedback-cycles-4\"></a>Short feedback cycles</h3>\n<p>Effective experimentation often involves testing many different variables in different conditions. In order to make efficient progress, we need to be able to run a lot of experiments and learn from them quickly. Increasing the number of Retro Funding iterations per year and introducing new opportunities for experiments can allow us to shorten feedback cycles.</p>\n<h3><a name=\"p-39451-reversibility-5\" class=\"anchor\" href=\"https://gov.optimism.io#p-39451-reversibility-5\"></a>Reversibility</h3>\n<p>The primary objective of experimentation is to learn. Experiments are a risk - we are never sure what the outcome will be, otherwise there would be no need for an experiment. Any changes made to Citizen selection in the name of experimentation must therefore be reversible. The concept of guest voters in Retro Funding experiments is one way to ensure reversibility of experiments.</p>\n<h3><a name=\"p-39451-citizen-selection-experiments-6\" class=\"anchor\" href=\"https://gov.optimism.io#p-39451-citizen-selection-experiments-6\"></a>Citizen selection experiments</h3>\n<p>The purpose of experimentation with Citizen selection is to increase the Collective’s knowledge about the effectiveness of various different selection mechanisms to ultimately enable effective future decisions. Experiments are currently run as part of the planned Retro Funding iterations that happen multiple times per year, with experiment outcomes being shared publicly at the end of each experiment.</p>\n<p>For each Retro Funding iteration, a different selection mechanism may be tested by selecting a limited number of guest voters to participate in the round. Guest voters are temporary participants in Retro Funding votes, and should not be confused with Citizens who participate in protocol upgrade proposal vetoes in addition to Retro Funding votes. The purpose of introducing guest voters is to increase the reversibility of experiments.</p>\n<p>Increased data collection around Retro Funding votes and their participants is also an essential component of measuring experiment outcomes, and may take several forms:</p>\n<ul>\n<li>Surveys distributed to voters, builders and other stakeholders</li>\n<li>An analysis of voting behavior within and across Retro Funding votes</li>\n<li>Measuring the concentration of power through social graph analysis</li>\n</ul>\n<p>Another essential type of data required for experimentation with Citizen selection is identity and ‘reputation’ data. This forms an important input into selection mechanisms themselves and is therefore essential to the Collective’s ability to experiment with various approaches.</p>\n<h2><a name=\"p-39451-identity-reputation-and-citizen-selection-7\" class=\"anchor\" href=\"https://gov.optimism.io#p-39451-identity-reputation-and-citizen-selection-7\"></a>Identity, reputation and Citizen selection</h2>\n<p>There are a myriad of variations of the above approaches to Citizen selection that may be tested experimentally. Many such selection mechanisms rely on information about prospective Citizens to make selection decisions. Building a rich identity layer within the Collective allows these kinds of selection mechanisms to function.</p>\n<p>By enabling individual members of the Collective to build and maintain their identity as a Collective participant, potentially relevant information about the individual can be factored into the selection process. For example, some selection mechanisms may use someone’s professional contributions to the Collective as a deciding factor in whether they should be Citizens. Another might use the duration and depth of engagement with apps built on the Superchain. These are just hypothetical examples, but they illustrate the importance of individual identity in being able to test all selection mechanisms.</p>\n<p>Building out <a href=\"https://hackmd.io/aVobj2ZKRoGZo5hKbvneiA\">the identity stack(opens in a new tab)</a> ensures that the Optimism Collective is able to effectively experiment with all possible selection mechanisms to identify those with the best performance. It is therefore a core building block in the development of Citizenship. Without adequate data on potential candidate Citizens and the performance of the Citizenry on its objectives, it is impossible to experiment with selection criteria.</p>\n<h2><a name=\"p-39451-to-recap-8\" class=\"anchor\" href=\"https://gov.optimism.io#p-39451-to-recap-8\"></a>To recap</h2>\n<ul>\n<li>A solid and shared foundation of knowledge and data from open-sourced experiments is essential for the Collective’s decision-making ability.</li>\n<li>Experimentation with selection criteria is the most effective way to increase knowledge around the effectiveness of various approaches to Citizen selection.</li>\n<li>Measurement of inputs and outcomes of Citizen selection, short feedback loops and reversible changes are essential prerequisites for the Collective to build up a reliable process for experimentation.</li>\n<li>The Optimism Foundation currently runs experiments on Citizen selection using guest voters in Retro Funding iterations with the help of surveys, voting analysis and other methods to measure experiment outcomes.</li>\n</ul>\n            <p><small>1 post - 1 participant</small></p>\n            <p><a href=\"https://gov.optimism.io/t/cross-posting-experimentation-with-citizenship/8732\">Read full topic</a></p>","link":"https://gov.optimism.io/t/cross-posting-experimentation-with-citizenship/8732","pubDate":"Fri, 16 Aug 2024 14:01:12 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"gov.optimism.io-topic-8732"},"source":{"@url":"https://gov.optimism.io/t/cross-posting-experimentation-with-citizenship/8732.rss","#text":"Cross Posting - Experimentation with Citizenship"},"filter":false},{"title":"Quadratic Funding + Retro: Token Engineering the Superchain!","dc:creator":"jade","category":"✨ General","description":"<h1><a name=\"p-39450-help-test-a-new-type-of-gitcoin-round-that-boosts-the-votes-of-superchain-stakeholders-1\" class=\"anchor\" href=\"https://gov.optimism.io#p-39450-help-test-a-new-type-of-gitcoin-round-that-boosts-the-votes-of-superchain-stakeholders-1\"></a>Help test a new type of Gitcoin round that boosts the votes of Superchain stakeholders!</h1>\n<p><strong></strong></p><div class=\"lightbox-wrapper\"><strong><a class=\"lightbox\" href=\"https://europe1.discourse-cdn.com/bc41dd/original/2X/8/864891ff0e691aabd42206cf8aae36103ca509fa.png\" data-download-href=\"/uploads/short-url/j9VsEE3aRrLCfalPkq81hW1NcMy.png?dl=1\" title=\"\" rel=\"noopener nofollow ugc\"><img src=\"https://europe1.discourse-cdn.com/bc41dd/optimized/2X/8/864891ff0e691aabd42206cf8aae36103ca509fa_2_624x124.png\" alt=\"\" data-base62-sha1=\"j9VsEE3aRrLCfalPkq81hW1NcMy\" width=\"624\" height=\"124\" role=\"presentation\" srcset=\"https://europe1.discourse-cdn.com/bc41dd/optimized/2X/8/864891ff0e691aabd42206cf8aae36103ca509fa_2_624x124.png, https://europe1.discourse-cdn.com/bc41dd/optimized/2X/8/864891ff0e691aabd42206cf8aae36103ca509fa_2_936x186.png 1.5x, https://europe1.discourse-cdn.com/bc41dd/optimized/2X/8/864891ff0e691aabd42206cf8aae36103ca509fa_2_1248x248.png 2x\" data-dominant-color=\"D6465A\"></a></strong></div><p></p>\n<p>Token Engineering the Superchain is attracting token engineering practitioners and projects to the Superchain – and it’s <a href=\"https://explorer.gitcoin.co/#/round/10/57\" rel=\"noopener nofollow ugc\">now live on Gitcoin</a>! Your participation will have a substantial impact in deciding which projects receive the round’s $60K matching pool.</p>\n<p>With just a few minutes of your time right now, you can also help test this new approach to seed funding impact on the Superchain. The Token Engineering Commons (TEC) is using a new approach called “Tunable Quadratic Funding” (TQF) to ‘boost’ the Quadratic Funding impact of Gitcoin contributions based on two factors:</p>\n<p><strong>Amplifying the Voice of Superchain Governance:</strong></p>\n<ul>\n<li>This Gitcoin round is designed to drive token engineering impact into the Superchain – and who better to shape that impact than the Superchain community itself? That’s why the TEC is using TQF to boost the voting power of OP badgeholders, delegates, and token holders.</li>\n</ul>\n<p><strong>Expertise-Boosted Quadratic Funding:</strong></p>\n<ul>\n<li>The TEC also uses TQF to boost votes for Gitcoin round participants with <a href=\"https://medium.com/token-engineering-commons/expertise-and-quadratic-funding-bd4f0c5c3e23\" rel=\"noopener nofollow ugc\">demonstrated token engineering expertise</a>. It’s our way of combining the participatory power of Quadratic Funding with Subject Matter Expertise in our capital allocation programs. It’s a complementary approach to Optimism’s experiments in incorporating “<a href=\"https://gov.optimism.io/t/retro-funding-5-expert-voting-experiment/8613/1\">guest voters with expertise</a>.”</li>\n</ul>\n<h2><a name=\"p-39450-proactive-seeds-retroactive-rewards-2\" class=\"anchor\" href=\"https://gov.optimism.io#p-39450-proactive-seeds-retroactive-rewards-2\"></a>Proactive Seeds, Retroactive Rewards</h2>\n<p>Your participation in this Gitcoin round also helps test another innovation in capital allocation: integrating Quadratic Funding and Retro Funding! The Quadratic Funding round serves as up-front seed funding that projects use to generate Superchain impact. Later this year, the TEC will run a follow-on retro round with <a href=\"https://easyretropgf.xyz/\" rel=\"noopener nofollow ugc\">Gitcoin’s EasyRetro</a> to retroactively reward these projects based on their actual impact, tracked in <a href=\"https://gap.karmahq.xyz/\" rel=\"noopener nofollow ugc\">Karma GAP</a>.</p>\n<h2><a name=\"p-39450-niche-retro-3\" class=\"anchor\" href=\"https://gov.optimism.io#p-39450-niche-retro-3\"></a>“Niche Retro”</h2>\n<p>This innovative approach to combining quadratic and retro funding enables the TEC to micro-target capital allocations to a specific domain of expertise. It’s what we call <strong>“Niche Retro”</strong> funding, and while our focus is on generating token engineering impact in the Superchain, we see this approach being replicated in other domains as well, such as gaming, defi, security audits, and much more.</p>\n<h2><a name=\"p-39450-data-driven-learning-iteration-4\" class=\"anchor\" href=\"https://gov.optimism.io#p-39450-data-driven-learning-iteration-4\"></a>Data-Driven Learning &amp; Iteration</h2>\n<p>The TEC migrated to OP Mainnet in 2023. It is our home and we are committed to helping the Superchain on its path to open metagovernance. To this end, we will be publicly sharing our findings from this experiment in the OP Forum as we iterate together in making the Superchain the most trustworthy of all blockchain ecosystems.</p>\n<h2><a name=\"p-39450-its-easy-5\" class=\"anchor\" href=\"https://gov.optimism.io#p-39450-its-easy-5\"></a>It’s Easy</h2>\n<p>Your participation in this experiment couldn’t be easier. With just a few minutes of your time and some donations of as little as 1 $OP, you can have a big influence on which projects get the biggest share of the $60K matching pool contributed by Gitcoin and the TEC. These projects will then be eligible for the follow-on retro funding round later this year!</p>\n<p>Just pop over to our <a href=\"https://explorer.gitcoin.co/#/round/10/57\" rel=\"noopener nofollow ugc\">Gitcoin round</a> right now, find a few projects you think will have a good impact on the Superchain, and cast your votes right now!</p>\n<p>One last thing! If you’re interested in getting involved in this experiment or the TEC more generally, please just drop us a note in the comments below. We’d love your help!</p>\n            <p><small>13 posts - 13 participants</small></p>\n            <p><a href=\"https://gov.optimism.io/t/quadratic-funding-retro-token-engineering-the-superchain/8731\">Read full topic</a></p>","link":"https://gov.optimism.io/t/quadratic-funding-retro-token-engineering-the-superchain/8731","pubDate":"Fri, 16 Aug 2024 13:55:36 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"gov.optimism.io-topic-8731"},"source":{"@url":"https://gov.optimism.io/t/quadratic-funding-retro-token-engineering-the-superchain/8731.rss","#text":"Quadratic Funding + Retro: Token Engineering the Superchain!"},"filter":false},{"title":"Retro Funding 5: Application Review Process","dc:creator":"system","category":"Retro  Funding 🔴","description":"<p>The Retroactive Public Goods Funding (Retro Funding) application review process is applied to decide which applicants are eligible to participate in retro rounds and is used to enforce application rules and eligibility criteria. This process is run by a selected group of Citizens during a 2 week period following the project sign up process. For a full overview of the application review process see <a href=\"https://gov.optimism.io/t/retro-funding-application-review-process/8012\">Retro Funding: Application Review Process</a>.</p>\n<h2><a name=\"p-39448-reviewer-expectations-1\" class=\"anchor\" href=\"https://gov.optimism.io#p-39448-reviewer-expectations-1\"></a>Reviewer Expectations</h2>\n<p>Any Citizen who participates in the review process should meet the following expectations</p>\n<ol>\n<li><strong>Time Commitment</strong>: As a reviewer you should expect to commit a <strong>minimum of 10 hours</strong> to participating in the review process. There’s a need for you to have ongoing availability during the process running from <strong>Sept 6th - Sept 20th</strong>.</li>\n<li><strong>OP Stack Knowledge</strong>: You should have high level familiarity with the OP Stack and its components to enforce the eligibility criteria. Please make sure you understand and are comfortable with enforcing the <a href=\"https://gov.optimism.io/t/retro-funding-5-op-stack-round-details/8612#p-38855-round-scope-and-eligibility-criteria-3\"><strong>eligibility criteria</strong></a> before you sign up.</li>\n<li><strong>Communication &amp; Synch calls:</strong> Stay attentive to messages, announcements, and action steps provided by the Lead Reviewers. Attend the onboarding call and attend regular reviewer synch calls.</li>\n<li><strong>Stick to the rules:</strong> Thoroughly review applications according to the application review checklist. You need to provide a written explanation for your review. Diverting from the rules to implement your personal values is <strong>unacceptable</strong> and will result in removal from the review process.</li>\n<li><strong>Conflicts of Interest</strong>: You are required to declare projects you have a conflict of interest with when applying to be a reviewer. If you discover a possible conflict later on, you’re required to contact a Lead Reviewer to be removed from reviewing this project. A conflict of Interest is defined as “Organizations where you expect any portion of funds to flow to yourself or any projects from which you derive income”.</li>\n</ol>\n<h2><a name=\"p-39448-reviewer-selection-2\" class=\"anchor\" href=\"https://gov.optimism.io#p-39448-reviewer-selection-2\"></a>Reviewer Selection</h2>\n<p>Citizens will be selected as Reviewers via a combination of an opt-in process and random sampling. This allows for a smaller group to engage in the process, while still being fairly selected via random sampling.</p>\n<ol>\n<li><strong>Opt-in</strong>: Citizens can opt-in to participate in the application review process until Aug 31st 19:00 UTC. To opt-in please fill out <a href=\"https://deform.optimism.io/reviewer-sign-ups\">this form</a> (<a href=\"https://deform.optimism.io/reviewer-sign-ups\">https://deform.optimism.io/reviewer-sign-ups</a>) and be sure you have read the <a href=\"https://gov.optimism.io/t/retro-funding-5-application-review-process/8730#p-39448-reviewer-expectations-1\">Reviewer Expectations</a>.</li>\n<li><strong>Random Sampling</strong>: 30 reviewers will be randomly selected from the citizens who have opted-in to review. Selection will take place on September 2nd and citizens will be notified via email about the outcome of the random selection.</li>\n<li><strong>Lead Reviewers</strong>: Diego, the Citizens’ House Gov NERD, will act as a non-voting lead reviewer, responsible for resolving questions, collecting votes, managing the timeline of the process and facilitating collaboration. One additional non-voting lead reviewer will be selected by Diego to manage and facilitate the process during European working hours. You can add your application to be a lead reviewer in the sign up form.</li>\n<li><strong>Reviewer Groups:</strong> Instead of randomly assigning reviewers to cases, there will be 6 reviewer groups with 5 reviewers each. Each reviewer will be randomly assigned to a group. This design aims at reducing the operational and technical complexity, as well as allow for more collaboration among reviewers.</li>\n</ol>\n<h2><a name=\"p-39448-application-review-process-overview-3\" class=\"anchor\" href=\"https://gov.optimism.io#p-39448-application-review-process-overview-3\"></a>Application Review Process Overview</h2>\n<p></p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://europe1.discourse-cdn.com/bc41dd/original/2X/b/b7dabd3eace0df362d8a93338859d22a3b43de4d.png\" data-download-href=\"/uploads/short-url/qes1thEWhW75PywPjkcI9DOhXuB.png?dl=1\" title=\"image\"><img src=\"https://europe1.discourse-cdn.com/bc41dd/optimized/2X/b/b7dabd3eace0df362d8a93338859d22a3b43de4d_2_690x292.png\" alt=\"image\" data-base62-sha1=\"qes1thEWhW75PywPjkcI9DOhXuB\" width=\"690\" height=\"292\" srcset=\"https://europe1.discourse-cdn.com/bc41dd/optimized/2X/b/b7dabd3eace0df362d8a93338859d22a3b43de4d_2_690x292.png, https://europe1.discourse-cdn.com/bc41dd/optimized/2X/b/b7dabd3eace0df362d8a93338859d22a3b43de4d_2_1035x438.png 1.5x, https://europe1.discourse-cdn.com/bc41dd/optimized/2X/b/b7dabd3eace0df362d8a93338859d22a3b43de4d_2_1380x584.png 2x\" data-dominant-color=\"FCFCFB\"></a></div><p></p>\n<ol>\n<li><strong>Application is submitted</strong> via <a href=\"http://retrofunding.optimism.io\">retrofunding.optimism.io</a></li>\n<li><strong>Application is assigned to reviewer group</strong> (see “Reviewer Selection”)</li>\n<li><strong>Rule Violation Check</strong>: 2 reviewers, from the relevant reviewer group, review the application for rule violations. If both reviewers approve the application, it qualifies for the round.</li>\n<li><strong>Full Review</strong>: If at least 1 reviewer rejected the application, the remaining 3 reviewers in the reviewer group are asked to submit their review. If the majority of reviewers approve, the application qualifies for the round.</li>\n<li><strong>Appeal</strong>: If a majority of reviewers rejected the application, the applicant can hand in an appeal. The appeal will then be reviewed by 5 reviewers from a different reviewer group to the one that did the initial review. The reviewer group decides if the application is rejected/approved by majority vote.</li>\n<li><strong>Application Edits</strong>: Edits to a projects application are only allowed in cases where the application form itself is misguided or deceived applications, bugs caused input errors or the application category was selected wrong. The Foundation decides which applications are allowed to be edited. Relevant edits are made following the Full Review and are considered within the Appeals process.</li>\n</ol>\n<h3><a name=\"p-39448-application-rules-4\" class=\"anchor\" href=\"https://gov.optimism.io#p-39448-application-rules-4\"></a>Application rules</h3>\n<p>Below are rules for which violation will result in the removal of an application from a Retro Funding round.</p>\n<ol>\n<li><strong>False statements &amp; deception</strong> - false claims about your contributions, past impact or funding &amp; grants are not allowed.</li>\n<li><strong>Hateful Content</strong> - No racist, sexist, or otherwise hateful speech, no discrimination as defined by the <a href=\"https://gov.optimism.io/t/rules-of-engagement-2-0/5728\">rules of engagement</a></li>\n<li><strong>Deceiving badgeholders</strong> - Malicious content that could cause harm or unintended consequences to users.</li>\n<li><strong>Fraud &amp; Impersonation</strong> - Claiming to be a brand or person you are not. The Grant owner must be directly affiliated with the project; the funds must go to the project.</li>\n<li><strong>Advertising</strong> - Using Retro Funding application to showcase something you are selling like a token sale or NFT drop</li>\n<li><strong>Outside of Retro round scope or not meeting eligibility criteria</strong> - Contributions that do not have a clear relationship to the scope of the retro round, or do not meet eligibility criteria</li>\n<li><strong>Spam</strong> - Applications containing spam, such as irrelevant answers, plagiarized content, broken or unrelated impact metrics and contribution links. Applications in languages other than English*.\n<ul>\n<li>This will help simplify the process as English is the working language of the majority of Badgeholders. Please ensure you translate any content that’s part of the application.</li>\n</ul>\n</li>\n<li><strong>Duplicate applications</strong> - Multiple applications from the same individual, project or group which apply for the same impact.\n<ul>\n<li>Members of <a href=\"https://www.notion.so/322eb3a24bf149eeb2bd7af5ba22d1b3?pvs=21\">contribution paths</a> (Council Members, Ambassadors, NumbaNERDs, SupNERDs, TechNERDs, Translators) or Councils can’t submit individual applications for their work within the relevant workstream, as each workstream will apply as a project.</li>\n</ul>\n</li>\n</ol>\n<h3><a name=\"p-39448-review-checklist-draft-5\" class=\"anchor\" href=\"https://gov.optimism.io#p-39448-review-checklist-draft-5\"></a>Review Checklist [Draft]</h3>\n<p>Reviewers will be asked to go over this checklist when performing the initial review of an applications. Please note that this is an early draft.</p>\n<ol>\n<li><strong>Spam</strong>: Does the application contain spam, such as irrelevant answers, plagiarized content, broken or unrelated impact metrics and contribution links? Is the application in another language than English?</li>\n<li><strong>Eligibility</strong>: Is this application Eligible, following the eligibility criteria of the round? [Reference <a href=\"https://gov.optimism.io/t/retro-funding-5-op-stack-round-details/8612#p-38855-round-scope-and-eligibility-criteria-3\">category specific criteria checklist</a>] 2.1 Is this application eligible for another category, different to the one they have selected?</li>\n<li><strong>Optimism Grants</strong>: Has the application correctly reported the grants they have received from Optimism (including Token House, Citizens’ House an Foundation grants)?</li>\n<li><strong>Venture Funding</strong>: Has the application correctly reported their venture funding based on public information?</li>\n<li><strong>Pricing</strong>: Has the application correctly reported their current pricing? See by checking the pricing on the projects website.</li>\n<li><strong>Impersonation</strong>: Does the application have a verified Github repo which belongs to the organisation they claim to be? Do any linked artefacts not belong to the project?</li>\n<li><strong>Future promises</strong>: Does this application make promises about work they will do in the future?</li>\n<li><strong>Advertising</strong>: Does this application actively promote a token or NFT sale in their application or on their website?</li>\n</ol>\n            <p><small>1 post - 1 participant</small></p>\n            <p><a href=\"https://gov.optimism.io/t/retro-funding-5-application-review-process/8730\">Read full topic</a></p>","link":"https://gov.optimism.io/t/retro-funding-5-application-review-process/8730","pubDate":"Fri, 16 Aug 2024 13:12:29 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"gov.optimism.io-topic-8730"},"source":{"@url":"https://gov.optimism.io/t/retro-funding-5-application-review-process/8730.rss","#text":"Retro Funding 5: Application Review Process"},"filter":false},{"title":"GovNFT Community Call Thread 2","dc:creator":"Michael","category":"✨ General","description":"<p>Hi GovNFT program participants!</p>\n<p>During the last community call we went into detail about Retro Funding 5: OP Stack and the guest voting experiment that will be implemented during the round, share your insights about the topic in this thread.</p>\n<p>Questions to answer:</p>\n<p>What projects are eligible for Round 5 of retrofunding?<br>\nWhat is the main experiment for Round 5 of retrofunding?</p>\n<p>In case you didn’t attend the call you can watch the recording here.</p>\n<p>As a reminder, thoughtful responses are 20 points. Spam or low-effort posts will not count towards the point total.</p>\n            <p><small>1 post - 1 participant</small></p>\n            <p><a href=\"https://gov.optimism.io/t/govnft-community-call-thread-2/8729\">Read full topic</a></p>","link":"https://gov.optimism.io/t/govnft-community-call-thread-2/8729","pubDate":"Thu, 15 Aug 2024 23:12:23 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"gov.optimism.io-topic-8729"},"source":{"@url":"https://gov.optimism.io/t/govnft-community-call-thread-2/8729.rss","#text":"GovNFT Community Call Thread 2"},"filter":false},{"title":"Security Council Election Town Hall Cohort A","dc:creator":"system","category":"Elected  Representatives 💼","description":"<p>Congratulations to all the approved self-nominees thus far! The following folks have self-nominated for the Security Council Cohort A, and have received the necessary 8 Top 100 delegate approvals to be considered valid to move to a vote before the deadline of August 19th at 19:00 GMT.</p>\n<p><a class=\"mention\" href=\"https://gov.optimism.io/u/jepsen\">@Jepsen</a> (<a href=\"https://gov.optimism.io/t/security-council-nomination-waylon-jepsen/8643\">link to individual self-nomination</a>, country of residence is USA)</p>\n<p><a class=\"mention\" href=\"https://gov.optimism.io/u/ethernaut\">@ethernaut</a> (<a href=\"https://gov.optimism.io/t/security-council-member-self-nomination-cohort-a/8650\">link to individual self-nomination</a>, country of residence is Uruguay)</p>\n<p><a class=\"mention\" href=\"https://gov.optimism.io/u/ryscheng\">@ryscheng</a> (<a href=\"https://gov.optimism.io/t/security-council-member-nomination-raymond-cheng/8658\">link to individual self-nomination</a>, country of residence is USA)</p>\n<p><a class=\"mention\" href=\"https://gov.optimism.io/u/yoseph\">@yoseph</a> (<a href=\"https://gov.optimism.io/t/security-council-member-nomination-yoseph-ayele/8669\">link to individual self-nomination</a>, country of residence is nomadic across Africa / Oceania / Asia)</p>\n<p><a class=\"mention\" href=\"https://gov.optimism.io/u/pablito.eth\">@pablito.eth</a> (<a href=\"https://gov.optimism.io/t/security-council-member-nomination-pablo-sabbatella-pablito-eth/8679\">link to individual self-nomination</a>, country of residence is Argentina)</p>\n<p><a class=\"mention\" href=\"https://gov.optimism.io/u/nanexcool\">@nanexcool</a> (<a href=\"https://gov.optimism.io/t/security-council-member-nomination-mariano-conti/8683\">link to individual self-nomination</a>, country of residence is Argentina)</p>\n<p><a class=\"mention\" href=\"https://gov.optimism.io/u/ml_sudo\">@ml_sudo</a> (<a href=\"https://gov.optimism.io/t/security-council-nomination-ml-sudo/8697\">link to individual self-nomination</a>, country of residence is nomadic across Asia and Mexico)</p>\n<p><a class=\"mention\" href=\"https://gov.optimism.io/u/kent\">@kent</a> (<a href=\"https://gov.optimism.io/t/security-council-member-nomination-kent-fenwick-agora/8696\">link to organizational self-nomination on behalf of Agora</a>, country of residence is Canada)</p>\n<p><a class=\"mention\" href=\"https://gov.optimism.io/u/alisha.eth\">@alisha.eth</a> (<a href=\"https://gov.optimism.io/t/security-council-nomination-alisha-eth/8702\">link to individual self-nomination</a>, country of residence is United Arab Emirates)</p>\n<p><a class=\"mention\" href=\"https://gov.optimism.io/u/emiliano\">@emiliano</a> (<a href=\"https://gov.optimism.io/t/security-council-member-nomination-emiliano-bonassi/8718\">link to individual self-nomination</a>, country of residence is Italy)</p>\n<p><a class=\"mention\" href=\"https://gov.optimism.io/u/troy\">@troy</a> (<a href=\"https://gov.optimism.io/t/security-council-member-nomination-troy/8722\">link to individual self-nomination</a>, country of residence is USA)</p>\n<p><a class=\"mention\" href=\"https://gov.optimism.io/u/sam.ng\">@sam.ng</a> (<a href=\"https://gov.optimism.io/t/security-council-member-nomination-node-guardians/8725\">link to organizational self-nomination on behalf of Node Guardians</a>, country of residence is British Virgin Islands)</p>\n<p><a class=\"mention\" href=\"https://gov.optimism.io/u/eek637\">@eek637</a> (<a href=\"https://gov.optimism.io/t/security-council-nomination-uniswap-foundation/\">link to organizational self-nomination on behalf of Uniswap Foundation</a>, country of residence is USA)</p>\n<h3><a name=\"p-39431-the-security-council-cohort-a-election-town-hall-will-be-hosted-on-tuesday-august-20th-from-2pm-3pm-et-6pm-7pm-gmt-1\" class=\"anchor\" href=\"https://gov.optimism.io#p-39431-the-security-council-cohort-a-election-town-hall-will-be-hosted-on-tuesday-august-20th-from-2pm-3pm-et-6pm-7pm-gmt-1\"></a>The Security Council Cohort A Election Town Hall will be hosted on Tuesday, August 20th from 2pm - 3pm ET / 6pm - 7pm GMT.</h3>\n<p>You can find the invite via the <a href=\"https://calendar.google.com/calendar/u/0/r?cid=Y19mbm10Z3VoNm5vbzZxZ2JuaTJncGVyaWQ0a0Bncm91cC5jYWxlbmRhci5nb29nbGUuY29t\">Public Optimism Governance Calendar</a>.</p>\n<p>The structure of the Town Hall will be each nominee will have 2-minutes each to answer one predefined question from the Foundation:</p>\n<ul>\n<li><em>Please share how delegates can be confident in your individual or organizational alignment with the Optimistic Collective and your ability to execute on the Security Council membership responsibilities.</em></li>\n</ul>\n<p>Self-nominees who aren’t able to attend live may share a 2-minute video answering the question above by replying to the email invitation they received for the call.</p>\n<p>If you’re a delegate, and you’re interested in asking a question to all self-nominees during the Town Hall please comment your question below. If time allows one question at random may be picked from the list of delegate questions in this thread.</p>\n<p>If you have specific questions for specific nominees, you may ask them in each nominee’s independent self-nomination topic, as listed in the <a href=\"https://gov.optimism.io/t/season-6-security-council-nomination-thread-cohort-a\">self-nomination thread</a>, and nominees may answer the questions async.</p>\n<p>As a reminder, the Voting Period for Security Council Cohort A elections will take place from August 22nd - August 28th at <a href=\"http://vote.optimism.io\">vote.optimism.io</a>.</p>\n            <p><small>3 posts - 3 participants</small></p>\n            <p><a href=\"https://gov.optimism.io/t/security-council-election-town-hall-cohort-a/8728\">Read full topic</a></p>","link":"https://gov.optimism.io/t/security-council-election-town-hall-cohort-a/8728","pubDate":"Thu, 15 Aug 2024 19:14:39 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"gov.optimism.io-topic-8728"},"source":{"@url":"https://gov.optimism.io/t/security-council-election-town-hall-cohort-a/8728.rss","#text":"Security Council Election Town Hall Cohort A"},"filter":false},{"title":"A case for the organizational chart","dc:creator":"alexsotodigital","category":"Metagovernance","description":"<p><em>Special thanks to <a class=\"mention\" href=\"https://gov.optimism.io/u/brichis\">@brichis</a> , <a class=\"mention\" href=\"https://gov.optimism.io/u/pumbi\">@Pumbi</a> and the <a class=\"mention-group\" href=\"https://gov.optimism.io/groups/govnerds\">@govNERDs</a> for the feedback and information support. And to the people at the Developer Advisory Board meeting for motivating to continue.</em></p>\n<p><strong>Dear fellow members of the collective,</strong></p>\n<p>As someone curious about organizational structures, I am surprised not to find any organizational chart that shows how the different operational roles are, both in the OP foundation and with the most active contributors of the collective.</p>\n<p>For me, having an organizational chart will work like a ‘you are here’ on those park maps. Knowing who is where and who the people are connected to can be very useful; especially in a 100% virtual organization where you can’t get lost in the hallways. <img src=\"https://emoji.discourse-cdn.com/twitter/blush.png?v=12\" title=\":blush:\" class=\"emoji\" alt=\":blush:\" loading=\"lazy\" width=\"20\" height=\"20\"></p>\n<p>I admit that I am a ‘visual’ person and perhaps my opinion is biased… <img src=\"https://emoji.discourse-cdn.com/twitter/see_no_evil.png?v=12\" title=\":see_no_evil:\" class=\"emoji\" alt=\":see_no_evil:\" loading=\"lazy\" width=\"20\" height=\"20\"><br>\nbut in order to ‘share’ my vision I decided to create a prototype that exemplifies what I imagine. <img src=\"https://emoji.discourse-cdn.com/twitter/sparkler.png?v=12\" title=\":sparkler:\" class=\"emoji\" alt=\":sparkler:\" loading=\"lazy\" width=\"20\" height=\"20\"></p>\n<p><a href=\"https://app.mural.co/t/alexsoto6941/m/alexsoto6941/1723490012295/dd52b073d03daf635e611f21d8f3f2f4fe1d0a70?sender=ud6461ce37fd968e224f71144\" class=\"onebox\" target=\"_blank\" rel=\"noopener nofollow ugc\">https://app.mural.co/t/alexsoto6941/m/alexsoto6941/1723490012295/dd52b073d03daf635e611f21d8f3f2f4fe1d0a70?sender=ud6461ce37fd968e224f71144</a></p>\n<p><strong><a href=\"https://app.mural.co/t/alexsoto6941/m/alexsoto6941/1723490012295/dd52b073d03daf635e611f21d8f3f2f4fe1d0a70?sender=ud6461ce37fd968e224f71144\" rel=\"noopener nofollow ugc\">Internal Communication Structure (Draft)</a></strong></p>\n<p></p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://europe1.discourse-cdn.com/bc41dd/original/2X/0/040be7b9994b8fc219fe7361db4e2e30b3ff235c.jpeg\" data-download-href=\"/uploads/short-url/zNpPqdlyiNeHFFIaLGdjtXHSHy.jpeg?dl=1\" title=\"Captura de pantalla 2024-08-14 a la(s) 13.03.38\" rel=\"noopener nofollow ugc\"><img src=\"https://europe1.discourse-cdn.com/bc41dd/optimized/2X/0/040be7b9994b8fc219fe7361db4e2e30b3ff235c_2_690x353.jpeg\" alt=\"Captura de pantalla 2024-08-14 a la(s) 13.03.38\" data-base62-sha1=\"zNpPqdlyiNeHFFIaLGdjtXHSHy\" width=\"690\" height=\"353\" srcset=\"https://europe1.discourse-cdn.com/bc41dd/optimized/2X/0/040be7b9994b8fc219fe7361db4e2e30b3ff235c_2_690x353.jpeg, https://europe1.discourse-cdn.com/bc41dd/optimized/2X/0/040be7b9994b8fc219fe7361db4e2e30b3ff235c_2_1035x529.jpeg 1.5x, https://europe1.discourse-cdn.com/bc41dd/optimized/2X/0/040be7b9994b8fc219fe7361db4e2e30b3ff235c_2_1380x706.jpeg 2x\" data-dominant-color=\"F5F4F4\"></a></div><p></p>\n<p>This figure is inspired by sociocratic/holacratic structures where each ‘circle’ represents a team of some kind. The idea of ​​creating ‘interconnections’ between circles promotes the idea that more information flow between teams has advantages when it comes to adapting to the changing environment. Which are increasingly recurrent.</p>\n<hr>\n<p><code>How to read this map *(and some suggestions)*:</code></p>\n<ul>\n<li>Each circle belongs to a ‘team’ of some kind (which requires having ‘meetings’ or status reports every so often). <strong>Whether sharing a telegram group or a private discord channel</strong>, the suggestion is to create a ‘flow of information’ where at least two people from each circle participate.</li>\n<li>People who are at the intersection of two circles belong to both teams as full members (and sociocracy encourages decisions to be made by consent).</li>\n<li>The most central circles should avoid making operational decisions to be executed by other circles (<strong>but allow them to define how to operate from their autonomy</strong>), and rather focus on sharing reports and generating alignment between all parties.</li>\n<li>Just because two people are not interconnected by circles doesn’t mean they can’t have direct communication. In fact, it’s amazing that we have the ability to send DMs at the speed of light. <strong>The more information flow, the more agility.</strong></li>\n</ul>\n<p><em>mini-disclosure</em></p>\n<ul>\n<li>In some cases I have put people at random as ‘examples’ of ‘lead’ and ‘representative’ for lack of more information on the matter. I am aware that there are errors and omissions in these lists.<br>\n<em>Anyone who has information to add can contact me as <a class=\"mention\" href=\"https://gov.optimism.io/u/alexsotodigital\">@alexsotodigital</a></em></li>\n</ul>\n<hr>\n<p><code>Some considerations of this approach.</code></p>\n<p><strong>Double Link:</strong></p>\n<p>At each ‘intersection’ there are at least two people, which usually means</p>\n<ul>\n<li>a ‘lead’ person (often established by the mother circle)</li>\n<li>a ‘representative’ chosen by the rest of the circle.</li>\n</ul>\n<p><a href=\"https://www.sociocracyforall.org/double-linking/\" rel=\"noopener nofollow ugc\">Double link is one of the main principles of sociocracy</a>, as it makes sure there is no power-over and ensures flow of information and transparency in all directions. If there was only one person, the group could be in danger of:</p>\n<ul>\n<li>the person missing an important meeting (preventing a decision from being made or creating a communication gap between both circles).</li>\n<li>the intermediary person being able to traffic or omit information to avoid some issue.</li>\n<li>the lead person not having the well-being of the team in their interests and making commitments without it being the opinion of the group.</li>\n</ul>\n<p><strong>Roles, not people:</strong></p>\n<p>Although in this first prototype I write the names of the person (as they have chosen their user within the community) and not the role (such as ‘Code of Conduct Council Member 1/5’), I think it is important to highlight that this organizational chart is mapping ‘roles’ and not ‘people’. That’s because:</p>\n<ul>\n<li>In an organizational chart with people, it is often perceived that the person is immovable and has greater resistance to change; especially in hierarchical organizations where there is ‘a boss’.</li>\n<li>With roles, a person can be represented in several places in the organizational chart simultaneously (as happens here) which promotes greater mobility and accountability.</li>\n</ul>\n<p>In a structure by roles, <em><strong>a person can have several roles and a role can be inhabited by multiple people simultaneously.</strong></em> <img src=\"https://emoji.discourse-cdn.com/twitter/sparkles.png?v=12\" title=\":sparkles:\" class=\"emoji\" alt=\":sparkles:\" loading=\"lazy\" width=\"20\" height=\"20\"></p>\n<hr>\n<p><code>The Ask.</code></p>\n<p>I would like to point out that I created this on a Mural canvas in the absence of better technical skills. However, I think this could serve as a blueprint for some team that knows how to bring this to a 2.0 version. <em>If you can think of any team that might be interested in collaborating with me to do this, please tag them in the comments.</em></p>\n<p></p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://europe1.discourse-cdn.com/bc41dd/original/2X/9/9e51856f99d2a82a4ee1e091ce8cc94da11046db.jpeg\" data-download-href=\"/uploads/short-url/mAy67FyCsX6RSTx6EblmaZ88rq3.jpeg?dl=1\" title=\"image\" rel=\"noopener nofollow ugc\"><img src=\"https://europe1.discourse-cdn.com/bc41dd/optimized/2X/9/9e51856f99d2a82a4ee1e091ce8cc94da11046db_2_690x388.jpeg\" alt=\"image\" data-base62-sha1=\"mAy67FyCsX6RSTx6EblmaZ88rq3\" width=\"690\" height=\"388\" srcset=\"https://europe1.discourse-cdn.com/bc41dd/optimized/2X/9/9e51856f99d2a82a4ee1e091ce8cc94da11046db_2_690x388.jpeg, https://europe1.discourse-cdn.com/bc41dd/original/2X/9/9e51856f99d2a82a4ee1e091ce8cc94da11046db.jpeg 1.5x, https://europe1.discourse-cdn.com/bc41dd/original/2X/9/9e51856f99d2a82a4ee1e091ce8cc94da11046db.jpeg 2x\" data-dominant-color=\"F1DFD5\"></a></div><p></p>\n<p><strong>Some features I imagine:</strong></p>\n<ul>\n<li>Being able to select the name of the role and when clicking on it, go to see the person or people who occupy it. There could be a link to the forum, as well as other contact information.</li>\n<li>Having some way of ‘updating’ automatically (at a graphical level) once it is written in an internal database. This way, several people could have editing permissions and it would save time.</li>\n<li>Set the ‘time period’ for which the participation agreement will be maintained and trigger a notification alarm to let us know it’s time to update or make a change.</li>\n<li>Being supported on a website that is own by the collective.</li>\n</ul>\n<hr>\n<p><code>Commitment</code> <img src=\"https://emoji.discourse-cdn.com/twitter/pray.png?v=12\" title=\":pray:\" class=\"emoji\" alt=\":pray:\" loading=\"lazy\" width=\"20\" height=\"20\"></p>\n<p>Until we find a more automatic solution, I am committed to keeping this version as up to date as possible.<br>\nIf there are any changes you would like to request, you can find me as <a class=\"mention\" href=\"https://gov.optimism.io/u/alexsotodigital\">@alexsotodigital</a> or write to me at <a href=\"mailto:alex.soto.digital@gmail.com\">alex.soto.digital@gmail.com</a></p>\n<p>What do you think?<br>\nDo you think this would be useful?</p>\n<p>Is it worth building?</p>\n<p><a href=\"https://gov.optimism.io/t/a-case-for-the-organizational-chart/8727/1\">Click to view the poll.</a></p>\n            <p><small>5 posts - 3 participants</small></p>\n            <p><a href=\"https://gov.optimism.io/t/a-case-for-the-organizational-chart/8727\">Read full topic</a></p>","link":"https://gov.optimism.io/t/a-case-for-the-organizational-chart/8727","pubDate":"Wed, 14 Aug 2024 20:11:09 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"gov.optimism.io-topic-8727"},"source":{"@url":"https://gov.optimism.io/t/a-case-for-the-organizational-chart/8727.rss","#text":"A case for the organizational chart"},"filter":false},{"title":"Security Council Nomination - Uniswap Foundation","dc:creator":"eek637","category":"Elected  Representatives 💼","description":"<h3><a name=\"p-39381-security-council-member-self-nomination-template-1\" class=\"anchor\" href=\"https://gov.optimism.io#p-39381-security-council-member-self-nomination-template-1\"></a>Security Council Member <strong>Self-Nomination Template</strong></h3>\n<p><em>Please keep your answers as concise as possible while conveying all relevant information.</em></p>\n<p><em>All nominations will require 8 Top 100 delegate approvals.</em></p>\n<p><strong>Please indicate if you are running to be the Council Lead or a Council Member:</strong> Council Member</p>\n<p><strong>Does this nomination represent an individual or organization:</strong> Organization ****</p>\n<p><strong>Candidate country of residence (or, if an entity, incorporation and principle place of business):</strong> USA</p>\n<p><strong>Have you previously served on Optimism’s Security Council:</strong> No</p>\n<p><strong>Have you previously served on any other Council or Board in the Collective:</strong> No</p>\n<p><strong>Are you a representative of OP Labs:</strong> No</p>\n<p><strong>Are you a representative of another OP Chain:</strong> No</p>\n<p><strong>If you are a delegate, please provide the link to your delegate profile:</strong> N/A</p>\n<p><strong>If you are a member of the Citizens’ House, please link to your most recent attestation here:</strong> No</p>\n<p><strong>Please outline your contributions, and their impact, to the Optimism ecosystem to date:</strong></p>\n<ul>\n<li>Uniswap was one of the first ever DeFi apps deployed to Optimism, more than 3 years ago in July 202. Before that, <a href=\"https://blog.uniswap.org/uniswap-optimism-alpha\" rel=\"noopener nofollow ugc\">Unipig</a> was one of the earliest proof of concepts in Ethereum application scaling.</li>\n<li>Uniswap is one of the most used applications across all Superchain L2s (<a href=\"https://dune.com/oplabspbc/op-stack-chains-l1-activity\" rel=\"noopener nofollow ugc\">here</a>) as well as the most popular DEX on Optimism with 60%+ market share (here).</li>\n<li>In addition to the scale and positive impact of Uniswap stemming from our deployment on multiple Superchain L2s, the Uniswap Foundation (”UF”), along with many Uniswap community members, have made additional positive contributions to the community, including:</li>\n</ul>\n<ol>\n<li>With the OP Grant to Uniswap early 2023, the UF alongside Uniswap community members were able to successfully deploy 3 Liquidity Mining campaigns for relatively sticky liquidity on major OP pools working with delegates from both the Optimism and Uniswap governance communities.</li>\n<li>The work done by Uniswap community members, Uniswap Labs, and Across on <a href=\"https://ethereum-magicians.org/t/erc-7683-cross-chain-intents-standard/19619\" rel=\"noopener nofollow ugc\">ERC-7683</a> focuses on establishing standards for crosschain intent fulfillment, which greatly reduces the interop friction for any dapp users needing users to bridge assets or fill transactions across chains.</li>\n<li>The UF recently co-sponsored a proposal with Whetstone Research to introduce new fee tiers on Base in order to provide more competitive pricing to swappers (<a href=\"https://gov.uniswap.org/t/rfc-proposal-to-active-2-3-4-bps-fee-tiers-on-base/24346\" rel=\"noopener nofollow ugc\">here</a>). If successful, the insights gathered will be informative and we may expand these fee tiers to other Superchain L2s.</li>\n</ol>\n<p><strong>Please demonstrate any non-Optimism experience you believe is relevant to this role:</strong></p>\n<p>Our team has helped to grow the Uniswap governance community over the past two years, building strong working relationships with a large number of delegates from a wide range of organizations, recently hosting 40 delegates at a governance-specific workshop called Govswap the day before EthCC in Brussels. Working with these members of the community, we have seen the UF’s participation as a major stakeholder in Uniswap governance proposals (delegating votes to post a proposal or posting it ourselves) drop from ~60% in 2023 to ~25% so far in 2024.  We have an acute appreciation for the human and technical intricacies of various governance processes, and will act as good stewards in this role’s “oracle” responsibilities.</p>\n<p>Elsewhere, we have recently taken a more active role in developing and auditing smart contracts for use by the Uniswap ecosystem, including Uniswap v4, where a team member is a leading contributor to the <a href=\"https://github.com/Uniswap/v4-periphery/graphs/contributors\" rel=\"noopener nofollow ugc\">periphery repo</a> and is intimately involved in the audit process, and Unistaker, where we managed mechanism design, contract development, and the security audit process.</p>\n<p><strong>Please elaborate on your technical background, including your github handle (this will be used to calculate your github expertise score and will be added to your nomination before it goes to a vote by the Foundation):</strong></p>\n<p><a href=\"https://github.com/narangchirag\" rel=\"noopener nofollow ugc\">Chirag Narang</a> was most recently VP of Product at Dapper Labs, where he was responsible for Flow’s strategic direction and execution across core protocol, smart contract language, and developer experience, managing a team of 50 Engineers and 6 PMs.</p>\n<p><a href=\"https://github.com/erin-koen\" rel=\"noopener nofollow ugc\">Erin Koen</a> spent two years (2020-2022) as a full-stack engineer at Avantgarde Finance, working on the Enzyme asset management app and its supporting infrastructure. He subsequently helped to start Avantgarde’s asset management business, managing the development of custom smart contracts to enable jurisdictionally compliant flows of funds into onchain investment vehicles.</p>\n<p>The UF’s Github can be found <a href=\"https://github.com/uniswapfoundation\" rel=\"noopener nofollow ugc\">here</a>.</p>\n<p><strong>Please elaborate on your experience with relevant member (or Lead) requirements:</strong></p>\n<p>As described <a href=\"https://gov.optimism.io/t/season-6-security-council-elections-cohort-a/8587#member-responsibilities-2\">here</a>, the primary requirements of a member of the Optimism Security Council are to be available and communicate well under pressure, thoughtfully execute protocol upgrades and other proposals approved by Optimism Governance, and the manage private keys securely.</p>\n<p>The UF is well-suited to satisfy these requirements. We regularly coordinate between members of not only the Uniswap Protocol ecosystem but also across other DeFi and chain ecosystems. We have also helped to manage the execution and implementation of technical projects including smart contract and app development, security audits, and governance votes. We maintain close working relationships with stakeholders of all stripes and pride ourselves on being thorough and responsive.</p>\n<p>Further, we have managed the creation and execution of numerous onchain votes for the Uniswap Protocol since our founding two years ago and stay informed regarding those votes in which we are not principal participants. This experience can easily translate into prompt, safe execution of Optimism Governance-approved actions.</p>\n<p>Finally, our team manages onchain accounts to administer our UNI treasury as well as a portion of our grants budget. The signers on those accounts have developed and maintained protocols for transaction hygiene as well as key management.</p>\n<p><strong>Please describe your philosophy on what makes a good Security Council member:</strong></p>\n<p>Coming from the Uniswap ecosystem, we understand that security is paramount to the longterm success of protocols. Often times security only becomes a focus after a crisis, but we believe that best practices for proactive security is how we maintain operational excellence as Council members. This is manifested in Uniswap through consistent audits and reviews to help establish frameworks for best understanding risks as we did with the <a href=\"https://www.notion.so/Bridge-Assessment-Report-0c8477afadce425abac9c0bd175ca382?pvs=21\" rel=\"noopener nofollow ugc\">Crosschain Bridge Assessment report</a>.</p>\n<p>While we can do everything to protect against security risks, unfortunately we must also plan for worst case scenarios. This involves war rooming at any hour, constant and transparent communications, as well as the technical competency to participate in recovery. Although we have been fortunate as a protocol, it comes with hard work behind the scenes and working with trusted partners across the ecosystem. Our philosophy here is to maintain this level of operational and technical excellence, while continuing to uphold the highest standards of communication and integrity.</p>\n<p><strong>Please disclose any anticipated conflicts of interest:</strong><br>\nn/a</p>\n<p><strong>Please verify that you understand you may be removed from this role via the Representative Removal proposal type in the Operating Manual:</strong> Confirmed</p>\n<p><strong>Please verify that you understand that election is subject to successful completion of a Foundation screen which</strong> <strong>may include KYC/AML, sanctions screening, and a requirement to sign a standard contract:</strong> Yes.</p>\n<p><strong>Please verify that you are able to commit ~5 active hours / month to fulfill the Member Responsibilities. Please note that there is an “on-call” aspect to this role that is not fully encompassed in the active hours estimate:</strong> Yes</p>\n            <p><small>11 posts - 11 participants</small></p>\n            <p><a href=\"https://gov.optimism.io/t/security-council-nomination-uniswap-foundation/8726\">Read full topic</a></p>","link":"https://gov.optimism.io/t/security-council-nomination-uniswap-foundation/8726","pubDate":"Wed, 14 Aug 2024 18:52:56 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"gov.optimism.io-topic-8726"},"source":{"@url":"https://gov.optimism.io/t/security-council-nomination-uniswap-foundation/8726.rss","#text":"Security Council Nomination - Uniswap Foundation"},"filter":false},{"title":"Security Council Member Nomination: Node Guardians","dc:creator":"sam.ng","category":"Elected  Representatives 💼","description":"<p><strong>Please indicate if you are running to be the Council Lead or a Council Member:</strong> Council Member</p>\n<p><strong>Does this nomination represent an individual or organization:</strong> Organization (sam here representing Node Guardians)</p>\n<p><strong>Candidate country of residence (or, if an entity, incorporation and principal place of business):</strong> British Virgin Islands</p>\n<p><strong>Have you previously served on Optimism’s Security Council:</strong> No</p>\n<p><strong>Have you previously served on any other Council or Board in the Collective:</strong> No</p>\n<p><strong>Are you a representative of OP Labs:</strong> No</p>\n<p><strong>Are you a representative of another OP Chain:</strong> No</p>\n<p><strong>If you are a delegate, please provide the link to your delegate profile:</strong> Not Applicable</p>\n<p><strong>If you are a member of the Citizens’ House, please link to your most recent attestation here:</strong> Not Applicable</p>\n<p><strong>Please outline your contributions, and their impact, to the Optimism ecosystem to date:</strong></p>\n<ul>\n<li>\n<p>Launched a programming challenge to highlight the work and progress made by OP Labs on the fraud-proof mechanism.<br>\n<a href=\"https://nodeguardians.io/quests/interactive-fraud-proofs?f=2%3D4\" class=\"inline-onebox\" rel=\"noopener nofollow ugc\">Interactive Fraud Proofs - Learn Solidity - CTF - Node Guardians: Level up your programming skills</a><br>\n<a href=\"https://x.com/nodeguardians/status/1696586775651668292\" class=\"inline-onebox\" rel=\"noopener nofollow ugc\">x.com</a></p>\n</li>\n<li>\n<p>Organized a series of programming challenges focused on the OP Stack, aimed at onboarding developers and familiarizing them with launching their own OP Stack chain.<br>\n<a href=\"https://nodeguardians.io/campaigns/playing-op-stack\" class=\"inline-onebox\" rel=\"noopener nofollow ugc\">Playing with OP Stack - Learn Solidity - Node Guardians: Level up your programming skills</a><br>\n<a href=\"https://x.com/nodeguardians/status/1803835999941754953\" class=\"inline-onebox\" rel=\"noopener nofollow ugc\">x.com</a></p>\n</li>\n<li>\n<p>Hosted the community-driven event “Optimistic Gathering” to bring together fellow optimists and provide updates on ongoing developments within the Collective.<br>\n<a href=\"https://x.com/opgathering/status/1814336529457938861\" class=\"inline-onebox\" rel=\"noopener nofollow ugc\">x.com</a><br>\n<a href=\"https://www.youtube.com/@opgathering/videos\" rel=\"noopener nofollow ugc\">https://www.youtube.com/@opgathering/videos</a></p>\n</li>\n</ul>\n<p><strong>Please demonstrate any non-Optimism experience you believe is relevant to this role:</strong> We have served on the Security Council of <a href=\"https://x.com/kroma_network\" rel=\"noopener nofollow ugc\">Kroma</a> for almost a year, which has provided us with valuable experience as part of our journey in governance and security council roles.</p>\n<p><strong>Please elaborate on your technical background, including your GitHub handle (this will be used to calculate your GitHub expertise score and will be added to your nomination before it goes to a vote by the Foundation):</strong></p>\n<p><a href=\"https://nodeguardians.io/quests\" rel=\"noopener nofollow ugc\">Node Guardians</a> has been live for over 2 years and our team consists of a core engineering group responsible for creating intermediate to complex programming challenges across various Ethereum ecosystem stack components. Additionally, we have a DevOps team with experience in key management as we serve as validators across <a href=\"https://infra.nodeguardians.io/\" rel=\"noopener nofollow ugc\">multiple networks</a>.</p><aside class=\"onebox allowlistedgeneric\" data-onebox-src=\"https://github.com/Nodeguardians\">\n  <header class=\"source\">\n      <img src=\"https://github.githubassets.com/favicons/favicon.svg\" class=\"site-icon\" width=\"32\" height=\"32\">\n\n      <a href=\"https://github.com/Nodeguardians\" target=\"_blank\" rel=\"noopener nofollow ugc\">GitHub</a>\n  </header>\n\n  <article class=\"onebox-body\">\n    <img width=\"280\" height=\"280\" src=\"https://europe1.discourse-cdn.com/bc41dd/original/2X/2/2a869e983e8fb86cf0064ce66e1ded54945e4b16.png\" class=\"thumbnail onebox-avatar\" data-dominant-color=\"202020\">\n\n<h3><a href=\"https://github.com/Nodeguardians\" target=\"_blank\" rel=\"noopener nofollow ugc\">Node Guardians</a></h3>\n\n  <p>Node Guardians has 28 repositories available. Follow their code on GitHub.</p>\n\n\n  </article>\n\n  <div class=\"onebox-metadata\">\n    \n    \n  </div>\n\n  <div style=\"clear: both\"></div>\n</aside>\n\n<p><strong>Please elaborate on your experience with relevant member (or Lead) requirements:</strong></p>\n<ul>\n<li>Serving on the Security Council of <a href=\"https://x.com/kroma_network\" rel=\"noopener nofollow ugc\">Kroma</a>, maintaining vigilant oversight of the validator network by promptly addressing and reporting any performance or security anomalies. Actively engaging in deliberations and decision-making processes related to L1 and L2 contract modifications.</li>\n<li>Operating as <a href=\"https://infra.nodeguardians.io/\" rel=\"noopener nofollow ugc\">validators</a> across various networks, emphasizing careful key management.</li>\n<li>Managing multisig operations on <a href=\"https://x.com/deBridgeFinance\" rel=\"noopener nofollow ugc\">Debridge</a>, <a href=\"https://research.lido.fi/t/staking-router-module-proposal-simple-dvt/5625\" rel=\"noopener nofollow ugc\">Lido x Obol, and Lido x SSV.</a></li>\n<li>Participating in governance within the Cosmos ecosystem.</li>\n</ul>\n<p><strong>Please describe your philosophy on what makes a good Security Council member:</strong></p>\n<p>A good Security Council member should have a strong attention to detail and a clear routine for monitoring and verification. The principle of “don’t trust, verify” has never been more real when you are a security council member.</p>\n<p><strong>Please disclose any anticipated conflicts of interest:</strong> None</p>\n<p><strong>Please verify that you understand you may be removed from this role via the Representative Removal proposal type in the <a href=\"https://github.com/ethereum-optimism/OPerating-manual/blob/main/manual.md\" rel=\"noopener nofollow ugc\">Operating Manual</a>:</strong> I understand</p>\n<p><strong>Please verify that you understand that election is subject to successful completion of a Foundation screen which may include KYC/AML, sanctions screening, and a requirement to sign a standard contract:</strong> Yes</p>\n<p><strong>Please verify that you are able to commit approximately 5 active hours per month to fulfill the Member Responsibilities. Please note that there is an “on-call” aspect to this role that is not fully encompassed in the active hours estimate:</strong> Yes</p>\n            <p><small>9 posts - 9 participants</small></p>\n            <p><a href=\"https://gov.optimism.io/t/security-council-member-nomination-node-guardians/8725\">Read full topic</a></p>","link":"https://gov.optimism.io/t/security-council-member-nomination-node-guardians/8725","pubDate":"Wed, 14 Aug 2024 17:50:08 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"gov.optimism.io-topic-8725"},"source":{"@url":"https://gov.optimism.io/t/security-council-member-nomination-node-guardians/8725.rss","#text":"Security Council Member Nomination: Node Guardians"},"filter":false},{"title":"Security Council member nomination: Shinya Mori","dc:creator":"Shinya_Mori","category":"Elected  Representatives 💼","description":"<p><strong>Please indicate if you are running to be the Council Lead or a Council Member:</strong><br>\nCouncil Member</p>\n<p><strong>Does this nomination represent an individual or organization:</strong><br>\nIndividual</p>\n<p><strong>Candidate country of residence (or, if an entity, incorporation and principle place of business):</strong><br>\nJapan</p>\n<p><strong>Have you previously served on Optimism’s Security Council:</strong><br>\nNo</p>\n<p><strong>Have you previously served on any other Council or Board in the Collective:</strong><br>\nYes. I have contributed to Polygon Community Grants Program as a reviewer.</p>\n<p><strong>Are you a representative of OP Labs:</strong><br>\nNo</p>\n<p><strong>Are you a representative of another OP Chain:</strong><br>\nNo</p>\n<p><strong>If you are a delegate, please provide the link to your delegate profile:</strong><br>\nI’m not a delegate.</p>\n<p><strong>If you are a member of the Citizens’ House, please link to your most recent attestation here:</strong><br>\nI’m not a member of the Citizens’ House.</p>\n<p><strong>Please outline your contributions, and their impact, to the Optimism ecosystem to date:</strong><br>\nI have significantly contributed to the Optimism ecosystem through my research on crypto grants programs, focusing on optimizing public goods funding mechanisms and achieving impact evaluation for grantees. My work provides a cross-comparative analysis of grant programs, including Optimism, and offers insights for improving decision-making and resource distribution within the ecosystem.</p>\n<aside class=\"onebox allowlistedgeneric\" data-onebox-src=\"https://research.fracton.ventures/reports/a-retrospective-quantitative-review-of-crypto-grants-programs/\">\n  <header class=\"source\">\n      <img src=\"https://europe1.discourse-cdn.com/bc41dd/original/2X/b/b32993f3f33eab503a3bf1464ea6ab557471f3fb.png\" class=\"site-icon\" data-dominant-color=\"222223\" width=\"48\" height=\"48\">\n\n      <a href=\"https://research.fracton.ventures/reports/a-retrospective-quantitative-review-of-crypto-grants-programs/\" target=\"_blank\" rel=\"noopener nofollow ugc\">research.fracton.ventures</a>\n  </header>\n\n  <article class=\"onebox-body\">\n    <div class=\"aspect-image\" style=\"--aspect-ratio:690/362;\"><img src=\"https://europe1.discourse-cdn.com/bc41dd/original/2X/5/538cd664d8bab763d26ce39c87bc6a7fde38716a.png\" class=\"thumbnail\" data-dominant-color=\"021102\" width=\"690\" height=\"362\"></div>\n\n<h3><a href=\"https://research.fracton.ventures/reports/a-retrospective-quantitative-review-of-crypto-grants-programs/\" target=\"_blank\" rel=\"noopener nofollow ugc\">A Retrospective Quantitative Review of Crypto Grants Programs | Fracton...</a></h3>\n\n  <p>Fracton Ventures Research is an R&amp;D institution for a positive sum world through exploring inclusive coordination design.</p>\n\n\n  </article>\n\n  <div class=\"onebox-metadata\">\n    \n    \n  </div>\n\n  <div style=\"clear: both\"></div>\n</aside>\n\n<p></p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://europe1.discourse-cdn.com/bc41dd/original/2X/1/1064d15a941fc1327ee073fc9dad86273057d685.png\" data-download-href=\"/uploads/short-url/2l1DID41W11PwossaRRywcOSbml.png?dl=1\" title=\"image3\" rel=\"noopener nofollow ugc\"><img src=\"https://europe1.discourse-cdn.com/bc41dd/optimized/2X/1/1064d15a941fc1327ee073fc9dad86273057d685_2_690x388.png\" alt=\"image3\" data-base62-sha1=\"2l1DID41W11PwossaRRywcOSbml\" width=\"690\" height=\"388\" srcset=\"https://europe1.discourse-cdn.com/bc41dd/optimized/2X/1/1064d15a941fc1327ee073fc9dad86273057d685_2_690x388.png, https://europe1.discourse-cdn.com/bc41dd/original/2X/1/1064d15a941fc1327ee073fc9dad86273057d685.png 1.5x, https://europe1.discourse-cdn.com/bc41dd/original/2X/1/1064d15a941fc1327ee073fc9dad86273057d685.png 2x\" data-dominant-color=\"042304\"></a></div><br>\n<div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://europe1.discourse-cdn.com/bc41dd/original/2X/f/f94da56d63249b9c73275aaedc226bbd2ad61c45.png\" data-download-href=\"/uploads/short-url/zzrfh0dvwN8sSL2abdIHCL4vTVP.png?dl=1\" title=\"image16\" rel=\"noopener nofollow ugc\"><img src=\"https://europe1.discourse-cdn.com/bc41dd/optimized/2X/f/f94da56d63249b9c73275aaedc226bbd2ad61c45_2_690x388.png\" alt=\"image16\" data-base62-sha1=\"zzrfh0dvwN8sSL2abdIHCL4vTVP\" width=\"690\" height=\"388\" srcset=\"https://europe1.discourse-cdn.com/bc41dd/optimized/2X/f/f94da56d63249b9c73275aaedc226bbd2ad61c45_2_690x388.png, https://europe1.discourse-cdn.com/bc41dd/original/2X/f/f94da56d63249b9c73275aaedc226bbd2ad61c45.png 1.5x, https://europe1.discourse-cdn.com/bc41dd/original/2X/f/f94da56d63249b9c73275aaedc226bbd2ad61c45.png 2x\" data-dominant-color=\"050E05\"></a></div><br>\n<div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://europe1.discourse-cdn.com/bc41dd/original/2X/7/71c52116ea4a0ebb3cee0b6e0f68b65008177b82.png\" data-download-href=\"/uploads/short-url/gesiHw8n9fyGbFayqdfAAJzaoAG.png?dl=1\" title=\"image12\" rel=\"noopener nofollow ugc\"><img src=\"https://europe1.discourse-cdn.com/bc41dd/optimized/2X/7/71c52116ea4a0ebb3cee0b6e0f68b65008177b82_2_690x388.png\" alt=\"image12\" data-base62-sha1=\"gesiHw8n9fyGbFayqdfAAJzaoAG\" width=\"690\" height=\"388\" srcset=\"https://europe1.discourse-cdn.com/bc41dd/optimized/2X/7/71c52116ea4a0ebb3cee0b6e0f68b65008177b82_2_690x388.png, https://europe1.discourse-cdn.com/bc41dd/original/2X/7/71c52116ea4a0ebb3cee0b6e0f68b65008177b82.png 1.5x, https://europe1.discourse-cdn.com/bc41dd/original/2X/7/71c52116ea4a0ebb3cee0b6e0f68b65008177b82.png 2x\" data-dominant-color=\"270906\"></a></div><br>\n<div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://europe1.discourse-cdn.com/bc41dd/original/2X/c/cfa922761854648c5995f4e93922b8087141babc.png\" data-download-href=\"/uploads/short-url/tD3cKpMr62E6ZrtRCKLNvowZpRG.png?dl=1\" title=\"image8\" rel=\"noopener nofollow ugc\"><img src=\"https://europe1.discourse-cdn.com/bc41dd/optimized/2X/c/cfa922761854648c5995f4e93922b8087141babc_2_690x388.png\" alt=\"image8\" data-base62-sha1=\"tD3cKpMr62E6ZrtRCKLNvowZpRG\" width=\"690\" height=\"388\" srcset=\"https://europe1.discourse-cdn.com/bc41dd/optimized/2X/c/cfa922761854648c5995f4e93922b8087141babc_2_690x388.png, https://europe1.discourse-cdn.com/bc41dd/original/2X/c/cfa922761854648c5995f4e93922b8087141babc.png 1.5x, https://europe1.discourse-cdn.com/bc41dd/original/2X/c/cfa922761854648c5995f4e93922b8087141babc.png 2x\" data-dominant-color=\"1C1B0F\"></a></div><p></p>\n<p><strong>Please demonstrate any non-Optimism experience you believe is relevant to this role:</strong><br>\nThrough my involvement in various community-based projects, I have gained extensive experience in managing shared assets, particularly in terms of security. Additionally, I contribute to Dig DAO, a community that spun off from Japan Digital Agency, and I am well-versed in governance managed by multiple members, as I have been experimenting with the implementation of onchain governance at Dig DAO.</p>\n<p><strong>Please elaborate on your technical background, including your github handle (this will be used to calculate your github expertise score and will be added to your nomination before it goes to a vote by the Foundation):</strong><br>\nNon-technical. But I have worked with members who are building products and tools.</p>\n<p><strong>Please elaborate on your experience with relevant member (or Lead) requirements:</strong><br>\nMy background can be divided into two main areas: supporting Japan’s crypto ecosystem and conducting research and development in the public goods space.</p>\n<p>In 2022, I contributed to the operation of an incubation program aimed at nurturing Crypto Builders in Japan. This three-month program invited various accomplished developers and founders to work towards the growth of Japan’s ecosystem. In 2023, I co-hosted DAO TOKYO, an international DAO event, bringing together DAO contributors from around the world to Tokyo, further contributing to the growth of Japan’s DAO ecosystem.</p>\n<p>Since then, and continuing to the present, I have focused on research and development in the public goods space, presenting my findings internationally at conferences such as Funding the Commons Berlin/Taipei and Ethcon Korea. Notably, the grants report I published aims to achieve more effective public goods funding and has contributed to the public goods space. This research has led to my involvement in reviewing project applications for the Polygon Community Grants Program, creating grants reports for the Grant Innovation Lab, and participating in projects with the Cartographer Syndicate aimed at promoting transparency for grantees.</p>\n<p>Additionally, I remain actively engaged in activities within Japan. I have been involved in the development of <span class=\"chcklst-box fa fa-square-o fa-fw\"></span> (Yohaku), a project aimed at addressing local issues in Japan, and in the development of a Japanese Yen-based QF platform through Dig DAO, a community that spun off from Japan Digital Agency.</p>\n<aside class=\"onebox allowlistedgeneric\" data-onebox-src=\"https://research.fracton.ventures/projects/yohaku/\">\n  <header class=\"source\">\n      <img src=\"https://europe1.discourse-cdn.com/bc41dd/original/2X/b/b32993f3f33eab503a3bf1464ea6ab557471f3fb.png\" class=\"site-icon\" data-dominant-color=\"222223\" width=\"48\" height=\"48\">\n\n      <a href=\"https://research.fracton.ventures/projects/yohaku/\" target=\"_blank\" rel=\"noopener nofollow ugc\">research.fracton.ventures</a>\n  </header>\n\n  <article class=\"onebox-body\">\n    <div class=\"aspect-image\" style=\"--aspect-ratio:690/362;\"><img src=\"https://europe1.discourse-cdn.com/bc41dd/optimized/2X/b/b1bec63247ce550b35c80c86c2c8e113621ad80e_2_690x362.png\" class=\"thumbnail\" data-dominant-color=\"0E0E0E\" width=\"690\" height=\"362\"></div>\n\n<h3><a href=\"https://research.fracton.ventures/projects/yohaku/\" target=\"_blank\" rel=\"noopener nofollow ugc\">[ ]Yohaku | Fracton Research Portal</a></h3>\n\n  <p>Fracton Ventures Research is an R&amp;D institution for a positive sum world through exploring inclusive coordination design.</p>\n\n\n  </article>\n\n  <div class=\"onebox-metadata\">\n    \n    \n  </div>\n\n  <div style=\"clear: both\"></div>\n</aside>\n<aside class=\"onebox allowlistedgeneric\" data-onebox-src=\"https://research.fracton.ventures/projects/digdao/\">\n  <header class=\"source\">\n      <img src=\"https://europe1.discourse-cdn.com/bc41dd/original/2X/b/b32993f3f33eab503a3bf1464ea6ab557471f3fb.png\" class=\"site-icon\" data-dominant-color=\"222223\" width=\"48\" height=\"48\">\n\n      <a href=\"https://research.fracton.ventures/projects/digdao/\" target=\"_blank\" rel=\"noopener nofollow ugc\">research.fracton.ventures</a>\n  </header>\n\n  <article class=\"onebox-body\">\n    <div class=\"aspect-image\" style=\"--aspect-ratio:690/362;\"><img src=\"https://europe1.discourse-cdn.com/bc41dd/optimized/2X/b/b1bec63247ce550b35c80c86c2c8e113621ad80e_2_690x362.png\" class=\"thumbnail\" data-dominant-color=\"0E0E0E\" width=\"690\" height=\"362\"></div>\n\n<h3><a href=\"https://research.fracton.ventures/projects/digdao/\" target=\"_blank\" rel=\"noopener nofollow ugc\">Contribution to DigDAO | Fracton Research Portal</a></h3>\n\n  <p>Fracton Ventures Research is an R&amp;D institution for a positive sum world through exploring inclusive coordination design.</p>\n\n\n  </article>\n\n  <div class=\"onebox-metadata\">\n    \n    \n  </div>\n\n  <div style=\"clear: both\"></div>\n</aside>\n\n<p>Last month, I co-hosted and contributed as a speaker at Funding the Commons Tokyo. I am committed to contributing to both the international and local public goods spaces</p>\n<p><strong>Please describe your philosophy on what makes a good Security Council member:</strong><br>\nAs a Good Security Council member, I believe the following points are important:</p>\n<ol>\n<li><strong>Neutrality and Fairness</strong><br>\nThe protocol must remain neutral and fair. The neutrality of the protocol should not be compromised by dependence on Security Council members. To ensure that the protocol remains a true public good, the Security Council must protect this principle.</li>\n<li><strong>Swift Response and Effective Communication</strong><br>\nIn situations requiring urgent action, a swift response is essential. Therefore, it is important to maintain proper communication among Security Council members on a regular basis, fostering relationships that enable rapid response in emergencies. Additionally, having Security Council members geographically distributed across different time zones enhances the ability to respond quickly, contributing to the maintenance of the protocol’s security.</li>\n</ol>\n<p><strong>Please disclose any anticipated conflicts of interest:</strong><br>\nNo existing conflicts of interested.</p>\n<p><strong>Please verify that you understand you may be removed from this role via the Representative Removal proposal type in the <a href=\"https://github.com/ethereum-optimism/OPerating-manual/blob/main/manual.md\" rel=\"noopener nofollow ugc\">Operating Manual</a>:</strong><br>\nI verify.</p>\n<p><strong>Please verify that you understand that election is subject to successful completion of a Foundation screen which</strong> <strong>may include KYC/AML, sanctions screening, and a requirement to sign a standard contract:</strong> [No/Yes]<br>\nYes</p>\n<p><strong>Please verify that you are able to commit ~5 active hours / month to fulfill the Member Responsibilities. Please note that there is an “on-call” aspect to this role that is not fully encompassed in the active hours estimate:</strong> [No/Yes]<br>\nYes</p>\n            <p><small>4 posts - 3 participants</small></p>\n            <p><a href=\"https://gov.optimism.io/t/security-council-member-nomination-shinya-mori/8723\">Read full topic</a></p>","link":"https://gov.optimism.io/t/security-council-member-nomination-shinya-mori/8723","pubDate":"Wed, 14 Aug 2024 17:28:00 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"gov.optimism.io-topic-8723"},"source":{"@url":"https://gov.optimism.io/t/security-council-member-nomination-shinya-mori/8723.rss","#text":"Security Council member nomination: Shinya Mori"},"filter":false},{"title":"Security Council Member Nomination: Troy","dc:creator":"troy","category":"Elected  Representatives 💼","description":"<h1><a name=\"p-39356-season-6-security-council-nomination-template-cohort-a-1\" class=\"anchor\" href=\"https://gov.optimism.io#p-39356-season-6-security-council-nomination-template-cohort-a-1\"></a>Season 6 Security Council Nomination Template - Cohort A</h1>\n<h2><a name=\"p-39356-please-paste-your-completed-nomination-herehttpsgovoptimismiotseason-6-security-council-cohort-a-nomination-thread8588-following-the-instructions-at-the-top-2\" class=\"anchor\" href=\"https://gov.optimism.io#p-39356-please-paste-your-completed-nomination-herehttpsgovoptimismiotseason-6-security-council-cohort-a-nomination-thread8588-following-the-instructions-at-the-top-2\"></a>Please paste your completed nomination <a href=\"https://gov.optimism.io/t/season-6-security-council-cohort-a-nomination-thread/8588\">here</a>, following the instructions at the top.</h2>\n<h3><a name=\"p-39356-security-council-member-self-nomination-template-3\" class=\"anchor\" href=\"https://gov.optimism.io#p-39356-security-council-member-self-nomination-template-3\"></a>Security Council Member Self-Nomination Template</h3>\n<p>Please keep your answers as concise as possible while conveying all relevant information.<br>\nAll nominations will require 8 Top 100 delegate approvals.</p>\n<p>Please indicate if you are running to be the Council Lead or a Council Member: Council Member</p>\n<p>Does this nomination represent an individual or organization: Individual</p>\n<p>Candidate country of residence (or, if an entity, incorporation and principle place of business): USA</p>\n<p>Have you previously served on Optimism’s Security Council: No</p>\n<p>Have you previously served on any other Council or Board in the Collective: No</p>\n<p>Are you a representative of OP Labs: No</p>\n<p>Are you a representative of another OP Chain: No</p>\n<p>If you are a delegate, please provide the link to your delegate profile: N/A</p>\n<p>If you are a member of the Citizens’ House, please link to your most recent attestation here: N/A</p>\n<p>Please outline your contributions, and their impact, to the Optimism ecosystem to date:</p>\n<p>I am a Core Contributor on the Synthetix team focused on building data infrastructure, deploying and configuring smart contracts, and providing support for integrators. Synthetix has deployments on both OP Mainnet and Base which drive significant activity on both chains. Prior to Synthetix I was also a core contributor at Kwenta. Kwenta is a derivatives trading platform active on both OP Mainnet and Base. I have also acted as an active governance participant in both DAOs.</p>\n<p>Please demonstrate any non-Optimism experience you believe is relevant to this role:</p>\n<p>Before joining Kwenta and Synthetix, I held positions as a data scientist at several technology organizations focused on influencing product decisions using statistical analysis and modeling.</p>\n<p>Please elaborate on your technical background, including your github handle (this will be used to calculate your github expertise score and will be added to your nomination before it goes to a vote by the Foundation):</p>\n<aside class=\"onebox allowlistedgeneric\" data-onebox-src=\"https://github.com/Tburm\">\n  <header class=\"source\">\n      <img src=\"https://github.githubassets.com/favicons/favicon.svg\" class=\"site-icon\" width=\"32\" height=\"32\">\n\n      <a href=\"https://github.com/Tburm\" target=\"_blank\" rel=\"noopener nofollow ugc\">GitHub</a>\n  </header>\n\n  <article class=\"onebox-body\">\n    <img width=\"150\" height=\"150\" src=\"https://europe1.discourse-cdn.com/bc41dd/original/2X/d/d06ce0a264b36c977b8d14e81acb44d4fecceedf.png\" class=\"thumbnail onebox-avatar\" data-dominant-color=\"87948E\">\n\n<h3><a href=\"https://github.com/Tburm\" target=\"_blank\" rel=\"noopener nofollow ugc\">Tburm - Overview</a></h3>\n\n  <p>blockchain developer | data scientist | LLM whisperer - Tburm</p>\n\n\n  </article>\n\n  <div class=\"onebox-metadata\">\n    \n    \n  </div>\n\n  <div style=\"clear: both\"></div>\n</aside>\n\n<p>My technical background is heavily focused on writing Python and SQL code for data analysis. In joining Kwenta and Synthetix I have also made significant contributions in typescript for frontend development and smart contracts using Solidity. Many of my contributions have been made on open source projects, as you can see from my github history.</p>\n<p>Please elaborate on your experience with relevant member (or Lead) requirements:</p>\n<p>I have been an active member in governance for both Kwenta and Synthetix, and also have the technical experience of managing complex smart contract deployments that hold $100M+ of TVL. Each of these deployments requires attention to detail as any errors can cause significant losses for users. I have acted as a steward for these protocols to protect user funds, keep private keys secure, and to test and execute these protocol upgrades.</p>\n<p>Please describe your philosophy on what makes a good Security Council member:</p>\n<p>A good Security Council Member has deep technical knowledge of Optimism and the OP Stack, plus understanding of developer needs at the protocol and app levels. They must be available to provide input and push through necessary items as the council requires it This mix of technical expertise, practical insight, and responsiveness is crucial for the role.</p>\n<p>Please disclose any anticipated conflicts of interest: While I do not anticipate this is a conflict of interest, I am a full-time core contributor at Synthetix.</p>\n<p>Please verify that you understand you may be removed from this role via the Representative Removal proposal type in the <a href=\"https://github.com/ethereum-optimism/OPerating-manual/blob/main/manual.md\" rel=\"noopener nofollow ugc\">Operating Manual</a>: Yes, verified.</p>\n<p>Please verify that you understand that election is subject to successful completion of a Foundation screen which may include KYC/AML, sanctions screening, and a requirement to sign a standard contract: Yes</p>\n<p>Please verify that you are able to commit ~5 active hours / month to fulfill the Member Responsibilities. Please note that there is an “on-call” aspect to this role that is not fully encompassed in the active hours estimate: Yes</p>\n            <p><small>16 posts - 16 participants</small></p>\n            <p><a href=\"https://gov.optimism.io/t/security-council-member-nomination-troy/8722\">Read full topic</a></p>","link":"https://gov.optimism.io/t/security-council-member-nomination-troy/8722","pubDate":"Wed, 14 Aug 2024 17:10:33 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"gov.optimism.io-topic-8722"},"source":{"@url":"https://gov.optimism.io/t/security-council-member-nomination-troy/8722.rss","#text":"Security Council Member Nomination: Troy"},"filter":false},{"title":"Retro Funding 5 Guest Voter Selection Algorithm Explanation","dc:creator":"gloriakw","category":"Citizens  👥","description":"<p>In this experiment, we wanted to rank developers, identified by their GitHub accounts, based on their proximity to OP Stack repos. We trialed a unique approach with a custom implementation of the EigenTrust algorithm.</p>\n<p><em>Special thanks to Carl Cervone (Open Source Observer), Emily Furlong (Optimism Foundation) and Eugene Kim (OpenRank), Jenya Nepoimannykh (OpenRank).</em></p>\n<h1><a name=\"p-39338-the-foundational-method-capturing-the-web-of-trust-via-recursive-trust-graph-1\" class=\"anchor\" href=\"https://gov.optimism.io#p-39338-the-foundational-method-capturing-the-web-of-trust-via-recursive-trust-graph-1\"></a>The Foundational Method: Capturing the Web of Trust via Recursive Trust Graph</h1>\n<p>Given a community of peers, their interactions with each other form a directed graph. Here, the peers become nodes within the graph and their interactions are the graph edges. These asymmetric edges can be viewed as trust arcs from one peer to the other. Additionally, the weight of each edge signals the degree of trust imparted by one peer onto another.</p>\n<p>The EigenTrust algorithm can then be run on such graphs to measure the impact of recursive trust propagation, leading to a global trust value for each peer or node in the network. Thus, every node gets assigned a reputation score. In a bipartite graph, there are two types of nodes, for example, GitHub repos as well as GitHub users as givers and receivers of trust forms a bipartite graph. EigenTrust not only works well with peer-to-peer data, but it can also be used for bipartite graphs, the implementation of which is achieved using the Hubs and Authorities algorithm. In a bipartite graph, there are two types of nodes, for example, GitHub repos as well as GitHub users as givers and receivers of trust forms a bipartite graph.</p>\n<h1><a name=\"p-39338-the-goal-of-the-exercise-and-the-choice-of-algorithm-2\" class=\"anchor\" href=\"https://gov.optimism.io#p-39338-the-goal-of-the-exercise-and-the-choice-of-algorithm-2\"></a>The Goal of the Exercise and the Choice of Algorithm</h1>\n<p><strong>Goal</strong></p>\n<p>To rank developers, identified by their GitHub accounts, based on their proximity to OP Stack repos.</p>\n<p><strong>Approach</strong></p>\n<p>OpenRank enables verifiable compute for a large class of reputation algorithms, **in particular those that (a) operate on a graph, (b) are iterative in nature and (c) have a tendency toward convergence. In the following sections, we give a brief overview of some of these algorithms.</p>\n<p>For our Developer ranking use case, we obtained a graph of relevant GitHub event data from Open Source Observer, covering more than 2,000 organizations and over 30,000 code repositories. We established two kinds of peers: GitHub users and repositories. We then used a variation of EigenTrust, the Hubs and Authorities algorithm, which computes rankings on an asymmetric bipartite trust graph.</p>\n<p>Below are the two different trust edges used in the graph:</p>\n<ul>\n<li><strong>User-to-repository trust</strong> - this signals the user’s interest in the repository through actions such as stars, forks and issue/PR submissions.</li>\n<li><strong>Repository-to-user trust</strong> - this signals the credit extended by the repository to the user for their contribution. Actions such as PRs merged, direct code commits received, and other maintenance actions.</li>\n</ul>\n<p>The reason for using these two different and asymmetric trust arcs between users and GitHub repositories is to ensure accuracy and sybil resistance in the rankings. For trust-critical use cases, shared interest signal is often not necessarily a good measure of trust. For example, sybil actors can create thousands of trust arcs directed to a malicious or irrelevant repository. We solve this in two ways, choose a set of somewhat trustworthy/useful seed peers (GitHub repositories); and using a trust arc from a repository to a user based on a relevant credit signal such as merging a PR.</p>\n<p>Once the compute is run, the resulting global trust can be used for ranking both users and GitHub repositories.</p>\n<h1><a name=\"p-39338-compute-model-assumptions-and-weights-3\" class=\"anchor\" href=\"https://gov.optimism.io#p-39338-compute-model-assumptions-and-weights-3\"></a>Compute Model Assumptions and Weights</h1>\n<h3><a name=\"p-39338-trust-signals-4\" class=\"anchor\" href=\"https://gov.optimism.io#p-39338-trust-signals-4\"></a><strong>Trust Signals</strong></h3>\n<p>In this model, we use developers (GitHub username) and OP Stack repositories as nodes in the trust graph. We establish trust arcs between users and repositories and vice versa in the following manner:</p>\n<p>User-to-repository actions (interest signals) include:</p>\n<ul>\n<li>Starring the repository</li>\n<li>Forking the repository</li>\n<li>Opening an issue</li>\n<li>Opening a pull request</li>\n<li>Directly committing to the repository</li>\n</ul>\n<p>Repository-to-user actions (credit signals) include:</p>\n<ul>\n<li>Having a pull request merged into the repository (approximated by opening of a pull request as of this exercise)</li>\n<li>Directly committing to the repository</li>\n<li>Repository maintenance, such as merging a PR, resolving an issue, etc.</li>\n</ul>\n<h3><a name=\"p-39338-choice-of-seed-peers-and-alpha-value-5\" class=\"anchor\" href=\"https://gov.optimism.io#p-39338-choice-of-seed-peers-and-alpha-value-5\"></a><strong>Choice of Seed Peers and Alpha Value</strong></h3>\n<p><strong>Seed peers are core OP Stack repo, weighted by their relative importance.</strong></p>\n<ul>\n<li>\n<p>Core repos with higher importance (weight =2)<br>\n‘testinprod-op-erigon’<br>\n‘a16z/magi’,<br>\n‘ethereum-optimism/optimism’,<br>\n‘ethereum-optimism/op-geth’,<br>\n‘ethereum-optimism/asterisc’,<br>\n‘ethereum-optimism/kona’,<br>\n‘ethereum-optimism/design-docs’,<br>\n‘ethereum-optimism/specs’</p>\n</li>\n<li>\n<p>Other core repos with importance (weight=1)</p>\n<p>‘ethereum-optimism/superchain-ops’,<br>\n‘ethereum-optimism/op-analytics’</p>\n</li>\n</ul>\n<p><strong>Alpha (α) Value</strong></p>\n<p>α is a paratermer in EigenTrust algorithm that determines the significance of seed peers influence that shapes the reputation score of every other peers in the entire network. Alpha value is normally chosen between 0 and 0.5 and the higher the alpha the stronger the influence of seed peers, meaning the trust arc from seed peers to other peers will matter more for a peer’s relative reputation.</p>\n<p>A weak alpha value ( α=0.2 ) is chosen in this exercise, intending to discover more repos related to OP stack, and attribute contribution back to developers. Relatively less influential seed peers could let the other peers express more reputation credit to other repos and peers, therefore suits the purpose of the exercise. To read more about alpha value, check out the EigenTrust documentation <a href=\"https://docs.openrank.com/reputation-algorithms/eigentrust\" rel=\"noopener nofollow ugc\">here.</a></p>\n<h3><a name=\"p-39338-reasoning-of-the-weights-choices-for-trust-arcs-6\" class=\"anchor\" href=\"https://gov.optimism.io#p-39338-reasoning-of-the-weights-choices-for-trust-arcs-6\"></a><strong>Reasoning of the Weights Choices for Trust Arcs</strong></h3>\n<p>The weight ratio in the same class of actions (user-to-repo, or repo-to-user) matters.</p>\n<p>User-to-repo weights signals the seriousness of interest as well as the effort that would go into the action. Least to most significant: Forking &lt; (committing directly, starring) &lt; (opening issue, merging PR) &lt; opening PR. A relative weight was assigned accordingly.</p>\n<ul>\n<li>Forking is a chore when someone wants to take a look at the repo and try something out quickly. (weight=1)</li>\n<li>Starring is a long-term interest signal to get updates from the repo and also skew the feed. (weight=5)</li>\n<li>Opening an issue actually takes nonnegligible effort. (weight=10)</li>\n<li>Opening a PR takes more effort as it also has proposed changes. PR opening reflects an original work. (weight =20)</li>\n<li>PR merging reflects a maintenance/review action. Typically it takes more effort for someone to create a patch and open a PR than to review it. (weight =10)</li>\n<li>Direct commits would normally sit between opening an issue and opening a PR; there are a lot of automated direct commits/pushes so we dial it down to the same level as opening an issue. (weight=5)</li>\n</ul>\n<p>Repo-to-user weight signals the degree of credit “thank you” from the repo(’s maintainers) to contributors (users). It can be thought of credit/“thank you” from the repository to the contributors.  Least to most significant: merging PR (maintainer action) &lt; direct commits (maintainer/allow-listed contributor action) &lt; authoring and submitting a PR (which was eventually merged). A relative weight was assigned accordingly.</p>\n<h3><a name=\"p-39338-iteration-on-the-ranking-results-7\" class=\"anchor\" href=\"https://gov.optimism.io#p-39338-iteration-on-the-ranking-results-7\"></a><strong>Iteration on the Ranking Results</strong></h3>\n<p>There were several rounds of iteration on the algorithm, but it should by no means be interpreted to be in its final state. The process of adjusting and improving an algorithm of this type is a continuing effort and we imagine that this algorithm still has room for improvement, but is of sufficient quality for use in this experiment.</p>\n<p>The first iteration of the algorithm appeared to overvalue outdated repos, so we added a time decay function. We also adjusted the weight of seed repos to reflect the relative importance to the OP stack. In running the algorithm we discovered that the choice between an alpha value of 0.5 and 0.2 did not have a significant effect on the ranking.</p>\n<h1><a name=\"p-39338-discussion-future-optimizations-and-sybil-resistance-8\" class=\"anchor\" href=\"https://gov.optimism.io#p-39338-discussion-future-optimizations-and-sybil-resistance-8\"></a>Discussion: Future Optimizations and Sybil-resistance</h1>\n<p>This is the first iteration of using OpenRank to compute reputation within OP Stack based on data inputs from Open Source Observer, eg: Github event data. A few topics can be explored further.</p>\n<h3><a name=\"p-39338-additional-signals-for-increasing-model-performance-and-sybil-resistance-9\" class=\"anchor\" href=\"https://gov.optimism.io#p-39338-additional-signals-for-increasing-model-performance-and-sybil-resistance-9\"></a>Additional Signals for Increasing Model Performance and Sybil Resistance</h3>\n<ul>\n<li>Using real (non-approximated) signal of having a pull request merged into the repository\n<ul>\n<li>Instead of approximating “opened PR = merged PR”</li>\n</ul>\n</li>\n<li>Parsing GitHub events for more concrete signs of collaboration (eg, comments on issues, co-authored pull requests) and assessing the quality of those collaboration signals (eg, a conversation taking place over multiple weeks might be higher signal than one over a shorter interval)</li>\n<li>Both interest signals and credit signals are captured in the same local trust matrix.  The local trust may also capture user-user and repo-repo trust signals (the latter being, once again, the success attribution signals), so the graph is not necessarily bipartite. Some examples:\n<ul>\n<li>Following/Starring other users</li>\n<li>Repository dependencies (if repo A depends on repo B, A’s success should be attributed to B)</li>\n</ul>\n</li>\n</ul>\n<h3><a name=\"p-39338-factoring-actions-size-into-the-trust-arc-weight-10\" class=\"anchor\" href=\"https://gov.optimism.io#p-39338-factoring-actions-size-into-the-trust-arc-weight-10\"></a>Factoring Action’s Size into the Trust Arc Weight</h3>\n<ul>\n<li>Example: PR importance (e.g. documentation fix &lt; a whole new feature)\n<ul>\n<li>Subjective factor (what kind of PR is it?  feature? bug fix? doc? does the project use labels for these?)</li>\n<li>Objective factor (change size?)</li>\n</ul>\n</li>\n</ul>\n<h3><a name=\"p-39338-expanded-seed-trust-11\" class=\"anchor\" href=\"https://gov.optimism.io#p-39338-expanded-seed-trust-11\"></a>Expanded Seed Trust</h3>\n<ul>\n<li>Use a wider selection of OP-related repos so users’ contribution to those repos will directly increase the user’s trust standing via the seed trust</li>\n<li>Try and include both actors and objects in the seed.  Actors-only or objects-only seed trust often yields to slow convergence.</li>\n<li>Associate different weights to seed repos, e.g. according to their importance</li>\n</ul>\n<h1><a name=\"p-39338-about-openrank-12\" class=\"anchor\" href=\"https://gov.optimism.io#p-39338-about-openrank-12\"></a>About OpenRank</h1>\n<p><a href=\"https://openrank.com/\" rel=\"noopener nofollow ugc\">OpenRank</a> is a decentralized ranking and reputation protocol. It enables a verifiable reputation compute layer for the open web that unlocks a broad range of useful applications, including those that resist cryptographic or game-theoretic mechanisms of trust. Using graph compute algorithms like EigenTrust, it offers resilience from sybil contexts, provides scalable and context-specific compute, and enables permissionless access to compute and reputation data for any developer.</p>\n<h3><a name=\"p-39338-the-verifiability-of-openrank-powered-reputation-scores-13\" class=\"anchor\" href=\"https://gov.optimism.io#p-39338-the-verifiability-of-openrank-powered-reputation-scores-13\"></a>The Verifiability of OpenRank powered Reputation Scores</h3>\n<p>As a reputation protocol, the permissionless verifiability of the scores is a key property of OpenRank’s proposition. The verification methods that we propose are far cheaper than verification of general purpose computations, based on the intuition that iterative convergent algorithms on a graph are expensive to compute, but inexpensive to check (typically requiring one matrix-vector multiplication to check for convergence). This makes it far more practical to use this reputation computer for these use cases than a general purpose decentralized compute network.</p>\n<p>Contact <a href=\"mailto:gloria@karma3labs.com\">gloria@karma3labs.com</a> to access the full preliminary litepaper.</p>\n<h1><a name=\"p-39338-github-link-of-the-open-sourced-code-14\" class=\"anchor\" href=\"https://gov.optimism.io#p-39338-github-link-of-the-open-sourced-code-14\"></a>Github Link of the Open Sourced Code</h1>\n<aside class=\"onebox githubblob\" data-onebox-src=\"https://github.com/openrankprotocol/interest-and-credit-notebooks/blob/main/OpenRank%20%2B%20GitHub%20I%26C%20for%20Retrofunding%20R5%20Voter%20Selection.ipynb\">\n  <header class=\"source\">\n\n      <a href=\"https://github.com/openrankprotocol/interest-and-credit-notebooks/blob/main/OpenRank%20%2B%20GitHub%20I%26C%20for%20Retrofunding%20R5%20Voter%20Selection.ipynb\" target=\"_blank\" rel=\"noopener nofollow ugc\">github.com</a>\n  </header>\n\n  <article class=\"onebox-body\">\n    <h4><a href=\"https://github.com/openrankprotocol/interest-and-credit-notebooks/blob/main/OpenRank%20%2B%20GitHub%20I%26C%20for%20Retrofunding%20R5%20Voter%20Selection.ipynb\" target=\"_blank\" rel=\"noopener nofollow ugc\">openrankprotocol/interest-and-credit-notebooks/blob/main/OpenRank + GitHub I&amp;amp;C for Retrofunding R5 Voter Selection.ipynb</a></h4>\n\n\n      <pre><code class=\"lang-ipynb\">{\n  \"nbformat\": 4,\n  \"nbformat_minor\": 0,\n  \"metadata\": {\n    \"colab\": {\n      \"provenance\": [],\n      \"include_colab_link\": true\n    },\n    \"kernelspec\": {\n      \"name\": \"python3\",\n      \"display_name\": \"Python 3\"\n    },\n    \"language_info\": {\n      \"name\": \"python\"\n    },\n    \"widgets\": {\n      \"application/vnd.jupyter.widget-state+json\": {\n        \"9a99368029a64ab38231bff75c464d70\": {\n          \"model_module\": \"@jupyter-widgets/controls\",\n          \"model_name\": \"HBoxModel\",\n</code></pre>\n\n\n\n  This file has been truncated. <a href=\"https://github.com/openrankprotocol/interest-and-credit-notebooks/blob/main/OpenRank%20%2B%20GitHub%20I%26C%20for%20Retrofunding%20R5%20Voter%20Selection.ipynb\" target=\"_blank\" rel=\"noopener nofollow ugc\">show original</a>\n\n  </article>\n\n  <div class=\"onebox-metadata\">\n    \n    \n  </div>\n\n  <div style=\"clear: both\"></div>\n</aside>\n\n            <p><small>1 post - 1 participant</small></p>\n            <p><a href=\"https://gov.optimism.io/t/retro-funding-5-guest-voter-selection-algorithm-explanation/8719\">Read full topic</a></p>","link":"https://gov.optimism.io/t/retro-funding-5-guest-voter-selection-algorithm-explanation/8719","pubDate":"Wed, 14 Aug 2024 09:30:00 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"gov.optimism.io-topic-8719"},"source":{"@url":"https://gov.optimism.io/t/retro-funding-5-guest-voter-selection-algorithm-explanation/8719.rss","#text":"Retro Funding 5 Guest Voter Selection Algorithm Explanation"},"filter":false},{"title":"Security Council Member Nomination: Emiliano Bonassi","dc:creator":"emiliano","category":"Elected  Representatives 💼","description":"<p><strong>Please indicate if you are running to be the Council Lead or a Council Member:</strong><br>\nCouncil Member</p>\n<p><strong>Does this nomination represent an individual or organization:</strong><br>\nIndividual</p>\n<p><strong>Candidate country of residence (or, if an entity, incorporation and principle place of business):</strong><br>\nItaly</p>\n<p><strong>Have you previously served on Optimism’s Security Council:</strong><br>\nNo</p>\n<p><strong>Have you previously served on any other Council or Board in the Collective:</strong><br>\nNo</p>\n<p><strong>Are you a representative of OP Labs:</strong><br>\nNo</p>\n<p><strong>Are you a representative of another OP Chain:</strong><br>\nNo</p>\n<p><strong>If you are a delegate, please provide the link to your delegate profile:</strong><br>\nNo</p>\n<p><strong>If you are a member of the Citizens’ House, please link to your most recent attestation here:</strong></p>\n<p><strong>Please outline your contributions, and their impact, to the Optimism ecosystem to date:</strong></p>\n<p>Day by day maintaining and upgrading 20+ op-stack mainnets with Conduit, like Zora and Mode. Offchain and onchain (msig) ops. Found and fixed issues on optimism code base affecting <a href=\"https://github.com/ethereum-optimism/optimism/pull/11169\" rel=\"noopener nofollow ugc\">batching</a> and scaling high-throughput rollups with new approaches like SuperBlobs.</p>\n<p><strong>Please demonstrate any non-Optimism experience you believe is relevant to this role:</strong></p>\n<ul>\n<li>Lead the major <a href=\"https://x.com/emilianobonassi/status/1770170286052135223?s=46&amp;t=nL1zc5VHVIko1BfG4YaCqg\" rel=\"noopener nofollow ugc\">upgrade</a> for 4844 on the biggest set of mainnet rollups</li>\n<li>Active in web3 security since 2020, in many war rooms and finding security issues on projects like Yearn, Synthetix</li>\n<li>Protocol multisig at Aura Finance and Sherlock Audit</li>\n<li>Advocating security <a href=\"https://x.com/emilianobonassi/status/1635692405495324673?s=46&amp;t=nL1zc5VHVIko1BfG4YaCqg\" rel=\"noopener nofollow ugc\">practices</a> and building security open-source tools like whitehacks-kit and <a href=\"https://forum.aura.finance/t/aip-8-multi-sig-best-practices-framework/142\" rel=\"noopener nofollow ugc\">multisig</a> best practices</li>\n<li>Worked at Amazon Web Service as Sr. Technical Account Manager, leading critical escalations for enterprise customers</li>\n</ul>\n<p><strong>Please elaborate on your technical background, including your expertise score (more info on this shortly):</strong></p>\n<p>I have strong foundations in cloud infra, node engineering and web3 smart contract development. I’ve been managing high-pressure incidents/critical ops in web3/web2 environments, quickly assessing impact and creating get to green plans, engaging properly key stakeholders towards resolution. Example <a href=\"https://medium.com/immunefi/inside-the-war-room-that-saved-primitive-finance-6509e2188c86\" rel=\"noopener nofollow ugc\">here</a>. Practically, from analyzing code and technical resolutions to coordinate/structure external communication, keeping track of community temperature.</p>\n<p>More on my <a href=\"https://emilianobonassi.com\" rel=\"noopener nofollow ugc\">personal</a> page and <a href=\"https://github.com/emilianobonassi\" rel=\"noopener nofollow ugc\">github</a>.</p>\n<p><strong>Please elaborate on your experience with relevant member (or Lead) requirements:</strong></p>\n<p><strong>Please describe your philosophy on what makes a good Security Council member:</strong></p>\n<p>I think a great Security Council member combines deep technical expertise of the OPStack with exceptional communication skills and a strong bias for action. They must understand complex security challenges, take decisive action, and articulate strategies clearly, ensuring both technical teams and non-technical stakeholders are aligned. Balancing technical insight with proactive decision-making and clear communication is key to driving effective security outcomes, ensuring OP ecosystem have highest security standards.</p>\n<p><strong>Please disclose any anticipated conflicts of interest:</strong></p>\n<p>None</p>\n<p><strong>Please verify that you understand you may be removed from this role via the Representative Removal proposal type in the <a href=\"https://github.com/ethereum-optimism/OPerating-manual/blob/main/manual.md\" rel=\"noopener nofollow ugc\">Operating Manual </a>:</strong><br>\nI understand</p>\n<p><strong>Please verify that you understand that election is subject to successful completion of a Foundation screen which</strong> <strong>may include KYC/AML, sanctions screening, and a requirement to sign a standard contract:</strong> [No/Yes]<br>\nYes</p>\n<p><strong>Please verify that you are able to commit ~5 active hours / month to fulfill the Member Responsibilities. Please note that there is an “on-call” aspect to this role that is not fully encompassed in the active hours estimate:</strong> [No/Yes]<br>\nYes, definitely</p>\n            <p><small>12 posts - 11 participants</small></p>\n            <p><a href=\"https://gov.optimism.io/t/security-council-member-nomination-emiliano-bonassi/8718\">Read full topic</a></p>","link":"https://gov.optimism.io/t/security-council-member-nomination-emiliano-bonassi/8718","pubDate":"Wed, 14 Aug 2024 09:21:26 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"gov.optimism.io-topic-8718"},"source":{"@url":"https://gov.optimism.io/t/security-council-member-nomination-emiliano-bonassi/8718.rss","#text":"Security Council Member Nomination: Emiliano Bonassi"},"filter":false},{"title":"Security Council Nomination: Remco Bloemen from Worldcoin Foundation","dc:creator":"Remco","category":"Elected  Representatives 💼","description":"<p><strong>Please indicate if you are running to be the Council Lead or a Council Member:</strong></p>\n<p>Council Member.</p>\n<p><strong>Does this nomination represent an individual or organization:</strong></p>\n<p>On behalf of <a href=\"https://worldcoin.org/\" rel=\"noopener nofollow ugc\">Worldcoin Foundation</a>.</p>\n<p><strong>Candidate country of residence (or, if an entity, incorporation and principle place of business):</strong></p>\n<p>Cayman Islands</p>\n<p><strong>Have you previously served on Optimism’s Security Council:</strong></p>\n<p>No.</p>\n<p><strong>Have you previously served on any other Council or Board in the Collective:</strong></p>\n<p>No.</p>\n<p><strong>Are you a representative of OP Labs:</strong></p>\n<p>No, I am not.</p>\n<p><strong>Are you a representative of another OP Chain:</strong></p>\n<p>Yes, World Chain.</p>\n<p><strong>If you are a delegate, please provide the link to your delegate profile:</strong></p>\n<p>I am not a delegate.</p>\n<p><strong>If you are a member of the Citizens’ House, please link to your most recent attestation here:</strong></p>\n<p>I am not.</p>\n<p><strong>Outline of Contributions to the Optimism Ecosystem</strong></p>\n<p>I have primarily focused on enhancing privacy-preserving identity solutions, critical for decentralized governance and security within the Optimism ecosystem. My work at the Worldcoin Foundation includes integrating advanced cryptographic protocols, improving identity verification without compromising user privacy, for World ID.</p>\n<p>One of the key contributions was collaborating with Optimism and Ethereum’s technical teams to implement the KZG ceremony that was needed for EIP-4844. I also contributed ruint, the arithmetic library that Reth (and hence op-reth and sp1-reth) uses for the 256-bit EVM virtual machine.</p>\n<p><strong>Non-Optimism Experience:</strong></p>\n<p>I bring significant experience in cryptography, blockchain, and decentralized systems to this role. My career includes significant contributions to several key projects in the blockchain space, where I have focused on privacy and scalability. At Worldcoin Foundation, I lead efforts to develop scalable, privacy-preserving technologies that address some of the most pressing challenges in decentralized identity. My contributions include the first open source compatible Stark prover, the Hubble L2 node implementation, EIP-712, and the gas optimized EVM assembly implementations of muldiv, exp and log used by many prominent projects.</p>\n<p><strong>Technical Background:</strong></p>\n<p>My GitHub handle is <span class=\"mention\">@recmo</span> and I write technical notes on <a href=\"http://xn--2-umb.com\" rel=\"noopener nofollow ugc\">2π.com</a>. I love to learn and dive into complex new subjects, which has given me experience in compilers, cryptography, databases, numerical algorithms, and many programming languages, including C++, Rust, Go, Python, Solidity, and EVM/x86/Aarch64 assembly. My current interests lie in cryptographic protocols, privacy-preserving technologies, and scalable decentralized systems. I have a strong focus on designing and implementing solutions that maintain the balance between security, scalability, and user privacy.</p>\n<p>I graduated from Sir Stephen Hawking’s theoretical physics department at Cambridge University, Business Administration at the University of Twente and the GSP of Singularity University at NASA Ames. Since then I’ve co-founded a cybersecurity company, a blockchain company, and joined 0x project early.</p>\n<p><strong>Experience with Relevant Member (or Lead) Requirements:</strong></p>\n<p>At Worldcoin Foundation, I regularly collaborate with various stakeholders in the Web3 ecosystem, including security experts, protocol developers, and governance bodies. This experience has taught me the importance of transparency, collaboration, and open communication when making complex governance decisions.</p>\n<p>I am particularly focused on integrating feedback from a diverse range of stakeholders, ensuring that our solutions meet the needs of the broader community while adhering to the highest standards of security and privacy.</p>\n<p><strong>Philosophy on What Makes a Good Security Council Member:</strong></p>\n<p>A good Security Council member should have a deep understanding of all technical matters involved and the project’s commitments. They should be able to independently judge the effects of operations on complex technical systems. An independent curious mind experienced in adversarial thinking is critical here.</p>\n<p>During normal operation they should strike the right balance between strict adherence to process and expediency. During emergencies they should be responsive, communicative and make decisions with exceptional judgment of technical matters and a strong moral understanding of the project’s goals and expectations. They should remain effective when faced with partial information and dilemma’s.</p>\n<p><strong>Anticipated Conflicts of Interest:</strong></p>\n<p>I will act in the best interest of the Collective, but I want to acknowledge that Worldcoin Foundation is deeply involved in privacy-preserving identity solutions, which may be deployed in other ecosystems that could have competing interests with Optimism.</p>\n<p><strong>Understanding of Removal and Election Processes:</strong></p>\n<p>I understand that I may be removed from this role via the Representative Removal proposal type in the Operating Manual, and that election is subject to a successful Foundation screen, which may include KYC/AML, sanctions screening, and a requirement to sign a standard contract.</p>\n<p><strong>Commitment to Responsibilities:</strong></p>\n<p>Yes, I am able to commit ~5 active hours per month to fulfill the Member Responsibilities, with an understanding of the “on-call” aspect of this role.</p>\n            <p><small>7 posts - 7 participants</small></p>\n            <p><a href=\"https://gov.optimism.io/t/security-council-nomination-remco-bloemen-from-worldcoin-foundation/8714\">Read full topic</a></p>","link":"https://gov.optimism.io/t/security-council-nomination-remco-bloemen-from-worldcoin-foundation/8714","pubDate":"Tue, 13 Aug 2024 22:01:40 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"gov.optimism.io-topic-8714"},"source":{"@url":"https://gov.optimism.io/t/security-council-nomination-remco-bloemen-from-worldcoin-foundation/8714.rss","#text":"Security Council Nomination: Remco Bloemen from Worldcoin Foundation"},"filter":false},{"title":"Security Council Nomination: Everett Hildenbrandt (Runtime Verification)","dc:creator":"ehildenb","category":"Elected  Representatives 💼","description":"<h1><a name=\"p-39327-season-6-security-council-nomination-template-cohort-a-1\" class=\"anchor\" href=\"https://gov.optimism.io#p-39327-season-6-security-council-nomination-template-cohort-a-1\"></a>Season 6 Security Council Nomination Template - Cohort A</h1>\n<h2><a name=\"p-39327-please-paste-your-completed-nomination-here-following-the-instructions-at-the-top-2\" class=\"anchor\" href=\"https://gov.optimism.io#p-39327-please-paste-your-completed-nomination-here-following-the-instructions-at-the-top-2\"></a>Please paste your completed nomination here, following the instructions at the top.</h2>\n<h3><a name=\"p-39327-security-council-member-self-nomination-template-3\" class=\"anchor\" href=\"https://gov.optimism.io#p-39327-security-council-member-self-nomination-template-3\"></a>Security Council Member <strong>Self-Nomination Template</strong></h3>\n<p><em>Please keep your answers as concise as possible while conveying all relevant information.</em><br>\n<em>All nominations will require 8 Top 100 delegate approvals.</em></p>\n<p><strong>Please indicate if you are running to be the Council Lead or a Council Member:</strong></p>\n<p>Council Member</p>\n<p><strong>Does this nomination represent an individual or organization:</strong></p>\n<p>Organization</p>\n<p><strong>Candidate country of residence (or, if an entity, incorporation and principle place of business):</strong></p>\n<p>USA</p>\n<p><strong>Have you previously served on Optimism’s Security Council:</strong></p>\n<p>No</p>\n<p><strong>Have you previously served on any other Council or Board in the Collective:</strong></p>\n<p>No</p>\n<p><strong>Are you a representative of OP Labs:</strong></p>\n<p>No</p>\n<p><strong>Are you a representative of another OP Chain:</strong></p>\n<p>No</p>\n<p><strong>If you are a delegate, please provide the link to your delegate profile:</strong></p>\n<p>No</p>\n<p><strong>If you are a member of the Citizens’ House, please link to your most recent attestation here:</strong></p>\n<p>No</p>\n<p><strong>Please outline your contributions, and their impact, to the Optimism ecosystem to date:</strong></p>\n<p>We have worked with the OP Labs team on integrating <a href=\"https://kontrol.runtimeverification.com/\" rel=\"noopener nofollow ugc\">Kontrol</a> —our formal verification tool for Solidity and EVM smart contracts—into their CI. Within the course of our most recent engagement, we verified the pausability mechanism (<a href=\"https://blog.oplabs.co/improved-superchain-incident-response/\" class=\"inline-onebox\" rel=\"noopener nofollow ugc\">Improving Superchain Incident Response Capabilities</a>) of Optimism L1 contracts. Being a part of Optimism’s CI, Kontrol continuously proves that the pausability mechanism works correctly as code evolves.</p>\n<p>Kontrol proofs and a detailed description of the project can be found in the Optimism monorepo: <a href=\"https://github.com/ethereum-optimism/optimism/tree/develop/packages/contracts-bedrock/test/kontrol\" class=\"inline-onebox\" rel=\"noopener nofollow ugc\">optimism/packages/contracts-bedrock/test/kontrol at develop · ethereum-optimism/optimism · GitHub</a>,</p>\n<p>and our blogpost: <a href=\"https://runtimeverification.com/blog/kontrol-integrated-verification-of-the-optimism-pausability-mechanism\" class=\"inline-onebox\" rel=\"noopener nofollow ugc\">Kontrol Integrated Verification of the Optimism Pausability Mechanism</a>.</p>\n<p><strong>Please demonstrate any non-Optimism experience you believe is relevant to this role:</strong></p>\n<p><a href=\"https://runtimeverification.com/\" rel=\"noopener nofollow ugc\">Runtime Verification</a> specializes in formal verification of software systems, providing the highest level of assurance for the correctness and security of smart contracts and other critical software. Our mission is to deliver open-source formal verification and developer tooling to reduce the costs of auditing and enable continuous formal verification and testing on each commit.</p>\n<p>Since 2018, we have provided formal verification and security services to numerous blockchain foundations and dApps, such as EigenLayer, Uniswap, Ethereum Foundation, Lido, Gnosis, Morpho, Polkadot, and many others.</p>\n<p>Here you can find a complete list of our <a href=\"https://github.com/runtimeverification/publications\" rel=\"noopener nofollow ugc\">previous engagements.</a></p>\n<p><strong>Please elaborate on your technical background, including your github handle (this will be used to calculate your github expertise score and will be added to your nomination before it goes to a vote by the Foundation):</strong></p>\n<p>Our technical expertise is rooted in the development and maintenance of industry-leading tools such as the K Framework, Kontrol, Simbolik, and KEVM. These tools are central to our formal verification processes, which have been applied to a wide range of blockchain ecosystems.</p>\n<p>Our <a href=\"https://github.com/runtimeverification/\" rel=\"noopener nofollow ugc\">GitHub Organization</a> hosts all of Runtime Verification’s open-source tools and projects, designed to improve the security and reliability of blockchain and software systems through formal verification.</p>\n<p>We are currently building and maintaining the following projects:</p>\n<ol>\n<li>K Framework: A rewrite-based executable semantic framework that allows formal definition of programming languages and VMs.</li>\n<li><a href=\"https://github.com/runtimeverification/kontrol\" rel=\"noopener nofollow ugc\">Kontrol</a>: Combines KEVM and Foundry to enable developers to perform formal verification without learning new languages or tools.</li>\n<li><a href=\"https://marketplace.visualstudio.com/items?itemName=RuntimeVerification.simbolik&amp;ssr=false#review-details\" rel=\"noopener nofollow ugc\">Simbolik</a>: VSCode-compatible Solidity debugger with built-in symbolic execution engine designed to assist in debugging and verifying smart contracts.</li>\n<li>KEVM: An executable formal specification of the Ethereum Virtual Machine (EVM) in the K framework.</li>\n<li>KWasm: A formal semantics of WebAssembly in the K framework, allowing formal analysis and verification of WebAssembly programs.</li>\n<li>KMIR: A formal semantics of the Rust MIR (Mid-level Intermediate Representation) in the K framework.</li>\n<li>Kasmer: A formal verification tool for WebAssembly, based on KWasm.</li>\n<li>KaaS: CI Integrated Cloud-Based Symbolic Execution.</li>\n</ol>\n<p>You can learn more about <a href=\"https://docs.runtimeverification.com/index\" rel=\"noopener nofollow ugc\">our tools from Runtime Verification docs</a>.</p>\n<p><strong>Please elaborate on your experience with relevant member (or Lead) requirements:</strong></p>\n<p>RV brings a unique combination of formal verification expertise, deep technical security knowledge, and a strong track record of contributing to high-profile blockchain ecosystems. Our team is well-versed in secure key management, governance processes, and the operational aspects of blockchain security. We have successfully integrated formal verification and security tools into CI pipelines of several projects, demonstrating our ability to manage complex security requirements and deliver robust, secure solutions. Our alignment with the Optimistism vision and our technical competency make us a strong candidate for the Security Council.</p>\n<p><strong>Please describe your philosophy on what makes a good Security Council member:</strong></p>\n<p>A good Security Council member should embody technical expertise, a commitment to transparency, and a strong ethical foundation. At Runtime Verification, we believe that members must possess deep knowledge in cybersecurity, especially web3 security, enabling them to make decisions that safeguard the network’s integrity. Our previous contributions to the Optimism ecosystem, particularly our work with OP Labs, have given us a deep understanding of the ecosystem’s ethos, which we fully share and support. Collaboration, accountability, and a focus on security are essential to our philosophy, ensuring that decisions reflect the community’s best interests while advancing the goals of decentralization within the Optimism ecosystem.</p>\n<p><strong>Please disclose any anticipated conflicts of interest:</strong></p>\n<p>Runtime Verification does not anticipate any conflicts of interest in serving on the Optimism Security Council. If any potential conflicts arise, we are committed to full transparency and will take measures to address them on the Optimism forum or under this post.</p>\n<p><strong>Please verify that you understand you may be removed from this role via the Representative Removal proposal type in the Operating Manual:</strong></p>\n<p>Yes, understood.</p>\n<p><strong>Please verify that you understand that election is subject to successful completion of a Foundation screen which</strong> <strong>may include KYC/AML, sanctions screening, and a requirement to sign a standard contract:</strong></p>\n<p>Yes</p>\n<p><strong>Please verify that you are able to commit ~5 active hours / month to fulfill the Member Responsibilities. Please note that there is an “on-call” aspect to this role that is not fully encompassed in the active hours estimate:</strong></p>\n<p>Yes</p>\n            <p><small>9 posts - 8 participants</small></p>\n            <p><a href=\"https://gov.optimism.io/t/security-council-nomination-everett-hildenbrandt-runtime-verification/8713\">Read full topic</a></p>","link":"https://gov.optimism.io/t/security-council-nomination-everett-hildenbrandt-runtime-verification/8713","pubDate":"Tue, 13 Aug 2024 20:57:42 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"gov.optimism.io-topic-8713"},"source":{"@url":"https://gov.optimism.io/t/security-council-nomination-everett-hildenbrandt-runtime-verification/8713.rss","#text":"Security Council Nomination: Everett Hildenbrandt (Runtime Verification)"},"filter":false},{"title":"Security Council Member Nomination: Corey Petty (corpetty.eth)","dc:creator":"corpetty","category":"Elected  Representatives 💼","description":"<h1><a name=\"p-39313-security-council-member-self-nomination-1\" class=\"anchor\" href=\"https://gov.optimism.io#p-39313-security-council-member-self-nomination-1\"></a>Security Council Member Self-Nomination</h1>\n<h2><a name=\"p-39313-please-indicate-if-you-are-running-to-be-the-council-lead-or-a-council-member-2\" class=\"anchor\" href=\"https://gov.optimism.io#p-39313-please-indicate-if-you-are-running-to-be-the-council-lead-or-a-council-member-2\"></a>Please indicate if you are running to be the Council Lead or a Council Member:</h2>\n<p>Council Member</p>\n<h2><a name=\"p-39313-does-this-nomination-represent-an-individual-or-organization-3\" class=\"anchor\" href=\"https://gov.optimism.io#p-39313-does-this-nomination-represent-an-individual-or-organization-3\"></a>Does this nomination represent an individual or organization:</h2>\n<p>individual</p>\n<h2><a name=\"p-39313-candidate-country-of-residence-or-if-an-entity-incorporation-and-principle-place-of-business-4\" class=\"anchor\" href=\"https://gov.optimism.io#p-39313-candidate-country-of-residence-or-if-an-entity-incorporation-and-principle-place-of-business-4\"></a>Candidate country of residence (or, if an entity, incorporation and principle place of business):</h2>\n<p>USA</p>\n<h2><a name=\"p-39313-have-you-previously-served-on-optimisms-security-council-5\" class=\"anchor\" href=\"https://gov.optimism.io#p-39313-have-you-previously-served-on-optimisms-security-council-5\"></a>Have you previously served on Optimism’s Security Council:</h2>\n<p>no</p>\n<h2><a name=\"p-39313-have-you-previously-served-on-any-other-council-or-board-in-the-collective-6\" class=\"anchor\" href=\"https://gov.optimism.io#p-39313-have-you-previously-served-on-any-other-council-or-board-in-the-collective-6\"></a>Have you previously served on any other Council or Board in the Collective:</h2>\n<p>no</p>\n<h2><a name=\"p-39313-are-you-a-representative-of-op-labs-7\" class=\"anchor\" href=\"https://gov.optimism.io#p-39313-are-you-a-representative-of-op-labs-7\"></a>Are you a representative of OP Labs:</h2>\n<p>no</p>\n<h2><a name=\"p-39313-are-you-a-representative-of-another-op-chain-8\" class=\"anchor\" href=\"https://gov.optimism.io#p-39313-are-you-a-representative-of-another-op-chain-8\"></a>Are you a representative of another OP Chain:</h2>\n<p>no</p>\n<h2><a name=\"p-39313-if-you-are-a-delegate-please-provide-the-link-to-your-delegate-profile-9\" class=\"anchor\" href=\"https://gov.optimism.io#p-39313-if-you-are-a-delegate-please-provide-the-link-to-your-delegate-profile-9\"></a>If you are a delegate, please provide the link to your delegate profile:</h2>\n<p>N/A</p>\n<h2><a name=\"p-39313-if-you-are-a-member-of-the-citizens-house-please-link-to-your-most-recent-attestation-here-10\" class=\"anchor\" href=\"https://gov.optimism.io#p-39313-if-you-are-a-member-of-the-citizens-house-please-link-to-your-most-recent-attestation-here-10\"></a>If you are a member of the Citizens’ House, please link to your most recent attestation here:</h2>\n<p>N/A</p>\n<h2><a name=\"p-39313-please-outline-your-contributions-and-their-impact-to-the-optimism-ecosystem-to-date-11\" class=\"anchor\" href=\"https://gov.optimism.io#p-39313-please-outline-your-contributions-and-their-impact-to-the-optimism-ecosystem-to-date-11\"></a>Please outline your contributions, and their impact, to the Optimism ecosystem to date:</h2>\n<p>As for direct contributions, I have only helped with education and awareness of the organization via interviews (linked youtube videos, which were uploaded recently to new channel so downloads are not reflective of actual numbers):</p>\n<ul>\n<li><a href=\"https://www.youtube.com/watch?v=vUfKv8569zg\" rel=\"noopener nofollow ugc\">Hashing It Out #33: Loom Network / Plasma Cash - Georgios Konstantopoulos</a></li>\n<li><a href=\"https://www.youtube.com/watch?v=xOIX968fkQI\" rel=\"noopener nofollow ugc\">Hashing It Out #64: Plasma - Kelvin Fichter</a></li>\n<li><a href=\"https://youtu.be/nT4uQ1_TL4c?si=V0BPsAc0G0OSUvFF\" rel=\"noopener nofollow ugc\">Hashing It Out #67: Optimistic Rollups - John Adler</a></li>\n<li><a href=\"https://youtu.be/cuQx7I-Qa5c?si=IrJ3vrhf3p8hnCK0\" rel=\"noopener nofollow ugc\">Hashing It Out #89: Optimism Karl Floersch</a></li>\n<li><a href=\"https://www.youtube.com/live/lnW97WV1DkU?si=KREgN39Bo3QjmOS1\" rel=\"noopener nofollow ugc\">Hashing It Out #105: Optimism</a></li>\n</ul>\n<h2><a name=\"p-39313-please-demonstrate-any-non-optimism-experience-you-believe-is-relevant-to-this-role-12\" class=\"anchor\" href=\"https://gov.optimism.io#p-39313-please-demonstrate-any-non-optimism-experience-you-believe-is-relevant-to-this-role-12\"></a>Please demonstrate any non-Optimism experience you believe is relevant to this role:</h2>\n<p>I have contributed significantly to the security field as well as general technical education of blockchain throughout my career. I am heavily aligned with the ideals of the Ethereum ecosystem. I’ve given classes on simple to advanced proper key management. Additionally, I have a reasonably large social profile (happy to provide references), lending to lowering risk of flight or maligned behavior. I’ve listed a number of interviews and material that’s been published throughout the years. There are many more but I’d like to keep this relatively short:</p>\n<ul>\n<li><a href=\"https://youtu.be/zcJmWr5_GOc?si=TibskYYew4Aa0bw5\" rel=\"noopener nofollow ugc\">[Kernel Security] The Web3 Security Mindset with Corey Petty</a></li>\n<li><a href=\"https://www.youtube.com/live/moa6Ragk6_s?si=sPJa1IKxt6P9FeCR\" rel=\"noopener nofollow ugc\">[KERNEL Security Track] Week 1: Lay of the Decentralized Land with Corey Petty</a></li>\n<li><a href=\"https://youtu.be/JnKGxLlYIhc?si=n0zaV7dhQmQC09qI\" rel=\"noopener nofollow ugc\">“Self Sovereignty and the Transformation of Online Security” by Corey Petty | MoneyDance 2020</a></li>\n<li>Technology &amp; Encryption: The Cat is out of the Bag - Corey Petty - <code>https://youtu.be/dqLMVCGfRtY?si=e5zT0VDPRIkjGHIr</code> (link limit)</li>\n<li>Cryptographic Asset Show <span class=\"hashtag-raw\">#28</span> - Corey Petty - <code>(https://youtu.be/mSHUOPONqUI?si=bd6OPMbkqHkVOi0x</code> (link limit for new users)</li>\n<li><a href=\"https://our.status.im/what-is-a-security-audit-when-you-should-get-one-and-how-to-prepare/\" class=\"inline-onebox\" rel=\"noopener nofollow ugc\">What is a Security Audit, When You Should Get One, and How to Prepare.</a></li>\n<li>Admin of EthSecurity Community channels</li>\n</ul>\n<p>In a different vein, I work as the portfolio manager and “head of Insights” within the <a href=\"https://free.technology\" rel=\"noopener nofollow ugc\">IFT</a>, which has had exposure to developments at all layers of the stack. Some of this work has interfaced with and around OP (Nimbus/Status).</p>\n<h2><a name=\"p-39313-please-elaborate-on-your-technical-background-including-your-github-handle-this-will-be-used-to-calculate-your-github-expertise-score-and-will-be-added-to-your-nomination-before-it-goes-to-a-vote-by-the-foundation-13\" class=\"anchor\" href=\"https://gov.optimism.io#p-39313-please-elaborate-on-your-technical-background-including-your-github-handle-this-will-be-used-to-calculate-your-github-expertise-score-and-will-be-added-to-your-nomination-before-it-goes-to-a-vote-by-the-foundation-13\"></a>Please elaborate on your technical background, including your github handle (this will be used to calculate your github expertise score and will be added to your nomination before it goes to a vote by the Foundation):</h2>\n<ul>\n<li>Github: corpetty</li>\n<li>My background is founded in a mixture of high performance computing, quantum physics, and physical chemistry. This was then leveraged to enter the industry via a data science/security position for a number of years. This was then leveraged to enter into the security industry (as Status’ Cheif Security Officer) when the conversation was small where I spent a lot of time in the broad community trying to raise the bar for everyone. I’ve spent considerable time analyzing all aspects of the blockchain stack, from identifying inefficiencies and improvements to the gossipsub and consensus layer to application security and intuitive UX design to help users make informed decisions for themselves.</li>\n</ul>\n<h2><a name=\"p-39313-please-elaborate-on-your-experience-with-relevant-member-or-lead-requirements-14\" class=\"anchor\" href=\"https://gov.optimism.io#p-39313-please-elaborate-on-your-experience-with-relevant-member-or-lead-requirements-14\"></a>Please elaborate on your experience with relevant member (or Lead) requirements:</h2>\n<p>Extensive experience with advising, managing, and threat modeling various multisig treasuries with zero compromises (loss of funds, loss of access, etc) in anything that I’ve overseen.</p>\n<h2><a name=\"p-39313-please-describe-your-philosophy-on-what-makes-a-good-security-council-member-15\" class=\"anchor\" href=\"https://gov.optimism.io#p-39313-please-describe-your-philosophy-on-what-makes-a-good-security-council-member-15\"></a>Please describe your philosophy on what makes a good Security Council member:</h2>\n<p>My general mentality to everything is a risk-based approach: Understand value, how it’s secured and accessed, minimize risk around it being compromised. Community is the key to any of this, so their voices and needs are number 1 priority, meaning the concept of risk is focused around them and their growth/sustainability.</p>\n<h2><a name=\"p-39313-please-disclose-any-anticipated-conflicts-of-interest-16\" class=\"anchor\" href=\"https://gov.optimism.io#p-39313-please-disclose-any-anticipated-conflicts-of-interest-16\"></a>Please disclose any anticipated conflicts of interest:</h2>\n<p>N/A</p>\n<h2><a name=\"p-39313-please-verify-that-you-understand-you-may-be-removed-from-this-role-via-the-representative-removal-proposal-type-in-the-operating-manual-17\" class=\"anchor\" href=\"https://gov.optimism.io#p-39313-please-verify-that-you-understand-you-may-be-removed-from-this-role-via-the-representative-removal-proposal-type-in-the-operating-manual-17\"></a>Please verify that you understand you may be removed from this role via the Representative Removal proposal type in the Operating Manual:</h2>\n<p>Yes</p>\n<h2><a name=\"p-39313-please-verify-that-you-understand-that-election-is-subject-to-successful-completion-of-a-foundation-screen-which-may-include-kycaml-sanctions-screening-and-a-requirement-to-sign-a-standard-contract-noyes-18\" class=\"anchor\" href=\"https://gov.optimism.io#p-39313-please-verify-that-you-understand-that-election-is-subject-to-successful-completion-of-a-foundation-screen-which-may-include-kycaml-sanctions-screening-and-a-requirement-to-sign-a-standard-contract-noyes-18\"></a>Please verify that you understand that election is subject to successful completion of a Foundation screen which may include KYC/AML, sanctions screening, and a requirement to sign a standard contract: [No/Yes]</h2>\n<p>Yes</p>\n<h2><a name=\"p-39313-please-verify-that-you-are-able-to-commit-5-active-hours-month-to-fulfill-the-member-responsibilities-please-note-that-there-is-an-on-call-aspect-to-this-role-that-is-not-fully-encompassed-in-the-active-hours-estimate-noyes-19\" class=\"anchor\" href=\"https://gov.optimism.io#p-39313-please-verify-that-you-are-able-to-commit-5-active-hours-month-to-fulfill-the-member-responsibilities-please-note-that-there-is-an-on-call-aspect-to-this-role-that-is-not-fully-encompassed-in-the-active-hours-estimate-noyes-19\"></a>Please verify that you are able to commit ~5 active hours / month to fulfill the Member Responsibilities. Please note that there is an “on-call” aspect to this role that is not fully encompassed in the active hours estimate: [No/Yes]</h2>\n<p>Yes</p>\n            <p><small>9 posts - 6 participants</small></p>\n            <p><a href=\"https://gov.optimism.io/t/security-council-member-nomination-corey-petty-corpetty-eth/8712\">Read full topic</a></p>","link":"https://gov.optimism.io/t/security-council-member-nomination-corey-petty-corpetty-eth/8712","pubDate":"Tue, 13 Aug 2024 17:57:50 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"gov.optimism.io-topic-8712"},"source":{"@url":"https://gov.optimism.io/t/security-council-member-nomination-corey-petty-corpetty-eth/8712.rss","#text":"Security Council Member Nomination: Corey Petty (corpetty.eth)"},"filter":false},{"title":"Advanced metrics for Retro Funding","dc:creator":"ccerv1","category":"Retro  Funding 🔴","description":"<p>We just published a <a href=\"https://docs.opensource.observer/blog/war-for-public-goods\" rel=\"noopener nofollow ugc\">new blogpost</a> called:  “WAR for public goods, or why we need more advanced metrics in crypto”.</p>\n<p>tl;dr -</p>\n<blockquote>\n<p><strong>W</strong>ins <strong>A</strong>bove <strong>R</strong>eplacement is an <a href=\"https://en.wikipedia.org/wiki/Wins_Above_Replacement\" rel=\"noopener nofollow ugc\">advanced baseball stat</a> that measures a player’s contribution to their team by comparing them to a hypothetical replacement-level player. The post explores how an empirically-derived metric similar to WAR might be applied to ecosystem grants programs as a way of measuring ROI. It includes some use case ideas (like a WAR oracle) and strawman WAR formulas for protocols and open source software (OSS) projects.</p>\n</blockquote>\n<p>WAR is not just a fun meme, but also a preview of the form factor that the next generation of impact metric could take.</p>\n<h2><a name=\"p-39312-context-1\" class=\"anchor\" href=\"https://gov.optimism.io#p-39312-context-1\"></a>Context</h2>\n<p>It’s been a little over a year since our <a href=\"https://gov.optimism.io/t/a-review-of-rpgf2-and-ideas-for-how-data-can-improve-future-iterations/6438\">hello world post</a> on the forum and <a href=\"https://mirror.xyz/cerv1.eth/tCjpRODfiYpnKIgPLRplW0lAopVP3no_JmI34dNsAWk\" rel=\"noopener nofollow ugc\">Mirror essay</a> on how data can improve future iterations of RetroPGF (now Retro Funding).</p>\n<p>Like most worthy problems, the deeper you go, the more complexity you uncover, but also the more obsessed you get with the problem space. We are not turning back the ship but we are staring at a pretty big ocean of possibilities!</p>\n<p>We’ve tried to document both our learnings and our thought process along the way via <a href=\"https://docs.opensource.observer/blog/tags/optimism\" rel=\"noopener nofollow ugc\">our blog</a>. Our <a href=\"https://github.com/opensource-observer\" rel=\"noopener nofollow ugc\">GitHub</a> is also a pretty good place to see how things have evolved.</p>\n<p>But, broadly speaking, this has been the progression:</p>\n<ul>\n<li>a year ago there were effectively no metrics, just project profiles</li>\n<li>we did a lot of analysis with relatively little data on RF3, creating “<a href=\"https://mirror.xyz/cerv1.eth/qL9YKLN9-dBzM89qKaZYgHK2ccpZy2XLPz2Z1PObwCg\" rel=\"noopener nofollow ugc\">impact vectors</a>” and “<a href=\"https://gov.optimism.io/t/retro-on-oso-s-retropgf-lists/7187\">lists</a>” based on fairly gameable metrics like stars, downloads, transaction counts, etc.</li>\n<li>we worked with badgeholders on the <a href=\"https://docs.opensource.observer/blog/impact-metrics-rf4-deep-dive\" rel=\"noopener nofollow ugc\">first set of metrics in RF4</a> and the first metrics-based voting round (and have more in store for RF5-7)</li>\n<li>we’ve done some initial <a href=\"https://docs.opensource.observer/blog/impact-of-retro-funding\" rel=\"noopener nofollow ugc\">longitudinal analysis</a> comparing RF-funded projects against other cohorts</li>\n</ul>\n<p>Here’s the evolution…</p>\n<p></p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://europe1.discourse-cdn.com/bc41dd/original/2X/1/183e9a1959a1ce01ac1461d8aa57540078a116c0.jpeg\" data-download-href=\"/uploads/short-url/3stAaoiZHbqilekJvf6H3AInEhW.jpeg?dl=1\" title=\"image\" rel=\"noopener nofollow ugc\"><img src=\"https://europe1.discourse-cdn.com/bc41dd/optimized/2X/1/183e9a1959a1ce01ac1461d8aa57540078a116c0_2_690x437.jpeg\" alt=\"image\" data-base62-sha1=\"3stAaoiZHbqilekJvf6H3AInEhW\" width=\"690\" height=\"437\" srcset=\"https://europe1.discourse-cdn.com/bc41dd/optimized/2X/1/183e9a1959a1ce01ac1461d8aa57540078a116c0_2_690x437.jpeg, https://europe1.discourse-cdn.com/bc41dd/optimized/2X/1/183e9a1959a1ce01ac1461d8aa57540078a116c0_2_1035x655.jpeg 1.5x, https://europe1.discourse-cdn.com/bc41dd/original/2X/1/183e9a1959a1ce01ac1461d8aa57540078a116c0.jpeg 2x\" data-dominant-color=\"CACACA\"></a></div><p></p>\n<p>Right now, we are currently focused on the <strong>longitudinal metrics</strong> stage, but can start to see the next evolutionary breakthrough: <strong>advanced metrics</strong> <img src=\"https://emoji.discourse-cdn.com/twitter/sparkles.png?v=12\" title=\":sparkles:\" class=\"emoji\" alt=\":sparkles:\" loading=\"lazy\" width=\"20\" height=\"20\"></p>\n<h2><a name=\"p-39312-advanced-metrics-2\" class=\"anchor\" href=\"https://gov.optimism.io#p-39312-advanced-metrics-2\"></a>Advanced metrics</h2>\n<p>We are continually ingesting new public datasets and building more metric models, but at the same time, we are also expanding OSO’s coverage to more projects and chains. This opens up the possibility of deriving new metrics that look more holistically at a project’s contributions <em>relative to some baseline</em>.</p>\n<p>In baseball, there is a famous advanced metric called “WAR” which allows for player comparisons across teams, leagues, years, and eras. There isn’t a single, standard formula for WAR. Different sources use various calculations, but they all rely on the same public datasets, publish their methodologies, and follow similar principles. Some key points:</p>\n<ul>\n<li>WAR includes a mix of offensive and defensive metrics, making it a more holistic measure than ones that focus on a single aspect.</li>\n<li>It adjusts for different player positions, recognizing that not all positions are equally important defensively.</li>\n<li>The averages and constants are derived empirically by looking at performance over a specific period, such as a single season or multiple seasons (an “era”).</li>\n</ul>\n<p>In the context of a grant program like Retro Funding, we want to understand how effective each round is relative to all the other incentive programs happening (or not happening) in the space AND have some way of aggregating the quality of all the proects being supported.</p>\n<blockquote>\n<p>WAR could help identify not only successful projects but also weak points within an ecosystem — whether in developer tooling, user engagement, or protocol innovation — that need more investment. It could be used to determine eligibility for grant rounds or power oracles that allocate ongoing funding streams to high-performing projects.</p>\n</blockquote>\n<p>The post includes a few strawman proposals for what a WAR for OSS projects or WAR for protocols might look like. The challenge lies in identifying metrics that not only capture current activity but also predict future growth and network effects. Realistically, it’s going to take some time to have decent WAR models running in production.</p>\n<h2><a name=\"p-39312-some-next-steps-3\" class=\"anchor\" href=\"https://gov.optimism.io#p-39312-some-next-steps-3\"></a>Some next steps</h2>\n<p>The post also include some ideas for how to get started…</p>\n<ul>\n<li><strong>Start Simple</strong>: The first version of WAR was fairly basic. Over time, more sophisticated versions emerged. Similarly, the initial metrics for decentralized ecosystems don’t need to be perfect. Starting with something simple allows for gradual refinement and improvement (see: <a href=\"http://principles-wiki.net/principles:gall_s_law\" rel=\"noopener nofollow ugc\">Gall’s Law</a>).</li>\n<li><strong>Embrace Competing Implementations</strong>: As mentioned earlier, there is no single standard calculation for WAR. Even though the data and methodologies are public, there’s vibrant debate about which method is best. In an industry as dynamic as crypto, this diversity of approaches is a strength, encouraging innovation and continuous improvement.</li>\n<li><strong>Engage the Research Community</strong>: WAR models are like catnip for data enthusiasts. They offer endless opportunities for simulation, experimentation, and visualization. By providing well-documented, easy-to-use datasets and stoking interest in the results from protocol leaders and governance teams, we can create a garden of catnip for researchers and data nerds.</li>\n</ul>\n<p>Check out the <a href=\"https://docs.opensource.observer/blog/war-for-public-goods\" rel=\"noopener nofollow ugc\">full post</a> and let us know if you have ideas for a WAR model or anything else metrics-related!</p>\n            <p><small>1 post - 1 participant</small></p>\n            <p><a href=\"https://gov.optimism.io/t/advanced-metrics-for-retro-funding/8711\">Read full topic</a></p>","link":"https://gov.optimism.io/t/advanced-metrics-for-retro-funding/8711","pubDate":"Tue, 13 Aug 2024 17:32:16 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"gov.optimism.io-topic-8711"},"source":{"@url":"https://gov.optimism.io/t/advanced-metrics-for-retro-funding/8711.rss","#text":"Advanced metrics for Retro Funding"},"filter":false},{"title":"Optimism Fractal Season 4","dc:creator":"DanSingjoy","category":"Community Calls","description":"<p>Dear Optimists,</p>\n<p>Optimism Fractal is returning from summer break and we’re excited to embark on Season 4! We’ve missed you and are looking forward to reconnecting at our first events of the season on Thursday, August 15th.</p>\n<p>Our seasonal debut will kick off with our beloved <a href=\"https://optimystics.io/respectgame\" rel=\"noopener nofollow ugc\">Respect Game</a>, which always provides a great time to collaborate with builders on the Superchain, raise awareness for your work, and build your reputation in the Optimism Collective. I’m so grateful for everyone who helped make the past three seasons so special and am stoked for all the amazing experiences the community will share at Optimism Fractal events in this season. I encourage you to invite friends and register on the <a href=\"https://lu.ma/optimystics\" rel=\"noopener nofollow ugc\">events calendar</a>, where you can also find weekly Optimism Town Hall and Eden Fractal events.</p>\n<p>At this week’s Optimism Town Hall I propose that we plan Optimism Fractal’s fourth season with an open discussion. We can reflect on our achievements so far, share updates from over the break, discuss goals for Season 4, and consider topics for future town hall events. Optimism Fractal is well-positioned to make significant strides in achieving our core intents and integrate more deeply with the Collective. You can vote on the <a href=\"https://snapshot.org/#/optimismtownhall.eth/proposal/0xfa81674b304ebc54ac9393277916dd5012babff9c1a12ac61d7468d3932d2510\" rel=\"noopener nofollow ugc\">topic proposal</a> and see how we choose topics at the town hall <a href=\"https://optimystics.io/cagendas\" rel=\"noopener nofollow ugc\">here</a>.</p>\n<p>Join us to connect, share your thoughts, and help actualize the Optimistic Vision in our fourth season. I’m excited to hear from everyone and take our next steps together. If you’re not yet familiar with Optimism Fractal, please explore <a href=\"http://OptimismFractal.com\" rel=\"noopener nofollow ugc\">OptimismFractal.com</a> to learn more and discover how we can collaborate. If you’d like to review our progress from last season, you can see this <a href=\"https://gov.optimism.io/t/optimism-fractal-season-3/8095\">thread</a> and watch our recent <a href=\"https://optimismfractal.com/videos\" rel=\"noopener nofollow ugc\">videos</a>.</p>\n<p>Looking forward to seeing you on Thursday! <img src=\"https://emoji.discourse-cdn.com/twitter/sunflower.png?v=12\" title=\":sunflower:\" class=\"emoji\" alt=\":sunflower:\" loading=\"lazy\" width=\"20\" height=\"20\"> <img src=\"https://emoji.discourse-cdn.com/twitter/red_circle.png?v=12\" title=\":red_circle:\" class=\"emoji\" alt=\":red_circle:\" loading=\"lazy\" width=\"20\" height=\"20\"> <img src=\"https://emoji.discourse-cdn.com/twitter/sun_with_face.png?v=12\" title=\":sun_with_face:\" class=\"emoji\" alt=\":sun_with_face:\" loading=\"lazy\" width=\"20\" height=\"20\"></p>\n<p></p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://europe1.discourse-cdn.com/bc41dd/original/2X/3/3a5bae17b433967bcf3d8b6dfefe2d58215ef4ff.jpeg\" data-download-href=\"/uploads/short-url/8kg7fj65ukjfTXr5MC5dVT0AVhZ.jpeg?dl=1\" title=\"optimism fractal sunny flower rainbow square 1\" rel=\"noopener nofollow ugc\"><img src=\"https://europe1.discourse-cdn.com/bc41dd/original/2X/3/3a5bae17b433967bcf3d8b6dfefe2d58215ef4ff.jpeg\" alt=\"optimism fractal sunny flower rainbow square 1\" data-base62-sha1=\"8kg7fj65ukjfTXr5MC5dVT0AVhZ\" width=\"500\" height=\"500\" data-dominant-color=\"9A7E2C\"></a></div><p></p>\n            <p><small>3 posts - 2 participants</small></p>\n            <p><a href=\"https://gov.optimism.io/t/optimism-fractal-season-4/8707\">Read full topic</a></p>","link":"https://gov.optimism.io/t/optimism-fractal-season-4/8707","pubDate":"Tue, 13 Aug 2024 02:19:47 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"gov.optimism.io-topic-8707"},"source":{"@url":"https://gov.optimism.io/t/optimism-fractal-season-4/8707.rss","#text":"Optimism Fractal Season 4"},"filter":false},{"title":"Optimism Forum Weekly Recap - daospace: 08/05 - 08/11","dc:creator":"daospace","category":"Updates  and Announcements 📢","description":"<p>gm Optimism Collective <img src=\"https://emoji.discourse-cdn.com/twitter/red_circle.png?v=12\" title=\":red_circle:\" class=\"emoji\" alt=\":red_circle:\" loading=\"lazy\" width=\"20\" height=\"20\"> <img src=\"https://emoji.discourse-cdn.com/twitter/sparkles.png?v=12\" title=\":sparkles:\" class=\"emoji\" alt=\":sparkles:\" loading=\"lazy\" width=\"20\" height=\"20\"></p>\n<p>Last week, 6 new topics were submitted to the Optimism forum, marking a decrease from the previous week’s 18 topics. The most impactful discussions included:</p>\n<ul>\n<li><strong><a href=\"https://gov.optimism.io/t/security-council-member-nomination-pablo-sabbatella-pablito-eth/8679\">Security Council Member Nomination: Pablo Sabbatella (pablito.eth)</a></strong>: Pablo Sabbatella, known for his extensive experience in cybersecurity and blockchain technology, is running for the position of Council Member. His nomination has sparked discussions about strengthening security within the Optimism community.</li>\n<li><strong><a href=\"https://gov.optimism.io/t/security-council-member-nomination-mariano-conti/8683\">Security Council Member Nomination: Mariano Conti</a></strong>: Mariano Conti, with previous experience on the Security Council and contributions to the Ethereum ecosystem, is self-nominating for the position of Council Member. His emphasis on honesty, technical ability, and availability has garnered attention within the community.</li>\n<li><strong><a href=\"https://gov.optimism.io/t/cycle-25-grants-final-roundup/8687\">Cycle 25 Grants Final Roundup</a></strong>: This report highlights the Grants Council’s activities at the end of Cycle 25, outlining challenges, feedback on applications, and strategic decisions for the next cycle. The detailed review process and community feedback have made this a key topic for future grant distributions.</li>\n</ul>\n<p>Despite the drop in new topics, the discussions remain highly relevant, with a focus on security and community governance.</p>\n<p><a href=\"https://twitter.com/daospace_ai\" rel=\"noopener nofollow ugc\">daospace </a>is a DAO discovery platform that aggregates contributions across different DAOs. We will be providing weekly Automated AI Summaries to help reduce information overload, and so that all members can stay up to date on forum activity within the DAO. Below is a summary of every topic made within the OP Governance Forum from last week.</p>\n<p>Feel free to leave us feedback in the comments below. You can get in touch with the daospace team on <a href=\"https://twitter.com/daospace_ai\" rel=\"noopener nofollow ugc\">X (Twitter) </a>, or reach out to the founders directly on X as well: <a href=\"https://twitter.com/JarisJames\" rel=\"noopener nofollow ugc\">Jaris James </a>&amp; <a href=\"https://twitter.com/sixty_keys\" rel=\"noopener nofollow ugc\">Sixty</a></p>\n<h2><a name=\"p-39285-security-council-member-nomination-pablo-sabbatella-pablitoethhttpsgovoptimismiotsecurity-council-member-nomination-pablo-sabbatella-pablito-eth8679-1\" class=\"anchor\" href=\"https://gov.optimism.io#p-39285-security-council-member-nomination-pablo-sabbatella-pablitoethhttpsgovoptimismiotsecurity-council-member-nomination-pablo-sabbatella-pablito-eth8679-1\"></a><a href=\"https://gov.optimism.io/t/security-council-member-nomination-pablo-sabbatella-pablito-eth/8679\">Security Council Member Nomination: Pablo Sabbatella (pablito.eth)</a></h2>\n<p><strong>Created</strong>: 2024-08-06</p>\n<p><strong>Author</strong>: <a class=\"mention\" href=\"https://gov.optimism.io/u/pablito.eth\">@pablito.eth</a></p>\n<p><strong>Summary</strong></p>\n<p>Pablo Sabbatella, an individual from Argentina, is running for the position of Council Member in the Optimism ecosystem. He has a deep background in cybersecurity, operational security, and blockchain technology. With experience in incident response, security education, and founding cybersecurity initiatives, Pablo aims to contribute his expertise to enhance security within the Optimism community.</p>\n<h2><a name=\"p-39285-security-council-member-nomination-mariano-contihttpsgovoptimismiotsecurity-council-member-nomination-mariano-conti8683-2\" class=\"anchor\" href=\"https://gov.optimism.io#p-39285-security-council-member-nomination-mariano-contihttpsgovoptimismiotsecurity-council-member-nomination-mariano-conti8683-2\"></a><a href=\"https://gov.optimism.io/t/security-council-member-nomination-mariano-conti/8683\">Security Council Member Nomination: Mariano Conti</a></h2>\n<p><strong>Created</strong>: 2024-08-06</p>\n<p><strong>Author</strong>: <a class=\"mention\" href=\"https://gov.optimism.io/u/nanexcool\">@nanexcool</a></p>\n<p><strong>Summary</strong></p>\n<p>A concise summary of the post: An individual from Argentina is self-nominating as a Council Member for Optimism’s Security Council. They have previous experience on the Security Council Cohort A and have a technical background with contributions to the Ethereum ecosystem. Their philosophy emphasizes honesty, technical ability, and availability. They have disclosed potential conflicts of interest and acknowledge the responsibilities of the role.</p>\n<h2><a name=\"p-39285-govnft-community-call-thread-1httpsgovoptimismiotgovnft-community-call-thread-18684-3\" class=\"anchor\" href=\"https://gov.optimism.io#p-39285-govnft-community-call-thread-1httpsgovoptimismiotgovnft-community-call-thread-18684-3\"></a><a href=\"https://gov.optimism.io/t/govnft-community-call-thread-1/8684\">GovNFT Community Call Thread 1</a></h2>\n<p><strong>Created</strong>: 2024-08-07</p>\n<p><strong>Author</strong>: <a class=\"mention\" href=\"https://gov.optimism.io/u/michael\">@Michael</a></p>\n<p><strong>Summary</strong></p>\n<p>Participants of the GovNFT program are discussing Security Council elections for season 6. They are sharing insights on the role of the Security Council and what qualities they look for in a council member. Thoughtful responses are encouraged for point allocation.</p>\n<h2><a name=\"p-39285-joint-house-call-retrofunding-5-edition-will-be-tuesday-august-13th-1100pt-1400-et-1800-gmt-1900-cethttpsgovoptimismiotjoint-house-call-retrofunding-5-edition-will-be-tuesday-august-13th-11-00pt-14-00-et-18-00-gmt-19-00-cet8688-4\" class=\"anchor\" href=\"https://gov.optimism.io#p-39285-joint-house-call-retrofunding-5-edition-will-be-tuesday-august-13th-1100pt-1400-et-1800-gmt-1900-cethttpsgovoptimismiotjoint-house-call-retrofunding-5-edition-will-be-tuesday-august-13th-11-00pt-14-00-et-18-00-gmt-19-00-cet8688-4\"></a><a href=\"https://gov.optimism.io/t/joint-house-call-retrofunding-5-edition-will-be-tuesday-august-13th-11-00pt-14-00-et-18-00-gmt-19-00-cet/8688\">Joint House Call <em>Retrofunding 5 Edition</em> will be [Tuesday, August 13th @ 11:00PT / 14:00 ET / 18:00 GMT / 19:00 CET]</a></h2>\n<p><strong>Created</strong>: 2024-08-09</p>\n<p><strong>Author</strong>: <a class=\"mention\" href=\"https://gov.optimism.io/u/michael\">@Michael</a></p>\n<p><strong>Summary</strong></p>\n<p>The post announces a Joint House call on Tuesday with Jonas providing an overview of Retrofunding Round 5. The call will take place on Tuesday, with a meeting link provided for participation.</p>\n<h2><a name=\"p-39285-voting-cycle-roundup-26httpsgovoptimismiotvoting-cycle-roundup-268689-5\" class=\"anchor\" href=\"https://gov.optimism.io#p-39285-voting-cycle-roundup-26httpsgovoptimismiotvoting-cycle-roundup-268689-5\"></a><a href=\"https://gov.optimism.io/t/voting-cycle-roundup-26/8689\">Voting Cycle Roundup #26</a></h2>\n<p><strong>Created</strong>: 2024-08-09</p>\n<p><strong>Author</strong>: system</p>\n<p><strong>Summary</strong></p>\n<p>Cycle <span class=\"hashtag-raw\">#26</span> started on August 8th at 19:00 GMT and ends on August 28th at 19:00 GMT. After the Token House Voting Period, the Citizens’ House has a week to veto any approved upgrades. Delegate voting weights will be recorded when votes go live on August 22nd at 19:00 GMT. The Citizens’ House veto vote will be conducted via Snapshot from August 29th to September 4th.</p>\n<h2><a name=\"p-39285-cycle-25-grants-final-rounduphttpsgovoptimismiotcycle-25-grants-final-roundup8687-6\" class=\"anchor\" href=\"https://gov.optimism.io#p-39285-cycle-25-grants-final-rounduphttpsgovoptimismiotcycle-25-grants-final-roundup8687-6\"></a><a href=\"https://gov.optimism.io/t/cycle-25-grants-final-roundup/8687\">Cycle 25 Grants final roundup</a></h2>\n<p><strong>Created</strong>: 2024-08-09</p>\n<p><strong>Author</strong>: <a class=\"mention\" href=\"https://gov.optimism.io/u/gonna.eth\">@Gonna.eth</a></p>\n<p><strong>Summary</strong></p>\n<p>The post is the first report on the Grants Council’s activities at the end of Cycle 25, outlining challenges faced, feedback on applications, and decisions made, as well as plans for the next cycle. Key points include addressing issues with the review process, dividing the review process among different groups, incorporating feedback from the Developer Advisory Board, and providing detailed scores and resolutions for each application reviewed.</p>\n            <p><small>1 post - 1 participant</small></p>\n            <p><a href=\"https://gov.optimism.io/t/optimism-forum-weekly-recap-daospace-08-05-08-11/8706\">Read full topic</a></p>","link":"https://gov.optimism.io/t/optimism-forum-weekly-recap-daospace-08-05-08-11/8706","pubDate":"Mon, 12 Aug 2024 17:19:33 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"gov.optimism.io-topic-8706"},"source":{"@url":"https://gov.optimism.io/t/optimism-forum-weekly-recap-daospace-08-05-08-11/8706.rss","#text":"Optimism Forum Weekly Recap - daospace: 08/05 - 08/11"},"filter":false},{"title":"Security Council Member Nomination: Riley (jtriley.eth)","dc:creator":"jtriley.eth","category":"Elections","description":"<p><strong>Please indicate if you are running to be the Council Lead or a Council Member:</strong></p>\n<p>Council Member</p>\n<p><strong>Does this nomination represent an individual or organization:</strong></p>\n<p>Individual</p>\n<p><strong>Candidate country of residence (or, if an entity, incorporation and principle place of business):</strong></p>\n<p>United States</p>\n<p><strong>Have you previously served on Optimism’s Security Council:</strong></p>\n<p>No</p>\n<p><strong>Have you previously served on any other Council or Board in the Collective:</strong></p>\n<p>No</p>\n<p><strong>Are you a representative of OP Labs:</strong></p>\n<p>No</p>\n<p><strong>Are you a representative of another OP Chain:</strong></p>\n<p>No</p>\n<p><strong>If you are a delegate, please provide the link to your delegate profile:</strong></p>\n<p>N/A</p>\n<p><strong>If you are a member of the Citizens’ House, please link to your most recent attestation here:</strong></p>\n<p>N/A</p>\n<p><strong>Please outline your contributions, and their impact, to the Optimism ecosystem to date:</strong></p>\n<p>Contributions are more toward EVM than explicitly Optimism, though the efforts benefit both.</p>\n<ul>\n<li><a href=\"https://eips.ethereum.org/EIPS/eip-6909\" rel=\"noopener nofollow ugc\">EIP-6909 </a>: Author</li>\n<li><a href=\"https://github.com/vectorized/solady\" rel=\"noopener nofollow ugc\">Solady</a>: EIP1967 Proxy</li>\n<li><a href=\"https://github.com/transmissions11/solmate\" rel=\"noopener nofollow ugc\">Solmate</a>: ERC6909 Implementation</li>\n<li><a href=\"https://github.com/pcaversaccio/snekmate\" rel=\"noopener nofollow ugc\">Snekmate</a>: ERC1155 Implementation</li>\n<li><a href=\"https://github.com/paradigmxyz/artemis\" rel=\"noopener nofollow ugc\">Artemis</a>: Strategy Huff-Port</li>\n<li><a href=\"https://github.com/jtriley-eth/the-ethereum-virtual-machine\" rel=\"noopener nofollow ugc\">The Ethereum Virtual Machine (Book) </a>: Author</li>\n<li><a href=\"https://github.com/jtriley-eth/token-types\" rel=\"noopener nofollow ugc\">Token Types</a>: Author</li>\n</ul>\n<p><strong>Please demonstrate any non-Optimism experience you believe is relevant to this role:</strong></p>\n<p>I have previous experience with independent security audits, responsible bug disclosure, and cryptography.</p>\n<p>If nominated, the mnemonic that produces the signing key will be generated on a hardware wallet for reasonably fast singing and the recovery phrase will be backed up as a 3 out of 6 Shamir Secret Sharing set, generated on a single use, airgapped raspberry pi, and the keys stored in a variety of distributed but reasonably accessible places. (Shamir code <a href=\"https://gist.github.com/jtriley-eth/51ae04f82c918f15d0d1bb4ec4a90d7b\" rel=\"noopener nofollow ugc\">here</a>.)</p>\n<p><strong>Please elaborate on your technical background, including your github handle (this will be used to calculate your github expertise score and will be added to your nomination before it goes to a vote by the Foundation):</strong></p>\n<p>3-4 years experience in software engineering, smart contract engineering, security audits; as full time (Superfluid, Fuel), on a contract basis, and through open source contributions.</p>\n<p>Github:</p><aside class=\"onebox allowlistedgeneric\" data-onebox-src=\"https://github.com/jtriley-eth\">\n  <header class=\"source\">\n      <img src=\"https://github.githubassets.com/favicons/favicon.svg\" class=\"site-icon\" width=\"32\" height=\"32\">\n\n      <a href=\"https://github.com/jtriley-eth\" target=\"_blank\" rel=\"noopener nofollow ugc\">GitHub</a>\n  </header>\n\n  <article class=\"onebox-body\">\n    <img width=\"400\" height=\"400\" src=\"https://europe1.discourse-cdn.com/bc41dd/original/2X/a/a5178061f541cc07cd7a7485b030fcfb28f8e71a.jpeg\" class=\"thumbnail onebox-avatar\" data-dominant-color=\"97929B\">\n\n<h3><a href=\"https://github.com/jtriley-eth\" target=\"_blank\" rel=\"noopener nofollow ugc\">jtriley-eth - Overview</a></h3>\n\n  <p>smart contract dev. jtriley-eth has 108 repositories available. Follow their code on GitHub.</p>\n\n\n  </article>\n\n  <div class=\"onebox-metadata\">\n    \n    \n  </div>\n\n  <div style=\"clear: both\"></div>\n</aside>\n\n<p><strong>Please elaborate on your experience with relevant member (or Lead) requirements:</strong></p>\n<p>Most of my experience is in smart contract engineering as well as security reviews. I’ve contributed to incident response efforts by using automated tooling to detect and find organizations with code susceptible to a critical compiler vulnerability, I’ve decompiled malicious contracts for exploit analysis, and I’ve found and responsibly disclosed a critical foundry vulnerability.</p>\n<p><strong>Please describe your philosophy on what makes a good Security Council member:</strong></p>\n<p>Security council is a sub-dao within the Optimism ecosystem; one that specializes in handling security incident response in a timely manner. Must haves include quick, clear, and collaborative communication abilities, technical expertise to assess incidents and respond, minimal conflicts of interest (and <strong>none</strong> undisclosed), contributes to reasonable geographic distribution, and generally aligned with the vision of Optimism.</p>\n<p><strong>Please disclose any anticipated conflicts of interest:</strong></p>\n<p>None, though should any come up in the future, they will be disclosed under this post.</p>\n<p><strong>Please verify that you understand you may be removed from this role via the Representative Removal proposal type in the <a href=\"https://github.com/ethereum-optimism/OPerating-manual/blob/main/manual.md\" rel=\"noopener nofollow ugc\">Operating Manual</a>:</strong></p>\n<p>Yes, understood</p>\n<p><strong>Please verify that you understand that election is subject to successful completion of a Foundation screen which</strong> <strong>may include KYC/AML, sanctions screening, and a requirement to sign a standard contract:</strong></p>\n<p>Yes</p>\n<p><strong>Please verify that you are able to commit ~5 active hours / month to fulfill the Member Responsibilities. Please note that there is an “on-call” aspect to this role that is not fully encompassed in the active hours estimate:</strong></p>\n<p>Yes</p>\n            <p><small>4 posts - 3 participants</small></p>\n            <p><a href=\"https://gov.optimism.io/t/security-council-member-nomination-riley-jtriley-eth/8705\">Read full topic</a></p>","link":"https://gov.optimism.io/t/security-council-member-nomination-riley-jtriley-eth/8705","pubDate":"Mon, 12 Aug 2024 16:55:51 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"gov.optimism.io-topic-8705"},"source":{"@url":"https://gov.optimism.io/t/security-council-member-nomination-riley-jtriley-eth/8705.rss","#text":"Security Council Member Nomination: Riley (jtriley.eth)"},"filter":false},{"title":"Security Council Nomination: alisha.eth","dc:creator":"alisha.eth","category":"Elected  Representatives 💼","description":"<p><strong>Please indicate if you are running to be the Council Lead or a Council Member:</strong><br>\nCouncil Lead</p>\n<p><strong>Does this nomination represent an individual or organization:</strong><br>\nIndividual</p>\n<p><strong>Candidate country of residence (or, if an entity, incorporation and principle place of business):</strong><br>\nUnited Arab Emirates</p>\n<p><strong>Have you previously served on Optimism’s Security Council:</strong><br>\nYes, I was initially appointed as a Security Council Member, which was ratified <a href=\"https://vote.optimism.io/proposals/85591583404433237270543189567126336043697987369929953414380041066767718361144\" rel=\"noopener nofollow ugc\">in this vote</a> (November 2023). Prior to kickoff, I took on the role of Security Council Lead, and have been in that role since.</p>\n<p><strong>Have you previously served on any other Council or Board in the Collective:</strong><br>\nNo</p>\n<p><strong>Are you a representative of OP Labs:</strong><br>\nNo</p>\n<p><strong>Are you a representative of another OP Chain:</strong><br>\nNo</p>\n<p><strong>If you are a delegate, please provide the link to your delegate profile:</strong><br>\nNA</p>\n<p><strong>If you are a member of the Citizens’ House, please link to your most recent attestation here:</strong><br>\n<a href=\"https://optimism.easscan.org/attestation/view/0xfe00ec58474654e249fbe4d3dc1df85e1956cf4559fdb34b9093ddb997013c3b\" rel=\"noopener nofollow ugc\">Badgeholder Attestation</a></p>\n<p><strong>Please outline your contributions, and their impact, to the Optimism ecosystem to date:</strong><br>\nAs Security Council Lead, I have coordinated the Security Council since December 2023. I am a badgeholder in the Citizen’s House and have voted on retro-funding rounds 2, 3 and 4.</p>\n<p><strong>Please demonstrate any non-Optimism experience you believe is relevant to this role:</strong><br>\nI am an experienced governance and ecosystem coordinator and a qualified lawyer. Previously, I lead governance at ENS. I am working on an open source hardware wallet (Firefly) with a quest to eliminate blind signing and as such I am especially conscious of wallet security and the approval process for signing Security Council transactions.</p>\n<p><strong>Please elaborate on your technical background, including your github handle (this will be used to calculate your github expertise score and will be added to your nomination before it goes to a vote by the Foundation):</strong></p>\n<p>I am not a developer, but incase it is useful, my github handle is <a href=\"https://github.com/futurealisha\" rel=\"noopener nofollow ugc\">futurealisha</a>.</p>\n<p><strong>Please elaborate on your experience with relevant member (or Lead) requirements:</strong><br>\nSince December 2023, I have coordinated all Security Council rehearsals, along with all signing ceremonies that have been executed by the Security Council. I pride myself on being alarmingly responsive with internal Security Council communications. I have built and maintained <a href=\"https://opsc.vercel.app/\" rel=\"noopener nofollow ugc\">opsc.vercel.app</a> which is a site that shares information on the Optimism Security Council, including status updates on signing ceremonies, and recordings of monthly calls, which I host.</p>\n<p><strong>Please describe your philosophy on what makes a good Security Council member:</strong><br>\nA good Security Council member is an independent thinker who pays attention to details and doesn’t operate on assumptions. For the operational success of the Security Council, an good Security Council member is also responsive and a clear communicator who isn’t afraid to speak up. A less technical qualification is an acute awareness of the position of responsibility and trust that a SC member operates with, and acting with integrity in all situations.</p>\n<p><strong>Please disclose any anticipated conflicts of interest:</strong><br>\nI contract with an entity that provides services to various foundation companies and DAOs in the Ethereum ecosystem. In matters related to Optimism, I am confident in my ability to always act in the best interests of Optimism governance.</p>\n<p><strong>Please verify that you understand you may be removed from this role via the Representative Removal proposal type in the <a href=\"https://github.com/ethereum-optimism/OPerating-manual/blob/main/manual.md\" rel=\"noopener nofollow ugc\">Operating Manual</a>:</strong><br>\nYes</p>\n<p><strong>Please verify that you understand that election is subject to successful completion of a Foundation screen which</strong> <strong>may include KYC/AML, sanctions screening, and a requirement to sign a standard contract:</strong><br>\nYes</p>\n<p><strong>Please verify that you are able to commit ~5 active hours / month to fulfill the Member Responsibilities. Please note that there is an “on-call” aspect to this role that is not fully encompassed in the active hours estimate:</strong><br>\nYes</p>\n            <p><small>10 posts - 10 participants</small></p>\n            <p><a href=\"https://gov.optimism.io/t/security-council-nomination-alisha-eth/8702\">Read full topic</a></p>","link":"https://gov.optimism.io/t/security-council-nomination-alisha-eth/8702","pubDate":"Mon, 12 Aug 2024 15:58:22 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"gov.optimism.io-topic-8702"},"source":{"@url":"https://gov.optimism.io/t/security-council-nomination-alisha-eth/8702.rss","#text":"Security Council Nomination: alisha.eth"},"filter":false},{"title":"Trust Tiers 2.0","dc:creator":"system","category":"Mission  Grants  🏹","description":"<p><a href=\"https://gov.optimism.io/t/deprecated-collective-trust-tiers/5877\">Collective Trust Tiers</a> were <a href=\"https://gov.optimism.io/t/guide-to-season-4-as-a-collective/5886\">introduced in Season 4</a> as a way to allow teams to build reputation onchain and create a common standard for grant eligibility. Although limiting grant amounts based on a team’s reputation is still a valuable concept, the implementation of Trust Tiers has revealed some limitations. As such, the Trust Tiers program will see some significant changes starting in Season 6 and beyond. These changes are informed by the experiences of builders and the Grants Council, and adhere to <a href=\"https://gov.optimism.io/t/the-path-to-open-metagovernance/\">the principle of iterative governance design and experimentation</a>.</p>\n<h3><a name=\"p-39262-trust-tiers-what-we-learned-in-seasons-4-and-5-1\" class=\"anchor\" href=\"https://gov.optimism.io#p-39262-trust-tiers-what-we-learned-in-seasons-4-and-5-1\"></a>Trust Tiers - what we learned in Seasons 4 and 5</h3>\n<p>These learnings derive from a survey with five members of the Season 5 Grants Council and four builders, as well as several informal conversations with Grants Council members.</p>\n<p>The Grants Council rated the concept of Trust Tiers as neutral, but rated Trust Tiers in their current form as not very useful. Here are the reasons given:</p>\n<ol>\n<li>Trust Tiers do not accurately reflect teams’ reputations. Some teams seem ‘overvalued’ and others ‘undervalued’ based on their Trust Tier. Specific limitations called out:</li>\n</ol>\n<ul>\n<li>Reputation gained in other ecosystems isn’t transferable to Optimism.</li>\n<li>There have been many edge cases where teams pivoted and lost their Tier, or trusted contributors left a project that retained its Tier.</li>\n<li>Trust Tier status gained through Retro Round 3 was called out as seemingly inaccurate or adding noise to the data.</li>\n</ul>\n<ol start=\"2\">\n<li>Trust Tiers are very hard to verify, making them difficult to use effectively.</li>\n</ol>\n<ul>\n<li>The Grants Council must rely on a project’s self-reported Trust Tier until the final stages of a grant application, when they verify the self-reported Trust Tier.</li>\n<li>This is because the operational overhead of checking each applicant’s Trust Tier up-front is too high.</li>\n</ul>\n<p>The builders surveyed were neutral on Trust Tiers, mostly understanding the concept and aware of the Trust Tier their project is in. The following limitations were highlighted:</p>\n<ol>\n<li>Teams aren’t always clear how to calculate their Trust Tier when they’ve had multiple grant types or they fall into a gray area.</li>\n<li>Trust Tiers may benefit from including other reputation markers beyond the team having previously received a grant.</li>\n</ol>\n<h3><a name=\"p-39262-diagnosing-the-problems-with-trust-tiers-2\" class=\"anchor\" href=\"https://gov.optimism.io#p-39262-diagnosing-the-problems-with-trust-tiers-2\"></a>Diagnosing the problems with Trust Tiers</h3>\n<p>The primary issue with the Trust Tiers is not that the reputation of teams doesn’t matter in grant decisions, but that the Tiers have not been an effective method of predicting whether a team would be successful at completing a Mission Request. In addition, manual verification of the Tiers is inefficient and may lead to confusion.</p>\n<p>Therefore, our objective should be to build an alternative reputation model that can more effectively predict whether a team will successfully complete a grant, with the ultimate goal of reducing the number of incomplete mission requests and grants clawed back and increasing the successful outcomes of completed grants.</p>\n<p>The initial implementation of Trust Tiers was based on subjective contributions to the Optimism Collective for each Tier’s qualification. These criteria are composed of trust signals like ‘has previously worked for the Optimism Collective’ or ‘has earned over a certain amount of OP in Retro Funding’. Each Tier’s set of criteria was a best guess at which signals might be relevant.</p>\n<p>The next generation of Trust Tiers should be built bottom-up, using the underlying trust signals as training data to build a machine learning model that effectively predicts a team’s likelihood of success. This approach is more likely to yield Tiers that effectively segment teams by reputation. It may also reveal that a continuous trust score (e.g. a scale of 0-100) is more useful than dividing teams into levels.</p>\n<h3><a name=\"p-39262-trust-tiers-in-season-6-3\" class=\"anchor\" href=\"https://gov.optimism.io#p-39262-trust-tiers-in-season-6-3\"></a>Trust Tiers in Season 6</h3>\n<p>To re-build the Trust Tiers bottom-up, the first priority is to grow the number of trust signals available about projects. Only then can the Collective attempt to build a model or models that effectively categorize or score teams.</p>\n<p><strong>Since the Trust Tiers do not appear to be working in their current form, they will no longer be used in Season 6.</strong> The Grants Council will make grant decisions based on the information that is available to them about the teams applying.</p>\n<p>Instead, the Collective will focus on developing the trust signals that underlie the Tiers, and record these as attestations. As part of this:</p>\n<ul>\n<li>All teams doing work in the Collective as part of Retro Funding or Mission Grants will be asked to create a persistent project profile, to which they collect attestations.</li>\n<li>Teams working on Foundation and Token House Mission Requests will receive attestations upon grant completion.\n<ul>\n<li>Attestations will include the OP amount and season in which the grant was issued.</li>\n</ul>\n</li>\n<li>Retro Funding awards will also be represented as attestations issued to the projects that applied. OP amount and Round are included in the <a href=\"https://docs.optimism.io/chain/identity/schemas#retro-funding-rewards\">attestation schema</a>.</li>\n<li>The owners of user interfaces that include project profiles are encouraged to display relevant project attestations.</li>\n</ul>\n<p>This is one of several initiatives the Foundation is bootstrapping in Season 6 to equip the Collective to be able to make data driven decisions. In future seasons as the project model gains more usage, the Collective can continue to develop the number and variety of trust signals available.</p>\n<p>Please see <a href=\"https://community.optimism.io/docs/identity/project-and-individual-identity-in-the-collective/#\">the governance docs</a> for more detailed information on how projects and people are represented in the Collective.</p>\n            <p><small>3 posts - 2 participants</small></p>\n            <p><a href=\"https://gov.optimism.io/t/trust-tiers-2-0/8698\">Read full topic</a></p>","link":"https://gov.optimism.io/t/trust-tiers-2-0/8698","pubDate":"Mon, 12 Aug 2024 07:58:46 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"gov.optimism.io-topic-8698"},"source":{"@url":"https://gov.optimism.io/t/trust-tiers-2-0/8698.rss","#text":"Trust Tiers 2.0"},"filter":false},{"title":"Security Council Nomination: ml_sudo","dc:creator":"ml_sudo","category":"✨ General","description":"<p><em>My name is Michelle Lai but I go by ml_sudo in community.</em> Twitter: <span class=\"mention\">@michlai007</span> (<a href=\"https://x.com/michlai007\" rel=\"noopener nofollow ugc\">link</a>)</p>\n<p><strong>Please indicate if you are running to be the Council Lead or a Council Member:</strong> Council Member</p>\n<p><strong>Does this nomination represent an individual or organization:</strong> Individual</p>\n<p><strong>Candidate country of residence (or, if an entity, incorporation and principle place of business):</strong> Nomadic (Asia, Mexico)</p>\n<p><strong>Have you previously served on Optimism’s Security Council:</strong> No<br>\n<strong>Have you previously served on any other Council or Board in the Collective:</strong> No<br>\n<strong>Are you a representative of OP Labs:</strong> No<br>\n<strong>Are you a representative of another OP Chain:</strong> No<br>\n<strong>If you are a delegate, please provide the link to your delegate profile:</strong> N.A.<br>\n<strong>If you are a member of the Citizens’ House, please link to your most recent attestation here:</strong> N.A.</p>\n<p><strong>Please outline your contributions, and their impact, to the Optimism ecosystem to date:</strong></p>\n<p>I am on the governance council (the Spartan Council) at Synthetix. Synthetix has been a key contributor to the genesis of Optimism through being one of the first apps to launch on OP Mainnet, and later through consistently being one of the top fee generators on the chain.</p>\n<p>Relative to most other applicants, I will be new blood, which could infuse new ideas and perspectives beneficial to improving Security Council processes.</p>\n<p><strong>Please demonstrate any non-Optimism experience you believe is relevant to this role:</strong></p>\n<p><strong>==&gt; Key management experience:</strong></p>\n<p>I developed a strong understanding of secure key management at Anchorage. As the first business hire and head of business development, I gained a lot of context on secure key management, the challenges that key holders face, and tradeoffs inherent in different key management models. I have a longstanding interest in cybersecurity and privacy, which means my personal op sec is relatively high. For example, I wrote a blog with personal security suggestions for Devcon Bogota in 2022 that was shared across many company Slack channels afaik (see <a href=\"https://x.com/michlai007/status/1574509318652706817\" rel=\"noopener nofollow ugc\">tweet</a>).</p>\n<p><strong>==&gt; Crisis management experience:</strong></p>\n<p>I’ve served on the Spartan Council at Synthetix (the governance council) since May 2023. Just this year alone we’ve had to react in real-time to several existential events arising from market volatility. We had to quickly determine the magnitude and cause of events, and act to balance different stakeholders’ interests. I’m also designing the next version of Synthetix’s security council (though I definitely won’t be on it, which suits the eligibility criteria).</p>\n<p>I serve on the Board of Directors at the Electric Coin Company (makers of Zcash), helping manage through a time of crisis and rebirth (token price crash, CEO transition, cross-entity conflict), at both the executive and community levels.</p>\n<p><strong>==&gt; Other experience:</strong></p>\n<p>I have a meaningful grasp of legal matters (contracts, litigation, regulations) through a previous life in private equity investing and through COO-type roles in other startups. Given the progressive approach to decentralization the Collective is taking, this experience is relevant.</p>\n<p>I’m no dev but I went through a full-stack web dev bootcamp in 2017, not to become a professional dev but learn how to better communicate with devs as a business person. This experience is relevant to avoid miscommunication with devs.</p>\n<p><strong>Please elaborate on your technical background</strong>, including your github handle (this will be used to calculate your github expertise score and will be added to your nomination before it goes to a vote by the Foundation):</p>\n<p>I write some Ruby, Python and Javascript, but just for fun!</p><aside class=\"onebox allowlistedgeneric\" data-onebox-src=\"https://github.com/ml-sudocode/\">\n  <header class=\"source\">\n      <img src=\"https://github.githubassets.com/favicons/favicon.svg\" class=\"site-icon\" width=\"32\" height=\"32\">\n\n      <a href=\"https://github.com/ml-sudocode/\" target=\"_blank\" rel=\"noopener nofollow ugc\">GitHub</a>\n  </header>\n\n  <article class=\"onebox-body\">\n    <img width=\"460\" height=\"460\" src=\"https://europe1.discourse-cdn.com/bc41dd/original/2X/3/32dcc433564e62da2922318c0eaf42dcc632d489.jpeg\" class=\"thumbnail onebox-avatar\" data-dominant-color=\"999999\">\n\n<h3><a href=\"https://github.com/ml-sudocode/\" target=\"_blank\" rel=\"noopener nofollow ugc\">ml-sudocode - Overview</a></h3>\n\n  <p>1/2 business + 1/2 geek. 100% nerd. ml-sudocode has 21 repositories available. Follow their code on GitHub.</p>\n\n\n  </article>\n\n  <div class=\"onebox-metadata\">\n    \n    \n  </div>\n\n  <div style=\"clear: both\"></div>\n</aside>\n\n<p>This is not “technical,” but I like explaining complex concepts in fun ways, so I put together a mini-movie with Legos explaining how OP rollup transactions work <img src=\"https://emoji.discourse-cdn.com/twitter/slight_smile.png?v=12\" title=\":slight_smile:\" class=\"emoji\" alt=\":slight_smile:\" loading=\"lazy\" width=\"20\" height=\"20\"><br>\nYoutube: <a href=\"https://www.youtube.com/watch?v=wn_-ux9MgZo\" rel=\"noopener nofollow ugc\">https://www.youtube.com/watch?v=wn_-ux9MgZo</a><br>\n</p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://europe1.discourse-cdn.com/bc41dd/original/2X/6/6ead2513b474e88d1b18e084c47fdb75e1369768.jpeg\" data-download-href=\"/uploads/short-url/fN5tW2vUN5cl7UnC83B2JAAR3oQ.jpeg?dl=1\" title=\"Screenshot 2024-08-20 012347\" rel=\"noopener nofollow ugc\"><img src=\"https://europe1.discourse-cdn.com/bc41dd/optimized/2X/6/6ead2513b474e88d1b18e084c47fdb75e1369768_2_345x225.jpeg\" alt=\"Screenshot 2024-08-20 012347\" data-base62-sha1=\"fN5tW2vUN5cl7UnC83B2JAAR3oQ\" width=\"345\" height=\"225\" srcset=\"https://europe1.discourse-cdn.com/bc41dd/optimized/2X/6/6ead2513b474e88d1b18e084c47fdb75e1369768_2_345x225.jpeg, https://europe1.discourse-cdn.com/bc41dd/optimized/2X/6/6ead2513b474e88d1b18e084c47fdb75e1369768_2_517x337.jpeg 1.5x, https://europe1.discourse-cdn.com/bc41dd/optimized/2X/6/6ead2513b474e88d1b18e084c47fdb75e1369768_2_690x450.jpeg 2x\" data-dominant-color=\"ECDBC4\"></a></div><p></p>\n<p><strong>Please elaborate on your experience with relevant member (or Lead) requirements:</strong></p>\n<p>For specific experiences, please see the preceding question on non-Optimism experience. Overall, since beginning my career in 2007, I’ve picked up broad experience in collapsing uncertainty in complex situations.</p>\n<p>Here is more color on what I am about, since many might not yet know me.</p>\n<p>From a motivation angle, I got into crypto in 2016 after one talk by Vitalik in Hong Kong where he shared a use case that immediately resonated: smart contracts for escrow payments. I had just arranged a 3-day (!) escrow for $100mn for my day job, and my eyes popped out at the ~$300,000 price tag - and there Vitalik was with a superior solution. This aligns with the Optimism refrain of “upgrading capitalism” - cutting out middlemen who rent-seek excessively through the sale of “trust.”</p>\n<p>Since then, I’ve stayed because I want to build tools for human freedom. I’ve interviewed Edward Snowden (<a href=\"https://www.youtube.com/watch?v=i4oklUP0b_c\" rel=\"noopener nofollow ugc\">link</a>; Devcon Bogota, 2022); given talks on privacy at Zcon (<a href=\"https://www.youtube.com/watch?v=hdd5X2z7O3o&amp;t=855s\" rel=\"noopener nofollow ugc\">link</a>; talk on the history of surveillance, The Handmaid’s Tale, and meeting Margaret Atwood, 2023), <a href=\"http://HOPE.net\" rel=\"noopener nofollow ugc\">HOPE.net</a> (<a href=\"https://www.youtube.com/watch?v=pDK55lOh3R0\" rel=\"noopener nofollow ugc\">link</a>; talk at a long-established hacker convention on privacy in cryptocurrency, NY, 2022); talked about WW3-resilient stacks (<a href=\"https://www.youtube.com/watch?v=N2Iy1c-1GKY&amp;t=4s\" rel=\"noopener nofollow ugc\">link</a>; Shielding Summit, Brussels, 2024); organized a 4-hour privacy special with a Tor cofounder, Meta whistleblower Frances Haugen and a professional hacker (<a href=\"https://www.youtube.com/watch?v=iZX40TFq8Ts\" rel=\"noopener nofollow ugc\">link</a>; ETHDenver, 2023); and helped set up the <a href=\"https://privacyalliance.com/\" rel=\"noopener nofollow ugc\">Universal Privacy Alliance</a> (alliance of leading privacy projects).</p>\n<p><strong>Please describe your philosophy on what makes a good Security Council member:</strong></p>\n<p>Three main traits:</p>\n<p>(1) Hard skills<br>\n(a) understand and have experience in secure key management, and<br>\n(b) understand how the protocol works, enough to ask intelligent questions in case of an emergency.</p>\n<p>(2) Soft skills<br>\nWhen it’s business-as-usual, an SC member should be responsive and collaborative.<br>\nIn emergency situations, they should react quickly and firmly, while balancing pressure from different stakeholders.</p>\n<p>(3) Mandate-driven<br>\nAn SC member should be clear what their scope is and to whom they are responsible, in order to protect the integrity of the Optimism Collective’s governance structures. Some understanding of legal frameworks may also be useful in dispatching their duties.</p>\n<p><strong>Please disclose any anticipated conflicts of interest:</strong> None.</p>\n<p><strong>Please verify that you understand you may be removed from this role</strong> via the Representative Removal proposal type in the Operating Manual: I understand</p>\n<p><strong>Please verify that you understand that election is subject to successful completion of a Foundation screen</strong> which may include KYC/AML, sanctions screening, and a requirement to sign a standard contract: Yes</p>\n<p><strong>Please verify that you are able to commit ~5 active hours / month to fulfill the Member Responsibilities.</strong> Please note that there is an “on-call” aspect to this role that is not fully encompassed in the active hours estimate: Yes</p>\n            <p><small>11 posts - 10 participants</small></p>\n            <p><a href=\"https://gov.optimism.io/t/security-council-nomination-ml-sudo/8697\">Read full topic</a></p>","link":"https://gov.optimism.io/t/security-council-nomination-ml-sudo/8697","pubDate":"Mon, 12 Aug 2024 06:58:38 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"gov.optimism.io-topic-8697"},"source":{"@url":"https://gov.optimism.io/t/security-council-nomination-ml-sudo/8697.rss","#text":"Security Council Nomination: ml_sudo"},"filter":false},{"title":"Security Council Member Nomination: Kent Fenwick (Agora)","dc:creator":"kent","category":"Elected  Representatives 💼","description":"<p><strong>Please indicate if you are running to be the Council Lead or a Council Member:</strong></p>\n<p>Council Member.</p>\n<p><strong>Does this nomination represent an individual or organization:</strong></p>\n<p>On behalf of <a href=\"https://www.agora.xyz/\" rel=\"noopener nofollow ugc\">Agora</a>.</p>\n<p><strong>Candidate country of residence (or, if an entity, incorporation and principle place of business):</strong></p>\n<p>Canada</p>\n<p><strong>Have you previously served on Optimism’s Security Council:</strong></p>\n<p>No, I haven’t.</p>\n<p><strong>Have you previously served on any other Council or Board in the Collective:</strong></p>\n<p>No, I haven’t.</p>\n<p><strong>Are you a representative of OP Labs:</strong></p>\n<p>No, I am not.</p>\n<p><strong>Are you a representative of another OP Chain:</strong></p>\n<p>No, I am not.</p>\n<p><strong>If you are a delegate, please provide the link to your delegate profile:</strong></p>\n<p>I am not a delegate.</p>\n<p><strong>If you are a member of the Citizens’ House, please link to your most recent attestation here:</strong></p>\n<p>I am not.</p>\n<p><strong>Please outline your contributions, and their impact, to the Optimism ecosystem to date:</strong></p>\n<p>I am the Chief Technology Officer at <a href=\"https://agora.xyz\" rel=\"noopener nofollow ugc\">Agora</a>. Agora is a Core Dev of the OP Collective and builds cutting edge governance solutions for the health and security of the OP Collective. In short, we were pivotal in moving OP Governance Onchain, let me explain how we did that.</p>\n<p>Our primary contribution in the past few years has been: <a href=\"https://vote.optimism.io/\" rel=\"noopener nofollow ugc\">vote.optimism.io</a> and the work we did on the <a href=\"https://github.com/ethereum-optimism/ecosystem-contributions/issues/64\" rel=\"noopener nofollow ugc\">Foundation Mission #64 in 2023</a>. This lead us to the rebuilding and design of the <a href=\"https://vote.optimism.io/changelog\" rel=\"noopener nofollow ugc\">advanced delegation</a> schema for OP delegates and the launch of a new governor. Each day, each week, we ensure that the team at Agora is doing all we can to make the voting and delegation experience better for OP Delegates, and that the vote is strong, and secure. Whether we are building new voting modules like our Approval Voting module in 2023 (Pick a choice voting) or our new Optimistic Voting Module in 2024, we are pushing the boundaries and delivering quality service that gets better each week.</p>\n<p>We were also the team behind: <a href=\"https://retrofunding.optimism.io/\" rel=\"noopener nofollow ugc\">https://retrofunding.optimism.io/</a>, the website and app that powers the new OP Project creation schema on EAS. We also built and maintain the <a href=\"https://github.com/voteagora/op-atlas\" rel=\"noopener nofollow ugc\">OP Atlas Github</a> repo that powers the code for the RetroFunding website.  and the API that powers the RetroPGF Voting process over here: <a href=\"https://vote.optimism.io/api_v1\" rel=\"noopener nofollow ugc\">https://vote.optimism.io/api_v1</a>.</p>\n<p>We are deeply proud of the work we do for the Collective and we are humbled to have the opportunity to work so deeply with so many great Collective members.</p>\n<p>Finally, at Agora we work with other incredible DAOs (Uniswap, ENS, Nouns) and are able to bring their ideas to the OP Collective and export what works for OP to other communities, making the entire Web3 ecosystem better and expanding the Collective.</p>\n<p><strong>Please demonstrate any non-Optimism experience you believe is relevant to this role:</strong></p>\n<p>Over the past two decades in the tech industry, I’ve established myself as a leader in building and scaling complex, real-time financial systems and large-scale platforms. My experience spans from innovative startups to established tech giants, always focusing on creating solutions that empower users and foster collaboration.</p>\n<p>At Clearco, as VP of Product and Growth, I spearheaded the development of groundbreaking financial products like Invoice Funding and Buy Now, Pay Later. These initiatives supported over 5,000 founders and facilitated the movement of nearly $500 million in capital. The core of my work involved constructing scalable systems capable of handling intricate financial transactions in real time, ensuring both seamless operations and sustainable growth.</p>\n<p>Prior to Clearco, I played a pivotal role at Tilt, where I managed and scaled a robust system enabling peer-to-peer payments. This work contributed significantly to the platform’s success, ultimately leading to its acquisition by Airbnb. Throughout my career, I’ve consistently leveraged my deep technical expertise and strategic understanding of product growth to build and lead teams that deliver cutting-edge solutions in the fintech space.</p>\n<p>My professional journey extends beyond these roles. I’ve founded over 10 startups, successfully exiting from two. This entrepreneurial experience has honed my ability to manage and optimize large, complex systems requiring real-time processing and high reliability.</p>\n<p>What truly drives me is a passion for grassroots growth, community building, and collective decision-making. This enthusiasm fuels my commitment to creating products that genuinely empower users, particularly in the Web3 space. Here, decentralized governance and community-driven initiatives are not just buzzwords, but the foundation of innovation.</p>\n<p>As I continue to lead and innovate in the tech space, my focus remains on creating value through technology while fostering strong, collaborative communities. It’s about building systems and products that make a tangible difference, all while remembering that our most valuable resource is time - and how we choose to spend it.</p>\n<p><strong>Please elaborate on your technical background, including your github handle (this will be used to calculate your github expertise score and will be added to your nomination before it goes to a vote by the Foundation):</strong></p>\n<p>My github handle is <a href=\"https://github.com/kent\" rel=\"noopener nofollow ugc\">@kent</a> on Github.</p>\n<p>Throughout my 20+ year career in the tech industry, I’ve cultivated a deep and diverse technical background, specializing in building and scaling complex, real-time financial systems and large-scale platforms.</p>\n<p>My expertise spans across multiple programming languages and frameworks, with a particular focus on those commonly used in fintech and blockchain development. I’m proficient in languages such as Python, Ruby, JavaScript/TypeScript (including Node.js), and Solidity for smart contract development. I’ve also worked extensively with frameworks like React for front-end development and Next.js for building robust back-end services.</p>\n<p>In terms of database technologies, I have hands-on experience with both SQL (PostgreSQL, MySQL) and NoSQL (MongoDB, Cassandra) databases, crucial for managing the vast amounts of data in financial systems. My work often involves designing and implementing scalable architectures, utilizing microservices and containerization technologies like Docker and Kubernetes.</p>\n<p>At Agora, I was foundational is designing and building our onchain and offchain platform architecture to ensure that we were able to work with different DAOs, on different chains in a fast, and effective way to deliver the test technical governance solutions we can.</p>\n<p>I’m a strong advocate for clean, maintainable code and have implemented rigorous testing and continuous integration/continuous deployment (CI/CD) pipelines in my projects. I believe in the power of open-source collaboration and regularly contribute to community-driven initiatives.</p>\n<p><strong>Please elaborate on your experience with relevant member (or Lead) requirements:</strong></p>\n<p>At Agora, we regularly work with and listen to various stakeholders at OP including members of the security council and protocol work. We will read their thoughts and listen when they weight in on designs or future protocol directions.</p>\n<p>In fact, a big learning we had when we rolled out our new governor was <em>not getting enough feedback</em> from the security council and we are continuing to redouble our efforts there. as we try and bring as much transparency and collaboration to our complex governance decisions.</p>\n<p><strong>Please describe your philosophy on what makes a good Security Council member:</strong></p>\n<p>Council members need to be:</p>\n<ul>\n<li>Informed</li>\n<li>Opinionated</li>\n<li>Have strong opinions loosely held</li>\n<li>Listen more than speak</li>\n</ul>\n<p>and ultimately integrate a bunch of information along with the goals and mission of the Collective and make the right recommendation or decision for the better of the Collective regardless of what that means for you personally.</p>\n<p>The proposals and decisions that we will put forth / vet will shape the future of the OP Collective and not something I take lightly.</p>\n<p><strong>Please disclose any anticipated conflicts of interest:</strong></p>\n<p>I will act with the Collectives best interest at heart, but also want to acknowledge that Agora is a governance software provider and may at in the future be deployed on other applications and ecosystems that could have competing interests with Optimism.</p>\n<p><strong>Please verify that you understand you may be removed from this role via the Representative Removal proposal type in the <a href=\"https://github.com/ethereum-optimism/OPerating-manual/blob/main/manual.md\" rel=\"noopener nofollow ugc\">Operating Manual</a>:</strong></p>\n<p>I do understand.</p>\n<p><strong>Please verify that you understand that election is subject to successful completion of a Foundation screen which</strong> <strong>may include KYC/AML, sanctions screening, and a requirement to sign a standard contract:</strong> [No/Yes]</p>\n<p>Yes</p>\n<p><strong>Please verify that you are able to commit ~5 active hours / month to fulfill the Member Responsibilities. Please note that there is an “on-call” aspect to this role that is not fully encompassed in the active hours estimate:</strong> [No/Yes]</p>\n<p>Yes</p>\n            <p><small>11 posts - 11 participants</small></p>\n            <p><a href=\"https://gov.optimism.io/t/security-council-member-nomination-kent-fenwick-agora/8696\">Read full topic</a></p>","link":"https://gov.optimism.io/t/security-council-member-nomination-kent-fenwick-agora/8696","pubDate":"Mon, 12 Aug 2024 04:15:42 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"gov.optimism.io-topic-8696"},"source":{"@url":"https://gov.optimism.io/t/security-council-member-nomination-kent-fenwick-agora/8696.rss","#text":"Security Council Member Nomination: Kent Fenwick (Agora)"},"filter":false},{"title":"Voting Cycle Roundup #26","dc:creator":"system","category":"Voting Cycles","description":"<p>Cycle <span class=\"hashtag-raw\">#26</span> began on Thursday August 8th at 19:00 GMT and runs until Wednesday August 28th at 19:00 GMT. Additionally, the Citizens’ House will have a one-week period to veto any Upgrades approved by the Token House, immediately following the conclusion of the Token House Voting Period.</p>\n<p>A snapshot of delegate voting weights will be taken at the time votes go live. Voting will take place at <a href=\"https://vote.optimism.io/\">https://vote.optimism.io/</a> starting on Thursday August 22nd at 19:00 GMT. The Citizens’ House veto vote will take place via Snapshot from Thursday August 29th to Wednesday September 4th.</p>\n            <p><small>4 posts - 2 participants</small></p>\n            <p><a href=\"https://gov.optimism.io/t/voting-cycle-roundup-26/8689\">Read full topic</a></p>","link":"https://gov.optimism.io/t/voting-cycle-roundup-26/8689","pubDate":"Fri, 09 Aug 2024 19:08:16 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"gov.optimism.io-topic-8689"},"source":{"@url":"https://gov.optimism.io/t/voting-cycle-roundup-26/8689.rss","#text":"Voting Cycle Roundup #26"},"filter":false},{"title":"Joint House Call *Retrofunding 5 Edition* will be [Tuesday, August 13th @ 11:00PT / 14:00 ET / 18:00 GMT / 19:00 CET]","dc:creator":"Michael","category":"Community Calls","description":"<p>Hey Everyone!</p>\n<p>We will be having our next Joint House call on Tuesday where the wonderful <a class=\"mention\" href=\"https://gov.optimism.io/u/jonas\">@Jonas</a> will be giving an overview of Retrofunding Round 5!</p>\n<p></p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://europe1.discourse-cdn.com/bc41dd/original/2X/b/b40b44bb8da10a8f29bf2b325ffa61d739563046.jpeg\" data-download-href=\"/uploads/short-url/pGK5pADvFbjYhFZhJKvXnTCzhGK.jpeg?dl=1\" title=\"Jointhcc17 (1)\"><img src=\"https://europe1.discourse-cdn.com/bc41dd/original/2X/b/b40b44bb8da10a8f29bf2b325ffa61d739563046.jpeg\" alt=\"Jointhcc17 (1)\" data-base62-sha1=\"pGK5pADvFbjYhFZhJKvXnTCzhGK\" width=\"690\" height=\"388\" data-dominant-color=\"E6DDD8\"></a></div><p></p>\n<p>See you there!<br>\n<a href=\"https://meet.google.com/vme-ovto-jcn\" class=\"onebox\" target=\"_blank\" rel=\"noopener\">https://meet.google.com/vme-ovto-jcn</a></p>\n<p>Michael</p>\n            <p><small>1 post - 1 participant</small></p>\n            <p><a href=\"https://gov.optimism.io/t/joint-house-call-retrofunding-5-edition-will-be-tuesday-august-13th-11-00pt-14-00-et-18-00-gmt-19-00-cet/8688\">Read full topic</a></p>","link":"https://gov.optimism.io/t/joint-house-call-retrofunding-5-edition-will-be-tuesday-august-13th-11-00pt-14-00-et-18-00-gmt-19-00-cet/8688","pubDate":"Fri, 09 Aug 2024 17:55:09 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"gov.optimism.io-topic-8688"},"source":{"@url":"https://gov.optimism.io/t/joint-house-call-retrofunding-5-edition-will-be-tuesday-august-13th-11-00pt-14-00-et-18-00-gmt-19-00-cet/8688.rss","#text":"Joint House Call *Retrofunding 5 Edition* will be [Tuesday, August 13th @ 11:00PT / 14:00 ET / 18:00 GMT / 19:00 CET]"},"filter":false},{"title":"Cycle 25 Grants final roundup","dc:creator":"Gonna.eth","category":"Grants Updates","description":"<p>Welcome to our first of six reports on the Grants Council’s activities at the end of each cycle. In this report, we reflect on the challenges faced during Cycle 25.</p>\n<p>We acknowledge that the fast-paced review process and some export issues with Charmverse limited our ability to provide comprehensive feedback. We are addressing this issue with the Charmverse team and have decided to push all non-approved applications to the next cycle to allow them to incorporate the feedback. <a href=\"https://docs.google.com/spreadsheets/d/1JpJK5AyOqqd2_LT8CmnX5yDKGd1UM6ebV3Af-PGdU3s/edit?usp=sharing\">Badly formatted comments here until further notice.</a></p>\n<p>For the next cycle, submission is always open, with a deadline at the end of the first week (intake) on Tuesday. Applications submitted after this deadline will be considered for the following cycle.</p>\n<p>We received 50 applications and managed to review 100% of them at each milestone. However, due to time constraints, only three reviewers had full context for final decision-making. To resolve this, we will divide the review process into two groups of six Grants Council members each.</p>\n<p>The Developer Advisory Board provided valuable feedback during the final review, but we understand that incorporating it in just 24 hours was insufficient. Going forward, we will provide preliminary review lists earlier to allow applicants and reviewers more time to consider DAB feedback.</p>\n<p>We want to thank the DAB for their prompt and precise input. At this point, no applications have been declined unless mission requests are fulfilled. Applications not approved will be carried over to the next cycle for additional review by three more Grants Council members.</p>\n<p>To Superchain grant applicants: We appreciate your interest in our program and apologize for any inconvenience caused by the postponement of decision-making to the next cycle. This allows us more time to thoroughly evaluate applications. We encourage you to refine your proposals and address areas of improvement identified by reviewers.</p>\n<p>In detail, scores are here <a href=\"https://docs.google.com/spreadsheets/d/1AcVf-8SjZchG11krE64YCrz8KWZ5f6CW_mWJUk5z6YE/edit?usp=sharing\">Grants Council public database</a></p>\n<div class=\"md-table\">\n<table>\n<thead>\n<tr>\n<th>Application</th>\n<th>Scores (Avg)</th>\n<th>Resolution</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>INTENT 1</td>\n<td></td>\n<td></td>\n</tr>\n<tr>\n<td><strong>Cross Chain Voting</strong></td>\n<td></td>\n<td></td>\n</tr>\n<tr>\n<td>Aragon &lt;&gt; RISC Zero - Joint partnership on crosschain voting</td>\n<td>57.66</td>\n<td>Moved to next Cycle (26)</td>\n</tr>\n<tr>\n<td>Cross chain voting with Snapshot and Herodotus</td>\n<td>55</td>\n<td>Moved to next Cycle (26)</td>\n</tr>\n<tr>\n<td>OP Stack Cross Chain Voting</td>\n<td>37.66</td>\n<td>Moved to next Cycle (26)</td>\n</tr>\n<tr>\n<td><strong>Grants Claiming Tools</strong></td>\n<td></td>\n<td></td>\n</tr>\n<tr>\n<td>Hedgey application</td>\n<td>40.33</td>\n<td>Moved to next Cycle (26)</td>\n</tr>\n<tr>\n<td>Attestation-Based Grants Payouts Claiming</td>\n<td>40</td>\n<td>Moved to next Cycle (26)</td>\n</tr>\n<tr>\n<td><strong>Analysis of Grant Programs</strong></td>\n<td></td>\n<td></td>\n</tr>\n<tr>\n<td>bleu’s Analysis of Grant Programs</td>\n<td>35.33</td>\n<td>Moved to next Cycle (26)</td>\n</tr>\n<tr>\n<td><strong>Voting Analysis</strong></td>\n<td></td>\n<td></td>\n</tr>\n<tr>\n<td>Governance Audit and Dashboard by Blockful</td>\n<td>29</td>\n<td>Approved</td>\n</tr>\n<tr>\n<td>Analyzing DAO Failures - Voting Analysis</td>\n<td>27</td>\n<td>Approved</td>\n</tr>\n<tr>\n<td><strong>Farcaster Social Graph</strong></td>\n<td></td>\n<td></td>\n</tr>\n<tr>\n<td>Farcaster Social Graph</td>\n<td>43.33</td>\n<td>Approved</td>\n</tr>\n<tr>\n<td>CastRank: PageRank for Farcaster</td>\n<td>28.66</td>\n<td>Moved to next Cycle (26)</td>\n</tr>\n<tr>\n<td><strong>Develop non-technical solutions for increasing both voter and token participation in the DAO</strong></td>\n<td></td>\n<td></td>\n</tr>\n<tr>\n<td>Optimism GovQuests</td>\n<td>40.33</td>\n<td>Approved</td>\n</tr>\n<tr>\n<td>Super Contributor Cohort</td>\n<td>37.66</td>\n<td>Approved</td>\n</tr>\n<tr>\n<td>Lighthouse</td>\n<td>27</td>\n<td>Moved to next Cycle (26)</td>\n</tr>\n<tr>\n<td><strong>Decentralized alternative for contract attestation placeholder</strong></td>\n<td></td>\n<td></td>\n</tr>\n<tr>\n<td>No Application</td>\n<td></td>\n<td></td>\n</tr>\n<tr>\n<td><strong>Create and Distribute Videos about Optimism Collective Governance</strong></td>\n<td></td>\n<td></td>\n</tr>\n<tr>\n<td>OP Roundup</td>\n<td>35.66</td>\n<td>Moved to next Cycle (26)</td>\n</tr>\n<tr>\n<td>Integration of Optimism Gov and RPGF into University Courses</td>\n<td></td>\n<td></td>\n</tr>\n<tr>\n<td>Integration of Optimism Gov and RPGF into University Courses</td>\n<td>33.33</td>\n<td>Moved to next Cycle (26)</td>\n</tr>\n<tr>\n<td></td>\n<td></td>\n<td></td>\n</tr>\n<tr>\n<td></td>\n<td></td>\n<td></td>\n</tr>\n<tr>\n<td>INTENT 3A</td>\n<td></td>\n<td></td>\n</tr>\n<tr>\n<td><strong>Optimism Dominance in Yield-Bearing Assets 1</strong></td>\n<td></td>\n<td></td>\n</tr>\n<tr>\n<td>OETH on OP (1 of 3)</td>\n<td>51.66</td>\n<td>Moved to next Cycle (26)</td>\n</tr>\n<tr>\n<td><strong>Optimism Dominance in Yield-Bearing Assets 2</strong></td>\n<td></td>\n<td></td>\n</tr>\n<tr>\n<td>OETH on OP (2 of 3)</td>\n<td>54.33</td>\n<td>Moved to next Cycle (26)</td>\n</tr>\n<tr>\n<td><strong>Optimism Dominance in Yield-Bearing Assets 3</strong></td>\n<td></td>\n<td></td>\n</tr>\n<tr>\n<td>Extra Finance S6 Mission Application</td>\n<td>-</td>\n<td>Moved to next Cycle (26)</td>\n</tr>\n<tr>\n<td><strong>Optimism Dominance in Yield-Bearing Assets 4</strong></td>\n<td></td>\n<td></td>\n</tr>\n<tr>\n<td>GFX Labs</td>\n<td>40.33</td>\n<td>Moved to next Cycle (26)</td>\n</tr>\n<tr>\n<td><strong>Developer Tools</strong></td>\n<td></td>\n<td></td>\n</tr>\n<tr>\n<td>Optimizing Token Launches: Open-Source Crowdsale Factory</td>\n<td>29.66</td>\n<td>Moved to next Cycle (26)</td>\n</tr>\n<tr>\n<td>GhostTags - Open Source tagging, streaming and filtering transactions infrastructure</td>\n<td>38.66</td>\n<td>Moved to next Cycle (26)</td>\n</tr>\n<tr>\n<td>Expansion of Soldeer</td>\n<td>51.33</td>\n<td>Approved</td>\n</tr>\n<tr>\n<td><strong>Research capital migration to the Superchain</strong></td>\n<td></td>\n<td></td>\n</tr>\n<tr>\n<td>Op superchain as Trillion Network stablecoins operational chain</td>\n<td>29.66</td>\n<td>Vetoed by DAB</td>\n</tr>\n<tr>\n<td><strong>Microgrants for Experimental Projects</strong></td>\n<td></td>\n<td></td>\n</tr>\n<tr>\n<td>Soulcial</td>\n<td>36.33</td>\n<td>Moved to next Cycle (26)</td>\n</tr>\n<tr>\n<td>Fractal Visions</td>\n<td>38.66</td>\n<td>Moved to next Cycle (26)</td>\n</tr>\n<tr>\n<td>ForkinWisdom</td>\n<td>32.66</td>\n<td>Moved to next Cycle (26)</td>\n</tr>\n<tr>\n<td>FairSharing - Contribution On-Chain, Reputation building, Decentralize coordination</td>\n<td>40</td>\n<td>Moved to next Cycle (26)</td>\n</tr>\n<tr>\n<td>FrameHack <span class=\"hashtag-raw\">#2</span></td>\n<td>54.66</td>\n<td>Approved</td>\n</tr>\n<tr>\n<td><strong>Optimism as base for LRTs</strong></td>\n<td></td>\n<td></td>\n</tr>\n<tr>\n<td>Renzo Optimism Season 6 Mission Request - Optimism as base for LRTs</td>\n<td>47</td>\n<td>Approved</td>\n</tr>\n<tr>\n<td>Expanding restaking on Optimism</td>\n<td>54</td>\n<td>Approved</td>\n</tr>\n<tr>\n<td><a href=\"http://Ether.fi\">Ether.fi</a> OP Mainnet LRT Grant</td>\n<td>48.33</td>\n<td>Approved</td>\n</tr>\n<tr>\n<td><strong>Experimental Derivative Markets</strong></td>\n<td></td>\n<td></td>\n</tr>\n<tr>\n<td>TLX - Leveraged Tokens Protocol</td>\n<td>55.33</td>\n<td>Moved to next Cycle (26)</td>\n</tr>\n<tr>\n<td><strong>ERC 4337 Data &amp; Attribution Standards for the Superchain</strong></td>\n<td></td>\n<td></td>\n</tr>\n<tr>\n<td>ERC-4337 Data &amp; Attribution Standards for the Superchain - Candide</td>\n<td>42</td>\n<td>Declined</td>\n</tr>\n<tr>\n<td>4337 Data &amp; Standards Group</td>\n<td>51.33</td>\n<td>Approved</td>\n</tr>\n<tr>\n<td><strong>Sequencer commitment games</strong></td>\n<td></td>\n<td></td>\n</tr>\n<tr>\n<td>Sequencer Commitment Games Research</td>\n<td>38.33</td>\n<td>Approved</td>\n</tr>\n<tr>\n<td>Develop Onchain Social Games that attract Builders to Optimism - v2</td>\n<td></td>\n<td></td>\n</tr>\n<tr>\n<td>WannaBet Weekly Tournaments</td>\n<td>34.33</td>\n<td>Approved</td>\n</tr>\n<tr>\n<td><strong>Open-source transaction simulator</strong></td>\n<td></td>\n<td></td>\n</tr>\n<tr>\n<td>Tevm Transaction Simulator</td>\n<td>43.33</td>\n<td>Conditionally Approved</td>\n</tr>\n<tr>\n<td>Open-source Transaction Debugger and Simulator</td>\n<td>47</td>\n<td>Conditionally Approved</td>\n</tr>\n<tr>\n<td><strong>Support on-chain games close to launch</strong></td>\n<td></td>\n<td></td>\n</tr>\n<tr>\n<td>No Application</td>\n<td></td>\n<td></td>\n</tr>\n<tr>\n<td><strong>Optimism as Venture Studio</strong></td>\n<td></td>\n<td></td>\n</tr>\n<tr>\n<td>Super Studios-Optimism as a Venture Studio</td>\n<td>48</td>\n<td>Moved to next Cycle (26)</td>\n</tr>\n<tr>\n<td><strong>Gaming Infra in the Superchain</strong></td>\n<td></td>\n<td></td>\n</tr>\n<tr>\n<td>No Application</td>\n<td></td>\n<td></td>\n</tr>\n<tr>\n<td><strong>Marquee Governance Hackaton</strong></td>\n<td></td>\n<td></td>\n</tr>\n<tr>\n<td>SuperHack Bangkok - Marquee Governance Hackathon</td>\n<td>39.33</td>\n<td>Moved to next Cycle (26)</td>\n</tr>\n<tr>\n<td><strong>Accelerating Game Development in the Superchain</strong></td>\n<td></td>\n<td></td>\n</tr>\n<tr>\n<td>No Application</td>\n<td></td>\n<td></td>\n</tr>\n<tr>\n<td><strong>Create Educational Programs that Empower Developers on Optimism - Modified with Lower Budget</strong></td>\n<td></td>\n<td></td>\n</tr>\n<tr>\n<td>Blockchain Innovation Hub: Optimism chapter</td>\n<td>35.66</td>\n<td>Moved to next Cycle (26)</td>\n</tr>\n<tr>\n<td></td>\n<td></td>\n<td></td>\n</tr>\n<tr>\n<td>INTENT 3B</td>\n<td></td>\n<td></td>\n</tr>\n<tr>\n<td>Superchain Grants (chains only)</td>\n<td></td>\n<td></td>\n</tr>\n<tr>\n<td>Fraxtal Application</td>\n<td>-</td>\n<td>Moved to next Cycle (26)</td>\n</tr>\n<tr>\n<td>Lisk - Intent 3B Grant Application</td>\n<td>-</td>\n<td>Moved to next Cycle (26)</td>\n</tr>\n<tr>\n<td>Mode</td>\n<td>-</td>\n<td>Moved to next Cycle (26)</td>\n</tr>\n</tbody>\n</table>\n</div>\n            <p><small>7 posts - 4 participants</small></p>\n            <p><a href=\"https://gov.optimism.io/t/cycle-25-grants-final-roundup/8687\">Read full topic</a></p>","link":"https://gov.optimism.io/t/cycle-25-grants-final-roundup/8687","pubDate":"Fri, 09 Aug 2024 14:17:06 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"gov.optimism.io-topic-8687"},"source":{"@url":"https://gov.optimism.io/t/cycle-25-grants-final-roundup/8687.rss","#text":"Cycle 25 Grants final roundup"},"filter":false}]}}}