{"rss":{"@version":"2.0","@xmlns:discourse":"http://www.discourse.org/","@xmlns:atom":"http://www.w3.org/2005/Atom","@xmlns:dc":"http://purl.org/dc/elements/1.1/","channel":{"title":"Optimism Collective - Latest topics","link":"https://gov.optimism.io/latest","description":"Latest topics","lastBuildDate":"Sat, 29 Jun 2024 00:47:14 +0000","atom:link":{"@href":"https://gov.optimism.io/latest.rss","@rel":"self","@type":"application/rss+xml"},"item":[{"title":"Grants Council Internal Operating Procedure - Season 6","dc:creator":"Gonna.eth","category":"Grants Updates","description":"<p><em>Huge thanks to <a class=\"mention\" href=\"https://gov.optimism.io/u/danelund.eth\">@danelund.eth</a> for publishing an <a href=\"https://app.charmverse.io/op-grants/season-6-internal-operating-procedure-thoughts-6930451974214464\">An internal operating procedure</a> designed for season 6. He committed to designing the S6 internal operating procedures, and completed this task flawlessly. Thank you, Dane, for your dedication and exceptional work. Your efforts have set a high standard for our council, and we are immensely grateful for your contributions.</em></p>\n<h2><a name=\"grants-council-internal-operating-procedure-1\" class=\"anchor\" href=\"https://gov.optimism.io#grants-council-internal-operating-procedure-1\"></a>Grants Council Internal Operating Procedure</h2>\n<p>The internal procedures in this document govern the activities of the Season 6 Grants Council. The document sets forth the processes the Review Teams will follow in order to screen applications and conduct a formal review of proposals submitted for grants.</p>\n<p><strong>Review Teams</strong></p>\n<p>In the rules below, the Review Teams shall be the Superchain Review Team, the Optimism Mission Review Team, and the Audit and Special Mission Review Team.</p>\n<p>The Milestones and Metrics Team will be a standards team and will not provide a graded review of proposals, other than as specified below or in the charter, in the regular course.</p>\n<p><strong>Cycle Review Procedure</strong></p>\n<p>Each Cycle will have two periods, a Submission Period and a Decision Period.</p>\n<p>The Submission Period is designed to accommodate the submission and fair review of applications. This period is designed to enable an initial review of submissions in advance of the Decision Period.</p>\n<p>The Decision Period is designed to facilitate efficient, sound and diligent grants decisions.</p>\n<p>The Cycle Procedure is set forth in detail in the sections that follow.</p>\n<p><strong>Standard and Procedures for Review Teams</strong></p>\n<p>Each of the three Review Teams will conduct three stages of review within each cycle: an Intake Review; a Preliminary Review; and a Final Review.</p>\n<p><em><strong>Intake Review Standards and Procedures</strong></em></p>\n<p>The first form of review for a given proposal will be an Intake Review. The Intake Review will be a sufficiency review, conducted to eliminate proposals that do not adhere to minimum assessment standards from the later review stages of a given cycle.</p>\n<p>The first reviewer assigned to a proposal shall take one of two actions after an initial review of the proposal, either confirm that the proposal meets the minimum standards for review or reject the proposal for substantive review. A reviewer may reject a proposal for substantive review on one of the following grounds:</p>\n<ul>\n<li>The proposal has been marked ready for submission but has not been completed;</li>\n<li>The proposal lacks sufficient detail for the reviewer to address each item set forth on the relevant review rubric;</li>\n<li>The proposal breaches the Grant Policies or Rules of Engagement for the Optimism Collective;</li>\n<li>The proposal has a clear lack of clarity or effort that it would be premature to review for substance;</li>\n<li>The proposal is not aligned with the mission request objective;</li>\n<li>The proposal request is above the author’s tier;</li>\n<li>The author does not answer questions within 48 hours of intake;</li>\n<li>The OP distribution is not clear or developed;</li>\n<li>The project is not deployed and deployment is a critical feature of assessing the merit of the project; or,</li>\n<li>The application is trying to circumvent grant restrictions set forth by the Optimism Collective</li>\n<li>The application is not for OP Mainnet (Except Intent 3B applications)</li>\n</ul>\n<p>Reviewers shall have the discretion to select any of the above criteria as grounds for rejection.</p>\n<p><em><strong>Preliminary Review Standards and Procedures</strong></em></p>\n<p>If a reviewer determines that a proposal passes the Intake Review, a Preliminary Review will follow. The same reviewer will review the proposal and assign a score based on the relevant Review Rubric for the line of review.</p>\n<p>A reviewer may revisit a proposal that has been updated during the Submission Period to update the score based on any new edits. It is the responsibility of the proposer to notify the relevant Review Team that an edit has been made, and edits may only be considered if time permits during the cycle.</p>\n<p><em><strong>Final Review Standards and Procedures</strong></em></p>\n<p>During the Final Review, the Milestone and Metrics and / or Lead will provide a list of proposals that exceeded the cutoff score specified in the Review Rubric for each line of review. The proposals will then be assigned to two other reviewers on the relevant Review Team to be reviewed in order of Preliminary Review score (highest to lowest). Each reviewer will review the proposal and provide questions or feedback to the proposer. Based on the volume of applications, the Lead will set a date at which proposals will be considered final and no further changes will be considered. At this point, each reviewer will finalize scores.</p>\n<p>Each Review Team will review the list of proposals ordered by an average of the two highest scores received (between the one Preliminary Review and two Final Reviews). Each reviewer will then have the opportunity to agree with the final ranked list or object to specific rankings. If there is an objection to the specific ranking, the relevant proposal will be reviewed by each reviewer on the Review Team and the proposal will receive the average of score of all of the reviewers (including any updated score from the preliminary reviewer).</p>\n<p>Once the Review Team agrees to the ranked list of final scores, the team shall vote on the number of proposals (n) to be named finalists. The number shall be confirmed by a simiple majority of the Review Team. Proposals ranked 1-n shall be named finalists for the cycle.</p>\n<p><strong>Other Review Procedures</strong></p>\n<ul>\n<li><em>Intake Review</em></li>\n</ul>\n<p>The Milestone and Metrics Team and / or Lead shall endeavor to assign proposals for Intake Review chronologically, with the earlier submitted proposals being reviewed first.</p>\n<p>If a proposer challenges the reviewer’s Intake Review determination, the determination will stand for the relevant cycle; however, the Milestone and Metrics Team will consider the objection and review whether the proposer gave due consideration and a reasonable ground for rejection and document the result. The Milestone and Metrics Team may choose to make the results of the objections and determinations available to the community in advance of any future elections.</p>\n<p>If a proposer does not pass Intake Review, no substantive review will follow in a given cycle unless the proposer affirmatively reapplies in a subsequent cycle. The Milestones and Metrics Team or Lead will notify proposers that their proposals did not pass the Intake Review by the end of the Decision Period.</p>\n<p>The Milestone and Metrics Team and / or Lead shall track which reviewer manages the Intake Review in a given cycle and endeavor to assign a different reviewer for Intake Review in a subsequent cycle.</p>\n<ul>\n<li><em>Preliminary Review</em></li>\n</ul>\n<p>Reviewers are encouraged to provide feedback to projects; however, priority should be given to projects that [are within 2 points of passing to the Final Review]. Reviewers are not required to provide feedback during the Preliminary Review, but the Milestone and Metrics Team should endeavor to assess how frequently reviewers provide comments during this period.</p>\n<ul>\n<li><em>Final Review</em></li>\n</ul>\n<p>Proposals that proceed to the Final Review in one cycle will be considered in the Final Review of each subsequent cycle <em>unless</em> the relevant Review Team votes to require the proposer to reapply for further consideration. Requiring reapplication should be reserved for circumstances in which some core aspect of the application would need to change for the Review Team to view the proposal as being competitive.</p>\n<p>Feedback should be provided to each proposal that reaches the Final Review. If a proposal reaches the Final Review in a given cycle by default, feedback may be reiterated or updated based on the degree to which the proposal is updated or remains the same as it had in the prior cycle.</p>\n<ul>\n<li><em>Timing</em></li>\n</ul>\n<p>In general, for each cycle, the Submission Period will last one week and the Decision Period will last two weeks. The Council may amend the duration of each period by a simple majority vote.</p>\n<ul>\n<li><em>Review Rubrics</em></li>\n</ul>\n<p>At the beginning of each cycle (not later than the end of the cycle’s Submission Period), each Review Team will publish a rubric for the relevant lines of review that apply for the cycle. Generally, a line of review refers to a mission or other request for grant proposal that applies to the Review Team.</p>\n<p>Rubrics should articulate the categories of review for a line of review, the number of points a category may receive, and the factors that differentiate scores within each category. Each rubric should specify a cutoff score for a project to reach the Final Review.</p>\n<p>The Lead may designate reviewers to manage the drafting and proposed revisions to a given rubric. Rubrics and amendments shall be approved by a simple majority vote of the relevant Review Team.</p>\n<p><strong>Team Procedures</strong></p>\n<ul>\n<li><strong>Superchain Team</strong></li>\n</ul>\n<p>The Superchain Team will consist of the three reviewers with the highest vote count in the reviewer election. A reviewer may elect to step down from the Superchain Team at the beginning of the Season. If a reviewer steps down, the reviewer with the next highest vote count will automatically become a member of the Superchain Team and the departing reviewer will become a member of the Optimism Mission Team. The Lead will confirm any changes on the governance forum for the Optimism Collective promptly.</p>\n<p>The Superchain Team may adopt Review Rubrics or amend its own procedures (to the extent that they do not conflict with the Grants Council Season 6 Charter or these Internal Operating Procedures) by a 2/3 vote.</p>\n<ul>\n<li><strong>Audit and Special Mission Review Team</strong></li>\n</ul>\n<p>At the beginning of each Cycle, the Lead shall coordinate with the Lead of the Developer Advisory Board to designate a reviewer from the Developer Advisory Board.</p>\n<p>Any Special Mission shall be designated a Special Mission at the beginning of a cycle by the Lead, provided a simple majority vote of the Optimism Mission Review Team votes in favor of the designation.</p>\n<ul>\n<li><strong>Milestone and Metrics Team</strong></li>\n</ul>\n<p>The Milestones and Metrics Team will be responsible for assessing and tracking milestones for grants that have reached the Final Review as well as finalists from prior seasons. The Milestone and Metrics team will designate a visible space for the community to view its determination on milestones.</p>\n<p><em>Prospective Proposals</em></p>\n<p>In order to be considered as a finalist, a proposal must include critical milestones. Critical milestones are intended to show good faith effort and a baseline of success toward the goals articulated in the grant proposal.</p>\n<p>The Milestone and Metrics Team will confirm Milestone Guidelines for assessing milestone sufficiency at the beginning of the Season by majority vote of the Team. The Milestone Guidelines will be aimed at creating discrete, trackable milestones for each successful proposal.</p>\n<p>At the beginning of each Final Review for each cycle, the Milestones and Metrics Team will review each proposal selected by each Review Team for Final Review to determine whether the proposal’s milestones meet the standard of sufficiency set forth in the Milestones Guidelines.</p>\n<p>In order to be eligible to become a finalist, a proposal must receive a favorable vote of a majority of the Milestones and Metrics Team members verifying that the proposal’s milestones meet the standards of sufficiency.</p>\n<p><em>Past Proposals</em></p>\n<p>The Milestones and Metrics Team shall make recommendations to the Foundation or Optimism Collective as to whether or not to proceed with the remainder of a grant from a prior Season. In general, the Milestones and Metrics Team shall not recommend proceeding with a project unless all critical milestones have been achieved (per the vote of the Team).</p>\n<p>The Milestone and Metrics Team is generally responsible for voting on whether or not milestones have been achieved. In circumstances where the Team determines that it would require expertise beyond the capacity of the Team, the Milestone and Metrics Team Lead may submit a milestone for consideration of the Team that originally voted to designate the proposal as a prior finalist. In such cases, the majority vote of the relevant team shall be considered determinative.</p>\n<p><em>Standard procedure</em></p>\n<p>Proposals for the continuation of a grant should be submitted to the Milestones Hub.</p>\n<p>In general, proposals will be reviewed only after a project confirms that all relevant critical milestones have been completed. However, the Milestone and Metrics Team may consider requests to review individual milestones in the case that a project requires feedback on a milestone to continue.</p>\n<p>Absent an approval for a greater amount of time, critical milestones will be considered past due after six months from the delivery of the grant for Experiments proposals and twelve months from the locking of the grant for Builders proposals.</p>\n<p>Milestones and Metrics votes shall be recorded.</p>\n<p><em>Other procedures</em></p>\n<p>In cases where a project has failed to complete its critical milestones in the allotted time (either the six or twelve month defaults for legacy Experiments and Builders or the time allotted on the specific proposal, whichever is greater), the Team will default to recommending against proceeding with any further steps of the grant.</p>\n<p>In the case where a proposer makes a proposal to change the substance (or extend the time) of a critical milestone, the Team may consider the change only if (a) the Team determines that there is substantial good reason to support the request and (b) at least 66% of all of the Council reviewers vote in favor of the proposal.</p>\n<p>For milestones pertinent to the Audit and Special Missions Team, the Team shall wait for the Developer Advisory Board to confirm the completion of the critical milestones prior to confirming completion to the Foundation.</p>\n<p>At any point, if the Council becomes aware of a matter that should be recommended for a code of conduct violation, the Council may revoke its recommendation to move forward with a grant.</p>\n<p>The guidance in this section yields to any contrary rule, guidance, or vote from Token House or the Foundation.</p>\n<p><em>Reviewer Metrics Accountability</em></p>\n<p>The Milestone and Metrics team will adopt any specific metrics and processes as mandated by the charter.</p>\n<p><strong>Official Record and Rule Changes</strong></p>\n<p>The Council will maintain a tracker of proposals considered, finalists named, milestones for finalists, and the progress / completion of milestones.</p>\n<p>On a bi-weekly basis, the Council may review the effectiveness of its internal procedures and make proposals for improvement. The Council can amend the internal procedures by a simple majority vote of the members of the Council; and, each Team may amend the internal procedures that pertain to the specific Team (insofar as the amendment does not conflict with the Season 6 Charter or these Internal Operating Procedures) by a simple majority vote of the Team. Any amendment to these Internal Operating Procedures must be recorded as a comment to this post and reflected on the Landing Page. It is recommended that the Team defer the effectiveness of an amendment until the next review cycle, unless the amendment creates a critical improvement to the review process.</p>\n<p><strong>Rules of Decision</strong></p>\n<p>If one or more Team members abstains from a vote, a vote will pass by the simple majority vote of the remaining members, provided there are more than one voting members remaining. If only one member of a Team votes, the result will be to take no action on the proposed matter. For instance, if the matter being voted on relates to whether or not to include an application in the final review, the result will be not to include the application in the final review.</p>\n<p>Any Council-wide votes must include members of each Team to achieve a quorum.</p>\n<p>The Lead may correct any clear errors in the Internal Procedures or resolve any conflicting provisions. For resolving conflicts, the Lead may submit a question about the best resolution to a vote of the Team members, the results of which may be recorded on the Landing Page.</p>\n            <p><small>1 post - 1 participant</small></p>\n            <p><a href=\"https://gov.optimism.io/t/grants-council-internal-operating-procedure-season-6/8424\">Read full topic</a></p>","link":"https://gov.optimism.io/t/grants-council-internal-operating-procedure-season-6/8424","pubDate":"Sat, 29 Jun 2024 00:47:14 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"gov.optimism.io-topic-8424"},"source":{"@url":"https://gov.optimism.io/t/grants-council-internal-operating-procedure-season-6/8424.rss","#text":"Grants Council Internal Operating Procedure - Season 6"},"filter":false},{"title":"Zenbit Logs - Builder Communication Thread","dc:creator":"Zenbit","category":"Updates  and Announcements 📢","description":"<p></p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://europe1.discourse-cdn.com/bc41dd/original/2X/6/6f4976d3e338c36b806ac96da111fb458841138b.png\" data-download-href=\"/uploads/short-url/fSuowdQM8LLJcIJJSWl48GD1Cwb.png?dl=1\" title=\"Zenbit\" rel=\"noopener nofollow ugc\"><img src=\"https://europe1.discourse-cdn.com/bc41dd/optimized/2X/6/6f4976d3e338c36b806ac96da111fb458841138b_2_690x230.png\" alt=\"Zenbit\" data-base62-sha1=\"fSuowdQM8LLJcIJJSWl48GD1Cwb\" width=\"690\" height=\"230\" srcset=\"https://europe1.discourse-cdn.com/bc41dd/optimized/2X/6/6f4976d3e338c36b806ac96da111fb458841138b_2_690x230.png, https://europe1.discourse-cdn.com/bc41dd/original/2X/6/6f4976d3e338c36b806ac96da111fb458841138b.png 1.5x, https://europe1.discourse-cdn.com/bc41dd/original/2X/6/6f4976d3e338c36b806ac96da111fb458841138b.png 2x\" data-dominant-color=\"1A475D\"></a></div><p></p>\n<h2><a name=\"tl-dr-1\" class=\"anchor\" href=\"https://gov.optimism.io#tl-dr-1\"></a>TL, DR</h2>\n<p>Zenbit is an R&amp;D laboratory building public goods for cities. We have been deploying our contracts in the Optimism network and testnet since 2022, and now we are building Zenbit Badges, a dapp to attest in OP Mainnet the progress of new users in their journey to use decentralized technologies; along with OPcity, a research, and implementation of the OP stack that aims to expand the Fault Proofs memory capabilities to manage disputes from OPml and oppAI states along with the ones produced by OP geth. We will share updates on these projects in this post.</p>\n<h2><a name=\"h-1-about-us-2\" class=\"anchor\" href=\"https://gov.optimism.io#h-1-about-us-2\"></a>1. About Us</h2>\n<p><a href=\"https://mirror.xyz/zenbit.eth/AJa9e4a4_gXCIwL1ijaYkhgVD_i3FvO4PuhqG-rTKlw\" rel=\"noopener nofollow ugc\">Zenbit began</a> by addressing the needs of a neighborhood in Querétaro, Mexico, collaborating with residents and local government to implement transparent and sustainable solutions. Over time, <a href=\"https://mirror.xyz/zenbit.eth/2-Hj-iXbBldEtQKmBttx1-WOokgav4OAT3Bmd1uZK1U\" rel=\"noopener nofollow ugc\">we have evolved</a> into an organization that connects regional and international talent to build decentralized infrastructure and applications using Open Source Software (OSS) and advanced Ethereum tools, aiming to improve urban management and enhance citizens’ quality of life.</p>\n<h3><a name=\"zenbit-reports-3\" class=\"anchor\" href=\"https://gov.optimism.io#zenbit-reports-3\"></a>Zenbit Reports</h3>\n<ul>\n<li><a href=\"https://mirror.xyz/zenbit.eth/AJa9e4a4_gXCIwL1ijaYkhgVD_i3FvO4PuhqG-rTKlw\" rel=\"noopener nofollow ugc\">Zenbit Report # 1</a></li>\n<li><a href=\"https://mirror.xyz/zenbit.eth/2-Hj-iXbBldEtQKmBttx1-WOokgav4OAT3Bmd1uZK1U\" rel=\"noopener nofollow ugc\">Zenbit Report # 2</a></li>\n</ul>\n<h3><a name=\"zenbit-contributors-4\" class=\"anchor\" href=\"https://gov.optimism.io#zenbit-contributors-4\"></a>Zenbit Contributors</h3>\n<ul>\n<li><a class=\"mention\" href=\"https://gov.optimism.io/u/habacuc.eth\">@habacuc.eth</a> / <a href=\"https://github.com/HabacucMX\" rel=\"noopener nofollow ugc\">Founder, R&amp;D</a></li>\n<li><a class=\"mention\" href=\"https://gov.optimism.io/u/kira\">@kira</a> / <a href=\"https://github.com/shyam-patel-kira\" rel=\"noopener nofollow ugc\">Protocol Engineer</a></li>\n<li><a href=\"https://x.com/alerex_eth\" rel=\"noopener nofollow ugc\">Alessandro</a> / <a href=\"https://github.com/alessandromaci\" rel=\"noopener nofollow ugc\">Smart Contracts and Backend Dev</a></li>\n<li><a href=\"https://x.com/Markkos89\" rel=\"noopener nofollow ugc\">Marcos</a> / <a href=\"https://github.com/Markkos89\" rel=\"noopener nofollow ugc\">Software Engineer</a></li>\n<li><a href=\"https://x.com/Dharmik79\" rel=\"noopener nofollow ugc\">Dharmik</a> / <a href=\"https://github.com/Dharmik79\" rel=\"noopener nofollow ugc\">Software Engineer</a></li>\n<li><a href=\"https://www.linkedin.com/in/maggiehdz/\" rel=\"noopener nofollow ugc\">Maggie / IP and Operations</a></li>\n</ul>\n<h3><a name=\"zenbit-onchain-5\" class=\"anchor\" href=\"https://gov.optimism.io#zenbit-onchain-5\"></a>Zenbit Onchain</h3>\n<ul>\n<li><a href=\"https://optimistic.etherscan.io/address/0xeCB4C1245665e8A1F43826355aaB0Dd6bF336e05\" rel=\"noopener nofollow ugc\">zenbit.eth</a></li>\n<li><a href=\"https://optimistic.etherscan.io/address/0x111D456edA93461D831cEA8A1598293e12B98393\" rel=\"noopener nofollow ugc\">Zenbit multisig</a></li>\n<li><a href=\"https://optimistic.etherscan.io/address/0x3a250dfbddf46f798ebd2ef67ddff10014946e9b\" rel=\"noopener nofollow ugc\">Zenbit treasury</a></li>\n</ul>\n<h3><a name=\"previous-contributions-to-the-op-collective-6\" class=\"anchor\" href=\"https://gov.optimism.io#previous-contributions-to-the-op-collective-6\"></a>Previous contributions to the OP Collective</h3>\n<ol>\n<li><strong>Zengo:</strong> A platform for managing public proposals for improving urban spaces and their positive impact on decentralized urban governance. We participated in this project in Retro PGF3.\n<ul>\n<li><a href=\"https://github.com/zenbitETH/zengo\" rel=\"noopener nofollow ugc\">Zengo Code Repo</a></li>\n<li><a href=\"https://round3.optimism.io/projects/0xa0e0d386a862f8f1ee625bf5837bfb8ef5a8201d70c459efbe9172602ff3d831\" rel=\"noopener nofollow ugc\">Zengo @ OP RetroPGF3</a></li>\n</ul>\n</li>\n<li><strong>Eneagon:</strong> A proof of concept of a pre-filtering solution for public goods funding that enables builders to connect with their stakeholders with code upgrades and onchain data. We participated in this project in RetroPGF2.\n<ul>\n<li><a href=\"https://github.com/zenbitETH/eneagon\" rel=\"noopener nofollow ugc\">Eneagon Code Repo</a></li>\n<li><a href=\"https://x.com/zenbitMX/status/1637335681348378626\" rel=\"noopener nofollow ugc\">Eneagon @ OP RetroPGF2</a></li>\n</ul>\n</li>\n</ol>\n<h2><a name=\"h-2-ongoing-op-projects-7\" class=\"anchor\" href=\"https://gov.optimism.io#h-2-ongoing-op-projects-7\"></a><strong>2. Ongoing OP projects:</strong></h2>\n<ol>\n<li><strong>OP city:</strong> A research and implementation of the OP stack to develop a rollup dedicated to cities. It integrates functionalities for Large Language Models (LLM) inferences in public data processing through <a href=\"https://arxiv.org/abs/2401.17555\" rel=\"noopener nofollow ugc\">Optimistic Machine Learning (opML)</a> and provides privacy tools via ZK and <a href=\"https://arxiv.org/abs/2402.15006\" rel=\"noopener nofollow ugc\">Optimistic Privacy-Preserving AI (oppAI)</a>. We will research the compatibility of the OP stack’s Canon Fault Proof VM with the opML’s Multi-Phase Fault Proof protocol. The goal is to implement a custom Fault Dispute Game that manages the challenges related to data availability states from the L2 rollup and the computation results from the Deep Neural Networks (DNN) of the multi-phase opML. This project was proposed in collaboration with Dr. Cathie for a <a href=\"https://app.charmverse.io/op-grants/page-1306815702055122\" rel=\"noopener nofollow ugc\">Builders Grant during Season 5</a> in Intent 1: Progress towards technical decentralization, which was <a href=\"https://gov.optimism.io/t/cycle-22-final-grants-roundup/8086\">granted during cycle 22</a>. It will be developed over 12 months starting this month.\n<ul>\n<li><a href=\"https://app.charmverse.io/op-grants/page-1306815702055122\" rel=\"noopener nofollow ugc\">OP City Stack governance proposal</a></li>\n<li><a href=\"https://github.com/zenbitETH/OPcity/milestones\" rel=\"noopener nofollow ugc\">OP City Stack milestones</a></li>\n</ul>\n</li>\n<li><strong>Zenbit Badges:</strong> An on-chain platform deployed on the OP mainnet, using the Ethereum Attestation Service (EAS) for skills certification, leveraging Optimism’s infrastructure. It has a contract deployed on the OP mainnet that allows registering events, mentors, and participants to issue automated attestations on behalf of badges.zenbit.eth. It currently verifies Optimism Onboarding and DAO Formation.\n<ul>\n<li><a href=\"https://optimistic.etherscan.io/address/0xe383f2b3ff9024baa09b33923b8dbd0f2af98ad0#code\" rel=\"noopener nofollow ugc\">Zenbit Badges contract (OP mainnet)</a></li>\n<li>Optimism Onboarding Badge / <a href=\"https://optimism.easscan.org/schema/view/0xe3990a5b917495816f40d1c85a5e0ec5ad3dd66e40b129edb0f0b3a381790b7b\" rel=\"noopener nofollow ugc\">EAS Schema #423</a></li>\n<li>DAO Formation Badge / <a href=\"https://optimism.easscan.org/schema/view/0xddc12d29e4863e857d1b6429f2afd4bf3d687110bbb425e730b87d5f1efcda5a\" rel=\"noopener nofollow ugc\">EAS Schema #424</a></li>\n<li><a href=\"https://github.com/zenbitETH/Zenbit-Badges\" rel=\"noopener nofollow ugc\">Zenbit Badges GitHub</a></li>\n<li><a href=\"https://badges.zenbit.mx/\" rel=\"noopener nofollow ugc\">Zenbit Badges Platform</a></li>\n</ul>\n</li>\n</ol>\n<h2><a name=\"h-3-other-initiatives-8\" class=\"anchor\" href=\"https://gov.optimism.io#h-3-other-initiatives-8\"></a><strong>3. Other initiatives</strong></h2>\n<p>We have also participated in other initiatives related to the Decentralized Technologies ecosystem:</p>\n<ol>\n<li>Development of Fundcaster during the <a href=\"https://ethglobal.com/showcase/fundcaster-34qsd\" rel=\"noopener nofollow ugc\">Frames Hackathon 2024</a>, a Frame that facilitates the creation of funding campaigns on the Farcaster social network.</li>\n<li>Participation in Optimism’s “We Love the Art” contest, presenting <a href=\"https://app.manifold.xyz/c/zenbitcity\" rel=\"noopener nofollow ugc\">“Zenbit City”</a> an AI-generated artwork representing our vision of integrating public goods in urban environments.</li>\n</ol>\n<p>For the next 12 months, Zenbit will focus on the integral development of Zenbit Badges and OP City Stack. We plan to collaborate closely with local universities, research centers, and civil organizations to promote the adoption of decentralized technologies, facilitate connections between emerging regional talents and global experts, and encourage technology transfer of the OP stack. In this post we will publishing updates for our projects related to the Superchain, we appreciate any feedback about our work and lets connect if you are interested in contributing to any of these developments.</p>\n<p>Stay Optimistic! <img src=\"https://emoji.discourse-cdn.com/twitter/red_circle.png?v=12\" title=\":red_circle:\" class=\"emoji\" alt=\":red_circle:\" loading=\"lazy\" width=\"20\" height=\"20\"><img src=\"https://emoji.discourse-cdn.com/twitter/sparkles.png?v=12\" title=\":sparkles:\" class=\"emoji\" alt=\":sparkles:\" loading=\"lazy\" width=\"20\" height=\"20\"></p>\n            <p><small>1 post - 1 participant</small></p>\n            <p><a href=\"https://gov.optimism.io/t/zenbit-logs-builder-communication-thread/8411\">Read full topic</a></p>","link":"https://gov.optimism.io/t/zenbit-logs-builder-communication-thread/8411","pubDate":"Fri, 28 Jun 2024 16:50:31 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"gov.optimism.io-topic-8411"},"source":{"@url":"https://gov.optimism.io/t/zenbit-logs-builder-communication-thread/8411.rss","#text":"Zenbit Logs - Builder Communication Thread"},"filter":false},{"title":"Season 6: Voting Cycle Guides","dc:creator":"system","category":"Updates  and Announcements 📢","description":"<h1><a name=\"season-6-voting-cycle-guides-1\" class=\"anchor\" href=\"https://gov.optimism.io#season-6-voting-cycle-guides-1\"></a>Season 6: Voting Cycle Guides</h1>\n<p>Based on delegate feedback, we will post step-by-step guides for each Voting Cycle in Season 6. We will update this thread with each cycle’s guide.</p>\n            <p><small>4 posts - 2 participants</small></p>\n            <p><a href=\"https://gov.optimism.io/t/season-6-voting-cycle-guides/8410\">Read full topic</a></p>","link":"https://gov.optimism.io/t/season-6-voting-cycle-guides/8410","pubDate":"Fri, 28 Jun 2024 16:27:52 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"gov.optimism.io-topic-8410"},"source":{"@url":"https://gov.optimism.io/t/season-6-voting-cycle-guides/8410.rss","#text":"Season 6: Voting Cycle Guides"},"filter":false},{"title":"Mission Request - open finance","dc:creator":"Pr0","category":"Grants  🏹","description":"<h3><a name=\"mission-request-summary-1\" class=\"anchor\" href=\"https://gov.optimism.io#mission-request-summary-1\"></a>Mission Request Summary</h3>\n<p><strong>S6 Intent:</strong> 3<br>\nGrow application developers on the Superchain by supporting the development and deployment of open-source financial applications and payment infrastructure.</p>\n<p><strong>Proposer:</strong> PR0 (discord notpr0)</p>\n<p><strong>Total Grant Amount:</strong> 400k OP</p>\n<h3><a name=\"background-2\" class=\"anchor\" href=\"https://gov.optimism.io#background-2\"></a><strong>Background:</strong></h3>\n<p>The concept of     open finance is rooted in the foundational principles of cryptocurrencies like Bitcoin and Ethereum—decentralization, transparency, and permissionless access. Open finance aims to build a financial system that is inclusive, resilient, and free from the constraints of traditional financial institutions. It seeks to empower individuals by providing them with direct control over their financial assets and interactions.</p>\n<p>Despite the significant growth of the crypto space, much of the activity remains speculative, with a focus on trading and investment rather than real-world utility. This speculative behavior has overshadowed the transformative potential of decentralized finance (DeFi) to create a more inclusive and efficient financial system. Open finance is about making crypto actually usable for everyday people, moving beyond speculation to practical applications that can improve lives.</p>\n<h3><a name=\"mission-summary-3\" class=\"anchor\" href=\"https://gov.optimism.io#mission-summary-3\"></a><strong>Mission Summary:</strong></h3>\n<p>The Open Finance Initiative aims to develop and promote completely open-source, consumer-focused financial tools and applications that align with the original ethos of cryptocurrencies. This mission focuses on creating innovative use cases and applications that have been live for less than six months, fostering a decentralized financial ecosystem that is transparent, permissionless, and resilient.</p>\n<h3><a name=\"goal-4\" class=\"anchor\" href=\"https://gov.optimism.io#goal-4\"></a><strong>Goal:</strong></h3>\n<p>To support the development and deployment of open-source financial applications and payment infrastructure, enhancing consumer access to decentralized finance (DeFi) within the Optimism Superchain.</p>\n<p><strong>Should this Mission be fulfilled by one or multiple applicants:</strong> Multiple</p>\n<hr>\n<h3><a name=\"how-will-this-mission-request-help-accomplish-the-above-intent-5\" class=\"anchor\" href=\"https://gov.optimism.io#how-will-this-mission-request-help-accomplish-the-above-intent-5\"></a>How will this Mission Request help accomplish the above Intent?</h3>\n<p>This mission will support Intent 3 by fostering a thriving developer ecosystem through the development and deployment of open-source financial applications. By funding new projects and engaging active developers, the initiative will bootstrap the supply side of the market, creating valuable, demand-generating applications on any OP Chain in the Superchain. This will help grow the number of active developers from 6,800 to the target of 9,500, thereby driving network usage and adoption.</p>\n<h3><a name=\"what-is-required-to-execute-this-mission-request-6\" class=\"anchor\" href=\"https://gov.optimism.io#what-is-required-to-execute-this-mission-request-6\"></a>What is required to execute this Mission Request?</h3>\n<ol>\n<li><strong>Development Teams:</strong> Applicants must have launched their application or tool within the last six months and demonstrate a commitment to open-source principles. The entire project, including any front end, must be fully open-source, novel, and payment-focused.</li>\n<li><strong>Documentation:</strong> Comprehensive and accessible documentation must be provided for all projects.</li>\n<li><strong>Budget Allocation:</strong> Up to 100k OP per project, with a total of 500k OP available.</li>\n<li><strong>Community Engagement:</strong> Funds can be used for marketing and user acquisition to ensure adoption and feedback.</li>\n</ol>\n<h3><a name=\"requirements-for-participating-7\" class=\"anchor\" href=\"https://gov.optimism.io#requirements-for-participating-7\"></a>Requirements for participating</h3>\n<ol>\n<li><strong>Open Source Commitment:</strong> All projects must be completely open-source.</li>\n<li><strong>Project Age:</strong> Only applications and tools that have been live for less than six months are eligible.</li>\n<li><strong>Funding Cap:</strong> Maximum grant amount per project is 100k OP.</li>\n<li><strong>Focus on Consumers:</strong> Projects must be consumer-focused, enhancing accessibility and usability of decentralized finance.</li>\n<li><strong>Disclosure:</strong> Applicants are expected to disclose their project’s details, development timeline, and milestones.</li>\n</ol>\n<h3><a name=\"how-should-governance-participants-measure-impact-upon-completion-of-this-mission-8\" class=\"anchor\" href=\"https://gov.optimism.io#how-should-governance-participants-measure-impact-upon-completion-of-this-mission-8\"></a>How should governance participants measure impact upon completion of this Mission?</h3>\n<p>Governance participants should measure impact based on the following:</p>\n<h4><a name=\"milestones-9\" class=\"anchor\" href=\"https://gov.optimism.io#milestones-9\"></a>Milestones:</h4>\n<ul>\n<li><strong>Q1:</strong> Initial development and proof of concept for funded projects.</li>\n<li><strong>Q2:</strong> Detailed docs for tools as well as demo.</li>\n<li><strong>Q3:</strong> Deployment and integration within the Superchain ecosystem, growth of user base.</li>\n<li><strong>Q4:</strong> Full deployment, ongoing support, and evaluation of impact.</li>\n</ul>\n<h4><a name=\"metrics-10\" class=\"anchor\" href=\"https://gov.optimism.io#metrics-10\"></a>Metrics:</h4>\n<ol>\n<li><strong>Number of Active Developers and Contributors:</strong> Measure the engagement and participation of developers in the funded projects.</li>\n<li><strong>Number of Deployed and Actively Used Financial Tools:</strong> Track the number of new open-source financial applications or tools that are deployed and actively used within the Superchain.</li>\n<li><strong>User Adoption Rate and Total Number of Unique Users:</strong> Monitor the adoption rate and total number of unique users engaging with the new financial tools and applications.</li>\n<li><strong>Community Feedback and Participation:</strong> Evaluate the feedback from the community and participation in governance processes related to the funded projects.</li>\n</ol>\n            <p><small>1 post - 1 participant</small></p>\n            <p><a href=\"https://gov.optimism.io/t/mission-request-open-finance/8409\">Read full topic</a></p>","link":"https://gov.optimism.io/t/mission-request-open-finance/8409","pubDate":"Fri, 28 Jun 2024 15:22:18 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"gov.optimism.io-topic-8409"},"source":{"@url":"https://gov.optimism.io/t/mission-request-open-finance/8409.rss","#text":"Mission Request - open finance"},"filter":false},{"title":"Countdown to Superchain Space Brussels: Connect, Learn, and Collaborate!","dc:creator":"SuperchainEco","category":"✨ General","description":"<p>We’re only 11 days away from Superchain Space Brussels! <img src=\"https://emoji.discourse-cdn.com/twitter/belgium.png?v=12\" title=\":belgium:\" class=\"emoji\" alt=\":belgium:\" loading=\"lazy\" width=\"20\" height=\"20\"><img src=\"https://emoji.discourse-cdn.com/twitter/house.png?v=12\" title=\":house:\" class=\"emoji\" alt=\":house:\" loading=\"lazy\" width=\"20\" height=\"20\"></p>\n<p>Just 2 minutes from the ETHCC venue, you’ll find the <a href=\"https://lu.ma/superchainspace\" rel=\"noopener nofollow ugc\">Superchain Space</a>, where leading Optimism Collective builders and citizens will gather to build relationships, share stories, and exchange knowledge.</p>\n<p>Explore who’s involved, what to expect, and apply to speak or attend! <img src=\"https://emoji.discourse-cdn.com/twitter/point_down.png?v=12\" title=\":point_down:\" class=\"emoji\" alt=\":point_down:\" loading=\"lazy\" width=\"20\" height=\"20\"><br>\n<a href=\"https://www.superchain.eco/space\" rel=\"noopener nofollow ugc\">Website</a> | <a href=\"https://x.com/SuperchainSpace/status/1806320089735585881\" rel=\"noopener nofollow ugc\">Announcement Tweet</a> | <a href=\"https://tally.superchain.eco/space\" rel=\"noopener nofollow ugc\">Speaker Application</a> | <a href=\"https://lu.ma/superchainspace\" rel=\"noopener nofollow ugc\">Lu Ma Event Page</a></p>\n<p></p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://europe1.discourse-cdn.com/bc41dd/original/2X/5/5dd664042c099e7dd5b716d3f88766248d37462d.jpeg\" data-download-href=\"/uploads/short-url/do7Jy7IOC1HuwmUQUzu3FGhvQ3b.jpeg?dl=1\" title=\"Twitter hp-1\" rel=\"noopener nofollow ugc\"><img src=\"https://europe1.discourse-cdn.com/bc41dd/optimized/2X/5/5dd664042c099e7dd5b716d3f88766248d37462d_2_517x282.jpeg\" alt=\"Twitter hp-1\" data-base62-sha1=\"do7Jy7IOC1HuwmUQUzu3FGhvQ3b\" width=\"517\" height=\"282\" srcset=\"https://europe1.discourse-cdn.com/bc41dd/optimized/2X/5/5dd664042c099e7dd5b716d3f88766248d37462d_2_517x282.jpeg, https://europe1.discourse-cdn.com/bc41dd/optimized/2X/5/5dd664042c099e7dd5b716d3f88766248d37462d_2_775x423.jpeg 1.5x, https://europe1.discourse-cdn.com/bc41dd/optimized/2X/5/5dd664042c099e7dd5b716d3f88766248d37462d_2_1034x564.jpeg 2x\" data-dominant-color=\"1C1516\"></a></div><p></p>\n<p>The Superchain has grown into a diverse network of chains and projects united by a common goal. We’re thrilled by the support and unity of the OP chains and are excited to have <a href=\"https://www.optimism.io/\" rel=\"noopener nofollow ugc\">Optimism</a>, <a href=\"https://celo.org/\" rel=\"noopener nofollow ugc\">Celo</a>, <a href=\"https://worldcoin.org/\" rel=\"noopener nofollow ugc\">Worldcoin</a>, <a href=\"https://kroma.network/\" rel=\"noopener nofollow ugc\">Kroma Network</a>, <a href=\"https://www.mintchain.io/\" rel=\"noopener nofollow ugc\">Mint Blockchain</a>, <a href=\"https://lisk.com/\" rel=\"noopener nofollow ugc\">Lisk</a>, and <a href=\"https://cyber.co/\" rel=\"noopener nofollow ugc\">BuildOnCyber</a> as Chain Partners.</p>\n<p></p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://europe1.discourse-cdn.com/bc41dd/original/2X/8/8de1b5fd28218ca83bab6014a4ea194c77787396.jpeg\" data-download-href=\"/uploads/short-url/kf8UdkuI5djbAuy3bfPLMGfU3tk.jpeg?dl=1\" title=\"Twitter Partners\" rel=\"noopener nofollow ugc\"><img src=\"https://europe1.discourse-cdn.com/bc41dd/optimized/2X/8/8de1b5fd28218ca83bab6014a4ea194c77787396_2_517x291.jpeg\" alt=\"Twitter Partners\" data-base62-sha1=\"kf8UdkuI5djbAuy3bfPLMGfU3tk\" width=\"517\" height=\"291\" srcset=\"https://europe1.discourse-cdn.com/bc41dd/optimized/2X/8/8de1b5fd28218ca83bab6014a4ea194c77787396_2_517x291.jpeg, https://europe1.discourse-cdn.com/bc41dd/optimized/2X/8/8de1b5fd28218ca83bab6014a4ea194c77787396_2_775x436.jpeg 1.5x, https://europe1.discourse-cdn.com/bc41dd/optimized/2X/8/8de1b5fd28218ca83bab6014a4ea194c77787396_2_1034x582.jpeg 2x\" data-dominant-color=\"0F0F0F\"></a></div><p></p>\n<p>At Superchain Space, those at the forefront of tech, governance, and business operations will exchange insights in various roundtables, talks, and workshops.</p>\n<p>We still have some final slots available for those with something valuable to share.</p>\n<p>Apply to speak or host a roundtable <img src=\"https://emoji.discourse-cdn.com/twitter/point_down.png?v=12\" title=\":point_down:\" class=\"emoji\" alt=\":point_down:\" loading=\"lazy\" width=\"20\" height=\"20\"></p><aside class=\"onebox allowlistedgeneric\" data-onebox-src=\"https://tally.superchain.eco/space\">\n  <header class=\"source\">\n      <img src=\"https://europe1.discourse-cdn.com/bc41dd/original/2X/8/841b1bd6e3ebbe766c33f637efb142ddddf9a871.png\" class=\"site-icon\" data-dominant-color=\"4B4B4B\" width=\"170\" height=\"170\">\n\n      <a href=\"https://tally.superchain.eco/space\" target=\"_blank\" rel=\"noopener nofollow ugc\">tally.superchain.eco</a>\n  </header>\n\n  <article class=\"onebox-body\">\n    <div class=\"aspect-image\" style=\"--aspect-ratio:690/388;\"><img src=\"https://europe1.discourse-cdn.com/bc41dd/optimized/2X/5/5a2959f584128420350b6d2dfd251eda900fa508_2_690x388.png\" class=\"thumbnail\" data-dominant-color=\"181314\" width=\"690\" height=\"388\"></div>\n\n<h3><a href=\"https://tally.superchain.eco/space\" target=\"_blank\" rel=\"noopener nofollow ugc\">Superchain Space Speaker Application</a></h3>\n\n  <p>Apply to become a Superchain Space speaker for July 8th!</p>\n\n\n  </article>\n\n  <div class=\"onebox-metadata\">\n    \n    \n  </div>\n\n  <div style=\"clear: both\"></div>\n</aside>\n\n<p>Collaboration is key—we’re happy to announce we’re collaborating with <a href=\"https://x.com/opgathering\" rel=\"noopener nofollow ugc\">OP Gathering</a> and will have a pop-up booth at their event on the 9th. The gathering is gearing up to be a big OP festival that goes on until the night.</p>\n<p>Learn more and apply to join the event <img src=\"https://emoji.discourse-cdn.com/twitter/arrow_down_small.png?v=12\" title=\":arrow_down_small:\" class=\"emoji\" alt=\":arrow_down_small:\" loading=\"lazy\" width=\"20\" height=\"20\"></p><aside class=\"onebox allowlistedgeneric\" data-onebox-src=\"https://www.optimistic-gathering.com/\">\n  <header class=\"source\">\n      <img src=\"https://europe1.discourse-cdn.com/bc41dd/original/2X/4/4288501df6cb8885a00b4f9aae498db735353eb7.png\" class=\"site-icon\" data-dominant-color=\"FF2F46\" width=\"32\" height=\"32\">\n\n      <a href=\"https://www.optimistic-gathering.com/\" target=\"_blank\" rel=\"noopener nofollow ugc\">optimistic-gathering.com</a>\n  </header>\n\n  <article class=\"onebox-body\">\n    \n\n<h3><a href=\"https://www.optimistic-gathering.com/\" target=\"_blank\" rel=\"noopener nofollow ugc\">Optimistic Gathering: Our Community Conference</a></h3>\n\n  <p>One day of workshops, networking and learning dedicated to Optimism.</p>\n\n\n  </article>\n\n  <div class=\"onebox-metadata\">\n    \n    \n  </div>\n\n  <div style=\"clear: both\"></div>\n</aside>\n\n<p>It’s amazing to see how the Superchain is shaping up, and we’re confident <span class=\"mention\">@ETHCC</span> will be a memorable week! <img src=\"https://emoji.discourse-cdn.com/twitter/red_circle.png?v=12\" title=\":red_circle:\" class=\"emoji\" alt=\":red_circle:\" loading=\"lazy\" width=\"20\" height=\"20\"></p>\n<p>However, If you can’t make it (you should FOMO in and still come), you can explore the Superchain on our platform and subscribe to our weekly newsletter to get the latest insights.</p>\n<aside class=\"onebox allowlistedgeneric\" data-onebox-src=\"https://mirror.xyz/superchaineco.eth\">\n  <header class=\"source\">\n      <img src=\"https://europe1.discourse-cdn.com/bc41dd/original/2X/b/beb791b0622f66cee0ae5f9b93ec2a9cbf6adbf5.png\" class=\"site-icon\" data-dominant-color=\"489FFF\" width=\"16\" height=\"16\">\n\n      <a href=\"https://mirror.xyz/superchaineco.eth\" target=\"_blank\" rel=\"noopener nofollow ugc\">mirror.xyz</a>\n  </header>\n\n  <article class=\"onebox-body\">\n    <img width=\"224\" height=\"224\" src=\"https://europe1.discourse-cdn.com/bc41dd/original/2X/0/0b674ab374458c3431b76f72eec97ed8a1f483b7.png\" class=\"thumbnail onebox-avatar\" data-dominant-color=\"FF1B35\">\n\n<h3><a href=\"https://mirror.xyz/superchaineco.eth\" target=\"_blank\" rel=\"noopener nofollow ugc\">Superchain Eco</a></h3>\n\n  <p>Built on web3 for web3, Mirror’s robust publishing platform pushes the boundaries of writing online—whether it’s the next big white paper or a weekly community update.</p>\n\n\n  </article>\n\n  <div class=\"onebox-metadata\">\n    \n    \n  </div>\n\n  <div style=\"clear: both\"></div>\n</aside>\n\n            <p><small>1 post - 1 participant</small></p>\n            <p><a href=\"https://gov.optimism.io/t/countdown-to-superchain-space-brussels-connect-learn-and-collaborate/8408\">Read full topic</a></p>","link":"https://gov.optimism.io/t/countdown-to-superchain-space-brussels-connect-learn-and-collaborate/8408","pubDate":"Fri, 28 Jun 2024 07:45:47 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"gov.optimism.io-topic-8408"},"source":{"@url":"https://gov.optimism.io/t/countdown-to-superchain-space-brussels-connect-learn-and-collaborate/8408.rss","#text":"Countdown to Superchain Space Brussels: Connect, Learn, and Collaborate!"},"filter":false},{"title":"Mission Request Sponsorships","dc:creator":"katie","category":"✨ General","description":"<p>Please post your Mission Request ideas you would like to see sponsored in this thread this <a href=\"https://gov.optimism.io/t/season-6-mission-request-creation-guide/8123\">template</a>.</p>\n<p><strong>Steps:</strong></p>\n<ol>\n<li>Copy the provided <a href=\"https://gov.optimism.io/t/season-6-mission-request-creation-guide/8123\">template</a>.</li>\n<li>Create a new forum post, paste the template, and fill out all the questions.</li>\n<li>Add the tag “S6 mission request” to your post.</li>\n<li>Return to this post and paste the link to your completed Mission request in the replies.</li>\n</ol>\n<p>Ej.<br>\n</p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://europe1.discourse-cdn.com/bc41dd/original/2X/f/f6bb312a253a4bdd6e492bfd765843bb5367cca5.png\" data-download-href=\"/uploads/short-url/zcGvV4l8Q4B6J0hTKfhrqykpOaV.png?dl=1\" title=\"image\"><img src=\"https://europe1.discourse-cdn.com/bc41dd/optimized/2X/f/f6bb312a253a4bdd6e492bfd765843bb5367cca5_2_690x304.png\" alt=\"image\" data-base62-sha1=\"zcGvV4l8Q4B6J0hTKfhrqykpOaV\" width=\"690\" height=\"304\" srcset=\"https://europe1.discourse-cdn.com/bc41dd/optimized/2X/f/f6bb312a253a4bdd6e492bfd765843bb5367cca5_2_690x304.png, https://europe1.discourse-cdn.com/bc41dd/optimized/2X/f/f6bb312a253a4bdd6e492bfd765843bb5367cca5_2_1035x456.png 1.5x, https://europe1.discourse-cdn.com/bc41dd/optimized/2X/f/f6bb312a253a4bdd6e492bfd765843bb5367cca5_2_1380x608.png 2x\" data-dominant-color=\"3D3D3D\"></a></div><p></p>\n            <p><small>5 posts - 4 participants</small></p>\n            <p><a href=\"https://gov.optimism.io/t/mission-request-sponsorships/8405\">Read full topic</a></p>","link":"https://gov.optimism.io/t/mission-request-sponsorships/8405","pubDate":"Fri, 28 Jun 2024 01:09:55 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"gov.optimism.io-topic-8405"},"source":{"@url":"https://gov.optimism.io/t/mission-request-sponsorships/8405.rss","#text":"Mission Request Sponsorships"},"filter":false},{"title":"Announcing Optimism Fractal’s Intent to Optimize Governance on the Superchain","dc:creator":"DanSingjoy","category":"Metagovernance","description":"<p>GM Optimists! I’m pleased to share an exciting update about Optimism Fractal that can greatly help the Optimism Collective and warmly invite you to join our weekly events <img src=\"https://emoji.discourse-cdn.com/twitter/red_circle.png?v=12\" title=\":red_circle:\" class=\"emoji\" alt=\":red_circle:\" loading=\"lazy\" width=\"20\" height=\"20\"> <img src=\"https://emoji.discourse-cdn.com/twitter/seedling.png?v=12\" title=\":seedling:\" class=\"emoji\" alt=\":seedling:\" loading=\"lazy\" width=\"20\" height=\"20\"></p>\n<p>During the 30th Optimism Fractal event, we played an onchain social game where builders rank each other’s work and then discussed the core intents of Optimism Fractal at Optimism Town Hall. After this discussion, a proposal was approved by the Optimism Fractal Council to update our core intents to include optimizing governance on the Superchain. You can watch the discussion in this <a href=\"https://youtu.be/JI0mreeaSgY?si=I2RMjlsXq-zZ01Uh\" rel=\"noopener nofollow ugc\">video</a> and learn more about the new core intents in this <a href=\"https://gov.optimism.io/t/optimism-fractal-season-3/8095/12\">post</a>.</p>\n<p>Optimism Fractal is trailblazing the future of governance with a revolutionary decision-making process called <a href=\"https://fractally.com/blog/what-is-fractal-democracy\" rel=\"noopener nofollow ugc\">fractal democracy</a> and we’re eager to contribute to Optimism Collective governance with our unique consensus processes, open-source tools, and community events. This focus on governance complements our two other core intents to foster collaboration and award public goods creators on the Superchain. Any feedback is welcome to help us better serve the Collective and actualize the Optimistic Vision.</p>\n<p>We appreciate your support and are excited to collaborate in pioneering new models of digital democratic governance. We’d love for you to join Optimism Fractal weekly events on Thursdays at 17 UTC, which provide a perfect place to network with governance enthusiasts and learn more about our decision-making processes while playing onchain social games. You’re also welcome to participate at Optimism Town Hall an hour later, where we discuss exciting topics about the Superchain and will discuss Optimism Season 6 this week.</p>\n<p>I encourage you to <a href=\"https://lu.ma/optimismfractal\" rel=\"noopener nofollow ugc\">RSVP</a> for the events, explore more at <a href=\"http://OptimismFractal.com\" rel=\"noopener nofollow ugc\">OptimismFractal.com</a>, and feel free to reach out if you have any questions. You can find details about this week’s town hall topic in <a href=\"https://gov.optimism.io/t/optimism-fractal-season-3/8095/14\">this post</a> and watch the video where we discussed our core intents below. We hope you enjoy learning about our work and look forward to seeing you at an upcoming event!</p>\n<p><a href=\"https://www.youtube.com/watch?v=JI0mreeaSgY\">OF 30: Governance Intent</a></p>\n\n            <p><small>1 post - 1 participant</small></p>\n            <p><a href=\"https://gov.optimism.io/t/announcing-optimism-fractal-s-intent-to-optimize-governance-on-the-superchain/8399\">Read full topic</a></p>","link":"https://gov.optimism.io/t/announcing-optimism-fractal-s-intent-to-optimize-governance-on-the-superchain/8399","pubDate":"Thu, 27 Jun 2024 16:39:40 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"gov.optimism.io-topic-8399"},"source":{"@url":"https://gov.optimism.io/t/announcing-optimism-fractal-s-intent-to-optimize-governance-on-the-superchain/8399.rss","#text":"Announcing Optimism Fractal’s Intent to Optimize Governance on the Superchain"},"filter":false},{"title":"Token House Call will be [Tuesday, July 2nd @ 11:00PT / 14:00 ET / 18:00 GMT / 19:00 CET]","dc:creator":"Michael","category":"Community Calls","description":"<p>Hey Everyone!</p>\n<p>Our next Token House Call will be Tuesday, July 2nd.</p>\n<p>Feel free to comment anything on this thread of topics you’d like to see covered!</p>\n<p>Meeting will take place here: <a href=\"https://meet.google.com/vme-ovto-jcn\">https://meet.google.com/vme-ovto-jcn</a></p>\n<p>- Michael <img src=\"https://emoji.discourse-cdn.com/twitter/red_circle.png?v=12\" title=\":red_circle:\" class=\"emoji\" alt=\":red_circle:\" loading=\"lazy\" width=\"20\" height=\"20\"> <img src=\"https://emoji.discourse-cdn.com/twitter/sparkles.png?v=12\" title=\":sparkles:\" class=\"emoji\" alt=\":sparkles:\" loading=\"lazy\" width=\"20\" height=\"20\"></p>\n            <p><small>1 post - 1 participant</small></p>\n            <p><a href=\"https://gov.optimism.io/t/token-house-call-will-be-tuesday-july-2nd-11-00pt-14-00-et-18-00-gmt-19-00-cet/8398\">Read full topic</a></p>","link":"https://gov.optimism.io/t/token-house-call-will-be-tuesday-july-2nd-11-00pt-14-00-et-18-00-gmt-19-00-cet/8398","pubDate":"Thu, 27 Jun 2024 16:39:38 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"gov.optimism.io-topic-8398"},"source":{"@url":"https://gov.optimism.io/t/token-house-call-will-be-tuesday-july-2nd-11-00pt-14-00-et-18-00-gmt-19-00-cet/8398.rss","#text":"Token House Call will be [Tuesday, July 2nd @ 11:00PT / 14:00 ET / 18:00 GMT / 19:00 CET]"},"filter":false},{"title":"Retro Funding 4: Voting Rationale Thread","dc:creator":"system","category":"Retro  Funding 🔴","description":"<p>A place for badgeholders to share their voting rationale for Retro Funding 4.</p>\n<p>Relevant resources</p>\n<ul>\n<li><a href=\"https://gov.optimism.io/t/retro-funding-4-onchain-builders-round-details/7988\">Retro Funding 4: Onchain Builders - round details</a></li>\n<li><a href=\"https://gov.optimism.io/t/retro-funding-4-badgeholder-manual/8239\">Retro Funding 4: Badgeholder Manual</a></li>\n</ul>\n            <p><small>1 post - 1 participant</small></p>\n            <p><a href=\"https://gov.optimism.io/t/retro-funding-4-voting-rationale-thread/8396\">Read full topic</a></p>","link":"https://gov.optimism.io/t/retro-funding-4-voting-rationale-thread/8396","pubDate":"Thu, 27 Jun 2024 14:35:54 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"gov.optimism.io-topic-8396"},"source":{"@url":"https://gov.optimism.io/t/retro-funding-4-voting-rationale-thread/8396.rss","#text":"Retro Funding 4: Voting Rationale Thread"},"filter":false},{"title":"Retro Funding 4: Voting Feedback Thread","dc:creator":"system","category":"Retro  Funding 🔴","description":"<p>A place for badgeholders to share their feedback on voting within Retro Funding 4.</p>\n<p>Relevant resources</p>\n<ul>\n<li><a href=\"https://gov.optimism.io/t/retro-funding-4-onchain-builders-round-details/7988\" class=\"inline-onebox\">Retro Funding 4: Onchain Builders - round details</a></li>\n<li><a href=\"https://gov.optimism.io/t/retro-funding-4-badgeholder-manual/8239\" class=\"inline-onebox\">Retro Funding 4: Badgeholder Manual</a></li>\n</ul>\n            <p><small>1 post - 1 participant</small></p>\n            <p><a href=\"https://gov.optimism.io/t/retro-funding-4-voting-feedback-thread/8394\">Read full topic</a></p>","link":"https://gov.optimism.io/t/retro-funding-4-voting-feedback-thread/8394","pubDate":"Thu, 27 Jun 2024 14:27:50 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"gov.optimism.io-topic-8394"},"source":{"@url":"https://gov.optimism.io/t/retro-funding-4-voting-feedback-thread/8394.rss","#text":"Retro Funding 4: Voting Feedback Thread"},"filter":false},{"title":"Retro Funding 5: Announcing Guest Voter Participation","dc:creator":"system","category":"Retro  Funding 🔴","description":"<p>Retroactive Public Goods Funding (Retro Funding) 5 will reward contributions to the OP Stack. As part of Retro Funding 5 a new kind of experiment will be run that aims to increase our collective knowledge around Citizenship selection mechanisms.</p>\n<p>In Retro Funding 5, a random sample of ~90 existing Citizens will be asked to participate in voting. Randomly sampling participants is a way to keep the Citizen workload manageable despite an increased number of rounds, and is a well established method of forming a representative sample of a larger population. In addition to these Citizens, ~30 Guest voters will participate in voting.</p>\n<p><strong>Guest voters</strong></p>\n<p>Guest voters are temporary participants able to vote in a single Retro Round. This new concept allows the Collective to <a href=\"https://community.optimism.io/docs/citizen-house/experimentation-with-citizenship/\">experiment with different selection mechanisms without making any permanent changes to Citizenship</a>.</p>\n<p><strong>How to become a guest voter for Retro Funding 5</strong></p>\n<p>Applications to become a guest voter are open until July 14th 2024 to developers contributing to the Optimism ecosystem. Of all applicants, ~30 will be selected to participate as guest voters using a ‘Proof of Work’ selection mechanism (see below). Part of this mechanism will involve an analysis of public GitHub account activity before June 27th 2024. The algorithm will be shared publicly after the selection process has taken place to avoid influencing the experiment.</p>\n<p>If you are a developer and you want to participate in voting for Retro Funding 5, please create your Optimist Profile and submit an application <a href=\"https://retrofunding.optimism.io/\">here</a> by July 14th 2024. Any developer can apply, the algorithm will rank and select the top applicants based on their code contributions to relevant repositories. Therefore, please apply even if you are unsure whether your contributions are significant. Please do not apply if you are not a developer.</p>\n<p><strong>Proof of Work</strong></p>\n<p>The hypothesis behind Proof of Work is that individuals who have contributed work and impact to the Collective will demonstrate relevant competencies and understanding of the Optimism ecosystem. Voting in Retro Funding 5 will benefit from a technical understanding of the OP Stack, which is why this particular opportunity was taken to test a selection mechanism aimed at identifying voters with relevant technical competencies.</p>\n<p>In the context of this experiment, the Proof of Work selection mechanism is being tested across only a single dimension - code contributions. However, the concept of Proof of Work can be applied to other areas and is not limited to technical contributions.</p>\n<p><strong>What does this mean for future Citizen selection?</strong></p>\n<p>The development of Citizenship is reliant on knowledge gathered from experimentation - this is the first in a series of Citizenship selection experiments designed with this end in mind. To read more about experimentation with Citizen selection, see <a href=\"https://community.optimism.io/docs/citizen-house/experimentation-with-citizenship/#\">this gov docs post.</a></p>\n<p>Learnings from this series of experiments will help the Collective gather knowledge about a variety of selection methods which is an important step in empowering Citizens to make informed choices about Citizenship criteria in the future.</p>\n<p>This experiment should not be taken to imply that future Citizen selection will focus on developers or the Proof of Work mechanism. Future Retro Funding Rounds may experiment with other methods of Citizen selection targeted at different Optimism participants.</p>\n            <p><small>4 posts - 4 participants</small></p>\n            <p><a href=\"https://gov.optimism.io/t/retro-funding-5-announcing-guest-voter-participation/8393\">Read full topic</a></p>","link":"https://gov.optimism.io/t/retro-funding-5-announcing-guest-voter-participation/8393","pubDate":"Thu, 27 Jun 2024 14:23:31 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"gov.optimism.io-topic-8393"},"source":{"@url":"https://gov.optimism.io/t/retro-funding-5-announcing-guest-voter-participation/8393.rss","#text":"Retro Funding 5: Announcing Guest Voter Participation"},"filter":false},{"title":"Can incentives be a good mechanism to improve Optimism governance?","dc:creator":"Cotabe","category":"Governance  Design 📐","description":"<p>GM Optimists! <img src=\"https://emoji.discourse-cdn.com/twitter/star2.png?v=12\" title=\":star2:\" class=\"emoji\" alt=\":star2:\" loading=\"lazy\" width=\"20\" height=\"20\"></p>\n<p>I don’t usually write forum posts, so please bear with me…</p>\n<p></p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://europe1.discourse-cdn.com/bc41dd/original/2X/7/7621ebff70d00fd15f9ad61e64f416b348c475b8.png\" data-download-href=\"/uploads/short-url/gR31ab0VaFDKn6j0HWfDoZCboik.png?dl=1\" title=\"Its my first day meme\" rel=\"noopener nofollow ugc\"><img src=\"https://europe1.discourse-cdn.com/bc41dd/optimized/2X/7/7621ebff70d00fd15f9ad61e64f416b348c475b8_2_328x250.png\" alt=\"Its my first day meme\" data-base62-sha1=\"gR31ab0VaFDKn6j0HWfDoZCboik\" width=\"328\" height=\"250\" srcset=\"https://europe1.discourse-cdn.com/bc41dd/optimized/2X/7/7621ebff70d00fd15f9ad61e64f416b348c475b8_2_328x250.png, https://europe1.discourse-cdn.com/bc41dd/optimized/2X/7/7621ebff70d00fd15f9ad61e64f416b348c475b8_2_492x375.png 1.5x, https://europe1.discourse-cdn.com/bc41dd/optimized/2X/7/7621ebff70d00fd15f9ad61e64f416b348c475b8_2_656x500.png 2x\" data-dominant-color=\"5D5459\"></a></div><p></p>\n<p>I’m also not sure if this is the right category. So feel free to correct me…</p>\n<p><strong>TL;DR: This post is to collect feedback from the community on how incentives can be used to improve Optimism Governance. It has open ended questions and some fun polls to collect aggregated signal for a community-led incentive program that will be run by Unitap.</strong></p>\n<p>Improving governance accessibility has been one of the <a href=\"https://gov.optimism.io/t/collective-intents-season-5/6883\">core intents of Optimism</a>. This intent became a Schelling point to align the community and work to improve Governance accessibility. However, human alignment is a complicated nut to crack and the best ways to improve Governance accessibility can be very different for all of us.</p>\n<p>This post was inspired by <a class=\"mention\" href=\"https://gov.optimism.io/u/launamu\">@LauNaMu</a>, as I heard her talking not long ago about how Governance incentives can go wrong. My intention is to collect insights, aggregated signal and feedback regarding how to improve governance accessibility overall and specifically what kind of incentives could help this intent and what kind of incentives could turn into perverse incentives that create unintended negative consequences.</p>\n<p></p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://europe1.discourse-cdn.com/bc41dd/original/2X/1/107ebb2a9d6bbe839ffcd8dbb3600bba8600dbaf.png\" data-download-href=\"/uploads/short-url/2lV9TSmzURsFzsk7aCRqSzgaJxJ.png?dl=1\" title=\"governance and incentives meme\" rel=\"noopener nofollow ugc\"><img src=\"https://europe1.discourse-cdn.com/bc41dd/optimized/2X/1/107ebb2a9d6bbe839ffcd8dbb3600bba8600dbaf_2_378x500.png\" alt=\"governance and incentives meme\" data-base62-sha1=\"2lV9TSmzURsFzsk7aCRqSzgaJxJ\" width=\"378\" height=\"500\" srcset=\"https://europe1.discourse-cdn.com/bc41dd/optimized/2X/1/107ebb2a9d6bbe839ffcd8dbb3600bba8600dbaf_2_378x500.png, https://europe1.discourse-cdn.com/bc41dd/original/2X/1/107ebb2a9d6bbe839ffcd8dbb3600bba8600dbaf.png 1.5x, https://europe1.discourse-cdn.com/bc41dd/original/2X/1/107ebb2a9d6bbe839ffcd8dbb3600bba8600dbaf.png 2x\" data-dominant-color=\"BAA8A6\"></a></div><p></p>\n<p>If you were dying to tell the Optimism community how you think we can improve Optimism Governance this is the place to gather all opinions and feedback. Here are some open questions and polls, but feel free to add anything you think is relevant.</p>\n<p><strong>Open ended questions.</strong></p>\n<ol>\n<li>What can be improved in Optimism Governance?</li>\n<li>What kind of interventions would help to improve Optimism Governance? (Solution brainstorming)</li>\n<li>What prevents OP holders from engaging in governance or delegating their tokens?</li>\n<li>How can delegators easily monitor their delegates’ participation?</li>\n<li>Are incentives a good mechanism? If so, how should we market incentive programs to reach its target audience? (for example: OP holders that haven’t delegated or that delegated to inactive or ghost delegates)</li>\n<li>Are the current KPIs (Delegated supply of OP, Average OP voted per governance proposal) sufficient? Should we consider other metrics like delegate diversity or the concentration of voting power in a handful of delegates?</li>\n<li>What kind of incentive programs could create negative consequences? (perverse incentives)</li>\n</ol>\n<h2><a name=\"poll-time-1\" class=\"anchor\" href=\"https://gov.optimism.io#poll-time-1\"></a>Poll Time!</h2>\n<p>Please help us get aggregated signal.</p>\n<p><strong>What incentives would be more effective in improving Optimism Governance?</strong></p>\n<p><a href=\"https://gov.optimism.io/t/can-incentives-be-a-good-mechanism-to-improve-optimism-governance/8386/1\">Click to view the poll.</a></p>\n<p><strong>2. Should OP be used for incentives?</strong></p>\n<p><a href=\"https://gov.optimism.io/t/can-incentives-be-a-good-mechanism-to-improve-optimism-governance/8386/1\">Click to view the poll.</a></p>\n<p><strong>3. Small rewards for everyone vs raffles with large prizes?</strong></p>\n<p><a href=\"https://gov.optimism.io/t/can-incentives-be-a-good-mechanism-to-improve-optimism-governance/8386/1\">Click to view the poll.</a></p>\n<p><strong>4. What would be the best KPI to measure the efficiency of a community-led incentive program pilot to improve Optimism governance?</strong></p>\n<p><a href=\"https://gov.optimism.io/t/can-incentives-be-a-good-mechanism-to-improve-optimism-governance/8386/1\">Click to view the poll.</a></p>\n<p>Thanks for your feedback, answers and governance insights. We will try to use your comments to design an effective community led incentive program.</p>\n<p>We will also be conducting some interviews with Govnerds, members of the OP foundation, OP labs and other stakeholders. Please feel free to DM <a class=\"mention\" href=\"https://gov.optimism.io/u/cotabe\">@cotabe</a> on TG if you want to be part of a short interview and support this effort.</p>\n<p>Stay Optimistic! <img src=\"https://emoji.discourse-cdn.com/twitter/speech_balloon.png?v=12\" title=\":speech_balloon:\" class=\"emoji\" alt=\":speech_balloon:\" loading=\"lazy\" width=\"20\" height=\"20\"><img src=\"https://emoji.discourse-cdn.com/twitter/sparkles.png?v=12\" title=\":sparkles:\" class=\"emoji\" alt=\":sparkles:\" loading=\"lazy\" width=\"20\" height=\"20\"></p>\n            <p><small>1 post - 1 participant</small></p>\n            <p><a href=\"https://gov.optimism.io/t/can-incentives-be-a-good-mechanism-to-improve-optimism-governance/8386\">Read full topic</a></p>","link":"https://gov.optimism.io/t/can-incentives-be-a-good-mechanism-to-improve-optimism-governance/8386","pubDate":"Tue, 25 Jun 2024 23:32:28 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"gov.optimism.io-topic-8386"},"source":{"@url":"https://gov.optimism.io/t/can-incentives-be-a-good-mechanism-to-improve-optimism-governance/8386.rss","#text":"Can incentives be a good mechanism to improve Optimism governance?"},"filter":false},{"title":"Governance Report : Special Voting Cycle #23a","dc:creator":"Boardroom","category":"✨ General","description":"<h1><a name=\"governance-report-special-voting-cycle-23a-1\" class=\"anchor\" href=\"https://gov.optimism.io#governance-report-special-voting-cycle-23a-1\"></a><strong>Governance Report: Special Voting Cycle <span class=\"hashtag-raw\">#23a</span></strong></h1>\n<p>The Special Voting Cycles in the Optimism Collective are designated periods during which members of the Optimism community engage in the governance process by voting on multiple proposals. The special voting cycle <span class=\"hashtag-raw\">#23a</span> brought forward some operational as well as key foundational changes that we have mentioned below</p>\n<ul>\n<li><a href=\"https://gov.optimism.io/t/upgrade-proposal-fault-proofs/8161\">Protocol Upgrade #7: Fault Proofs</a></li>\n<li><a href=\"https://gov.optimism.io/t/upgrade-proposal-guardian-security-council-threshold-and-l2-proxyadmin-ownership-changes-for-stage-1-decentralization/8157\">Protocol Upgrade #8: Changes for Stage 1 Decentralization</a></li>\n<li><a href=\"https://gov.optimism.io/t/governor-update-proposal-2-improvements-to-advanced-delegation-allowance-calculations/8164\">Governor Update Proposal #2: Improvements to advanced delegation allowance calculations</a></li>\n<li><a href=\"https://gov.optimism.io/t/season-6-grants-council-operating-budget/8082\">Season 6: Grants Council Operating Budget 2</a>\n<ul>\n<li><a href=\"https://gov.optimism.io/t/season-6-grants-council-operating-budget/8171\">Grants Council Operating Budget proposed by Gonna.eth</a></li>\n</ul>\n</li>\n<li><a href=\"https://gov.optimism.io/t/season-6-code-of-conduct-council-renewal/8100\">Season 6: Code of Conduct Council Renewal 2</a>\n<ul>\n<li><a href=\"https://gov.optimism.io/t/draft-code-of-conduct-council-cocc-operating-budget-for-season-6/8167/1\">Code of Conduct Council Operating Budget proposed by Juan Carlos Bell (juankbell)</a></li>\n</ul>\n</li>\n<li><a href=\"https://gov.optimism.io/t/season-6-developer-advisory-board-renewal/8099\">Season 6: Developer Advisory Board Renewal 3</a>\n<ul>\n<li><a href=\"https://gov.optimism.io/t/zach-obront-developer-advisory-board-operating-budget/8141\">Developer Advisory Board Operating Budget proposed by Zach Obront 1</a></li>\n<li><a href=\"https://gov.optimism.io/t/ed-mazurek-developer-advisory-board-operating-budget/8175\">Developer Advisory Board Operating Budget proposed by Ed Mazurek (wildmolasses) 1</a></li>\n</ul>\n</li>\n<li><a href=\"https://gov.optimism.io/t/season-6-intents-ratification/8104\">Season 6: Intents Ratification and Budget Approval 5</a></li>\n</ul>\n<h2><a name=\"proposal-final-protocol-upgrade-7-fault-proofshttpsvoteoptimismioproposals72085170435228531173144599119267762084652443676555508407874836206178427511368-2\" class=\"anchor\" href=\"https://gov.optimism.io#proposal-final-protocol-upgrade-7-fault-proofshttpsvoteoptimismioproposals72085170435228531173144599119267762084652443676555508407874836206178427511368-2\"></a><a href=\"https://vote.optimism.io/proposals/72085170435228531173144599119267762084652443676555508407874836206178427511368\" rel=\"noopener nofollow ugc\">Proposal: Final Protocol Upgrade #7 - Fault Proofs</a></h2>\n<p>Status: Passed <img src=\"https://emoji.discourse-cdn.com/twitter/white_check_mark.png?v=12\" title=\":white_check_mark:\" class=\"emoji\" alt=\":white_check_mark:\" loading=\"lazy\" width=\"20\" height=\"20\"></p>\n<h3><a name=\"introduction-3\" class=\"anchor\" href=\"https://gov.optimism.io#introduction-3\"></a>Introduction</h3>\n<p>The proposal focuses on implementing a fault-proof system to enhance the security and decentralization of Optimism’s network. This upgrade enables permissionless output proposals and fault proofs, reducing reliance on privileged roles for withdrawals.</p>\n<h3><a name=\"key-points-4\" class=\"anchor\" href=\"https://gov.optimism.io#key-points-4\"></a>Key Points</h3>\n<ol>\n<li><strong>Fault Proof System</strong>:\n<ul>\n<li>Allows anyone to propose output roots and participate in the dispute resolution process.</li>\n<li>Includes a smart contract framework for future multi-proof systems.</li>\n</ul>\n</li>\n<li><strong>Guardian Role</strong>:\n<ul>\n<li>The Guardian can override the system in emergencies, ensuring network security during the transition.</li>\n</ul>\n</li>\n<li><strong>Technical Changes</strong>:\n<ul>\n<li>Updates to key contracts like <code>OptimismPortal</code>, <code>DisputeGameFactory</code>, and others to support the new system.</li>\n<li>Introduction of <code>DelayedWETH</code> for handling bonds with delays to ensure integrity.</li>\n</ul>\n</li>\n<li><strong>Specifications</strong>:\n<ul>\n<li>Detailed specifications for fault proofs, including the deployment of relevant contracts and their roles.</li>\n<li>Off-chain programs for monitoring and automating the dispute resolution process.</li>\n</ul>\n</li>\n<li><strong>Impact</strong>:\n<ul>\n<li>All pending withdrawals will need to be re-proven under the new system.</li>\n<li>No anticipated downtime, but updates to tooling and SDKs required.</li>\n</ul>\n</li>\n</ol>\n<h3><a name=\"conclusion-5\" class=\"anchor\" href=\"https://gov.optimism.io#conclusion-5\"></a>Conclusion</h3>\n<p>This upgrade is a significant step towards decentralization, ensuring safer and more trustless withdrawal processes on Optimism. It balances security with the move towards a fully permissionless system, laying the groundwork for future enhancements.</p>\n<h3><a name=\"proposal-8-guardian-security-council-threshold-and-l2-proxyadmin-ownership-changes-for-stage-1-decentralizationhttpsvoteoptimismioproposals89250535338859095270968116984279971013811713632639468811376241520756760598962-6\" class=\"anchor\" href=\"https://gov.optimism.io#proposal-8-guardian-security-council-threshold-and-l2-proxyadmin-ownership-changes-for-stage-1-decentralizationhttpsvoteoptimismioproposals89250535338859095270968116984279971013811713632639468811376241520756760598962-6\"></a><a href=\"https://vote.optimism.io/proposals/89250535338859095270968116984279971013811713632639468811376241520756760598962\" rel=\"noopener nofollow ugc\">Proposal #8 - Guardian, Security Council Threshold, and L2 ProxyAdmin Ownership Changes for Stage 1 Decentralization</a></h3>\n<p>Status: Passed <img src=\"https://emoji.discourse-cdn.com/twitter/white_check_mark.png?v=12\" title=\":white_check_mark:\" class=\"emoji\" alt=\":white_check_mark:\" loading=\"lazy\" width=\"20\" height=\"20\"></p>\n<h3><a name=\"introduction-7\" class=\"anchor\" href=\"https://gov.optimism.io#introduction-7\"></a>Introduction</h3>\n<p>This proposal aims to advance the decentralization of Optimism by increasing the Security Council’s threshold, transferring the Guardian role, and changing L2 ProxyAdmin ownership. These changes align with Stage 1 decentralization requirements, enhancing network security and resilience.</p>\n<h3><a name=\"key-points-8\" class=\"anchor\" href=\"https://gov.optimism.io#key-points-8\"></a>Key Points</h3>\n<ol>\n<li><strong>Security Council Threshold</strong>:\n<ul>\n<li>Increase signing threshold from 4 to 10 out of 13 members.</li>\n<li>Enhances security by requiring broader consensus for decisions.</li>\n</ul>\n</li>\n<li><strong>Guardian Role Transfer</strong>:\n<ul>\n<li>Transfer Guardian role to a new Guardian Safe controlled by the Security Council.</li>\n<li>Foundation becomes Deputy Guardian, retaining emergency intervention capabilities.</li>\n</ul>\n</li>\n<li><strong>L2 ProxyAdmin Ownership</strong>:\n<ul>\n<li>Transfer ownership from the Foundation to the Security Council.</li>\n<li>Ensures the Security Council has a blocking vote on L2 predeploy upgrades.</li>\n</ul>\n</li>\n<li><strong>Technical Specifications</strong>:\n<ul>\n<li>Modifications to <code>SecurityCouncilSafe</code>, <code>GuardianSafe</code>, and <code>L2ProxyAdmin</code> contracts.</li>\n<li>Introduction of new modules to support liveness checks and secure contract ownership transitions.</li>\n</ul>\n</li>\n<li><strong>Impact</strong>:\n<ul>\n<li>No anticipated downtime; existing integrations remain unaffected.</li>\n<li>Node operators and users experience increased decentralization and security.</li>\n</ul>\n</li>\n</ol>\n<h3><a name=\"conclusion-9\" class=\"anchor\" href=\"https://gov.optimism.io#conclusion-9\"></a>Conclusion</h3>\n<p>This upgrade represents a significant step towards achieving Stage 1 decentralization. It enhances the security and decentralization of the Optimism network, ensuring a more robust and resilient system. The proposal underscores the commitment to a decentralized governance model while maintaining effective security measures.</p>\n<h2><a name=\"proposal-2-improvements-to-advanced-delegation-allowance-calculationshttpsvoteoptimismioproposals47257038716514883626179774712509684309799801257166588609178192779726195852111-10\" class=\"anchor\" href=\"https://gov.optimism.io#proposal-2-improvements-to-advanced-delegation-allowance-calculationshttpsvoteoptimismioproposals47257038716514883626179774712509684309799801257166588609178192779726195852111-10\"></a><a href=\"https://vote.optimism.io/proposals/47257038716514883626179774712509684309799801257166588609178192779726195852111\" rel=\"noopener nofollow ugc\">Proposal #2 - Improvements to Advanced Delegation Allowance Calculations</a></h2>\n<p>Status:  Passed <img src=\"https://emoji.discourse-cdn.com/twitter/white_check_mark.png?v=12\" title=\":white_check_mark:\" class=\"emoji\" alt=\":white_check_mark:\" loading=\"lazy\" width=\"20\" height=\"20\"></p>\n<h3><a name=\"introduction-11\" class=\"anchor\" href=\"https://gov.optimism.io#introduction-11\"></a>Introduction</h3>\n<p>This proposal addresses improvements to the advanced delegation allowance calculations within the Optimism governance system. The changes aim to rectify issues with the voting power allocation for delegates using the advanced delegation feature.</p>\n<h3><a name=\"key-points-12\" class=\"anchor\" href=\"https://gov.optimism.io#key-points-12\"></a>Key Points</h3>\n<ol>\n<li><strong>Advanced Delegation</strong>:\n<ul>\n<li>Fixes inaccuracies in voting power calculations for delegates receiving absolute and relative delegations.</li>\n<li>Ensures delegates retain correct voting power in complex delegation chains.</li>\n</ul>\n</li>\n<li><strong>Motivation</strong>:\n<ul>\n<li>Enhances the functionality of the advanced delegation feature launched in December 2023.</li>\n<li>Addresses scenarios not initially covered during testing.</li>\n</ul>\n</li>\n<li><strong>Technical Specifications</strong>:\n<ul>\n<li>Updates to the <code>Optimism Governor</code> contract.</li>\n<li>Implementation verified and audited by OpenZeppelin, with no issues found.</li>\n</ul>\n</li>\n<li><strong>Impact</strong>:\n<ul>\n<li>No anticipated downtime.</li>\n<li>Improved user experience for delegates in complex delegation states.</li>\n</ul>\n</li>\n</ol>\n<h3><a name=\"conclusion-13\" class=\"anchor\" href=\"https://gov.optimism.io#conclusion-13\"></a>Conclusion</h3>\n<p>This proposal aims to refine the advanced delegation process, ensuring accurate voting power calculations. The updates, backed by thorough testing and auditing, enhance the governance system’s robustness and delegate experience.</p>\n<h2><a name=\"proposal-season-6-grants-council-operating-budgethttpsvoteoptimismioproposals23296680451920040311284556255465306513981293154669425902294655221457403608367-14\" class=\"anchor\" href=\"https://gov.optimism.io#proposal-season-6-grants-council-operating-budgethttpsvoteoptimismioproposals23296680451920040311284556255465306513981293154669425902294655221457403608367-14\"></a><a href=\"https://vote.optimism.io/proposals/23296680451920040311284556255465306513981293154669425902294655221457403608367\" rel=\"noopener nofollow ugc\">Proposal: Season 6 Grants Council Operating Budget</a></h2>\n<p>Status:  Passed <img src=\"https://emoji.discourse-cdn.com/twitter/white_check_mark.png?v=12\" title=\":white_check_mark:\" class=\"emoji\" alt=\":white_check_mark:\" loading=\"lazy\" width=\"20\" height=\"20\"></p>\n<h3><a name=\"introduction-15\" class=\"anchor\" href=\"https://gov.optimism.io#introduction-15\"></a>Introduction</h3>\n<p>This proposal outlines the operating budget for the Season 6 Grants Council. The budget aims to support the Council’s activities, ensuring efficient grant distribution and improved governance within the Optimism ecosystem.</p>\n<h3><a name=\"key-points-16\" class=\"anchor\" href=\"https://gov.optimism.io#key-points-16\"></a>Key Points</h3>\n<ol>\n<li><strong>Budget Allocation</strong>:\n<ul>\n<li>Total proposed budget: 610,000 OP, an increase of 170,000 OP from the previous season.</li>\n<li>Breakdown includes compensation for reviewers, additional members, audit and special mission reviewers, and operations management.</li>\n</ul>\n</li>\n<li><strong>Council Structure</strong>:\n<ul>\n<li>18 positions, including Superchain Mission Reviewers, Optimism Mission Reviewers, and a new Audit and Special Mission Review team.</li>\n<li>Emphasis on enhancing review processes and supporting increased application volume.</li>\n</ul>\n</li>\n<li><strong>Operational Improvements</strong>:\n<ul>\n<li>Internal procedures for work distribution and accountability.</li>\n<li>Focus on metrics and milestones to measure performance and impact.</li>\n</ul>\n</li>\n<li><strong>KPI and Performance Metrics</strong>:\n<ul>\n<li>NPS of finalists &gt; 9/10.</li>\n<li>Aim for a 5% increase in votable supply and active developers.</li>\n<li>Evaluation based on grant performance and adherence to milestones.</li>\n</ul>\n</li>\n</ol>\n<h3><a name=\"conclusion-17\" class=\"anchor\" href=\"https://gov.optimism.io#conclusion-17\"></a>Conclusion</h3>\n<p>The proposed budget for Season 6 reflects the need for expanded resources to handle an anticipated increase in grant applications and to ensure effective governance. The enhancements in council structure and operational processes are designed to improve efficiency and support the ongoing growth of the Optimism ecosystem.</p>\n<h2><a name=\"proposal-code-of-conduct-council-cocc-operating-budget-for-season-6httpsvoteoptimismioproposals105090569675606228680479820654354019470447822380910214626164858605991232311940-18\" class=\"anchor\" href=\"https://gov.optimism.io#proposal-code-of-conduct-council-cocc-operating-budget-for-season-6httpsvoteoptimismioproposals105090569675606228680479820654354019470447822380910214626164858605991232311940-18\"></a><a href=\"https://vote.optimism.io/proposals/105090569675606228680479820654354019470447822380910214626164858605991232311940\" rel=\"noopener nofollow ugc\">Proposal: Code of Conduct Council (CoCC) Operating Budget for Season 6</a></h2>\n<p>Status:  Passed <img src=\"https://emoji.discourse-cdn.com/twitter/white_check_mark.png?v=12\" title=\":white_check_mark:\" class=\"emoji\" alt=\":white_check_mark:\" loading=\"lazy\" width=\"20\" height=\"20\"></p>\n<h3><a name=\"introduction-19\" class=\"anchor\" href=\"https://gov.optimism.io#introduction-19\"></a>Introduction</h3>\n<p>This proposal outlines the operating budget for the Code of Conduct Council (CoCC) for Season 6. The budget aims to ensure the enforcement of the Rules of Engagement across Optimism-hosted platforms and enhance community governance and conflict management.</p>\n<h3><a name=\"key-points-20\" class=\"anchor\" href=\"https://gov.optimism.io#key-points-20\"></a>Key Points</h3>\n<ol>\n<li><strong>Budget Allocation</strong>:\n<ul>\n<li>Total proposed budget: 55,000 OP, an increase of 37,000 OP from the previous season.</li>\n<li>Breakdown: 40,000 OP for five council members and 10,000 OP for the council lead.</li>\n</ul>\n</li>\n<li><strong>Council Responsibilities</strong>:\n<ul>\n<li>Enforce the Rules of Engagement, handle conflicts, and ensure compliance.</li>\n<li>Elected council members to oversee reports and make enforcement decisions.</li>\n</ul>\n</li>\n<li><strong>SupportNERDs</strong>:\n<ul>\n<li>Introduction of SupportNERDs to assist the council, providing monitoring and raising issues.</li>\n</ul>\n</li>\n<li><strong>KPIs and Performance Metrics</strong>:\n<ul>\n<li>Response time, transparency, and accountability in processing reports.</li>\n<li>Regular community updates and feedback collection.</li>\n</ul>\n</li>\n</ol>\n<h3><a name=\"conclusion-21\" class=\"anchor\" href=\"https://gov.optimism.io#conclusion-21\"></a>Conclusion</h3>\n<p>The proposal seeks to renew and expand the CoCC, reflecting its importance in maintaining community standards and governance. The increased budget is justified by the need for specialized conflict management and enhanced operational scope.</p>\n<h2><a name=\"proposal-developer-advisory-board-operating-budgethttpsvoteoptimismioproposals6975052961793121236744122111241179429220183353809219742149740939877970567765-22\" class=\"anchor\" href=\"https://gov.optimism.io#proposal-developer-advisory-board-operating-budgethttpsvoteoptimismioproposals6975052961793121236744122111241179429220183353809219742149740939877970567765-22\"></a><a href=\"https://vote.optimism.io/proposals/6975052961793121236744122111241179429220183353809219742149740939877970567765\" rel=\"noopener nofollow ugc\">Proposal: Developer Advisory Board Operating Budget</a></h2>\n<p>Status:  Passed <img src=\"https://emoji.discourse-cdn.com/twitter/white_check_mark.png?v=12\" title=\":white_check_mark:\" class=\"emoji\" alt=\":white_check_mark:\" loading=\"lazy\" width=\"20\" height=\"20\"> (Two options were given to voters)</p>\n<h3><a name=\"introduction-23\" class=\"anchor\" href=\"https://gov.optimism.io#introduction-23\"></a>Introduction</h3>\n<p>This proposal outlines the operating budget for the Developer Advisory Board (DAB) for Season 6, led by Zach Obront. The proposed budget aims to enhance the board’s operational capabilities and responsibilities within the Optimism ecosystem.</p>\n<h3><a name=\"key-points-24\" class=\"anchor\" href=\"https://gov.optimism.io#key-points-24\"></a>Key Points</h3>\n<ol>\n<li><strong>Budget Allocation</strong>:\n<ul>\n<li>Total proposed budget: 90,000 OP (an increase of 20,000 OP from last season).</li>\n<li>Breakdown includes compensation for the Board Lead, Upgrade Czar, Ops Lead, and additional members.</li>\n</ul>\n</li>\n<li><strong>Board Responsibilities</strong>:\n<ul>\n<li>Provide technical guidance on protocol upgrades and grant evaluations.</li>\n<li>Ensure clear communication of technical decisions to the community.</li>\n<li>Support the Grants Council by reviewing Mission Requests and grant applications.</li>\n</ul>\n</li>\n<li><strong>Expanded Roles</strong>:\n<ul>\n<li>New roles such as Upgrade Czar and Ops Lead to streamline operations and improve efficiency.</li>\n<li>Increased responsibilities for the Board Lead.</li>\n</ul>\n</li>\n<li><strong>KPIs and Performance Metrics</strong>:\n<ul>\n<li>Measure the impact of non-technical summaries on voting participation.</li>\n<li>Evaluate the quality and success of DAB-approved grants.</li>\n</ul>\n</li>\n</ol>\n<h3><a name=\"conclusion-25\" class=\"anchor\" href=\"https://gov.optimism.io#conclusion-25\"></a>Conclusion</h3>\n<p>The proposed budget increase reflects the expanded responsibilities and aims to enhance the board’s effectiveness in supporting Optimism’s technical and governance needs. This proposal seeks to maintain high standards of accountability and performance.</p>\n<h2><a name=\"proposal-season-6-intents-ratificationhttpsvoteoptimismioproposals4537769538885163906898768401836322976193114338273264147746088063279656611139-26\" class=\"anchor\" href=\"https://gov.optimism.io#proposal-season-6-intents-ratificationhttpsvoteoptimismioproposals4537769538885163906898768401836322976193114338273264147746088063279656611139-26\"></a><a href=\"https://vote.optimism.io/proposals/4537769538885163906898768401836322976193114338273264147746088063279656611139\" rel=\"noopener nofollow ugc\">Proposal: Season 6 Intents Ratification</a></h2>\n<p>Status:  Passed <img src=\"https://emoji.discourse-cdn.com/twitter/white_check_mark.png?v=12\" title=\":white_check_mark:\" class=\"emoji\" alt=\":white_check_mark:\" loading=\"lazy\" width=\"20\" height=\"20\"></p>\n<h3><a name=\"introduction-27\" class=\"anchor\" href=\"https://gov.optimism.io#introduction-27\"></a>Introduction</h3>\n<p>This proposal aims to ratify the strategic intents for Season 6, focusing on advancing decentralization, expanding the Superchain, and growing application developers within the Optimism ecosystem. These intents are crucial for guiding the collective efforts and resources towards strategic goals.</p>\n<h3><a name=\"key-points-28\" class=\"anchor\" href=\"https://gov.optimism.io#key-points-28\"></a>Key Points</h3>\n<ol>\n<li><strong>Intent 1: Progress Towards Decentralization</strong>:\n<ul>\n<li>Focus on both technical and organizational decentralization.</li>\n<li>Target metrics: Stage 1 rollup with multiple fault proofs, increasing votable supply to 100M OP, and boosting confidence in Citizens’ House governance.</li>\n</ul>\n</li>\n<li><strong>Intent 2: Bring Chains to the Superchain</strong>:\n<ul>\n<li>Goal to add 20 new chains to the Superchain in the next 6 months.</li>\n<li>Core development efforts include features like OP Plasma and interoperability.</li>\n</ul>\n</li>\n<li><strong>Intent 3: Grow Application Developers on the Superchain</strong>:\n<ul>\n<li>Aim to increase active developers to 9,500.</li>\n<li>Support through Superchain Dev Console, infrastructure partnerships, and vertical-specific growth campaigns.</li>\n</ul>\n</li>\n</ol>\n<h3><a name=\"conclusion-29\" class=\"anchor\" href=\"https://gov.optimism.io#conclusion-29\"></a>Conclusion</h3>\n<p>The ratification of these intents for Season 6 sets a clear strategic direction for the Optimism Collective. By focusing on decentralization, expanding the Superchain, and growing the developer community, the proposal aims to drive significant growth and innovation within the ecosystem.</p>\n            <p><small>1 post - 1 participant</small></p>\n            <p><a href=\"https://gov.optimism.io/t/governance-report-special-voting-cycle-23a/8378\">Read full topic</a></p>","link":"https://gov.optimism.io/t/governance-report-special-voting-cycle-23a/8378","pubDate":"Tue, 25 Jun 2024 11:22:19 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"gov.optimism.io-topic-8378"},"source":{"@url":"https://gov.optimism.io/t/governance-report-special-voting-cycle-23a/8378.rss","#text":"Governance Report : Special Voting Cycle #23a"},"filter":false},{"title":"What is the Name of the Network with Chain ID: 10?","dc:creator":"hashigo","category":"✨ General","description":"<p>There is some confusion within the community regarding the name of the network with Chain ID: 10. Currently, the following four names are being used:</p>\n<ol>\n<li><strong>Optimism</strong></li>\n<li><strong>OP Mainnet</strong></li>\n<li><strong>OP-Mainnet</strong></li>\n<li><strong>OP</strong></li>\n</ol>\n<h3><a name=\"optimism-1\" class=\"anchor\" href=\"https://gov.optimism.io#optimism-1\"></a>Optimism</h3>\n<p>This name was used before last year’s name change. Currently, it refers to the Superchain ecosystem.</p>\n<h3><a name=\"op-mainnet-2\" class=\"anchor\" href=\"https://gov.optimism.io#op-mainnet-2\"></a>OP Mainnet</h3>\n<p>This name started being used after last year’s name change. For example, it is used in this <a href=\"https://optimism.mirror.xyz/9ZMwZjst9SQpzIgEd4gN42UDjATyK3ZRClPFx9oMPp8\" rel=\"noopener nofollow ugc\">blog</a>.</p>\n<h3><a name=\"op-mainnet-3\" class=\"anchor\" href=\"https://gov.optimism.io#op-mainnet-3\"></a>OP-Mainnet</h3>\n<p>This name is used in the <a href=\"https://github.com/ethereum-optimism/superchain-registry\" rel=\"noopener nofollow ugc\">Superchain registry</a>. The Superchain registry is used as an off-chain source of truth and is considered the most reliable source, but I have never seen the name OP-Mainnet being used in practice.</p>\n<h3><a name=\"op-4\" class=\"anchor\" href=\"https://gov.optimism.io#op-4\"></a>OP</h3>\n<p>This is an abbreviated name due to the general nature of the word “Mainnet”. There is a file named <a href=\"https://github.com/ethereum-optimism/superchain-registry/blob/main/superchain/configs/mainnet/op.yaml\" rel=\"noopener nofollow ugc\">op.yaml</a> in the Superchain registry. In practice, Debank has adopted this name.</p>\n<hr>\n<p>As you can see, there is inconsistency in the name of the network with Chain ID: 10, which is causing confusion. Could you please share your opinion on this matter?</p>\n            <p><small>1 post - 1 participant</small></p>\n            <p><a href=\"https://gov.optimism.io/t/what-is-the-name-of-the-network-with-chain-id-10/8377\">Read full topic</a></p>","link":"https://gov.optimism.io/t/what-is-the-name-of-the-network-with-chain-id-10/8377","pubDate":"Tue, 25 Jun 2024 06:51:41 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"gov.optimism.io-topic-8377"},"source":{"@url":"https://gov.optimism.io/t/what-is-the-name-of-the-network-with-chain-id-10/8377.rss","#text":"What is the Name of the Network with Chain ID: 10?"},"filter":false},{"title":"Optimism Forum Weekly Recap - daospace: 06/17 - 06/23","dc:creator":"daospace","category":"Updates  and Announcements 📢","description":"<p>gm Optimism Collective <img src=\"https://emoji.discourse-cdn.com/twitter/red_circle.png?v=12\" title=\":red_circle:\" class=\"emoji\" alt=\":red_circle:\" loading=\"lazy\" width=\"20\" height=\"20\"> <img src=\"https://emoji.discourse-cdn.com/twitter/sparkles.png?v=12\" title=\":sparkles:\" class=\"emoji\" alt=\":sparkles:\" loading=\"lazy\" width=\"20\" height=\"20\"></p>\n<p>Last week saw a slight dip in forum activity with only 4 new topics created. Key highlights include the ratification of a standardized profit definition for Round 4 of Retroactive Public Goods Funding, the outline of the Season 6 Grants Council’s structure and roles, the introduction of a new university program on Optimism, Blockchain, and Web 3 at CENFOTEC University in Costa Rica starting June 25, 2024, and a community member, <a class=\"mention\" href=\"https://gov.optimism.io/u/jp_2024\">@Jp_2024</a>, expressing enthusiasm for joining the community to explore positivity and resilience.</p>\n<p><a href=\"https://twitter.com/daospace_ai\" rel=\"noopener nofollow ugc\">daospace </a>is a DAO discovery platform that aggregates contributions across different DAOs. We will be providing weekly Automated AI Summaries to help reduce information overload, and so that all members can stay up to date on forum activity within the DAO. Below is a summary of every topic made within the OP Governance Forum from last week.</p>\n<p>Feel free to leave us feedback in the comments below. You can get in touch with the daospace team on <a href=\"https://twitter.com/daospace_ai\" rel=\"noopener nofollow ugc\">X (Twitter) </a>, or reach out to the founders directly on X as well: <a href=\"https://twitter.com/JarisJames\" rel=\"noopener nofollow ugc\">Jaris James </a>&amp; <a href=\"https://twitter.com/sixty_keys\" rel=\"noopener nofollow ugc\">Sixty</a></p>\n<h2><a name=\"ratification-of-profit-definition-for-round-4httpsgovoptimismiotratification-of-profit-definition-for-round-48312-1\" class=\"anchor\" href=\"https://gov.optimism.io#ratification-of-profit-definition-for-round-4httpsgovoptimismiotratification-of-profit-definition-for-round-48312-1\"></a><a href=\"https://gov.optimism.io/t/ratification-of-profit-definition-for-round-4/8312\">Ratification of Profit Definition for Round 4</a></h2>\n<p><strong>Created</strong>: 2024-06-17</p>\n<p><strong>Author</strong>: <a class=\"mention\" href=\"https://gov.optimism.io/u/system\">@system</a></p>\n<p><strong>Summary</strong></p>\n<p>In Round 4 of the Retroactive Public Goods Funding on Optimism, a standardized definition of profit will be applied universally. The profit calculation will deduct past transfers, such as grants and funding, to determine the final award in OP for each voter’s impact assessment. A deliberative process involving badgeholders determined the profit definition, with a proposed deduction weight applied only to Optimism Grants. Badgeholders are called to vote on ratifying this definition which will automatically be applied to the voting result calculation in Round 4, with a fallback definition proposed by the Foundation if not ratified. The voting will take place on Snapshot from June 20-26.</p>\n<h2><a name=\"s6-grants-council-communication-threadhttpsgovoptimismiots6-grants-council-communication-thread8324-2\" class=\"anchor\" href=\"https://gov.optimism.io#s6-grants-council-communication-threadhttpsgovoptimismiots6-grants-council-communication-thread8324-2\"></a><a href=\"https://gov.optimism.io/t/s6-grants-council-communication-thread/8324\">S6 Grants Council Communication Thread</a></h2>\n<p><strong>Created</strong>: 2024-06-19</p>\n<p><strong>Author</strong>: <a class=\"mention\" href=\"https://gov.optimism.io/u/gonna.eth\">@Gonna.eth</a></p>\n<p><strong>Summary</strong></p>\n<p>In the Grants Council Communication Thread, an outline of the Season 6 Grants Council’s structure and roles is provided. The Council, delegated by Token House, processes applications, reviews cycles, and aims to increase transparency within the community. It comprises four sub-committees: Superchain, Optimism, Audit and Special Mission, and Milestones &amp; Metrics, each with specific goals. Three key roles are identified for Season 6: Communications Lead, Milestone and Metrics Lead, and elected reviewers appointed by the Grants Council lead. <a class=\"mention\" href=\"https://gov.optimism.io/u/katie\">@katie</a> serves as the Communications Lead, and <a class=\"mention\" href=\"https://gov.optimism.io/u/juanbug_pgov\">@Juanbug_PGov</a> as the Milestones and Metrics Lead, responsible for various essential tasks within the Council.</p>\n<h2><a name=\"optimism-university-module-in-costa-ricahttpsgovoptimismiotoptimism-university-module-in-costa-rica8338-3\" class=\"anchor\" href=\"https://gov.optimism.io#optimism-university-module-in-costa-ricahttpsgovoptimismiotoptimism-university-module-in-costa-rica8338-3\"></a><a href=\"https://gov.optimism.io/t/optimism-university-module-in-costa-rica/8338\">OPTIMISM University Module in Costa Rica</a></h2>\n<p><strong>Created</strong>: 2024-06-20</p>\n<p><strong>Author</strong>: <a class=\"mention\" href=\"https://gov.optimism.io/u/inbestprogram.eth\">@inbestprogram.eth</a></p>\n<p><strong>Summary</strong></p>\n<p>A new university program on Optimism, Blockchain, and Web 3 has been introduced at CENFOTEC University in Costa Rica. The course will offer comprehensive knowledge on these technologies over a 7-week module, providing participants with expertise in Ethereum, Optimism, and Web 3.</p>\n<p>A scholarship application form has been released alongside economic incentives in OP tokens. The course will cover topics like Ethereum, Optimism, smart contract creation, and job opportunities in Web 3. Various modules are structured to cover different aspects of blockchain technology and web development, with the course starting on June 25, 2024. Special guests will provide real-life examples, and only 25 students will be accepted for this iteration of the program. Feedback is encouraged for future improvements in this initiative.</p>\n<h2><a name=\"hiello-everyonehttpsgovoptimismiothiello-everyone8354-4\" class=\"anchor\" href=\"https://gov.optimism.io#hiello-everyonehttpsgovoptimismiothiello-everyone8354-4\"></a><a href=\"https://gov.optimism.io/t/hiello-everyone/8354\">Hiello everyone</a></h2>\n<p><strong>Created</strong>: 2024-06-22</p>\n<p><strong>Author</strong>: <a class=\"mention\" href=\"https://gov.optimism.io/u/jp_2024\">@Jp_2024</a></p>\n<p><strong>Summary</strong></p>\n<p>JP_ 2024 expresses enthusiasm for joining the community to explore positivity and resilience, aiming to create a brighter future through inspiration and motivation. This individual seeks to learn and grow alongside others in this journey.</p>\n            <p><small>1 post - 1 participant</small></p>\n            <p><a href=\"https://gov.optimism.io/t/optimism-forum-weekly-recap-daospace-06-17-06-23/8374\">Read full topic</a></p>","link":"https://gov.optimism.io/t/optimism-forum-weekly-recap-daospace-06-17-06-23/8374","pubDate":"Mon, 24 Jun 2024 16:02:16 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"gov.optimism.io-topic-8374"},"source":{"@url":"https://gov.optimism.io/t/optimism-forum-weekly-recap-daospace-06-17-06-23/8374.rss","#text":"Optimism Forum Weekly Recap - daospace: 06/17 - 06/23"},"filter":false},{"title":"Call for Interviews: Share your experience building on/for Optimism","dc:creator":"0xR","category":"✨ General","description":"<p>Dear Optimism Community,</p>\n<p>As a recently approved recipient of the Builder Grant, I’m excited to announce that we’re conducting preliminary research to ensure our project aligns with the needs and expectations of the Optimism builder community. We want to hear from you!</p>\n<p>We are seeking to connect with Optimism builders across various fields—whether you’re involved in tech, education, design, or communications—who have applied for grants of any tier. Your insights are invaluable to us.</p>\n<p><strong>What We’re Looking For:</strong></p>\n<p>• Builders who have had their grant applications approved by the Grant Council.</p>\n<p>• Builders who have applied but not received grant approval.</p>\n<p><strong>Interview Details:</strong></p>\n<p>• Duration: Approximately 30 minutes.</p>\n<p>• Anonymity: Available</p>\n<p>• Interview Questions: Can be shared in advance if preferred.</p>\n<ul>\n<li>Location: Online meeting</li>\n</ul>\n<p>The interviews will cover topics related to funding, security, and your experiences within the Optimism builder community. Your feedback will help us understand the community better and shape our project to serve you effectively.</p>\n<p>If you’re interested in participating, please comment below or reach out via Telegram at <span class=\"mention\">@OxRussel</span>.</p>\n<p>For more information about our project and the Builder Grant we received, check out our approved grant link: <a href=\"https://app.charmverse.io/op-grants/optimistic-crowdstaking-funding-more-builders-on-optimism-8173089535454674\" rel=\"noopener nofollow ugc\">Optimistic Crowdstaking: Funding More Builders on Optimism.</a></p>\n<p>Thank you for your time and contribution. I look forward to hearing from you!</p>\n<p>Best regards, 0xR</p>\n            <p><small>1 post - 1 participant</small></p>\n            <p><a href=\"https://gov.optimism.io/t/call-for-interviews-share-your-experience-building-on-for-optimism/8373\">Read full topic</a></p>","link":"https://gov.optimism.io/t/call-for-interviews-share-your-experience-building-on-for-optimism/8373","pubDate":"Mon, 24 Jun 2024 13:09:57 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"gov.optimism.io-topic-8373"},"source":{"@url":"https://gov.optimism.io/t/call-for-interviews-share-your-experience-building-on-for-optimism/8373.rss","#text":"Call for Interviews: Share your experience building on/for Optimism"},"filter":false},{"title":"About OP Stack Superchain's liquidity benefits","dc:creator":"rehnuma122","category":"✨ General","description":"<p>Can anyone please clear my doubt on how Op Stack superchain will enable unified liquidity like Polygon CDK does, or will superchains entirely rely on external interoperability layer or AMMs for this. Thank you in advance.</p>\n            <p><small>2 posts - 2 participants</small></p>\n            <p><a href=\"https://gov.optimism.io/t/about-op-stack-superchains-liquidity-benefits/8372\">Read full topic</a></p>","link":"https://gov.optimism.io/t/about-op-stack-superchains-liquidity-benefits/8372","pubDate":"Mon, 24 Jun 2024 13:06:44 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"gov.optimism.io-topic-8372"},"source":{"@url":"https://gov.optimism.io/t/about-op-stack-superchains-liquidity-benefits/8372.rss","#text":"About OP Stack Superchain's liquidity benefits"},"filter":false},{"title":"Bleu Assistant AI","dc:creator":"bleu_builders","category":"Grants  🏹","description":"<p>The <a href=\"https://bleu.builders/\" rel=\"noopener nofollow ugc\">bleu</a> team is thrilled to be selected to execute the mission of building an AI-powered assistant designed to generate guidance and digested information about the Optimism Collective, more details <a href=\"https://app.charmverse.io/op-grants/bleu-assistant-ai-6926133139021808\" rel=\"noopener nofollow ugc\">here</a>.</p>\n<p>As outlined in our proposal, we’re creating this forum post to keep you updated on our progress and seek your valuable input every two weeks by posting a comment on this thread. Your feedback is crucial for us!</p>\n<p>bleu is committed to transparency and open-source development. If you’d like to track our progress, feel free to check out our work on this <a href=\"https://github.com/bleu/op-ai-tools\" rel=\"noopener nofollow ugc\">GitHub Repository</a>.</p>\n            <p><small>2 posts - 1 participant</small></p>\n            <p><a href=\"https://gov.optimism.io/t/bleu-assistant-ai/8371\">Read full topic</a></p>","link":"https://gov.optimism.io/t/bleu-assistant-ai/8371","pubDate":"Mon, 24 Jun 2024 12:52:19 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"gov.optimism.io-topic-8371"},"source":{"@url":"https://gov.optimism.io/t/bleu-assistant-ai/8371.rss","#text":"Bleu Assistant AI"},"filter":false},{"title":"Why I am getting this error?","dc:creator":"nathaniel","category":"✨ General","description":"<p>Hello</p>\n<p>I recently posted a query on this forum, But now it is showing this error- “ Hello</p>\n<p>I recently posted a query on this forum, But now it is showing this error- “ Our automated spam filter, <a href=\"https://akismet.com/\" rel=\"noopener nofollow ugc\">Akismet</a>, has temporarily hidden <a href=\"https://gov.optimism.io/t/what-metrics-should-we-use-to-measure-the-effectiveness-of-airdrops-in-the-superchain/8368/1\">your post</a> in <em>What metrics should we use to measure the effectiveness of airdrops in the Superchain?</em> for review.”<br>\n<a href=\"https://gov.optimism.io/t/what-metrics-should-we-use-to-measure-the-effectiveness-of-airdrops-in-the-superchain/8368/1\">https://gov.optimism.io/t/what-metrics-should-we-use-to-measure-the-effectiveness-of-airdrops-in-the-superchain/8368/1</a></p>\n<p></p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://europe1.discourse-cdn.com/bc41dd/original/2X/6/6ddd82477ef4f526c0a32641d708e82877680ba8.png\" data-download-href=\"/uploads/short-url/fFUCKaWexZF0ZlvJBQlynv7EOwg.png?dl=1\" title=\"image\" rel=\"noopener nofollow ugc\"><img src=\"https://europe1.discourse-cdn.com/bc41dd/original/2X/6/6ddd82477ef4f526c0a32641d708e82877680ba8.png\" alt=\"image\" data-base62-sha1=\"fFUCKaWexZF0ZlvJBQlynv7EOwg\" width=\"690\" height=\"276\" data-dominant-color=\"F7F5F5\"></a></div><p></p>\n<p>I need solution for this . I have followed all community guidelines. pls restore my post .</p>\n<p>Thank you</p>\n            <p><small>1 post - 1 participant</small></p>\n            <p><a href=\"https://gov.optimism.io/t/why-i-am-getting-this-error/8370\">Read full topic</a></p>","link":"https://gov.optimism.io/t/why-i-am-getting-this-error/8370","pubDate":"Mon, 24 Jun 2024 05:40:00 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"gov.optimism.io-topic-8370"},"source":{"@url":"https://gov.optimism.io/t/why-i-am-getting-this-error/8370.rss","#text":"Why I am getting this error?"},"filter":false},{"title":"What metrics should we use to measure the effectiveness of airdrops in the Superchain?","dc:creator":"nathaniel","category":"✨ General","description":"<p>Hello,</p>\n<p>I am interested in understanding the best ways to evaluate the success of airdrops within the Superchain. What key metrics should we focus on to measure their effectiveness?</p>\n<p>Some areas that come to mind are user acquisition and retention, token utilization, community engagement, project growth ;  and economic impact. Checked <a href=\"https://gov.optimism.io/t/draft-cycle-13-experiments-form/6045\" class=\"inline-onebox\">[DRAFT] Cycle 13 Experiments Form</a> <a href=\"https://www.igmguru.com/cyber-security/cissp-certification-training/\" rel=\"noopener nofollow ugc\">cissp</a>  but still need help .</p>\n<p>Are there other metrics that have worked well in your experience?</p>\n<p>Looking forward to the community’s insights!</p>\n<p>Thank you <img src=\"https://emoji.discourse-cdn.com/twitter/slightly_smiling_face.png?v=12\" title=\":slightly_smiling_face:\" class=\"emoji\" alt=\":slightly_smiling_face:\" loading=\"lazy\" width=\"20\" height=\"20\"><br>\nnathaniel</p>\n            <p><small>1 post - 1 participant</small></p>\n            <p><a href=\"https://gov.optimism.io/t/what-metrics-should-we-use-to-measure-the-effectiveness-of-airdrops-in-the-superchain/8368\">Read full topic</a></p>","link":"https://gov.optimism.io/t/what-metrics-should-we-use-to-measure-the-effectiveness-of-airdrops-in-the-superchain/8368","pubDate":"Mon, 24 Jun 2024 05:32:56 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"gov.optimism.io-topic-8368"},"source":{"@url":"https://gov.optimism.io/t/what-metrics-should-we-use-to-measure-the-effectiveness-of-airdrops-in-the-superchain/8368.rss","#text":"What metrics should we use to measure the effectiveness of airdrops in the Superchain?"},"filter":false},{"title":"Hiello everyone","dc:creator":"Jp_2024","category":"✨ General","description":"<p>I’m JP_2024 and I’m delighted to be here with us. I hope to learn in this space the power of positivity and resilience. Together, we can build a brighter, more hopeful future. I hope to be inspired and motivated every step of this journey.</p>\n            <p><small>1 post - 1 participant</small></p>\n            <p><a href=\"https://gov.optimism.io/t/hiello-everyone/8354\">Read full topic</a></p>","link":"https://gov.optimism.io/t/hiello-everyone/8354","pubDate":"Sat, 22 Jun 2024 13:15:05 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"gov.optimism.io-topic-8354"},"source":{"@url":"https://gov.optimism.io/t/hiello-everyone/8354.rss","#text":"Hiello everyone"},"filter":false},{"title":"OPTIMISM University Module in Costa Rica","dc:creator":"inbestprogram.eth","category":"✨ General","description":"<p>The First <strong>Optimism University module</strong> has arrived to <strong>Costa Rica</strong> in <a href=\"https://x.com/UCenfotec\" rel=\"noopener nofollow ugc\">CENFOTEC University</a>, a leader in technological education.\"</p>\n<p>We are pleased to announce the creation of a specially designed university program at <strong>CENFOTEC</strong> University to explore and delve into the technologies of Optimism, Blockchain, and Web3. This <strong>intensive 7-week</strong> module will provide participants with the tools and knowledge necessary to understand the workings of these revolutionary technologies and their transformative potential in various sectors of society.</p>\n<p><a href=\"https://linktw.in/riQaBn\" rel=\"noopener nofollow ugc\"><strong>SCOLARSHIP APPLICATION FORM</strong></a></p>\n<p>In addition to acquiring valuable knowledge and becoming an expert in Blockchain, Web3, and Optimism, you will receive economic incentives in the form of OP tokens, donated by the <strong>Optimism Grants Council</strong> to promote education and adoption of the technology</p>\n<p>This course aims to equip students with comprehensive knowledge of blockchain technology, enabling them to embark on the Web3 journey. Students will learn about Ethereum, its properties, various mechanisms, layers, scaling with Optimism, and its current state.</p>\n<p><strong>Students will learn:</strong></p>\n<ul>\n<li>\n<p>Basic concepts of Blockchain and Web3</p>\n</li>\n<li>\n<p>What is Ethereum and Roll Ups</p>\n</li>\n<li>\n<p>Data availability &amp; ETH Upgrades</p>\n</li>\n<li>\n<p>Optimism: potential and governance in Blockchain</p>\n</li>\n<li>\n<p>Creation of applications and smart contracts</p>\n</li>\n<li>\n<p>Unique opportunities: development, incentives, and jobs in Web3</p>\n</li>\n</ul>\n<p><strong>Become an expert in the Superchain</strong></p>\n<h4><a name=\"module-structure-1\" class=\"anchor\" href=\"https://gov.optimism.io#module-structure-1\"></a>Module Structure</h4>\n<ul>\n<li><strong>Module 1:</strong> Introduction to blockchain tech</li>\n</ul>\n<p></p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://europe1.discourse-cdn.com/bc41dd/original/2X/4/42e47201c9d81c8206b16aa7bcc66325041ea36a.png\" data-download-href=\"/uploads/short-url/9xKXcLeIRQ3F34IA81cW1w9rw3U.png?dl=1\" title=\"1\" rel=\"noopener nofollow ugc\"><img src=\"https://europe1.discourse-cdn.com/bc41dd/optimized/2X/4/42e47201c9d81c8206b16aa7bcc66325041ea36a_2_500x500.png\" alt=\"1\" data-base62-sha1=\"9xKXcLeIRQ3F34IA81cW1w9rw3U\" width=\"500\" height=\"500\" srcset=\"https://europe1.discourse-cdn.com/bc41dd/optimized/2X/4/42e47201c9d81c8206b16aa7bcc66325041ea36a_2_500x500.png, https://europe1.discourse-cdn.com/bc41dd/optimized/2X/4/42e47201c9d81c8206b16aa7bcc66325041ea36a_2_750x750.png 1.5x, https://europe1.discourse-cdn.com/bc41dd/optimized/2X/4/42e47201c9d81c8206b16aa7bcc66325041ea36a_2_1000x1000.png 2x\" data-dominant-color=\"F8ECED\"></a></div><p></p>\n<ul>\n<li><strong>Module 2:</strong> Optimism &amp; Layer 2s</li>\n</ul>\n<p></p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://europe1.discourse-cdn.com/bc41dd/original/2X/d/d43d2ef6d7d7b4504b43a408c5885704cb297d25.png\" data-download-href=\"/uploads/short-url/uhyj8ziCXzBWhvPyXC2vxTwIkOV.png?dl=1\" title=\"2\" rel=\"noopener nofollow ugc\"><img src=\"https://europe1.discourse-cdn.com/bc41dd/optimized/2X/d/d43d2ef6d7d7b4504b43a408c5885704cb297d25_2_500x500.png\" alt=\"2\" data-base62-sha1=\"uhyj8ziCXzBWhvPyXC2vxTwIkOV\" width=\"500\" height=\"500\" srcset=\"https://europe1.discourse-cdn.com/bc41dd/optimized/2X/d/d43d2ef6d7d7b4504b43a408c5885704cb297d25_2_500x500.png, https://europe1.discourse-cdn.com/bc41dd/optimized/2X/d/d43d2ef6d7d7b4504b43a408c5885704cb297d25_2_750x750.png 1.5x, https://europe1.discourse-cdn.com/bc41dd/optimized/2X/d/d43d2ef6d7d7b4504b43a408c5885704cb297d25_2_1000x1000.png 2x\" data-dominant-color=\"F8EAEC\"></a></div><p></p>\n<ul>\n<li><strong>Module 3:</strong> Intro a Solidity</li>\n</ul>\n<p></p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://europe1.discourse-cdn.com/bc41dd/original/2X/5/5a093bae8123ba17eaadec016cec20059c4bdefe.png\" data-download-href=\"/uploads/short-url/cQuKLgVHvVvnGHD10RMzps5wV2e.png?dl=1\" title=\"3\" rel=\"noopener nofollow ugc\"><img src=\"https://europe1.discourse-cdn.com/bc41dd/optimized/2X/5/5a093bae8123ba17eaadec016cec20059c4bdefe_2_500x500.png\" alt=\"3\" data-base62-sha1=\"cQuKLgVHvVvnGHD10RMzps5wV2e\" width=\"500\" height=\"500\" srcset=\"https://europe1.discourse-cdn.com/bc41dd/optimized/2X/5/5a093bae8123ba17eaadec016cec20059c4bdefe_2_500x500.png, https://europe1.discourse-cdn.com/bc41dd/optimized/2X/5/5a093bae8123ba17eaadec016cec20059c4bdefe_2_750x750.png 1.5x, https://europe1.discourse-cdn.com/bc41dd/optimized/2X/5/5a093bae8123ba17eaadec016cec20059c4bdefe_2_1000x1000.png 2x\" data-dominant-color=\"F9EFF0\"></a></div><p></p>\n<ul>\n<li><strong>Module 4:</strong> Advanced Solidity</li>\n</ul>\n<p></p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://europe1.discourse-cdn.com/bc41dd/original/2X/7/7969cf64d9204a707402fb80fbfe2b8efaf74290.png\" data-download-href=\"/uploads/short-url/hk4tcRqnRrp7PHxINS5lpoM4Wt2.png?dl=1\" title=\"4\" rel=\"noopener nofollow ugc\"><img src=\"https://europe1.discourse-cdn.com/bc41dd/optimized/2X/7/7969cf64d9204a707402fb80fbfe2b8efaf74290_2_500x500.png\" alt=\"4\" data-base62-sha1=\"hk4tcRqnRrp7PHxINS5lpoM4Wt2\" width=\"500\" height=\"500\" srcset=\"https://europe1.discourse-cdn.com/bc41dd/optimized/2X/7/7969cf64d9204a707402fb80fbfe2b8efaf74290_2_500x500.png, https://europe1.discourse-cdn.com/bc41dd/optimized/2X/7/7969cf64d9204a707402fb80fbfe2b8efaf74290_2_750x750.png 1.5x, https://europe1.discourse-cdn.com/bc41dd/optimized/2X/7/7969cf64d9204a707402fb80fbfe2b8efaf74290_2_1000x1000.png 2x\" data-dominant-color=\"F8ECED\"></a></div><p></p>\n<ul>\n<li><strong>Finalization:</strong> Presentation of Final Projects and Graduation</li>\n</ul>\n<p></p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://europe1.discourse-cdn.com/bc41dd/original/2X/8/851cd496ce92fcee4d5c1340a6fe7fe359c6a43e.png\" data-download-href=\"/uploads/short-url/iZzgTnU9R1aHuoUd20z7zvaJj1s.png?dl=1\" title=\"5\" rel=\"noopener nofollow ugc\"><img src=\"https://europe1.discourse-cdn.com/bc41dd/optimized/2X/8/851cd496ce92fcee4d5c1340a6fe7fe359c6a43e_2_500x500.png\" alt=\"5\" data-base62-sha1=\"iZzgTnU9R1aHuoUd20z7zvaJj1s\" width=\"500\" height=\"500\" srcset=\"https://europe1.discourse-cdn.com/bc41dd/optimized/2X/8/851cd496ce92fcee4d5c1340a6fe7fe359c6a43e_2_500x500.png, https://europe1.discourse-cdn.com/bc41dd/optimized/2X/8/851cd496ce92fcee4d5c1340a6fe7fe359c6a43e_2_750x750.png 1.5x, https://europe1.discourse-cdn.com/bc41dd/optimized/2X/8/851cd496ce92fcee4d5c1340a6fe7fe359c6a43e_2_1000x1000.png 2x\" data-dominant-color=\"FAF1F1\"></a></div><p></p>\n<p>The course starts on June 25, 2024, and will be held on Tuesdays and Thursdays at the following time: <strong>07:00 pm - 09:00 pm</strong></p>\n<p><strong>Program Rules:</strong></p>\n<ul>\n<li>Attendance is mandatory</li>\n<li>You need to bring your Laptop</li>\n<li>Quizzes and exams must be submitted on time.</li>\n<li>Weekly reports on the forum are required.</li>\n</ul>\n<p>There will be a call with the students on <strong>Monday 24</strong> before the first session to address any questions that may arise.</p>\n<p>We, as a community in Costa Rica, have assembled this Special Ops team to provide students with the best experience from various experts in their fields. Different members of the team will be invited as special guests to present real-life scenarios and practical examples to the students.</p>\n<ul>\n<li><a href=\"https://x.com/AndyGuzmanEth\" rel=\"noopener nofollow ugc\">Andy Guzman</a></li>\n<li><a href=\"https://x.com/0xBeja\" rel=\"noopener nofollow ugc\">Daniel Bejarano</a></li>\n<li><a href=\"https://x.com/brolag\" rel=\"noopener nofollow ugc\">Alfredo Bonilla</a></li>\n<li><a href=\"https://x.com/robertramdev\" rel=\"noopener nofollow ugc\">Robert Ramirez</a></li>\n<li><a href=\"https://x.com/InBestProgram\" rel=\"noopener nofollow ugc\">Alberto Galan</a></li>\n</ul>\n<p>All the material discussed in the classrooms will be published here and made available for students and for others to use as well!</p>\n<p>The final winners of the scholarship will be announced here on Saturday, June 22!</p>\n<p>Please keep in mind that this is the first iteration of this module, and <strong>we can only accept 25 students</strong>. If you do not win a scholarship this time, the doors are still open for you. You are more than welcome to join our community, review all the material, and be a part of the process. We wish we could accept everyone, but we aim to continue offering these university modules in the future.</p>\n<p>That’s why <strong>your feedback is crucial</strong> to the success of this initiative.</p>\n<p>For more information and registration:</p>\n<ul>\n<li><strong>Info and registration for Scholarship Competition:</strong> <a href=\"https://linktw.in/riQaBn\" class=\"inline-onebox\" rel=\"noopener nofollow ugc\">OPTIMISM MODULE</a></li>\n<li><strong>Telegram Group:</strong> <a href=\"https://t.me/+Z8hAmZQI3QkzOGQx\" class=\"inline-onebox\" rel=\"noopener nofollow ugc\">Telegram: Join Group Chat</a></li>\n<li><strong>X:</strong> <a href=\"https://x.com/EthereumCR/status/1801654424311333053\" class=\"inline-onebox\" rel=\"noopener nofollow ugc\">x.com</a></li>\n</ul>\n<p>We look forward to seeing you on this exciting journey into the future of technology with Optimism at <strong>CENFOTEC!</strong></p>\n            <p><small>33 posts - 29 participants</small></p>\n            <p><a href=\"https://gov.optimism.io/t/optimism-university-module-in-costa-rica/8338\">Read full topic</a></p>","link":"https://gov.optimism.io/t/optimism-university-module-in-costa-rica/8338","pubDate":"Thu, 20 Jun 2024 19:44:22 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"gov.optimism.io-topic-8338"},"source":{"@url":"https://gov.optimism.io/t/optimism-university-module-in-costa-rica/8338.rss","#text":"OPTIMISM University Module in Costa Rica"},"filter":false},{"title":"S6 Grants Council Communication Thread","dc:creator":"Gonna.eth","category":"Council Communication Threads","description":"<h2><a name=\"welcome-to-the-grants-council-communication-thread-1\" class=\"anchor\" href=\"https://gov.optimism.io#welcome-to-the-grants-council-communication-thread-1\"></a>Welcome to the Grants Council Communication Thread</h2>\n<p>The Optimism Grants Council was initiated in Governance Season 3. This page will outline the basic details of the Grants Council as constituted for Season 6 and use this thread for official communications with the collective.</p>\n<h2><a name=\"season-6-grants-council-posts-index-2\" class=\"anchor\" href=\"https://gov.optimism.io#season-6-grants-council-posts-index-2\"></a>Season 6 Grants Council Posts Index</h2>\n<ul>\n<li><a href=\"https://gov.optimism.io/t/grants-council-charter-season-6/8170\">Grants Council charter</a></li>\n<li><a href=\"https://gov.optimism.io/t/grants-council-internal-operating-procedure-season-6/8424\">Grants Council Internal Operating Procedure</a></li>\n</ul>\n<h2><a name=\"purpose-3\" class=\"anchor\" href=\"https://gov.optimism.io#purpose-3\"></a>Purpose</h2>\n<p>The Grants Council serves by delegation from Token House.</p>\n<p>The Grants Council exists to:</p>\n<ul>\n<li>Process Delegate Mission Applications proposed in accordance with the Council’s Internal Operating Procedures (TBD)</li>\n<li>Review applications in regular cycles, which include a reasonable deadline for application submission before a review period begins</li>\n<li>Publish a report outlining grant finalists for each Intent within three days of the end of Season 6. The Grants Council should additionally publish a report at the end of each review period</li>\n<li>Use best efforts to assess whether grant recipients have met pre-defined milestones</li>\n<li>Ensure ongoing Council operations and performance are reasonably transparent to the community</li>\n<li>Reduce the workload on delegates so that they have more time to weigh in on high-impact votes, better positioning the grants process within the broader responsibilities of Token House governance</li>\n</ul>\n<h2><a name=\"structure-4\" class=\"anchor\" href=\"https://gov.optimism.io#structure-4\"></a>Structure</h2>\n<p>The Grants Council consists of four Sub-Committees:</p>\n<ul>\n<li>Superchain</li>\n<li>Optimism</li>\n<li>Audit and Special Mission</li>\n<li>Milestone &amp; Metrics</li>\n</ul>\n<p>Each Sub-Committee has a mandate to fulfill the purpose of the <a href=\"https://gov.optimism.io/t/draft-proposed-grants-council-charter-season-6/8170\">Grants Council charter</a>.</p>\n<p>The <strong>Superchain subcommittee</strong> will process applications from OP Chains requesting tokens to run their own grants program but will not process individual grant applications for other OP Chains.</p>\n<p>The Reviewers Subcommittee aims to maximize the number of builders building projects within a specified Intent and maximize the number of users interacting with applications that further a specified intent defined by the Optimism Collective.</p>\n<p>The ** Audit and Special Mission Sub-Committee** aims to review proposals and select finalists for Mission Requests or Legacy Requests for Grants that require ongoing review.</p>\n<p>The <strong>Milestones and Metrics Sub-Committee</strong> aims to assess historical grant finalist progress on milestones, confirm final milestones for Season 6 grants, and maintain relevant council and reviewer metrics.</p>\n<p>The Grants Council structure for Season 6 has three distinctive roles. These positions are held by elected reviewers and have been appointed by the Grants Council lead.</p>\n<ul>\n<li><strong>Communications Lead:</strong> handles the communications of the Grants Council with the Optimism community and is responsible for communicating calendar items, key updates, cycle results, and other important items to keep the community informed about the Grants Council’s process. The Communications Lead for Season 6 is <a href=\"https://gov.optimism.io/u/katie/summary\">Katie Garcia</a>.</li>\n<li><strong>The Milestone and Metrics Lead</strong>: administers the milestone program and will develop a system of metrics for the Council, including reviewer KPIs. The Milestones and Metrics Lead for Season 6 is <a href=\"https://gov.optimism.io/t/pgov-delegate-communication-thread/6059\">Jun (Pgov) </a>.</li>\n</ul>\n            <p><small>6 posts - 5 participants</small></p>\n            <p><a href=\"https://gov.optimism.io/t/s6-grants-council-communication-thread/8324\">Read full topic</a></p>","link":"https://gov.optimism.io/t/s6-grants-council-communication-thread/8324","pubDate":"Wed, 19 Jun 2024 23:04:53 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"gov.optimism.io-topic-8324"},"source":{"@url":"https://gov.optimism.io/t/s6-grants-council-communication-thread/8324.rss","#text":"S6 Grants Council Communication Thread"},"filter":false},{"title":"Optimism Forum Weekly Recap - daospace: 06/10 - 06/16","dc:creator":"daospace","category":"Updates  and Announcements 📢","description":"<p>gm Optimism Collective <img src=\"https://emoji.discourse-cdn.com/twitter/red_circle.png?v=12\" title=\":red_circle:\" class=\"emoji\" alt=\":red_circle:\" loading=\"lazy\" width=\"20\" height=\"20\"> <img src=\"https://emoji.discourse-cdn.com/twitter/sparkles.png?v=12\" title=\":sparkles:\" class=\"emoji\" alt=\":sparkles:\" loading=\"lazy\" width=\"20\" height=\"20\"></p>\n<p>Last week there were 9 topics created on forum. Key highlights include the GovNFT Pilot Program curriculum to incentivize governance participation through activities like delegation, forum engagement, and community calls, which has garnered a decent amount of interest. Discussions have also centered around the Round 4 Bribery Policy to prevent self-dealing within the Citizens’ House, the upcoming Special Voting Cycle <span class=\"hashtag-raw\">#23b</span> where the Citizens’ House can veto approved proposals, and there was also a topic created by <a class=\"mention\" href=\"https://gov.optimism.io/u/nathaniel\">@nathaniel</a> where he initiated a discussion about the future impacts of Optimism’s latest scaling solutions on the broader ecosystem.</p>\n<p><a href=\"https://twitter.com/daospace_ai\" rel=\"noopener nofollow ugc\">daospace </a>is a DAO discovery platform that aggregates contributions across different DAOs. We will be providing weekly Automated AI Summaries to help reduce information overload, and so that all members can stay up to date on forum activity within the DAO. Below is a summary of every topic made within the OP Governance Forum from last week.</p>\n<p>Feel free to leave us feedback in the comments below. You can get in touch with the daospace team on <a href=\"https://twitter.com/daospace_ai\" rel=\"noopener nofollow ugc\">X (Twitter) </a>, or reach out to the founders directly on X as well: <a href=\"https://twitter.com/JarisJames\" rel=\"noopener nofollow ugc\">Jaris James </a>&amp; <a href=\"https://twitter.com/sixty_keys\" rel=\"noopener nofollow ugc\">Sixty</a></p>\n<h2><a name=\"grants-council-season-6-nomination-election-process-feedbackhttpsgovoptimismiotgrants-council-season-6-nomination-election-process-feedback8287-1\" class=\"anchor\" href=\"https://gov.optimism.io#grants-council-season-6-nomination-election-process-feedbackhttpsgovoptimismiotgrants-council-season-6-nomination-election-process-feedback8287-1\"></a><a href=\"https://gov.optimism.io/t/grants-council-season-6-nomination-election-process-feedback/8287\">Grants Council Season 6 Nomination + Election Process Feedback</a></h2>\n<p><strong>Created</strong>: 2024-06-11</p>\n<p><strong>Author</strong>: system</p>\n<p><strong>Summary</strong></p>\n<p>The post is a feedback thread available for comments on the Season 6 Grants Council self-nomination and election processes. Users are encouraged to share their thoughts on the processes, which are linked in the post for reference.</p>\n<h2><a name=\"developer-advisory-board-season-6-nomination-election-process-feedbackhttpsgovoptimismiotdeveloper-advisory-board-season-6-nomination-election-process-feedback8288-2\" class=\"anchor\" href=\"https://gov.optimism.io#developer-advisory-board-season-6-nomination-election-process-feedbackhttpsgovoptimismiotdeveloper-advisory-board-season-6-nomination-election-process-feedback8288-2\"></a><a href=\"https://gov.optimism.io/t/developer-advisory-board-season-6-nomination-election-process-feedback/8288\">Developer Advisory Board Season 6 Nomination + Election Process Feedback</a></h2>\n<p><strong>Created</strong>: 2024-06-11</p>\n<p><strong>Author</strong>: system</p>\n<p><strong>Summary</strong></p>\n<p>This post is a feedback thread for the Season 6 Developer Advisory Board self-nomination and election processes. Users can provide their feedback regarding the processes through the provided relevant links.</p>\n<h2><a name=\"round-4-bribery-policyhttpsgovoptimismiotround-4-bribery-policy8281-3\" class=\"anchor\" href=\"https://gov.optimism.io#round-4-bribery-policyhttpsgovoptimismiotround-4-bribery-policy8281-3\"></a><a href=\"https://gov.optimism.io/t/round-4-bribery-policy/8281\">Round 4 Bribery Policy</a></h2>\n<p><strong>Created</strong>: 2024-06-11</p>\n<p><strong>Author</strong>: system</p>\n<p><strong>Summary</strong></p>\n<p>In Round 4, the Bribery Policy within the Citizens’ House aims to prevent self-dealing and bribery. The policy includes metrics-based voting, reporting processes, and enforcement measures against badgeholders or projects involved in bribery. Multiple reports are required for valid cases, and enforcement actions are subject to the approval of the Citizens’ House before implementation.</p>\n<h2><a name=\"voting-cycle-roundup-23bhttpsgovoptimismiotvoting-cycle-roundup-23b8299-4\" class=\"anchor\" href=\"https://gov.optimism.io#voting-cycle-roundup-23bhttpsgovoptimismiotvoting-cycle-roundup-23b8299-4\"></a><a href=\"https://gov.optimism.io/t/voting-cycle-roundup-23b/8299\">Voting Cycle Roundup #23b</a></h2>\n<p><strong>Created</strong>: 2024-06-13</p>\n<p><strong>Author</strong>: system</p>\n<p><strong>Summary</strong></p>\n<p>Special Voting Cycle <span class=\"hashtag-raw\">#23</span> b will begin on June 13th at 19:00 GMT and ends on June 19th at 19:00 GMT. The Citizens’ House will have a week following the Token House voting period to veto any approved Upgrades. Voting will occur at <a href=\"https://vote.optimism.io\" rel=\"noopener nofollow ugc\">https://vote.optimism.io</a> starting on June 13th. The proposals include various elections and amendments, with the possibility of a protocol upgrade and voting by the Citizens’ House.</p>\n<h2><a name=\"joint-house-call-will-be-tuesday-june-18th-1400-et-1800-utc-2000-cethttpsgovoptimismiotjoint-house-call-will-be-tuesday-june-18th-14-00-et-18-00-utc-20-00-cet8308-5\" class=\"anchor\" href=\"https://gov.optimism.io#joint-house-call-will-be-tuesday-june-18th-1400-et-1800-utc-2000-cethttpsgovoptimismiotjoint-house-call-will-be-tuesday-june-18th-14-00-et-18-00-utc-20-00-cet8308-5\"></a><a href=\"https://gov.optimism.io/t/joint-house-call-will-be-tuesday-june-18th-14-00-et-18-00-utc-20-00-cet/8308\">Joint House Call will be [Tuesday, June 18th @ 14:00 ET / 18:00 UTC / 20:00 CET]</a></h2>\n<p><strong>Created</strong>: 2024-06-14</p>\n<p><strong>Author</strong>: <a class=\"mention\" href=\"https://gov.optimism.io/u/michael\">@Michael</a></p>\n<p><strong>Summary</strong></p>\n<p>Summary: The post is an invitation to a Joint House call happening on Tuesday, where they will discuss topics like the deliberative process and token house elections. The invitation includes a Google Meet link for participation.</p>\n<h2><a name=\"retro-funding-4-eligibility-criteria-enforcementhttpsgovoptimismiotretro-funding-4-eligibility-criteria-enforcement8303-6\" class=\"anchor\" href=\"https://gov.optimism.io#retro-funding-4-eligibility-criteria-enforcementhttpsgovoptimismiotretro-funding-4-eligibility-criteria-enforcement8303-6\"></a><a href=\"https://gov.optimism.io/t/retro-funding-4-eligibility-criteria-enforcement/8303\">Retro Funding 4: Eligibility criteria enforcement</a></h2>\n<p><strong>Created</strong>: 2024-06-14</p>\n<p><strong>Author</strong>: <a class=\"mention\" href=\"https://gov.optimism.io/u/jonas\">@Jonas</a></p>\n<p><strong>Summary</strong></p>\n<p>The post provides information on the eligibility criteria for Retroactive Public Goods Funding (Retro Funding 4), highlighting requirements such as onchain contract deployment, verification, code availability on Github, compliance with KYC requirements, and application submission rules. Rejected applicants can appeal before a specified deadline and are encouraged to ask questions in the Discord channel. Applicants have been informed via email, with exceptions for those who did not provide an email address.</p>\n<h2><a name=\"foundation-year-3-budget-updatehttpsgovoptimismiotfoundation-year-3-budget-update8304-7\" class=\"anchor\" href=\"https://gov.optimism.io#foundation-year-3-budget-updatehttpsgovoptimismiotfoundation-year-3-budget-update8304-7\"></a><a href=\"https://gov.optimism.io/t/foundation-year-3-budget-update/8304\">Foundation Year 3 Budget Update</a></h2>\n<p><strong>Created</strong>: 2024-06-14</p>\n<p><strong>Author</strong>: system</p>\n<p><strong>Summary</strong></p>\n<p>Summary: The Optimism Foundation plans to maintain its operating budget for the current year without requesting any additional tokens from the Token House for approval. The Foundation is committed to deploying existing allocations to support key initiatives within the Collective, and transparency is emphasized in budget management.</p>\n<h2><a name=\"govnft-and-governance-participation-curriculumhttpsgovoptimismiotgovnft-and-governance-participation-curriculum8310-8\" class=\"anchor\" href=\"https://gov.optimism.io#govnft-and-governance-participation-curriculumhttpsgovoptimismiotgovnft-and-governance-participation-curriculum8310-8\"></a><a href=\"https://gov.optimism.io/t/govnft-and-governance-participation-curriculum/8310\">GovNFT and Governance Participation Curriculum</a></h2>\n<p><strong>Created</strong>: 2024-06-15</p>\n<p><strong>Author</strong>: <a class=\"mention\" href=\"https://gov.optimism.io/u/michael\">@Michael</a></p>\n<p><strong>Summary</strong></p>\n<p>In this post, feedback is being sought on a proposed curriculum for engaging in Optimism Governance through the GovNFT Pilot Program. GovNFTs are governance primitives allowing locked tokens to participate in governance. The pilot program aims to incentivize GovNFT holders through various activities like delegation, forum participation, and community calls. Feedback is requested to improve the program before expanding it further. Participants are urged to provide ideas for additional or revised activities.</p>\n<h2><a name=\"exploring-the-future-impacts-of-optimisms-latest-scaling-solutionshttpsgovoptimismiotexploring-the-future-impacts-of-optimisms-latest-scaling-solutions8309-9\" class=\"anchor\" href=\"https://gov.optimism.io#exploring-the-future-impacts-of-optimisms-latest-scaling-solutionshttpsgovoptimismiotexploring-the-future-impacts-of-optimisms-latest-scaling-solutions8309-9\"></a><a href=\"https://gov.optimism.io/t/exploring-the-future-impacts-of-optimisms-latest-scaling-solutions/8309\">Exploring the Future Impacts of Optimism’s Latest Scaling Solutions</a></h2>\n<p><strong>Created</strong>: 2024-06-15</p>\n<p><strong>Author</strong>: <a class=\"mention\" href=\"https://gov.optimism.io/u/nathaniel\">@nathaniel</a></p>\n<p><strong>Summary</strong></p>\n<p>Nathaniel is curious about the latest advancements in Optimism’s scaling solutions and how they will impact the broader ecosystem in the near future. He is eager to hear thoughts and insights on this topic.</p>\n            <p><small>1 post - 1 participant</small></p>\n            <p><a href=\"https://gov.optimism.io/t/optimism-forum-weekly-recap-daospace-06-10-06-16/8315\">Read full topic</a></p>","link":"https://gov.optimism.io/t/optimism-forum-weekly-recap-daospace-06-10-06-16/8315","pubDate":"Mon, 17 Jun 2024 19:45:05 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"gov.optimism.io-topic-8315"},"source":{"@url":"https://gov.optimism.io/t/optimism-forum-weekly-recap-daospace-06-10-06-16/8315.rss","#text":"Optimism Forum Weekly Recap - daospace: 06/10 - 06/16"},"filter":false},{"title":"Ratification of Profit Definition for Round 4","dc:creator":"system","category":"Citizens  👥","description":"<h1><a name=\"ratification-of-profit-definition-for-round-4-1\" class=\"anchor\" href=\"https://gov.optimism.io#ratification-of-profit-definition-for-round-4-1\"></a>Ratification of Profit Definition for Round 4</h1>\n<h3><a name=\"impact-profit-2\" class=\"anchor\" href=\"https://gov.optimism.io#impact-profit-2\"></a>Impact = profit</h3>\n<p>Optimism’s Retroactive Public Goods Funding (Retro Funding) has been built around the principle that positive impact to the collective should be rewarded as: <em><strong>Impact = profit.</strong></em> This principle serves as a North Star to motivate the creation of a more productive and sustainable ecosystem.</p>\n<p>In previous Retro Funding rounds, each Citizen conducted their own assessment of impact and decided how to calculate profit by considering the past rewards received by projects and deducting that amount from impact to arrive at a final OP allocation. This non-standardized approach sparked <a href=\"https://gov.optimism.io/t/the-role-of-vc-funding-in-retropgf/7342\">various debates</a> within the community about whether external funding (e.g., VC funding, Optimism grants, or external grants) should be deducted from a project’s overall public goods funding reward.</p>\n<h3><a name=\"round-4-definition-3\" class=\"anchor\" href=\"https://gov.optimism.io#round-4-definition-3\"></a>Round 4 Definition</h3>\n<p>In <a href=\"https://gov.optimism.io/t/retro-funding-4-onchain-builders-round-details/7988/3\">Retro Funding 4: Onchain Builders</a>, a definition of profit will be universally applied to the retro round. Badgeholders will no longer need to calculate profit, but instead, a collective definition will be applied and subtracted from each voter’s assessment of impact as such:</p>\n<blockquote>\n<p><em><strong>Impact - Past transfers = Award in OP</strong></em></p>\n</blockquote>\n<p>The possible categories considered as Past Transfers are:</p>\n<ul>\n<li>Grants from Optimism</li>\n<li>VC funding</li>\n<li>Grants from other ecosystems</li>\n<li>Revenue.</li>\n</ul>\n<p>All data collected on this categories in the Round 4 application process was for the timeframe of Jan 2023 - May 23rd, 2024.</p>\n<hr>\n<h3><a name=\"deliberative-process-4\" class=\"anchor\" href=\"https://gov.optimism.io#deliberative-process-4\"></a>Deliberative Process</h3>\n<p>Over the past month, a randomly selected subset of badgeholders <a href=\"https://gov.optimism.io/t/experimenting-with-deliberative-processes-in-the-collective/8041\">experimented with a deliberative process</a> to determine this profit definition for Round 4. You can access the public documentation of this process below. <strong>We encourage you to review this documentation so you have the full context to vote on this proposal.</strong></p>\n<ul>\n<li><strong>Session 1:</strong>\n<ul>\n<li><a href=\"https://docs.google.com/document/d/1ozOsXETe13EarMG6Fk2yc_vfo4V6h4clnsWubyy3tyE/edit?usp=sharing\">Pre-reading Info Kit</a></li>\n<li>The plenary session recording for Session 1 is unfortunately unusable</li>\n<li><a href=\"https://gov.optimism.io/t/retro-funding-4-deliberative-process-on-the-definition-of-profit/8083/11\">Forum recap</a></li>\n</ul>\n</li>\n<li><strong>Session 2:</strong>\n<ul>\n<li><a href=\"https://docs.google.com/document/d/1kmVq4CvBrX6CcAzCYrhyh-ZDC1D7GIXGkEybGCMbVGs/edit?usp=sharing\">Pre-reading Info Kit</a></li>\n<li><a href=\"https://missionspubliques.zoom.us/rec/share/jNWsFgSa4kiDyM7tTkK7N12W1DbPFqd_2pVU-JzEnnBozD9S_d3xabyv6pF2gyB2.hteAvKOlclO7MqB-\">Plenary session recording</a> (doesn’t include breakout rooms) - Kenncode: 6R2W*ORW</li>\n<li><a href=\"https://gov.optimism.io/t/retro-funding-4-deliberative-process-on-the-definition-of-profit/8083/12\">Forum recap</a></li>\n</ul>\n</li>\n<li><strong>Session 3:</strong>\n<ul>\n<li><a href=\"https://docs.google.com/document/d/1KC7EAAokxbH7N0YGHP6xVEXZKYCS9ZMa1LZubh8O8bs/edit?usp=sharing\">Pre-reading Info Kit</a></li>\n<li><a href=\"https://missionspubliques.zoom.us/rec/share/Q_a-4y0Apsa4dgO4n9B9TV0F6fxpQeQOtTRwKqeF2zdZpJmWIsq6bULTR8aRIzjV.om91tDLiBmH8G8kl\">Plenary session recording</a> (doesn’t include breakout rooms) - Kenncode: U1uN9!6L</li>\n<li><a href=\"https://gov.optimism.io/t/retro-funding-4-deliberative-process-on-the-definition-of-profit/8083/15\">Forum recap</a></li>\n</ul>\n</li>\n</ul>\n<p>This <a href=\"https://miro.com/app/board/uXjVK-3OHHU=/?moveToWidget=3458764592049624735&amp;cot=14\">Miro board</a> was used to collect input in all three sessions.</p>\n<hr>\n<h3><a name=\"proposed-round-4-profit-definition-5\" class=\"anchor\" href=\"https://gov.optimism.io#proposed-round-4-profit-definition-5\"></a>Proposed Round 4 Profit Definition</h3>\n<h4><a name=\"vote-1-6\" class=\"anchor\" href=\"https://gov.optimism.io#vote-1-6\"></a>Vote 1</h4>\n<p>Participating badgeholders were asked to determine the profit definition taking into account <strong>the specific category definitions and limitations on data collection as it applies practically in Round 4.</strong> It is important to understand the nuance and complexity of the practical implementation of defining profit which are distinct from philosophical debates about inclusion or exclusion of each category. Two votes occurred during the deliberative process experiment. The first was on which categories to include in the profit definition. The results are below:</p>\n<p></p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://europe1.discourse-cdn.com/bc41dd/original/2X/8/806c6126d64ecdd7c3f1fee0d7707c801f29945d.png\" data-download-href=\"/uploads/short-url/ik5jJfq9Md8Fn50pGJBB4bvu30N.png?dl=1\" title=\"image\"><img src=\"https://europe1.discourse-cdn.com/bc41dd/optimized/2X/8/806c6126d64ecdd7c3f1fee0d7707c801f29945d_2_690x244.png\" alt=\"image\" data-base62-sha1=\"ik5jJfq9Md8Fn50pGJBB4bvu30N\" width=\"690\" height=\"244\" srcset=\"https://europe1.discourse-cdn.com/bc41dd/optimized/2X/8/806c6126d64ecdd7c3f1fee0d7707c801f29945d_2_690x244.png, https://europe1.discourse-cdn.com/bc41dd/optimized/2X/8/806c6126d64ecdd7c3f1fee0d7707c801f29945d_2_1035x366.png 1.5x, https://europe1.discourse-cdn.com/bc41dd/original/2X/8/806c6126d64ecdd7c3f1fee0d7707c801f29945d.png 2x\" data-dominant-color=\"DFD4ED\"></a></div><p></p>\n<p>Based on the Collective’s standard 51% approval threshold, these results determined that a <strong>deduction weight would only be applied only to Optimism Grants.</strong></p>\n<h4><a name=\"vote-2-7\" class=\"anchor\" href=\"https://gov.optimism.io#vote-2-7\"></a>Vote 2</h4>\n<p>The second vote was on the deduction weight that should be applied to Optimism Grants, as broken into three sub-categories:</p>\n<ul>\n<li>Token House growth grants, which are passed on to end users</li>\n<li>Token House builders grants, which are locked for one year</li>\n<li>Foundation grants and Missions</li>\n<li>*Past Retro Funding is not included as the evaluation period begins after the end of Round 3</li>\n</ul>\n<p>The responses resulted in a proposed profit definition of Round 4 as outlined below:</p>\n<p></p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://europe1.discourse-cdn.com/bc41dd/original/2X/6/61748caf93681e4a5dc3b8d00176734aec6604b2.png\" data-download-href=\"/uploads/short-url/dU81ilq17cy0OC8vbBEobnVV48a.png?dl=1\" title=\"image\"><img src=\"https://europe1.discourse-cdn.com/bc41dd/optimized/2X/6/61748caf93681e4a5dc3b8d00176734aec6604b2_2_690x90.png\" alt=\"image\" data-base62-sha1=\"dU81ilq17cy0OC8vbBEobnVV48a\" width=\"690\" height=\"90\" srcset=\"https://europe1.discourse-cdn.com/bc41dd/optimized/2X/6/61748caf93681e4a5dc3b8d00176734aec6604b2_2_690x90.png, https://europe1.discourse-cdn.com/bc41dd/optimized/2X/6/61748caf93681e4a5dc3b8d00176734aec6604b2_2_1035x135.png 1.5x, https://europe1.discourse-cdn.com/bc41dd/original/2X/6/61748caf93681e4a5dc3b8d00176734aec6604b2.png 2x\" data-dominant-color=\"CFBCE9\"></a></div><p></p>\n<p>A breakdown of votes is shown below:</p>\n<p></p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://europe1.discourse-cdn.com/bc41dd/original/2X/f/f21b71e8eb16b812c77980a2ee85d8b38faeb039.png\" data-download-href=\"/uploads/short-url/yxMlBgEkt15Y25YYY7shLRZKqs9.png?dl=1\" title=\"image\"><img src=\"https://europe1.discourse-cdn.com/bc41dd/optimized/2X/f/f21b71e8eb16b812c77980a2ee85d8b38faeb039_2_690x403.png\" alt=\"image\" data-base62-sha1=\"yxMlBgEkt15Y25YYY7shLRZKqs9\" width=\"690\" height=\"403\" srcset=\"https://europe1.discourse-cdn.com/bc41dd/optimized/2X/f/f21b71e8eb16b812c77980a2ee85d8b38faeb039_2_690x403.png, https://europe1.discourse-cdn.com/bc41dd/optimized/2X/f/f21b71e8eb16b812c77980a2ee85d8b38faeb039_2_1035x604.png 1.5x, https://europe1.discourse-cdn.com/bc41dd/original/2X/f/f21b71e8eb16b812c77980a2ee85d8b38faeb039.png 2x\" data-dominant-color=\"F1EDF8\"></a></div><p></p>\n<h3><a name=\"ratification-8\" class=\"anchor\" href=\"https://gov.optimism.io#ratification-8\"></a>Ratification</h3>\n<p>If you wish to ratify the below definition, which will be globally and automatically applied to the voting result calculation in Round 4, please vote “Yes” on this proposal.</p>\n<blockquote>\n<p><strong>Impact - ((10% * Token House Growth Grants) + (45% * Token House Builders Grants) + (25% * Foundation Grants)) = Award in OP</strong></p>\n</blockquote>\n<p>The OP amount deducted from the impact rewards will be returned to the Retroactive Public Goods Funding treasury.</p>\n<p>If you do not wish to ratify this definition, a fallback definition proposed by the Foundation will be globally and automatically applied to the voting result calculation in Round 4 instead. This definition is:</p>\n<blockquote>\n<p><strong>Impact = Award in OP</strong></p>\n</blockquote>\n<p>The deliberative process experiment surfaced the amount of complexity, nuance, and effort required to accurately define profit and the challenges in verifying self-reported profit data which is oftentimes not publicly disclosed. In light of these learnings, the Foundation believes it is premature to accurately calculate profit and instead proposes solely focusing on impact in Round 4. The fallback profit definition below, will be implemented if this proposal is not ratified.</p>\n<p><strong>Voting will take place on <a href=\"https://snapshot.org/#/citizenshouse.eth\">Snapshot</a> and will run from June 20-26 at 19:00 GMT. Quorum will require 30% of badgeholders to cast a vote with an approval threshold will be 51% of votes cast.</strong></p>\n            <p><small>41 posts - 25 participants</small></p>\n            <p><a href=\"https://gov.optimism.io/t/ratification-of-profit-definition-for-round-4/8312\">Read full topic</a></p>","link":"https://gov.optimism.io/t/ratification-of-profit-definition-for-round-4/8312","pubDate":"Mon, 17 Jun 2024 11:48:12 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"gov.optimism.io-topic-8312"},"source":{"@url":"https://gov.optimism.io/t/ratification-of-profit-definition-for-round-4/8312.rss","#text":"Ratification of Profit Definition for Round 4"},"filter":false},{"title":"GovNFT and Governance Participation Curriculum","dc:creator":"Michael","category":"Governance  Design 📐","description":"<h1><a name=\"govnft-pilot-program-1\" class=\"anchor\" href=\"https://gov.optimism.io#govnft-pilot-program-1\"></a>GovNFT Pilot Program</h1>\n<p>Hi Everyone,</p>\n<p>The purpose of this post is to seek feedback on a general curriculum for participation in Optimism Governance.</p>\n<p>Specifically, this curriculum will be used to create incentive-based activities for GovNFT holders as part of <a href=\"https://app.charmverse.io/op-grants/velodrome-finance-governance-participation-23531902138656102\">this grant</a>. The goal is to design a “curriculum” for the best way for new governance participants to engage in meaningful governance activities, which can hopefully be expanded in the future.</p>\n<p><strong>What are GovNFTs?</strong><br>\nGovNFTs are a general-purpose governance primitive built by the Velodrome team. As many of you know, tokens for builders’ grants have a 1-year lock. Delegations have been made on these locked tokens in the past but require manual work from the foundation to do so. GovNFTs are an audited smart contract that can keep the tokens “locked” while at the same time allowing the builder to fluidly participate in Optimism Governance.</p>\n<p><strong>What is this program?</strong><br>\nTo test this primitive before expanding to the broader set of Optimism builder’s grantees, we are creating a pilot program as outlined in <a href=\"https://app.charmverse.io/op-grants/velodrome-finance-governance-participation-23531902138656102\">this grant</a>. This pilot program makes available 25K OP to incentivize and reward existing GovNFT holders for valuable participation in Optimism governance. The initial set of users is 200+ users and protocols who have previously earned GovNFTs through previous grants on Velodrome. A series of activities will be assigned a point value. The 25k OP will be distributed among participants in the pilot based on a weighted average of points. The activities and their potential point values are as follows.</p>\n<p><em>This is a draft; the goal is to improve the following based on feedback from the community. If you have any ideas for changing or adding activities, please outline them in this thread.</em></p>\n<h3><a name=\"incentivized-activities-2\" class=\"anchor\" href=\"https://gov.optimism.io#incentivized-activities-2\"></a>Incentivized Activities:</h3>\n<p><strong>Delegation</strong></p>\n<ul>\n<li>Delegate to an active delegate on-chain (3 points)</li>\n<li>Post in a program-specific “delegate selection thread” and answer the following questions on why you chose that delegate (12 points)\n<ul>\n<li>Example questions\n<ul>\n<li>What delegate did you choose?</li>\n<li>Why do you think this is a good delegate?</li>\n<li>In what ways is this delegate aligned with you?</li>\n<li>What about their delegate profile/statement do you like?</li>\n<li>What is this delegate’s voting percentage in the last 10 votes?</li>\n</ul>\n</li>\n</ul>\n</li>\n</ul>\n<p><strong>Forum Participation</strong></p>\n<ul>\n<li>Make a thoughtful post in our “bi-weekly governance topic thread” (6 points)\n<ul>\n<li>This thread will be created every two weeks by the GovNFT champion and cover a current topic in governance.</li>\n<li>The idea is that it is a governance “sandbox” for this pilot to avoid spam in other threads, however, all governance community members are encouraged to participate.</li>\n<li>“Spam” responses as judged by the GovNFT Champion will have 6 points deducted.</li>\n<li>The most thoughtful response in each thread, as judged by the GovNFT Champion, will be awarded an additional 20 points.</li>\n</ul>\n</li>\n</ul>\n<p><strong>Community Calls</strong></p>\n<ul>\n<li>Attend a community call (10 points)</li>\n<li>Post in a program-specific GovNFT thread after the call (10 points)</li>\n</ul>\n<p><strong>Becoming a Delegate</strong><br>\nThis path will only be available to those who already have 7,500 OP or more in their GovNFT.</p>\n<ul>\n<li>Tasks:\n<ul>\n<li>Post a delegate statement (25 points)</li>\n<li>Delegate to yourself (15 points)</li>\n<li>Introduce yourself in a community call (25 points)</li>\n<li>Vote in an election cycle (25 points)</li>\n</ul>\n</li>\n</ul>\n<h3><a name=\"guiding-principles-3\" class=\"anchor\" href=\"https://gov.optimism.io#guiding-principles-3\"></a>Guiding Principles</h3>\n<p>Ideally, the activities outlined directly contribute to the governance intents of Season 6 and also Season 5, such as meaningfully driving delegation and distribution of votable supply among a broad set of specific stakeholders, increasing the delegated supply of OP, and increasing the average OP voted per governance proposal.</p>\n<p>We explicitly want to disincentivize any low-effort behavior that would reduce the quality of discussion on the forums. For that reason, much of the forum participation outlined above is based on participation in program-specific threads.</p>\n<p>We also want to keep in mind the potential for these activities to become a template for new participants in governance. For example, a new builder in the ecosystem may receive a builder’s grant. They can use the activities outlined above as a guide for the best way to get started in governance.</p>\n<p>I’m looking forward to your feedback!<br>\nMichael <img src=\"https://emoji.discourse-cdn.com/twitter/red_circle.png?v=12\" title=\":red_circle:\" class=\"emoji\" alt=\":red_circle:\" loading=\"lazy\" width=\"20\" height=\"20\"> <img src=\"https://emoji.discourse-cdn.com/twitter/sparkles.png?v=12\" title=\":sparkles:\" class=\"emoji\" alt=\":sparkles:\" loading=\"lazy\" width=\"20\" height=\"20\"></p>\n            <p><small>4 posts - 3 participants</small></p>\n            <p><a href=\"https://gov.optimism.io/t/govnft-and-governance-participation-curriculum/8310\">Read full topic</a></p>","link":"https://gov.optimism.io/t/govnft-and-governance-participation-curriculum/8310","pubDate":"Sat, 15 Jun 2024 20:55:25 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"gov.optimism.io-topic-8310"},"source":{"@url":"https://gov.optimism.io/t/govnft-and-governance-participation-curriculum/8310.rss","#text":"GovNFT and Governance Participation Curriculum"},"filter":false},{"title":"Exploring the Future Impacts of Optimism's Latest Scaling Solutions","dc:creator":"nathaniel","category":"✨ General","description":"<p>Hello ,</p>\n<p>I am excited  to hear your thoughts on the latest developments in Optimism’s scaling solutions. How do you think these advancements will impact the broader ecosystem in the coming months?</p>\n<p>Looking forward to your insights!</p>\n<p>Thank you <img src=\"https://emoji.discourse-cdn.com/twitter/slightly_smiling_face.png?v=12\" title=\":slightly_smiling_face:\" class=\"emoji\" alt=\":slightly_smiling_face:\" loading=\"lazy\" width=\"20\" height=\"20\"><br>\nnathaniel</p>\n            <p><small>3 posts - 2 participants</small></p>\n            <p><a href=\"https://gov.optimism.io/t/exploring-the-future-impacts-of-optimisms-latest-scaling-solutions/8309\">Read full topic</a></p>","link":"https://gov.optimism.io/t/exploring-the-future-impacts-of-optimisms-latest-scaling-solutions/8309","pubDate":"Sat, 15 Jun 2024 10:22:16 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"gov.optimism.io-topic-8309"},"source":{"@url":"https://gov.optimism.io/t/exploring-the-future-impacts-of-optimisms-latest-scaling-solutions/8309.rss","#text":"Exploring the Future Impacts of Optimism's Latest Scaling Solutions"},"filter":false},{"title":"Joint House Call will be [Tuesday, June 18th @ 14:00 ET / 18:00 UTC / 20:00 CET]","dc:creator":"Michael","category":"Community Calls","description":"<p>Hello beautiful Optimists! <img src=\"https://emoji.discourse-cdn.com/twitter/red_circle.png?v=12\" title=\":red_circle:\" class=\"emoji\" alt=\":red_circle:\" loading=\"lazy\" width=\"20\" height=\"20\"> <img src=\"https://emoji.discourse-cdn.com/twitter/sparkles.png?v=12\" title=\":sparkles:\" class=\"emoji\" alt=\":sparkles:\" loading=\"lazy\" width=\"20\" height=\"20\"></p>\n<p>This Tuesday we will be having our Joint House call.</p>\n<p>Discussion will be about the deliberative process, token house elections, and more!</p>\n<p>Google meet: <a href=\"https://www.google.com/url?q=https://meet.google.com/vme-ovto-jcn&amp;sa=D&amp;source=calendar&amp;usd=2&amp;usg=AOvVaw1AeMdMjvD-okXIK4fwasHk\">https://meet.google.com/vme-ovto-jcn</a></p>\n<p>See you there.</p>\n<p>Michael</p>\n<p></p><div class=\"lightbox-wrapper\"><a class=\"lightbox\" href=\"https://europe1.discourse-cdn.com/bc41dd/original/2X/8/82d709b0fd7449605b5f873dbff8b75fdcb1035d.jpeg\" data-download-href=\"/uploads/short-url/iFsMPH8IEseEcPehdLknt97X3Wd.jpeg?dl=1\" title=\"jh cc s6\"><img src=\"https://europe1.discourse-cdn.com/bc41dd/optimized/2X/8/82d709b0fd7449605b5f873dbff8b75fdcb1035d_2_690x388.jpeg\" alt=\"jh cc s6\" data-base62-sha1=\"iFsMPH8IEseEcPehdLknt97X3Wd\" width=\"690\" height=\"388\" srcset=\"https://europe1.discourse-cdn.com/bc41dd/optimized/2X/8/82d709b0fd7449605b5f873dbff8b75fdcb1035d_2_690x388.jpeg, https://europe1.discourse-cdn.com/bc41dd/original/2X/8/82d709b0fd7449605b5f873dbff8b75fdcb1035d.jpeg 1.5x, https://europe1.discourse-cdn.com/bc41dd/original/2X/8/82d709b0fd7449605b5f873dbff8b75fdcb1035d.jpeg 2x\" data-dominant-color=\"ECD2DB\"></a></div><p></p>\n            <p><small>1 post - 1 participant</small></p>\n            <p><a href=\"https://gov.optimism.io/t/joint-house-call-will-be-tuesday-june-18th-14-00-et-18-00-utc-20-00-cet/8308\">Read full topic</a></p>","link":"https://gov.optimism.io/t/joint-house-call-will-be-tuesday-june-18th-14-00-et-18-00-utc-20-00-cet/8308","pubDate":"Fri, 14 Jun 2024 23:43:19 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"gov.optimism.io-topic-8308"},"source":{"@url":"https://gov.optimism.io/t/joint-house-call-will-be-tuesday-june-18th-14-00-et-18-00-utc-20-00-cet/8308.rss","#text":"Joint House Call will be [Tuesday, June 18th @ 14:00 ET / 18:00 UTC / 20:00 CET]"},"filter":false},{"title":"Foundation Year 3 Budget Update","dc:creator":"system","category":"Updates  and Announcements 📢","description":"<h1><a name=\"summary-1\" class=\"anchor\" href=\"https://gov.optimism.io#summary-1\"></a>Summary</h1>\n<p>The Optimism Foundation’s operating budget of OP, subject to governance approval by the Token House, maintains the original budget set into motion in both Year 1 and Year 2 proposals.</p>\n<p><strong>For this year’s operating budget, The Foundation is requesting zero additional OP</strong> and will continue deploying existing allocations against key initiatives across the Collective.</p>\n<p>There will not be a Token House vote on this budget as no OP is being requested.</p>\n<h1><a name=\"background-2\" class=\"anchor\" href=\"https://gov.optimism.io#background-2\"></a>Background</h1>\n<p>The Optimism Foundation administers a portion of the token supply to further the Collective’s goals. This set of tokens is referred to as the “Foundation Budget,” which must be utilized in line with overall OP Token Allocations.</p>\n<p>The primary operating budget for Year 2 (June 2023 - May 2024) carried over from the initial OP token allocation at the <em>founding of the Collective</em> on April 24, 2022. In 2023, an additional 1 OP was requested (symbolically) towards Year 2’s budget as a means to initiate the Token House for future budget approvals. We received feedback from delegates that they did not like the symbolic vote and are therefore providing transparency into the budget for 2024 but will not initiate a symbolic vote.</p>\n<h3><a name=\"overall-op-allocations-3\" class=\"anchor\" href=\"https://gov.optimism.io#overall-op-allocations-3\"></a>Overall OP Allocations</h3>\n<p>The overall ecosystem allocations of the total initial supply of OP (as outlined in the <a href=\"https://community.optimism.io/docs/governance/allocations/\">governance documentation</a>) are as follows:</p>\n<ul>\n<li><strong>858,993,459 OP</strong> (20%) to Retroactive Public Goods Funding</li>\n<li><strong>1,073,741,824 OP</strong> (25%) to Ecosystem Fund (Governance Fund, Partner Fund, Seed Fund, Unallocated)</li>\n<li><strong>816,043,786 OP</strong> (19%) to User Airdrops</li>\n<li><strong>810,329,332 OP</strong> (19%) to Core Contributors</li>\n<li><strong>735,858,894</strong> <strong>OP</strong> (17%) to Sugar Xaddies</li>\n</ul>\n<p>In April 2022, 30% of the total initial token supply was made available to the Foundation for administration in line with the overall token allocations detailed above. In utilizing these tokens, the Foundation may not exceed 30% of the total supply, and may not exceed any individual category’s allocation limit.</p>\n<h1><a name=\"budget-update-4\" class=\"anchor\" href=\"https://gov.optimism.io#budget-update-4\"></a>Budget Update</h1>\n<h3><a name=\"total-token-supply-5\" class=\"anchor\" href=\"https://gov.optimism.io#total-token-supply-5\"></a>Total Token Supply</h3>\n<p>The current circulating supply of OP, as well as a breakdown in each category, is maintained in the public OP Token Unlock tracker <a href=\"https://docs.google.com/spreadsheets/d/1qVMhLmmch3s6XSbiBe8hgD4ntMkPIOhc1WrhsYsQc7M/edit#gid=470961921\">here 28</a>.</p>\n<p>As of 30 April 2024, token supply is as follows:</p>\n<div class=\"md-table\">\n<table>\n<thead>\n<tr>\n<th>Category</th>\n<th>Total OP Circulating</th>\n<th>Total OP Committed</th>\n<th>Total OP Allocated</th>\n<th>% of total supply</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>Governance Fund</td>\n<td>60,801,152</td>\n<td>76,297,219</td>\n<td>231,928,234</td>\n<td>5.4%</td>\n</tr>\n<tr>\n<td>Partner Fund, Seed Fund, Unallocated</td>\n<td>55,153,657</td>\n<td>484,674,162</td>\n<td>841,813,590</td>\n<td>5.4%+5.4%+8.8%</td>\n</tr>\n<tr>\n<td>Airdrops</td>\n<td>256,245,713</td>\n<td>256,245,713</td>\n<td>816,043,786</td>\n<td>19.0%</td>\n</tr>\n<tr>\n<td>RPGF</td>\n<td>32,546,814</td>\n<td>40,000,000</td>\n<td>858,993,459</td>\n<td>20.0%</td>\n</tr>\n<tr>\n<td>Early Core Contributors</td>\n<td>329,543,520</td>\n<td>712,140,140</td>\n<td>810,329,332</td>\n<td>18.9%</td>\n</tr>\n<tr>\n<td>Sugar Xaddies</td>\n<td>352,599,107</td>\n<td>735,858,894</td>\n<td>735,858,894</td>\n<td>17.1%</td>\n</tr>\n<tr>\n<td></td>\n<td></td>\n<td></td>\n<td></td>\n<td></td>\n</tr>\n<tr>\n<td>Cumulative Total</td>\n<td>1,086,889,963</td>\n<td>2,305,216,128</td>\n<td>4,294,967,296</td>\n<td>100%</td>\n</tr>\n<tr>\n<td>% Relative to Fully Diluted Supply</td>\n<td>25.3%</td>\n<td>53.7%</td>\n<td></td>\n<td></td>\n</tr>\n</tbody>\n</table>\n</div><h3><a name=\"foundation-budget-6\" class=\"anchor\" href=\"https://gov.optimism.io#foundation-budget-6\"></a>Foundation Budget</h3>\n<p>In Year 2 (April 20, 2023 → April 19, 2024), the Foundation fueled the growth of the Collective by specifically focusing on giving out tokens from the Ecosystem Fund, Airdrops, as well as Retro Funding. The below showcases percentage changes since November 2023 (our prior mid-year update), where we first introduced accounting for both “circulating” OP and “committed” OP (defined in “Accounting Notes” below).</p>\n<p>To increase clarity going forward, we will provide year-over-year comparisons in the future. As always, a full accounting of all circulating OP (including OP outside the Foundation’s budget) is available in the <a href=\"https://docs.google.com/spreadsheets/d/1qVMhLmmch3s6XSbiBe8hgD4ntMkPIOhc1WrhsYsQc7M/edit#gid=470961921\">OP Token Unlock tracker</a>.</p>\n<p>As of 30 April 2024, these tokens have been administered as follows.</p>\n<div class=\"md-table\">\n<table>\n<thead>\n<tr>\n<th>Category</th>\n<th>Total OP Circulating as of 30 April, 2024</th>\n<th>% Change in OP Circulating since Nov 2023</th>\n<th>Total OP Committed as of 30 April, 2024</th>\n<th>% Change in OP Committed since Nov 2023</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>Retro Funding</td>\n<td>32,546,814</td>\n<td>+302.4% [+8,087,372]</td>\n<td>40,000,000</td>\n<td>0.0% [40,000,000]</td>\n</tr>\n<tr>\n<td>Ecosystem Fund</td>\n<td></td>\n<td></td>\n<td></td>\n<td></td>\n</tr>\n<tr>\n<td>(Partner Fund, Seed Fund, Unallocated)</td>\n<td>55,153,657</td>\n<td>17.68% [+46,865,690]*</td>\n<td>484,674,162</td>\n<td>13.1% [+428,565,480]</td>\n</tr>\n<tr>\n<td>Airdrops</td>\n<td>41,497,348</td>\n<td>33.2% [+31,153,590.1]</td>\n<td>41,497,348</td>\n<td>33.2% [+31,153,590.1]</td>\n</tr>\n<tr>\n<td>Cumulative total</td>\n<td>129,197,819</td>\n<td>24.84% [+103,489,463.1]</td>\n<td>566,171,510</td>\n<td>13.3% [+499,719,070.1]</td>\n</tr>\n<tr>\n<td>% of Foundation Budget</td>\n<td>10.03%</td>\n<td></td>\n<td>43.94%</td>\n<td></td>\n</tr>\n<tr>\n<td>% of Total Supply</td>\n<td>3.01%</td>\n<td></td>\n<td>13.18%</td>\n<td></td>\n</tr>\n</tbody>\n</table>\n</div><h3><a name=\"appendix-7\" class=\"anchor\" href=\"https://gov.optimism.io#appendix-7\"></a>Appendix</h3>\n<ul>\n<li>*<strong>Note regarding Ecosystem Fund tokens in circulation</strong> — Last November the Foundation reported 64.2M circulating OP tokens in the Partner Fund, Seed Fund, and Unallocated bucket, which included OP grants made from Foundation to service providers that are not circulating. The amount in the ‘Unallocated’ bucket has been reduced by ~17.3M tokens, to 46.9M, to account for these tokens as “Committed” rather than “Circulating.”</li>\n<li>Percentages are rounded to the nearest tenth for simplicity. As a result, exact calculations based on these percentages may not match precisely.</li>\n<li>“Circulating” refers to tokens with no known restrictions on sale or transfer.</li>\n<li>“Committed” refers to (1) OP tokens that have been granted subject to a lock-up + (2) all OP tokens that have been conditionally committed subject to vesting or completing milestones.</li>\n</ul>\n<p><strong>Ecosystem Growth</strong></p>\n<p>Over the past year, Foundation tokens have been used to secure a variety of partnerships, bootstrapping the Superchain with a focus on bringing more L2s and tooling into the Collective. We had the opportunity to welcome some of the most prominent names in the space, including Base, Zora, Redstone, Frax, Celo, Worldcoin, Mode, and Lisk, all launching their own L2 blockspace built on the OP Stack.</p>\n<p>In addition, with a goal of reducing chain deployment friction, we set out to establish key infrastructure teams within the Superchain to help improve developer onramp experience. Notable groups like Blockscout, Chainlink, Safe, Gelato, and Conduit, just to name a few, joined as contributors to the cause.</p>\n<p><strong>Airdrops</strong></p>\n<p>The Foundation successfully initiated <a href=\"https://community.optimism.io/docs/governance/airdrop-3.html\">Airdrop #3</a> (Sept 2023) and <a href=\"https://community.optimism.io/docs/governance/airdrop-4.html\">Airdrop #4</a> (Feb 2024), delivering a total of 29,755,070.81 OP between the two. Airdrop <span class=\"hashtag-raw\">#3</span> continued to reward positive sum governance participation while Airdrop <span class=\"hashtag-raw\">#4</span> focused on celebrating the vibrant creative energy that artists introduce to the Superchain.</p>\n<p>Note: Airdrop <span class=\"hashtag-raw\">#4</span> rewards are still able to be <a href=\"https://app.optimism.io/airdrops/4\">claimed</a> through Feb 13, 2025!</p>\n<p><strong>Retro Funding 3</strong></p>\n<p><a href=\"https://optimism.mirror.xyz/37Bgum6MfTJWDuE41CH9RXSH5KBm_RCL5zsSFeRZl4E\">Retro Funding Round 3</a> rewarded contributors for the impact they provided to the Optimism Collective across four categories: OP Stack, Collective Governance, Developer Ecosystem, End User Experience and Adoption. You can check out a ‘by the numbers’ breakdown <a href=\"https://vote.optimism.io/retropgf/3/summary\">here</a>. A special thanks to OP Labs, Agora, West, OS Observer, Pairwise, GrowThePie, Retrolist.app, and RetroPGFhub for enabling Round 3 to happen.</p>\n<p><strong>Next Budget Update</strong></p>\n<p>The next Foundation Budget update will post in November, 2024.</p>\n            <p><small>1 post - 1 participant</small></p>\n            <p><a href=\"https://gov.optimism.io/t/foundation-year-3-budget-update/8304\">Read full topic</a></p>","link":"https://gov.optimism.io/t/foundation-year-3-budget-update/8304","pubDate":"Fri, 14 Jun 2024 15:18:33 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"gov.optimism.io-topic-8304"},"source":{"@url":"https://gov.optimism.io/t/foundation-year-3-budget-update/8304.rss","#text":"Foundation Year 3 Budget Update"},"filter":false},{"title":"Retro Funding 4: Eligibility criteria enforcement","dc:creator":"Jonas","category":"Retro  Funding 🔴","description":"<p>This post is to inform applicants who have not met the eligibility criteria of the round.</p>\n<p>For projects to be eligibile for Retroactive Public Goods Funding (Retro Funding 4), they must meet the following criteria:</p>\n<ul>\n<li>Deployed their onchain contracts on one or multiple of the following OP chains: OP Mainnet, Base, Zora, Mode, Fraxtal and Metal, and meet the following criteria:\n<ul>\n<li>Onchain contracts have interactions from 420 unique addresses during Jan 1st - May 1st 2024</li>\n<li>Onchain contracts had their first transaction before April 1st 2024</li>\n<li>Onchain contract had more than 10 days of activity during Jan 1st - May 1st 2024</li>\n</ul>\n</li>\n<li>Verified their onchain contracts in the Retro Funding sign up process</li>\n<li>Made their contract code available in a public Github repo, for which ownership has been verified in the Retro Funding sign up process</li>\n<li>Confirmed that they will comply with Optimism Foundation KYC requirements and are not residing in a sanctioned country</li>\n<li>Submitted a Retro Funding application before June 6th, 2024 and comply with application rules</li>\n</ul>\n<p>Within the <a href=\"https://docs.google.com/spreadsheets/d/1H_gJJlOujJMZjDpagaGkrQQ7nlOln3Am5PxfjId0rtE/edit?usp=sharing\">this table</a>  you find ProjectIDs, names and reason for not meeting eligibility</p>\n<p>If projects believe their exclusion to be an error in the data, they can hand in an appeal by Tuesday, 18th of June 19:00 UTC. To hand in an appeal please submit this <a href=\"https://deform.optimism.io/eligibiltiyappeal\">form</a> (<a href=\"https://deform.optimism.io/eligibiltiyappeal\">https://deform.optimism.io/eligibiltiyappeal</a>)<br>\nIf you have any questions, please ask them in the <span class=\"hashtag-raw\">#retrofunding-discussion</span> channel in Discord.</p>\n<p>All applicants, which have provided an email, have been informed via email of this.<br>\n50 of the rejected applicants have not provided an email address in their applications, those will not receive an email.</p>\n            <p><small>2 posts - 1 participant</small></p>\n            <p><a href=\"https://gov.optimism.io/t/retro-funding-4-eligibility-criteria-enforcement/8303\">Read full topic</a></p>","link":"https://gov.optimism.io/t/retro-funding-4-eligibility-criteria-enforcement/8303","pubDate":"Fri, 14 Jun 2024 12:08:34 +0000","discourse:topicPinned":"No","discourse:topicClosed":"No","discourse:topicArchived":"No","guid":{"@isPermaLink":"false","#text":"gov.optimism.io-topic-8303"},"source":{"@url":"https://gov.optimism.io/t/retro-funding-4-eligibility-criteria-enforcement/8303.rss","#text":"Retro Funding 4: Eligibility criteria enforcement"},"filter":false}]}}}